; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/agg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/agg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!354 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 330, baseType: !5, size: 32, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!358 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!359 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!360 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 405, baseType: !5, size: 32, elements: !362)
!362 = !{!363, !364}
!363 = !DIEnumerator(name: "PCGAMG_LAYOUT_COMPACT", value: 0, isUnsigned: true)
!364 = !DIEnumerator(name: "PCGAMG_LAYOUT_SPREAD", value: 1, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tag", file: !371, line: 69, baseType: !5, size: 32, elements: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcgamgimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!373 = !DIEnumerator(name: "SET1", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "SET2", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "GRAPH", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "GRAPH_MAT", value: 3, isUnsigned: true)
!377 = !DIEnumerator(name: "GRAPH_FILTER", value: 4, isUnsigned: true)
!378 = !DIEnumerator(name: "GRAPH_SQR", value: 5, isUnsigned: true)
!379 = !DIEnumerator(name: "SET4", value: 6, isUnsigned: true)
!380 = !DIEnumerator(name: "SET5", value: 7, isUnsigned: true)
!381 = !DIEnumerator(name: "SET6", value: 8, isUnsigned: true)
!382 = !DIEnumerator(name: "FIND_V", value: 9, isUnsigned: true)
!383 = !DIEnumerator(name: "SET7", value: 10, isUnsigned: true)
!384 = !DIEnumerator(name: "SET8", value: 11, isUnsigned: true)
!385 = !DIEnumerator(name: "SET9", value: 12, isUnsigned: true)
!386 = !DIEnumerator(name: "SET10", value: 13, isUnsigned: true)
!387 = !DIEnumerator(name: "SET11", value: 14, isUnsigned: true)
!388 = !DIEnumerator(name: "SET12", value: 15, isUnsigned: true)
!389 = !DIEnumerator(name: "SET13", value: 16, isUnsigned: true)
!390 = !DIEnumerator(name: "SET14", value: 17, isUnsigned: true)
!391 = !DIEnumerator(name: "SET15", value: 18, isUnsigned: true)
!392 = !DIEnumerator(name: "SET16", value: 19, isUnsigned: true)
!393 = !DIEnumerator(name: "NUM_SET", value: 20, isUnsigned: true)
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !395)
!395 = !{!396, !397, !398, !399, !400}
!396 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!397 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!398 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!399 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!400 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 726, baseType: !5, size: 32, elements: !402)
!402 = !{!403, !404}
!403 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!405 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !406, line: 451, baseType: !72, size: 32, elements: !407)
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!407 = !{!408, !409, !410, !411, !412}
!408 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!409 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!410 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!411 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!412 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!413 = !{!414, !418, !419, !494, !622, !625, !504, !72, !628, !454, !631, !1563, !588, !629, !5, !1657, !592, !477, !1665, !1709, !540, !1809, !486, !530, !531, !480, !449}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !415, line: 330, baseType: !416)
!415 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !415, line: 330, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !422, line: 73, size: 4480, elements: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!423 = !{!424, !426, !475, !476, !478, !481, !482, !483, !484, !492, !493, !495, !499, !503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !516, !517, !518, !520, !521, !523, !525, !526, !527, !528, !529, !532, !534, !535, !536, !537, !538, !541, !543, !544, !545, !555, !557, !558, !562, !563, !612, !617, !619, !620, !621}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !421, file: !422, line: 74, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !421, file: !422, line: 75, baseType: !427, size: 448, offset: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 448, elements: !473)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !422, line: 53, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 45, size: 448, elements: !430)
!430 = !{!431, !437, !445, !450, !457, !461, !468}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !429, file: !422, line: 46, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !419, !436}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !429, file: !422, line: 47, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!435, !419, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !442, line: 16, baseType: !443)
!442 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !442, line: 16, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !429, file: !422, line: 48, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!435, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !429, file: !422, line: 49, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!435, !419, !454, !419}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !429, file: !422, line: 50, baseType: !458, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!435, !419, !454, !449}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !429, file: !422, line: 51, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!435, !419, !454, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !429, file: !422, line: 52, baseType: !469, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!435, !419, !454, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!473 = !{!474}
!474 = !DISubrange(count: 1)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !421, file: !422, line: 76, baseType: !414, size: 64, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !422, line: 77, baseType: !477, size: 32, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !421, file: !422, line: 78, baseType: !479, size: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !480)
!480 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !421, file: !422, line: 78, baseType: !479, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !421, file: !422, line: 78, baseType: !479, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !421, file: !422, line: 78, baseType: !479, size: 64, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !421, file: !422, line: 79, baseType: !485, size: 64, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !488, line: 27, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !490, line: 43, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!491 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !421, file: !422, line: 80, baseType: !477, size: 32, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !421, file: !422, line: 81, baseType: !494, size: 32, offset: 992)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !421, file: !422, line: 82, baseType: !496, size: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !421, file: !422, line: 83, baseType: !500, size: 64, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !421, file: !422, line: 84, baseType: !504, size: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !421, file: !422, line: 85, baseType: !504, size: 64, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !421, file: !422, line: 86, baseType: !504, size: 64, offset: 1280)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !421, file: !422, line: 87, baseType: !504, size: 64, offset: 1344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !421, file: !422, line: 88, baseType: !419, size: 64, offset: 1408)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !421, file: !422, line: 89, baseType: !485, size: 64, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !422, line: 90, baseType: !504, size: 64, offset: 1536)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !421, file: !422, line: 91, baseType: !504, size: 64, offset: 1600)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !421, file: !422, line: 92, baseType: !477, size: 32, offset: 1664)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !421, file: !422, line: 93, baseType: !418, size: 64, offset: 1728)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !421, file: !422, line: 94, baseType: !515, size: 64, offset: 1792)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !486)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !421, file: !422, line: 95, baseType: !477, size: 32, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !421, file: !422, line: 95, baseType: !477, size: 32, offset: 1888)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !421, file: !422, line: 96, baseType: !519, size: 64, offset: 1920)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !421, file: !422, line: 96, baseType: !519, size: 64, offset: 1984)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !421, file: !422, line: 97, baseType: !522, size: 64, offset: 2048)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !421, file: !422, line: 97, baseType: !524, size: 64, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !421, file: !422, line: 98, baseType: !477, size: 32, offset: 2176)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !421, file: !422, line: 98, baseType: !477, size: 32, offset: 2208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !421, file: !422, line: 99, baseType: !519, size: 64, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !421, file: !422, line: 99, baseType: !519, size: 64, offset: 2304)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !421, file: !422, line: 100, baseType: !530, size: 64, offset: 2368)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !421, file: !422, line: 100, baseType: !533, size: 64, offset: 2432)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !421, file: !422, line: 101, baseType: !477, size: 32, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !421, file: !422, line: 101, baseType: !477, size: 32, offset: 2528)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !421, file: !422, line: 102, baseType: !519, size: 64, offset: 2560)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !421, file: !422, line: 102, baseType: !519, size: 64, offset: 2624)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !421, file: !422, line: 103, baseType: !539, size: 64, offset: 2688)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !531)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !421, file: !422, line: 103, baseType: !542, size: 64, offset: 2752)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !421, file: !422, line: 104, baseType: !472, size: 64, offset: 2816)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !421, file: !422, line: 105, baseType: !477, size: 32, offset: 2880)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !421, file: !422, line: 106, baseType: !546, size: 128, offset: 2944)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 128, elements: !553)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !422, line: 64, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 61, size: 128, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !549, file: !422, line: 62, baseType: !465, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !549, file: !422, line: 63, baseType: !418, size: 64, offset: 64)
!553 = !{!554}
!554 = !DISubrange(count: 2)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !421, file: !422, line: 107, baseType: !556, size: 64, offset: 3072)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 64, elements: !553)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !421, file: !422, line: 108, baseType: !418, size: 64, offset: 3136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !421, file: !422, line: 109, baseType: !559, size: 64, offset: 3200)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!435, !418}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !421, file: !422, line: 111, baseType: !477, size: 32, offset: 3264)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !421, file: !422, line: 112, baseType: !564, size: 320, offset: 3328)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 320, elements: !610)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!435, !568, !419, !418}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !571)
!571 = !{!572, !573, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !570, file: !10, line: 100, baseType: !477, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !10, line: 101, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !585, !586, !587, !591, !593, !595, !596, !597}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !576, file: !10, line: 84, baseType: !504, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !576, file: !10, line: 85, baseType: !504, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !576, file: !10, line: 86, baseType: !418, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !576, file: !10, line: 87, baseType: !496, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !576, file: !10, line: 88, baseType: !583, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !576, file: !10, line: 89, baseType: !456, size: 8, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !576, file: !10, line: 90, baseType: !504, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !576, file: !10, line: 91, baseType: !588, size: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !589, line: 46, baseType: !590)
!589 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!590 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !576, file: !10, line: 92, baseType: !592, size: 32, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !576, file: !10, line: 93, baseType: !594, size: 32, offset: 544)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !576, file: !10, line: 94, baseType: !574, size: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !576, file: !10, line: 95, baseType: !504, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !576, file: !10, line: 96, baseType: !418, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !570, file: !10, line: 102, baseType: !504, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !570, file: !10, line: 102, baseType: !504, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !570, file: !10, line: 103, baseType: !504, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !570, file: !10, line: 104, baseType: !414, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !570, file: !10, line: 105, baseType: !592, size: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !570, file: !10, line: 105, baseType: !592, size: 32, offset: 416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !570, file: !10, line: 105, baseType: !592, size: 32, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !570, file: !10, line: 106, baseType: !419, size: 64, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !570, file: !10, line: 107, baseType: !607, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!610 = !{!611}
!611 = !DISubrange(count: 5)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !421, file: !422, line: 113, baseType: !613, size: 320, offset: 3648)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 320, elements: !610)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!435, !419, !418}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !421, file: !422, line: 114, baseType: !618, size: 320, offset: 3968)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 320, elements: !610)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !421, file: !422, line: 115, baseType: !592, size: 32, offset: 4288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !421, file: !422, line: 120, baseType: !607, size: 64, offset: 4352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !421, file: !422, line: 121, baseType: !592, size: 32, offset: 4416)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !415, line: 331, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !415, line: 331, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !415, line: 338, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !415, line: 338, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !630, line: 1451, baseType: !465)
!630 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !633, line: 79, baseType: !634)
!633 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 53, size: 2240, elements: !635)
!635 = !{!636, !638, !639, !640, !642, !643, !644, !646, !647, !648, !649, !650, !651, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1467, !1558, !1562}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !634, file: !633, line: 54, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !295, line: 264, baseType: !342)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !634, file: !633, line: 55, baseType: !477, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !634, file: !633, line: 56, baseType: !477, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !634, file: !633, line: 57, baseType: !641, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !295, line: 297, baseType: !348)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !634, file: !633, line: 58, baseType: !592, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !634, file: !633, line: 60, baseType: !592, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !634, file: !633, line: 61, baseType: !645, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !295, line: 330, baseType: !355)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !634, file: !633, line: 62, baseType: !477, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !634, file: !633, line: 63, baseType: !477, size: 32, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !634, file: !633, line: 64, baseType: !592, size: 32, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !634, file: !633, line: 66, baseType: !592, size: 32, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !634, file: !633, line: 68, baseType: !477, size: 32, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !634, file: !633, line: 69, baseType: !652, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !633, line: 48, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 14, size: 1600, elements: !656)
!656 = !{!657, !658, !659, !660, !664, !665, !666, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1455, !1456, !1457}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !655, file: !633, line: 15, baseType: !477, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !655, file: !633, line: 16, baseType: !477, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !655, file: !633, line: 17, baseType: !477, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !655, file: !633, line: 18, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !655, file: !633, line: 19, baseType: !661, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !655, file: !633, line: 20, baseType: !661, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !655, file: !633, line: 21, baseType: !667, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !670, line: 436, size: 23424, elements: !671)
!670 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!671 = !{!672, !674, !1178, !1198, !1199, !1200, !1202, !1203, !1204, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1328, !1329, !1345, !1346, !1347, !1348, !1349, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1384, !1404, !1405, !1407, !1408, !1409, !1410, !1411, !1412, !1430, !1431}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !669, file: !670, line: 437, baseType: !673, size: 4480)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !422, line: 122, baseType: !421)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !669, file: !670, line: 437, baseType: !675, size: 9472, offset: 4480)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 9472, elements: !473)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !670, line: 32, size: 9472, elements: !677)
!677 = !{!678, !687, !691, !692, !696, !700, !701, !702, !703, !704, !705, !706, !730, !734, !739, !745, !764, !769, !773, !774, !779, !784, !785, !790, !794, !798, !802, !806, !810, !811, !812, !813, !814, !818, !819, !824, !825, !826, !827, !828, !833, !840, !845, !849, !853, !857, !861, !862, !866, !867, !874, !879, !880, !881, !882, !944, !952, !953, !957, !958, !962, !963, !967, !972, !973, !977, !981, !988, !989, !990, !991, !992, !993, !998, !999, !1003, !1007, !1011, !1012, !1013, !1017, !1027, !1028, !1032, !1033, !1037, !1038, !1042, !1043, !1048, !1049, !1053, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1067, !1068, !1069, !1070, !1071, !1072, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1087, !1091, !1092, !1093, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1107, !1108, !1109, !1114, !1118, !1119, !1123, !1124, !1125, !1126, !1152, !1156, !1157, !1158, !1159, !1160, !1164, !1165, !1166, !1167, !1168, !1172, !1176, !1177}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !676, file: !670, line: 34, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!435, !667, !477, !682, !477, !682, !684, !686}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !676, file: !670, line: 35, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!435, !667, !477, !522, !524, !542}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !676, file: !670, line: 36, baseType: !688, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !676, file: !670, line: 37, baseType: !693, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!435, !667, !661, !661}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !676, file: !670, line: 38, baseType: !697, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!435, !667, !661, !661, !661}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !676, file: !670, line: 40, baseType: !693, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !676, file: !670, line: 41, baseType: !697, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !676, file: !670, line: 42, baseType: !693, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !676, file: !670, line: 43, baseType: !697, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !676, file: !670, line: 44, baseType: !693, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !676, file: !670, line: 46, baseType: !697, size: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !676, file: !670, line: 47, baseType: !707, size: 64, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!435, !667, !710, !710, !714}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !711, line: 11, baseType: !712)
!711 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !711, line: 11, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !717, file: !36, line: 1227, baseType: !531, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !717, file: !36, line: 1228, baseType: !531, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !717, file: !36, line: 1229, baseType: !531, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !717, file: !36, line: 1230, baseType: !531, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !717, file: !36, line: 1231, baseType: !531, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !717, file: !36, line: 1232, baseType: !531, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !717, file: !36, line: 1233, baseType: !531, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !717, file: !36, line: 1234, baseType: !531, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !717, file: !36, line: 1236, baseType: !531, size: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !717, file: !36, line: 1237, baseType: !531, size: 64, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !717, file: !36, line: 1238, baseType: !531, size: 64, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !676, file: !670, line: 48, baseType: !731, size: 64, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!435, !667, !710, !714}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !676, file: !670, line: 49, baseType: !735, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!435, !667, !661, !531, !738, !531, !477, !477, !661}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !676, file: !670, line: 50, baseType: !740, size: 64, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!435, !667, !743, !744}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !676, file: !670, line: 52, baseType: !746, size: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!435, !667, !749, !750}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !752, file: !36, line: 593, baseType: !479, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !752, file: !36, line: 594, baseType: !479, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !752, file: !36, line: 594, baseType: !479, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !752, file: !36, line: 594, baseType: !479, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !752, file: !36, line: 595, baseType: !479, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !752, file: !36, line: 596, baseType: !479, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !752, file: !36, line: 597, baseType: !479, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !752, file: !36, line: 598, baseType: !479, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !752, file: !36, line: 598, baseType: !479, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !752, file: !36, line: 599, baseType: !479, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !676, file: !670, line: 53, baseType: !765, size: 64, offset: 1024)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!435, !667, !667, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !676, file: !670, line: 54, baseType: !770, size: 64, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!435, !667, !661}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !676, file: !670, line: 55, baseType: !693, size: 64, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !676, file: !670, line: 56, baseType: !775, size: 64, offset: 1216)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!435, !667, !778, !530}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !676, file: !670, line: 58, baseType: !780, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!435, !667, !783}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !676, file: !670, line: 59, baseType: !780, size: 64, offset: 1344)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !676, file: !670, line: 60, baseType: !786, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!435, !667, !789, !592}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !676, file: !670, line: 61, baseType: !791, size: 64, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!435, !667}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !676, file: !670, line: 63, baseType: !795, size: 64, offset: 1536)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!435, !667, !477, !682, !540, !661, !661}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !676, file: !670, line: 64, baseType: !799, size: 64, offset: 1600)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!435, !667, !667, !710, !710, !714}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !676, file: !670, line: 65, baseType: !803, size: 64, offset: 1664)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!435, !667, !667, !714}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !676, file: !670, line: 66, baseType: !807, size: 64, offset: 1728)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!435, !667, !667, !710, !714}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !676, file: !670, line: 67, baseType: !803, size: 64, offset: 1792)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !676, file: !670, line: 69, baseType: !791, size: 64, offset: 1856)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !676, file: !670, line: 70, baseType: !799, size: 64, offset: 1920)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !676, file: !670, line: 71, baseType: !807, size: 64, offset: 1984)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !676, file: !670, line: 72, baseType: !815, size: 64, offset: 2048)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!435, !667, !744}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !676, file: !670, line: 73, baseType: !791, size: 64, offset: 2112)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !676, file: !670, line: 75, baseType: !820, size: 64, offset: 2176)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!435, !667, !823, !744}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !676, file: !670, line: 76, baseType: !693, size: 64, offset: 2240)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !676, file: !670, line: 77, baseType: !693, size: 64, offset: 2304)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !676, file: !670, line: 78, baseType: !707, size: 64, offset: 2368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !676, file: !670, line: 79, baseType: !731, size: 64, offset: 2432)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !676, file: !670, line: 81, baseType: !829, size: 64, offset: 2496)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!435, !667, !540, !667, !832}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !676, file: !670, line: 82, baseType: !834, size: 64, offset: 2560)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!435, !667, !477, !837, !837, !743, !839}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !676, file: !670, line: 83, baseType: !841, size: 64, offset: 2624)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!435, !667, !477, !844, !477}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !676, file: !670, line: 84, baseType: !846, size: 64, offset: 2688)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!435, !667, !477, !682, !477, !682, !539}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !676, file: !670, line: 85, baseType: !850, size: 64, offset: 2752)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!435, !667, !667, !832}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !676, file: !670, line: 87, baseType: !854, size: 64, offset: 2816)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!435, !667, !661, !522}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !676, file: !670, line: 88, baseType: !858, size: 64, offset: 2880)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!435, !667, !540}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !676, file: !670, line: 89, baseType: !858, size: 64, offset: 2944)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !676, file: !670, line: 90, baseType: !863, size: 64, offset: 3008)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!435, !667, !661, !686}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !676, file: !670, line: 91, baseType: !795, size: 64, offset: 3072)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !676, file: !670, line: 93, baseType: !868, size: 64, offset: 3136)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!435, !667, !871}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !676, file: !670, line: 94, baseType: !875, size: 64, offset: 3200)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!435, !667, !477, !592, !592, !522, !878, !878, !768}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !676, file: !670, line: 95, baseType: !875, size: 64, offset: 3264)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !676, file: !670, line: 96, baseType: !875, size: 64, offset: 3328)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !676, file: !670, line: 97, baseType: !875, size: 64, offset: 3392)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !676, file: !670, line: 99, baseType: !883, size: 64, offset: 3456)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!435, !667, !886, !889}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !711, line: 51, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !711, line: 51, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !670, line: 609, size: 6208, elements: !892)
!892 = !{!893, !894, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !913, !920, !921, !922, !923, !924, !925, !926, !927, !931, !932, !933, !934, !935, !937, !938, !939, !940, !941, !942, !943}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !891, file: !670, line: 610, baseType: !673, size: 4480)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !891, file: !670, line: 610, baseType: !895, size: 32, offset: 4480)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !473)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !891, file: !670, line: 611, baseType: !477, size: 32, offset: 4512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !891, file: !670, line: 611, baseType: !477, size: 32, offset: 4544)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !891, file: !670, line: 611, baseType: !477, size: 32, offset: 4576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !891, file: !670, line: 612, baseType: !477, size: 32, offset: 4608)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !891, file: !670, line: 613, baseType: !477, size: 32, offset: 4640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !891, file: !670, line: 614, baseType: !522, size: 64, offset: 4672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !891, file: !670, line: 615, baseType: !524, size: 64, offset: 4736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !891, file: !670, line: 616, baseType: !844, size: 64, offset: 4800)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !891, file: !670, line: 617, baseType: !522, size: 64, offset: 4864)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !891, file: !670, line: 618, baseType: !906, size: 64, offset: 4928)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !670, line: 602, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 598, size: 128, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !908, file: !670, line: 599, baseType: !477, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !908, file: !670, line: 600, baseType: !477, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !908, file: !670, line: 601, baseType: !539, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !891, file: !670, line: 619, baseType: !914, size: 64, offset: 4992)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !670, line: 607, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 604, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !916, file: !670, line: 605, baseType: !477, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !916, file: !670, line: 606, baseType: !539, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !891, file: !670, line: 620, baseType: !539, size: 64, offset: 5056)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !891, file: !670, line: 621, baseType: !531, size: 64, offset: 5120)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !891, file: !670, line: 622, baseType: !531, size: 64, offset: 5184)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !891, file: !670, line: 623, baseType: !661, size: 64, offset: 5248)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !891, file: !670, line: 623, baseType: !661, size: 64, offset: 5312)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !891, file: !670, line: 623, baseType: !661, size: 64, offset: 5376)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !891, file: !670, line: 624, baseType: !592, size: 32, offset: 5440)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !891, file: !670, line: 625, baseType: !928, size: 64, offset: 5504)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!435}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !891, file: !670, line: 626, baseType: !418, size: 64, offset: 5568)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !891, file: !670, line: 627, baseType: !661, size: 64, offset: 5632)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !891, file: !670, line: 628, baseType: !477, size: 32, offset: 5696)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !891, file: !670, line: 629, baseType: !454, size: 64, offset: 5760)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !891, file: !670, line: 630, baseType: !936, size: 32, offset: 5824)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !891, file: !670, line: 631, baseType: !477, size: 32, offset: 5856)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !891, file: !670, line: 631, baseType: !477, size: 32, offset: 5888)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !891, file: !670, line: 632, baseType: !592, size: 32, offset: 5920)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !891, file: !670, line: 633, baseType: !592, size: 32, offset: 5952)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !891, file: !670, line: 634, baseType: !465, size: 64, offset: 6016)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !891, file: !670, line: 634, baseType: !418, size: 64, offset: 6080)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !891, file: !670, line: 635, baseType: !485, size: 64, offset: 6144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !676, file: !670, line: 100, baseType: !945, size: 64, offset: 3520)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!435, !667, !477, !477, !948, !951}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !950)
!950 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !676, file: !670, line: 101, baseType: !791, size: 64, offset: 3584)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !676, file: !670, line: 102, baseType: !954, size: 64, offset: 3648)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!435, !667, !710, !710, !744}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !676, file: !670, line: 103, baseType: !679, size: 64, offset: 3712)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !676, file: !670, line: 105, baseType: !959, size: 64, offset: 3776)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!435, !667, !710, !710, !743, !744}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !676, file: !670, line: 106, baseType: !791, size: 64, offset: 3840)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !676, file: !670, line: 107, baseType: !964, size: 64, offset: 3904)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!435, !667, !441}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !676, file: !670, line: 108, baseType: !968, size: 64, offset: 3968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!435, !667, !971, !743, !744}
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !454)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !676, file: !670, line: 109, baseType: !928, size: 64, offset: 4032)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !676, file: !670, line: 111, baseType: !974, size: 64, offset: 4096)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!435, !667, !667, !667, !531, !667}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !676, file: !670, line: 112, baseType: !978, size: 64, offset: 4160)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!435, !667, !667, !667, !667}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !676, file: !670, line: 113, baseType: !982, size: 64, offset: 4224)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!435, !667, !985, !985}
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !711, line: 30, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !711, line: 30, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !676, file: !670, line: 114, baseType: !679, size: 64, offset: 4288)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !676, file: !670, line: 115, baseType: !795, size: 64, offset: 4352)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !676, file: !670, line: 117, baseType: !854, size: 64, offset: 4416)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !676, file: !670, line: 118, baseType: !854, size: 64, offset: 4480)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !676, file: !670, line: 119, baseType: !968, size: 64, offset: 4544)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !676, file: !670, line: 120, baseType: !994, size: 64, offset: 4608)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!435, !667, !997, !768}
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !676, file: !670, line: 121, baseType: !928, size: 64, offset: 4672)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !676, file: !670, line: 123, baseType: !1000, size: 64, offset: 4736)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!435, !667, !477, !418}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !676, file: !670, line: 124, baseType: !1004, size: 64, offset: 4800)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!435, !667, !889, !661, !418}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !676, file: !670, line: 125, baseType: !1008, size: 64, offset: 4864)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!435, !568, !667}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !676, file: !670, line: 126, baseType: !693, size: 64, offset: 4928)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !676, file: !670, line: 127, baseType: !693, size: 64, offset: 4992)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !676, file: !670, line: 129, baseType: !1014, size: 64, offset: 5056)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!435, !667, !844}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !676, file: !670, line: 130, baseType: !1018, size: 64, offset: 5120)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!435, !667, !1021, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1023, file: !60, line: 653, baseType: !477, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1023, file: !60, line: 653, baseType: !661, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !676, file: !670, line: 131, baseType: !1018, size: 64, offset: 5184)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !676, file: !670, line: 132, baseType: !1029, size: 64, offset: 5248)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!435, !667, !522, !522, !522}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !676, file: !670, line: 133, baseType: !964, size: 64, offset: 5312)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !676, file: !670, line: 135, baseType: !1034, size: 64, offset: 5376)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!435, !667, !531, !768}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !676, file: !670, line: 136, baseType: !1034, size: 64, offset: 5440)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !676, file: !670, line: 137, baseType: !1039, size: 64, offset: 5504)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!435, !667, !768}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !676, file: !670, line: 138, baseType: !679, size: 64, offset: 5568)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !676, file: !670, line: 139, baseType: !1044, size: 64, offset: 5632)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!435, !667, !1047, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !676, file: !670, line: 141, baseType: !928, size: 64, offset: 5696)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !676, file: !670, line: 142, baseType: !1050, size: 64, offset: 5760)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!435, !667, !667, !531, !667}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !676, file: !670, line: 143, baseType: !1054, size: 64, offset: 5824)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!435, !667, !667, !667}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !676, file: !670, line: 144, baseType: !928, size: 64, offset: 5888)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !676, file: !670, line: 145, baseType: !1050, size: 64, offset: 5952)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !676, file: !670, line: 147, baseType: !1054, size: 64, offset: 6016)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !676, file: !670, line: 148, baseType: !928, size: 64, offset: 6080)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !676, file: !670, line: 149, baseType: !1050, size: 64, offset: 6144)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !676, file: !670, line: 150, baseType: !1054, size: 64, offset: 6208)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !676, file: !670, line: 151, baseType: !1064, size: 64, offset: 6272)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!435, !667, !592}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !676, file: !670, line: 153, baseType: !791, size: 64, offset: 6336)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !676, file: !670, line: 154, baseType: !791, size: 64, offset: 6400)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !676, file: !670, line: 155, baseType: !791, size: 64, offset: 6464)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !676, file: !670, line: 156, baseType: !791, size: 64, offset: 6528)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !676, file: !670, line: 157, baseType: !964, size: 64, offset: 6592)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !676, file: !670, line: 159, baseType: !1073, size: 64, offset: 6656)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!435, !667, !477, !684}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !676, file: !670, line: 160, baseType: !791, size: 64, offset: 6720)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !676, file: !670, line: 161, baseType: !791, size: 64, offset: 6784)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !676, file: !670, line: 162, baseType: !791, size: 64, offset: 6848)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !676, file: !670, line: 163, baseType: !791, size: 64, offset: 6912)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !676, file: !670, line: 165, baseType: !1054, size: 64, offset: 6976)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !676, file: !670, line: 166, baseType: !1054, size: 64, offset: 7040)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !676, file: !670, line: 167, baseType: !854, size: 64, offset: 7104)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !676, file: !670, line: 168, baseType: !1084, size: 64, offset: 7168)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!435, !667, !661, !477}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !676, file: !670, line: 169, baseType: !1088, size: 64, offset: 7232)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!435, !667, !768, !522}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !676, file: !670, line: 171, baseType: !815, size: 64, offset: 7296)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !676, file: !670, line: 172, baseType: !791, size: 64, offset: 7360)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !676, file: !670, line: 173, baseType: !1094, size: 64, offset: 7424)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!435, !667, !522, !878}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !676, file: !670, line: 174, baseType: !954, size: 64, offset: 7488)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !676, file: !670, line: 175, baseType: !954, size: 64, offset: 7552)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !676, file: !670, line: 177, baseType: !693, size: 64, offset: 7616)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !676, file: !670, line: 178, baseType: !740, size: 64, offset: 7680)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !676, file: !670, line: 179, baseType: !693, size: 64, offset: 7744)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !676, file: !670, line: 180, baseType: !697, size: 64, offset: 7808)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !676, file: !670, line: 181, baseType: !1104, size: 64, offset: 7872)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!435, !667, !414, !743, !744}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !676, file: !670, line: 183, baseType: !1014, size: 64, offset: 7936)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !676, file: !670, line: 184, baseType: !775, size: 64, offset: 8000)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !676, file: !670, line: 185, baseType: !1110, size: 64, offset: 8064)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!435, !667, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !676, file: !670, line: 186, baseType: !1115, size: 64, offset: 8128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!435, !667, !477, !682, !539}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !676, file: !670, line: 187, baseType: !834, size: 64, offset: 8192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !676, file: !670, line: 189, baseType: !1120, size: 64, offset: 8256)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!435, !667, !477, !477, !522, !684}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !676, file: !670, line: 190, baseType: !928, size: 64, offset: 8320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !676, file: !670, line: 191, baseType: !1050, size: 64, offset: 8384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !676, file: !670, line: 192, baseType: !1054, size: 64, offset: 8448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !676, file: !670, line: 193, baseType: !1127, size: 64, offset: 8512)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!435, !667, !886, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !670, line: 660, size: 5312, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1132, file: !670, line: 661, baseType: !673, size: 4480)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1132, file: !670, line: 661, baseType: !895, size: 32, offset: 4480)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1132, file: !670, line: 662, baseType: !477, size: 32, offset: 4512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1132, file: !670, line: 662, baseType: !477, size: 32, offset: 4544)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1132, file: !670, line: 662, baseType: !477, size: 32, offset: 4576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1132, file: !670, line: 663, baseType: !477, size: 32, offset: 4608)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1132, file: !670, line: 664, baseType: !477, size: 32, offset: 4640)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1132, file: !670, line: 665, baseType: !522, size: 64, offset: 4672)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1132, file: !670, line: 666, baseType: !522, size: 64, offset: 4736)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1132, file: !670, line: 667, baseType: !477, size: 32, offset: 4800)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1132, file: !670, line: 668, baseType: !936, size: 32, offset: 4832)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1132, file: !670, line: 670, baseType: !522, size: 64, offset: 4864)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1132, file: !670, line: 670, baseType: !522, size: 64, offset: 4928)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1132, file: !670, line: 671, baseType: !522, size: 64, offset: 4992)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1132, file: !670, line: 672, baseType: !522, size: 64, offset: 5056)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1132, file: !670, line: 673, baseType: !522, size: 64, offset: 5120)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1132, file: !670, line: 674, baseType: !477, size: 32, offset: 5184)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1132, file: !670, line: 675, baseType: !522, size: 64, offset: 5248)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !676, file: !670, line: 195, baseType: !1153, size: 64, offset: 8576)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!435, !1130, !667, !667}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !676, file: !670, line: 196, baseType: !1153, size: 64, offset: 8640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !676, file: !670, line: 197, baseType: !928, size: 64, offset: 8704)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !676, file: !670, line: 198, baseType: !1050, size: 64, offset: 8768)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !676, file: !670, line: 199, baseType: !1054, size: 64, offset: 8832)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !676, file: !670, line: 201, baseType: !1161, size: 64, offset: 8896)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!435, !667, !477, !477}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !676, file: !670, line: 202, baseType: !829, size: 64, offset: 8960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !676, file: !670, line: 203, baseType: !697, size: 64, offset: 9024)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !676, file: !670, line: 204, baseType: !883, size: 64, offset: 9088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !676, file: !670, line: 205, baseType: !1014, size: 64, offset: 9152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !676, file: !670, line: 206, baseType: !1169, size: 64, offset: 9216)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!435, !414, !667, !477, !743, !744}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !676, file: !670, line: 208, baseType: !1173, size: 64, offset: 9280)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!435, !477, !839}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !676, file: !670, line: 209, baseType: !1054, size: 64, offset: 9344)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !676, file: !670, line: 210, baseType: !846, size: 64, offset: 9408)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !669, file: !670, line: 438, baseType: !1179, size: 64, offset: 13952)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !711, line: 60, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1181, file: !114, line: 241, baseType: !414, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !114, line: 242, baseType: !494, size: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1181, file: !114, line: 243, baseType: !477, size: 32, offset: 96)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1181, file: !114, line: 243, baseType: !477, size: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1181, file: !114, line: 244, baseType: !477, size: 32, offset: 160)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1181, file: !114, line: 244, baseType: !477, size: 32, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1181, file: !114, line: 245, baseType: !522, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1181, file: !114, line: 246, baseType: !592, size: 32, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1181, file: !114, line: 247, baseType: !477, size: 32, offset: 352)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1181, file: !114, line: 251, baseType: !477, size: 32, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1181, file: !114, line: 252, baseType: !985, size: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1181, file: !114, line: 253, baseType: !592, size: 32, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1181, file: !114, line: 254, baseType: !477, size: 32, offset: 544)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1181, file: !114, line: 254, baseType: !477, size: 32, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1181, file: !114, line: 255, baseType: !477, size: 32, offset: 608)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !669, file: !670, line: 438, baseType: !1179, size: 64, offset: 14016)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !670, line: 439, baseType: !418, size: 64, offset: 14080)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !669, file: !670, line: 440, baseType: !1201, size: 32, offset: 14144)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !669, file: !670, line: 441, baseType: !592, size: 32, offset: 14176)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !669, file: !670, line: 442, baseType: !592, size: 32, offset: 14208)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !669, file: !670, line: 443, baseType: !1205, size: 448, offset: 14272)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1206, size: 448, elements: !1207)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !454)
!1207 = !{!1208}
!1208 = !DISubrange(count: 7)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !669, file: !670, line: 444, baseType: !592, size: 32, offset: 14720)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !669, file: !670, line: 445, baseType: !592, size: 32, offset: 14752)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !669, file: !670, line: 446, baseType: !477, size: 32, offset: 14784)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !669, file: !670, line: 447, baseType: !515, size: 64, offset: 14848)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !669, file: !670, line: 448, baseType: !515, size: 64, offset: 14912)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !669, file: !670, line: 449, baseType: !751, size: 640, offset: 14976)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !669, file: !670, line: 450, baseType: !686, size: 32, offset: 15616)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !669, file: !670, line: 451, baseType: !1217, size: 2880, offset: 15680)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !670, line: 318, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !670, line: 319, size: 2880, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1239, !1240, !1245, !1250, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1265, !1266, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1298, !1299, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1323, !1324, !1325, !1326}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1218, file: !670, line: 320, baseType: !477, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1218, file: !670, line: 321, baseType: !477, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1218, file: !670, line: 322, baseType: !477, size: 32, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1218, file: !670, line: 323, baseType: !477, size: 32, offset: 96)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1218, file: !670, line: 324, baseType: !477, size: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1218, file: !670, line: 325, baseType: !477, size: 32, offset: 160)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1218, file: !670, line: 326, baseType: !1227, size: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !670, line: 293, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !670, line: 295, size: 448, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1229, file: !670, line: 296, baseType: !1227, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1229, file: !670, line: 297, baseType: !539, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1229, file: !670, line: 297, baseType: !539, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1229, file: !670, line: 298, baseType: !522, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1229, file: !670, line: 298, baseType: !522, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1229, file: !670, line: 299, baseType: !477, size: 32, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1229, file: !670, line: 300, baseType: !477, size: 32, offset: 352)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1229, file: !670, line: 301, baseType: !477, size: 32, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1218, file: !670, line: 326, baseType: !1227, size: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1218, file: !670, line: 328, baseType: !1241, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!435, !667, !1244, !522}
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1218, file: !670, line: 329, baseType: !1246, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!435, !1244, !1249, !524, !524, !542, !522}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1218, file: !670, line: 330, baseType: !1251, size: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!435, !1244}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1218, file: !670, line: 331, baseType: !1251, size: 64, offset: 512)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1218, file: !670, line: 334, baseType: !414, size: 64, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1218, file: !670, line: 335, baseType: !494, size: 32, offset: 640)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1218, file: !670, line: 335, baseType: !494, size: 32, offset: 672)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1218, file: !670, line: 336, baseType: !494, size: 32, offset: 704)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1218, file: !670, line: 336, baseType: !494, size: 32, offset: 736)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1218, file: !670, line: 337, baseType: !1261, size: 64, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !415, line: 339, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !415, line: 339, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1218, file: !670, line: 338, baseType: !1261, size: 64, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1218, file: !670, line: 339, baseType: !1267, size: 64, offset: 896)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !415, line: 341, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !415, line: 351, size: 192, elements: !1270)
!1270 = !{!1271, !1272, !1273, !1274, !1275}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1269, file: !415, line: 354, baseType: !72, size: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1269, file: !415, line: 355, baseType: !72, size: 32, offset: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1269, file: !415, line: 356, baseType: !72, size: 32, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1269, file: !415, line: 361, baseType: !72, size: 32, offset: 96)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1269, file: !415, line: 362, baseType: !588, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1218, file: !670, line: 340, baseType: !477, size: 32, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1218, file: !670, line: 340, baseType: !477, size: 32, offset: 992)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1218, file: !670, line: 341, baseType: !539, size: 64, offset: 1024)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1218, file: !670, line: 342, baseType: !522, size: 64, offset: 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1218, file: !670, line: 343, baseType: !542, size: 64, offset: 1152)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1218, file: !670, line: 344, baseType: !524, size: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1218, file: !670, line: 345, baseType: !477, size: 32, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1218, file: !670, line: 346, baseType: !1249, size: 64, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1218, file: !670, line: 347, baseType: !592, size: 32, offset: 1408)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1218, file: !670, line: 348, baseType: !477, size: 32, offset: 1440)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1218, file: !670, line: 351, baseType: !592, size: 32, offset: 1472)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1218, file: !670, line: 352, baseType: !592, size: 32, offset: 1504)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1218, file: !670, line: 353, baseType: !494, size: 32, offset: 1536)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1218, file: !670, line: 354, baseType: !494, size: 32, offset: 1568)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1218, file: !670, line: 355, baseType: !1249, size: 64, offset: 1600)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1218, file: !670, line: 356, baseType: !1249, size: 64, offset: 1664)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1218, file: !670, line: 357, baseType: !1293, size: 64, offset: 1728)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !670, line: 310, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 308, size: 32, elements: !1296)
!1296 = !{!1297}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1295, file: !670, line: 309, baseType: !477, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1218, file: !670, line: 357, baseType: !1293, size: 64, offset: 1792)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1218, file: !670, line: 358, baseType: !1300, size: 64, offset: 1856)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !670, line: 316, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 312, size: 128, elements: !1303)
!1303 = !{!1304, !1305, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1302, file: !670, line: 313, baseType: !418, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1302, file: !670, line: 314, baseType: !477, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1302, file: !670, line: 315, baseType: !456, size: 8, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1218, file: !670, line: 359, baseType: !1300, size: 64, offset: 1920)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1218, file: !670, line: 360, baseType: !1300, size: 64, offset: 1984)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1218, file: !670, line: 361, baseType: !477, size: 32, offset: 2048)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1218, file: !670, line: 362, baseType: !494, size: 32, offset: 2080)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1218, file: !670, line: 363, baseType: !477, size: 32, offset: 2112)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1218, file: !670, line: 364, baseType: !1249, size: 64, offset: 2176)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1218, file: !670, line: 365, baseType: !1267, size: 64, offset: 2240)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1218, file: !670, line: 366, baseType: !494, size: 32, offset: 2304)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1218, file: !670, line: 367, baseType: !494, size: 32, offset: 2336)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1218, file: !670, line: 368, baseType: !1261, size: 64, offset: 2368)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1218, file: !670, line: 369, baseType: !1261, size: 64, offset: 2432)
