; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almmutils.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almmutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 181, baseType: !64, size: 32, elements: !65)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!66 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!67 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!68 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!69 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!70 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!71 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!72 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!73 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!74 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!75 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!76 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!77 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!78 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 26, baseType: !5, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 115, baseType: !5, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "TAO_ALMM_CLASSIC", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "TAO_ALMM_PHR", value: 1, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 663, baseType: !5, size: 32, elements: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!90 = !{!91, !92, !93}
!91 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!96 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!114 = !{!115, !119, !120, !323, !155, !326}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !116, line: 330, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !116, line: 330, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !123, line: 73, size: 4480, elements: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!124 = !{!125, !127, !176, !177, !179, !182, !183, !184, !185, !193, !194, !196, !200, !204, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !217, !218, !219, !221, !222, !224, !226, !227, !228, !229, !230, !233, !235, !236, !237, !238, !239, !242, !244, !245, !246, !256, !258, !259, !263, !264, !313, !318, !320, !321, !322}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !122, file: !123, line: 74, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !122, file: !123, line: 75, baseType: !128, size: 448, offset: 64)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 448, elements: !174)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !123, line: 53, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 45, size: 448, elements: !131)
!131 = !{!132, !138, !146, !151, !158, !162, !169}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !130, file: !123, line: 46, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !120, !137}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !130, file: !123, line: 47, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!136, !120, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !143, line: 16, baseType: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !143, line: 16, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !130, file: !123, line: 48, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!136, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !130, file: !123, line: 49, baseType: !152, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!136, !120, !155, !120}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !130, file: !123, line: 50, baseType: !159, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!136, !120, !155, !150}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !130, file: !123, line: 51, baseType: !163, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!136, !120, !155, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !130, file: !123, line: 52, baseType: !170, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!136, !120, !155, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!174 = !{!175}
!175 = !DISubrange(count: 1)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !122, file: !123, line: 76, baseType: !115, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !122, file: !123, line: 77, baseType: !178, size: 32, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !122, file: !123, line: 78, baseType: !180, size: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !181)
!181 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !122, file: !123, line: 78, baseType: !180, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !122, file: !123, line: 78, baseType: !180, size: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !122, file: !123, line: 78, baseType: !180, size: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !123, line: 79, baseType: !186, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !189, line: 27, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !191, line: 43, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!192 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !122, file: !123, line: 80, baseType: !178, size: 32, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !122, file: !123, line: 81, baseType: !195, size: 32, offset: 992)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !122, file: !123, line: 82, baseType: !197, size: 64, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !122, file: !123, line: 83, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !122, file: !123, line: 84, baseType: !205, size: 64, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !122, file: !123, line: 85, baseType: !205, size: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !122, file: !123, line: 86, baseType: !205, size: 64, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !122, file: !123, line: 87, baseType: !205, size: 64, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !123, line: 88, baseType: !120, size: 64, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !122, file: !123, line: 89, baseType: !186, size: 64, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !123, line: 90, baseType: !205, size: 64, offset: 1536)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !122, file: !123, line: 91, baseType: !205, size: 64, offset: 1600)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !122, file: !123, line: 92, baseType: !178, size: 32, offset: 1664)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !122, file: !123, line: 93, baseType: !119, size: 64, offset: 1728)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !122, file: !123, line: 94, baseType: !216, size: 64, offset: 1792)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !187)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !122, file: !123, line: 95, baseType: !178, size: 32, offset: 1856)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !122, file: !123, line: 95, baseType: !178, size: 32, offset: 1888)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !122, file: !123, line: 96, baseType: !220, size: 64, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !122, file: !123, line: 96, baseType: !220, size: 64, offset: 1984)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !122, file: !123, line: 97, baseType: !223, size: 64, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !122, file: !123, line: 97, baseType: !225, size: 64, offset: 2112)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !122, file: !123, line: 98, baseType: !178, size: 32, offset: 2176)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !122, file: !123, line: 98, baseType: !178, size: 32, offset: 2208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !122, file: !123, line: 99, baseType: !220, size: 64, offset: 2240)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !122, file: !123, line: 99, baseType: !220, size: 64, offset: 2304)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !122, file: !123, line: 100, baseType: !231, size: 64, offset: 2368)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !181)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !122, file: !123, line: 100, baseType: !234, size: 64, offset: 2432)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !122, file: !123, line: 101, baseType: !178, size: 32, offset: 2496)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !122, file: !123, line: 101, baseType: !178, size: 32, offset: 2528)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !122, file: !123, line: 102, baseType: !220, size: 64, offset: 2560)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !122, file: !123, line: 102, baseType: !220, size: 64, offset: 2624)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !122, file: !123, line: 103, baseType: !240, size: 64, offset: 2688)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !232)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !122, file: !123, line: 103, baseType: !243, size: 64, offset: 2752)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !122, file: !123, line: 104, baseType: !173, size: 64, offset: 2816)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !122, file: !123, line: 105, baseType: !178, size: 32, offset: 2880)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !122, file: !123, line: 106, baseType: !247, size: 128, offset: 2944)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 128, elements: !254)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !123, line: 64, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 61, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !250, file: !123, line: 62, baseType: !166, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !250, file: !123, line: 63, baseType: !119, size: 64, offset: 64)
!254 = !{!255}
!255 = !DISubrange(count: 2)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !122, file: !123, line: 107, baseType: !257, size: 64, offset: 3072)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 64, elements: !254)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !122, file: !123, line: 108, baseType: !119, size: 64, offset: 3136)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !122, file: !123, line: 109, baseType: !260, size: 64, offset: 3200)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!136, !119}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !122, file: !123, line: 111, baseType: !178, size: 32, offset: 3264)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !122, file: !123, line: 112, baseType: !265, size: 320, offset: 3328)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 320, elements: !311)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!136, !269, !120, !119}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !272)
!272 = !{!273, !274, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !271, file: !10, line: 100, baseType: !178, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !10, line: 101, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !286, !287, !288, !292, !294, !296, !297, !298}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !277, file: !10, line: 84, baseType: !205, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !277, file: !10, line: 85, baseType: !205, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !10, line: 86, baseType: !119, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !277, file: !10, line: 87, baseType: !197, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !277, file: !10, line: 88, baseType: !284, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !277, file: !10, line: 89, baseType: !157, size: 8, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !277, file: !10, line: 90, baseType: !205, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !277, file: !10, line: 91, baseType: !289, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !290, line: 46, baseType: !291)
!290 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!291 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !277, file: !10, line: 92, baseType: !293, size: 32, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !10, line: 93, baseType: !295, size: 32, offset: 544)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !10, line: 94, baseType: !275, size: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !277, file: !10, line: 95, baseType: !205, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !277, file: !10, line: 96, baseType: !119, size: 64, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !271, file: !10, line: 102, baseType: !205, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !271, file: !10, line: 102, baseType: !205, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !271, file: !10, line: 103, baseType: !205, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !271, file: !10, line: 104, baseType: !115, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !271, file: !10, line: 105, baseType: !293, size: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !271, file: !10, line: 105, baseType: !293, size: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !271, file: !10, line: 105, baseType: !293, size: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !271, file: !10, line: 106, baseType: !120, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !271, file: !10, line: 107, baseType: !308, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!311 = !{!312}
!312 = !DISubrange(count: 5)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !122, file: !123, line: 113, baseType: !314, size: 320, offset: 3648)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 320, elements: !311)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!136, !120, !119}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !122, file: !123, line: 114, baseType: !319, size: 320, offset: 3968)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 320, elements: !311)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !122, file: !123, line: 115, baseType: !293, size: 32, offset: 4288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !122, file: !123, line: 120, baseType: !308, size: 64, offset: 4352)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !122, file: !123, line: 121, baseType: !293, size: 32, offset: 4416)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !325, line: 1451, baseType: !166)
!325 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_ALMM", file: !328, line: 25, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/constrained/impls/almm/almm.h", directory: "/home/users/ndemeye/xSDK")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 5, size: 3328, elements: !330)
!330 = !{!331, !858, !859, !860, !862, !863, !864, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "subsolver", scope: !329, file: !328, line: 6, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !63, line: 118, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !335, line: 45, size: 14656, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !339, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !729, !735, !737, !738, !739, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !810, !811, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !850, !851, !852, !853, !854, !855, !856, !857}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !334, file: !335, line: 46, baseType: !338, size: 4480)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !123, line: 122, baseType: !122)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !334, file: !335, line: 46, baseType: !340, size: 1536, offset: 4480)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 1536, elements: !174)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !335, line: 13, size: 1536, elements: !342)
!342 = !{!343, !648, !652, !656, !664, !665, !666, !667, !668, !669, !670, !674, !678, !679, !680, !681, !685, !689, !690, !694, !698, !699, !703, !707}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !341, file: !335, line: 15, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!136, !332, !347, !231, !119}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !350, line: 142, size: 12800, elements: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = !{!352, !353, !573, !594, !595, !596, !642, !643, !644, !645, !647}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !349, file: !350, line: 143, baseType: !338, size: 4480)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !349, file: !350, line: 143, baseType: !354, size: 5248, offset: 4480)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 5248, elements: !174)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !350, line: 23, size: 5248, elements: !356)
!356 = !{!357, !362, !367, !371, !375, !381, !386, !387, !388, !392, !396, !397, !398, !402, !406, !412, !413, !417, !421, !425, !426, !433, !437, !438, !442, !446, !447, !448, !452, !453, !460, !465, !466, !467, !471, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !492, !493, !494, !498, !502, !503, !504, !505, !509, !510, !511, !512, !513, !514, !515, !519, !520, !524, !531, !532, !537, !538, !542, !543, !544, !545, !546, !547, !548, !549, !553, !554, !555, !561, !565, !566, !567}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !355, file: !350, line: 24, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!136, !347, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !355, file: !350, line: 25, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!136, !347, !178, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !355, file: !350, line: 26, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!136, !178, !361}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !355, file: !350, line: 27, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!136, !347, !347, !240}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !355, file: !350, line: 28, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!136, !347, !178, !379, !240}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !355, file: !350, line: 29, baseType: !382, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!136, !347, !385, !231}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !355, file: !350, line: 30, baseType: !372, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !355, file: !350, line: 31, baseType: !376, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !355, file: !350, line: 32, baseType: !389, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!136, !347, !241}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !355, file: !350, line: 33, baseType: !393, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!136, !347, !347}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !355, file: !350, line: 34, baseType: !389, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !355, file: !350, line: 35, baseType: !393, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !355, file: !350, line: 36, baseType: !399, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!136, !347, !241, !347}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !355, file: !350, line: 37, baseType: !403, size: 64, offset: 832)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!136, !347, !241, !241, !347}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !355, file: !350, line: 38, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!136, !347, !178, !410, !361}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !355, file: !350, line: 39, baseType: !399, size: 64, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !355, file: !350, line: 40, baseType: !414, size: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!136, !347, !241, !347, !347}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !355, file: !350, line: 41, baseType: !418, size: 64, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!136, !347, !241, !241, !241, !347, !347}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !355, file: !350, line: 42, baseType: !422, size: 64, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!136, !347, !347, !347}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !355, file: !350, line: 43, baseType: !422, size: 64, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !355, file: !350, line: 44, baseType: !427, size: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!136, !347, !178, !430, !410, !432}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !355, file: !350, line: 45, baseType: !434, size: 64, offset: 1344)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!136, !347}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !355, file: !350, line: 46, baseType: !434, size: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !355, file: !350, line: 47, baseType: !439, size: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!136, !347, !243}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !355, file: !350, line: 48, baseType: !443, size: 64, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!136, !347, !223}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !355, file: !350, line: 49, baseType: !443, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !355, file: !350, line: 50, baseType: !439, size: 64, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !355, file: !350, line: 51, baseType: !449, size: 64, offset: 1728)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!136, !347, !223, !231}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !355, file: !350, line: 52, baseType: !449, size: 64, offset: 1792)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !355, file: !350, line: 53, baseType: !454, size: 64, offset: 1856)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!136, !347, !457}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !355, file: !350, line: 54, baseType: !461, size: 64, offset: 1920)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!136, !347, !464, !293}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !355, file: !350, line: 55, baseType: !427, size: 64, offset: 1984)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !355, file: !350, line: 56, baseType: !434, size: 64, offset: 2048)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !355, file: !350, line: 57, baseType: !468, size: 64, offset: 2112)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!136, !347, !142}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !355, file: !350, line: 58, baseType: !472, size: 64, offset: 2176)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!136, !347, !410}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !355, file: !350, line: 59, baseType: !472, size: 64, offset: 2240)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !355, file: !350, line: 60, baseType: !372, size: 64, offset: 2304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !355, file: !350, line: 61, baseType: !372, size: 64, offset: 2368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !355, file: !350, line: 62, baseType: !382, size: 64, offset: 2432)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !355, file: !350, line: 63, baseType: !376, size: 64, offset: 2496)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !355, file: !350, line: 64, baseType: !376, size: 64, offset: 2560)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !355, file: !350, line: 65, baseType: !468, size: 64, offset: 2624)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !355, file: !350, line: 66, baseType: !434, size: 64, offset: 2688)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !355, file: !350, line: 67, baseType: !434, size: 64, offset: 2752)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !355, file: !350, line: 68, baseType: !485, size: 64, offset: 2816)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!136, !347, !488}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !489, line: 30, baseType: !490)
!489 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !489, line: 30, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !355, file: !350, line: 69, baseType: !427, size: 64, offset: 2880)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !355, file: !350, line: 70, baseType: !434, size: 64, offset: 2944)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !355, file: !350, line: 71, baseType: !495, size: 64, offset: 3008)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!136, !269, !347}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !355, file: !350, line: 72, baseType: !499, size: 64, offset: 3072)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!136, !347, !347, !231}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !355, file: !350, line: 73, baseType: !422, size: 64, offset: 3136)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !355, file: !350, line: 74, baseType: !422, size: 64, offset: 3200)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !355, file: !350, line: 75, baseType: !422, size: 64, offset: 3264)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !355, file: !350, line: 76, baseType: !506, size: 64, offset: 3328)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!136, !347, !178, !430, !240}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !355, file: !350, line: 77, baseType: !434, size: 64, offset: 3392)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !355, file: !350, line: 78, baseType: !434, size: 64, offset: 3456)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !355, file: !350, line: 79, baseType: !434, size: 64, offset: 3520)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !355, file: !350, line: 80, baseType: !434, size: 64, offset: 3584)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !355, file: !350, line: 81, baseType: !389, size: 64, offset: 3648)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !355, file: !350, line: 82, baseType: !434, size: 64, offset: 3712)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !355, file: !350, line: 83, baseType: !516, size: 64, offset: 3776)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!136, !347, !178, !347, !432}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !355, file: !350, line: 84, baseType: !516, size: 64, offset: 3840)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !355, file: !350, line: 85, baseType: !521, size: 64, offset: 3904)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!136, !347, !347, !240, !240}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !355, file: !350, line: 86, baseType: !525, size: 64, offset: 3968)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!136, !347, !528, !361}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !489, line: 11, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !489, line: 11, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !355, file: !350, line: 87, baseType: !525, size: 64, offset: 4032)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !355, file: !350, line: 88, baseType: !533, size: 64, offset: 4096)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!136, !347, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !355, file: !350, line: 89, baseType: !533, size: 64, offset: 4160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !355, file: !350, line: 90, baseType: !539, size: 64, offset: 4224)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!136, !347, !178, !430, !430, !347, !432}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !355, file: !350, line: 91, baseType: !539, size: 64, offset: 4288)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !355, file: !350, line: 92, baseType: !468, size: 64, offset: 4352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !355, file: !350, line: 93, baseType: !468, size: 64, offset: 4416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !355, file: !350, line: 94, baseType: !393, size: 64, offset: 4480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !355, file: !350, line: 95, baseType: !393, size: 64, offset: 4544)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !355, file: !350, line: 96, baseType: !393, size: 64, offset: 4608)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !355, file: !350, line: 97, baseType: !393, size: 64, offset: 4672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !355, file: !350, line: 98, baseType: !550, size: 64, offset: 4736)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!136, !347, !293}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !355, file: !350, line: 99, baseType: !439, size: 64, offset: 4800)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !355, file: !350, line: 100, baseType: !439, size: 64, offset: 4864)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !355, file: !350, line: 101, baseType: !556, size: 64, offset: 4928)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!136, !347, !243, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !355, file: !350, line: 102, baseType: !562, size: 64, offset: 4992)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!136, !347, !536, !559}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !355, file: !350, line: 103, baseType: !439, size: 64, offset: 5056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !355, file: !350, line: 104, baseType: !533, size: 64, offset: 5120)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !355, file: !350, line: 105, baseType: !568, size: 64, offset: 5184)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!136, !178, !379, !361, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !349, file: !350, line: 144, baseType: !574, size: 64, offset: 9728)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !489, line: 60, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !577, line: 240, size: 640, elements: !578)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !576, file: !577, line: 241, baseType: !115, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !576, file: !577, line: 242, baseType: !195, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !576, file: !577, line: 243, baseType: !178, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !576, file: !577, line: 243, baseType: !178, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !576, file: !577, line: 244, baseType: !178, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !576, file: !577, line: 244, baseType: !178, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !576, file: !577, line: 245, baseType: !223, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !576, file: !577, line: 246, baseType: !293, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !576, file: !577, line: 247, baseType: !178, size: 32, offset: 352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !576, file: !577, line: 251, baseType: !178, size: 32, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !576, file: !577, line: 252, baseType: !488, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !576, file: !577, line: 253, baseType: !293, size: 32, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !576, file: !577, line: 254, baseType: !178, size: 32, offset: 544)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !576, file: !577, line: 254, baseType: !178, size: 32, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !576, file: !577, line: 255, baseType: !178, size: 32, offset: 608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !350, line: 145, baseType: !119, size: 64, offset: 9792)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !349, file: !350, line: 146, baseType: !293, size: 32, offset: 9856)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !349, file: !350, line: 147, baseType: !597, size: 1344, offset: 9920)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !350, line: 140, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 114, size: 1344, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !618, !619, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !598, file: !350, line: 115, baseType: !178, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !598, file: !350, line: 116, baseType: !178, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !598, file: !350, line: 117, baseType: !178, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !598, file: !350, line: 118, baseType: !178, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !598, file: !350, line: 119, baseType: !178, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !598, file: !350, line: 120, baseType: !178, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !598, file: !350, line: 121, baseType: !223, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !598, file: !350, line: 122, baseType: !240, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !598, file: !350, line: 124, baseType: !115, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !598, file: !350, line: 125, baseType: !195, size: 32, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !598, file: !350, line: 125, baseType: !195, size: 32, offset: 416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !598, file: !350, line: 126, baseType: !195, size: 32, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !598, file: !350, line: 126, baseType: !195, size: 32, offset: 480)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !598, file: !350, line: 127, baseType: !614, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !116, line: 339, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !116, line: 339, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !598, file: !350, line: 128, baseType: !614, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !598, file: !350, line: 129, baseType: !620, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !116, line: 341, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !116, line: 351, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !622, file: !116, line: 354, baseType: !64, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !622, file: !116, line: 355, baseType: !64, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !622, file: !116, line: 356, baseType: !64, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !622, file: !116, line: 361, baseType: !64, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !622, file: !116, line: 362, baseType: !289, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !598, file: !350, line: 130, baseType: !178, size: 32, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !598, file: !350, line: 130, baseType: !178, size: 32, offset: 736)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !598, file: !350, line: 131, baseType: !240, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !598, file: !350, line: 131, baseType: !240, size: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !598, file: !350, line: 132, baseType: !223, size: 64, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !598, file: !350, line: 132, baseType: !223, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !598, file: !350, line: 133, baseType: !178, size: 32, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !598, file: !350, line: 134, baseType: !223, size: 64, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !598, file: !350, line: 135, baseType: !178, size: 32, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !598, file: !350, line: 136, baseType: !293, size: 32, offset: 1184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !598, file: !350, line: 137, baseType: !293, size: 32, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !598, file: !350, line: 138, baseType: !432, size: 32, offset: 1248)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !598, file: !350, line: 139, baseType: !223, size: 64, offset: 1280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !349, file: !350, line: 147, baseType: !597, size: 1344, offset: 11264)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !349, file: !350, line: 148, baseType: !293, size: 32, offset: 12608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !349, file: !350, line: 149, baseType: !178, size: 32, offset: 12640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !349, file: !350, line: 150, baseType: !646, size: 32, offset: 12672)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !349, file: !350, line: 157, baseType: !205, size: 64, offset: 12736)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !341, file: !335, line: 16, baseType: !649, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!136, !332, !347, !231, !347, !119}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !341, file: !335, line: 17, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!136, !332, !347, !347, !119}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !341, file: !335, line: 18, baseType: !657, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!136, !332, !347, !660, !660, !119}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !661, line: 16, baseType: !662)
!661 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !661, line: 16, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !341, file: !335, line: 19, baseType: !653, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !341, file: !335, line: 20, baseType: !657, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !341, file: !335, line: 21, baseType: !653, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !341, file: !335, line: 22, baseType: !653, size: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !341, file: !335, line: 23, baseType: !653, size: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !341, file: !335, line: 24, baseType: !657, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !341, file: !335, line: 25, baseType: !671, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!136, !332, !347, !660, !660, !660, !119}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !341, file: !335, line: 26, baseType: !675, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!136, !332, !347, !660, !119}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !341, file: !335, line: 27, baseType: !657, size: 64, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !341, file: !335, line: 28, baseType: !657, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !341, file: !335, line: 29, baseType: !653, size: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !341, file: !335, line: 30, baseType: !682, size: 64, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!136, !332, !178, !119}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !341, file: !335, line: 31, baseType: !686, size: 64, offset: 1024)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!136, !332, !119}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !341, file: !335, line: 32, baseType: !260, size: 64, offset: 1088)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !341, file: !335, line: 35, baseType: !691, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!136, !332, !347, !347}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !341, file: !335, line: 36, baseType: !695, size: 64, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!136, !332}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !341, file: !335, line: 37, baseType: !695, size: 64, offset: 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !341, file: !335, line: 38, baseType: !700, size: 64, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!136, !332, !142}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !341, file: !335, line: 39, baseType: !704, size: 64, offset: 1408)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!136, !269, !332}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !341, file: !335, line: 40, baseType: !695, size: 64, offset: 1472)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !334, file: !335, line: 47, baseType: !119, size: 64, offset: 6016)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !334, file: !335, line: 48, baseType: !119, size: 64, offset: 6080)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !334, file: !335, line: 49, baseType: !119, size: 64, offset: 6144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !334, file: !335, line: 50, baseType: !119, size: 64, offset: 6208)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !334, file: !335, line: 51, baseType: !119, size: 64, offset: 6272)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !334, file: !335, line: 52, baseType: !119, size: 64, offset: 6336)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !334, file: !335, line: 53, baseType: !119, size: 64, offset: 6400)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !334, file: !335, line: 54, baseType: !119, size: 64, offset: 6464)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !334, file: !335, line: 55, baseType: !119, size: 64, offset: 6528)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !334, file: !335, line: 56, baseType: !119, size: 64, offset: 6592)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !334, file: !335, line: 57, baseType: !119, size: 64, offset: 6656)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !334, file: !335, line: 58, baseType: !119, size: 64, offset: 6720)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !334, file: !335, line: 59, baseType: !119, size: 64, offset: 6784)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !334, file: !335, line: 60, baseType: !119, size: 64, offset: 6848)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !334, file: !335, line: 61, baseType: !119, size: 64, offset: 6912)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !334, file: !335, line: 62, baseType: !119, size: 64, offset: 6976)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !334, file: !335, line: 63, baseType: !119, size: 64, offset: 7040)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !334, file: !335, line: 65, baseType: !726, size: 640, offset: 7104)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 640, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 10)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !334, file: !335, line: 66, baseType: !730, size: 640, offset: 7744)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 640, elements: !727)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!136, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !334, file: !335, line: 67, baseType: !736, size: 640, offset: 8384)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 640, elements: !727)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !334, file: !335, line: 68, baseType: !178, size: 32, offset: 9024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !334, file: !335, line: 69, baseType: !119, size: 64, offset: 9088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !334, file: !335, line: 70, baseType: !740, size: 32, offset: 9152)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !63, line: 196, baseType: !62)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !334, file: !335, line: 72, baseType: !293, size: 32, offset: 9184)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !335, line: 73, baseType: !119, size: 64, offset: 9216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !334, file: !335, line: 75, baseType: !347, size: 64, offset: 9280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !334, file: !335, line: 76, baseType: !347, size: 64, offset: 9344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !334, file: !335, line: 77, baseType: !347, size: 64, offset: 9408)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !334, file: !335, line: 78, baseType: !347, size: 64, offset: 9472)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !334, file: !335, line: 79, baseType: !347, size: 64, offset: 9536)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !334, file: !335, line: 80, baseType: !347, size: 64, offset: 9600)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !334, file: !335, line: 81, baseType: !347, size: 64, offset: 9664)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !334, file: !335, line: 82, baseType: !347, size: 64, offset: 9728)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !334, file: !335, line: 83, baseType: !347, size: 64, offset: 9792)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !334, file: !335, line: 84, baseType: !660, size: 64, offset: 9856)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !334, file: !335, line: 85, baseType: !660, size: 64, offset: 9920)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !334, file: !335, line: 86, baseType: !660, size: 64, offset: 9984)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !334, file: !335, line: 87, baseType: !347, size: 64, offset: 10048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !334, file: !335, line: 88, baseType: !347, size: 64, offset: 10112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !334, file: !335, line: 89, baseType: !660, size: 64, offset: 10176)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !334, file: !335, line: 90, baseType: !660, size: 64, offset: 10240)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !334, file: !335, line: 91, baseType: !347, size: 64, offset: 10304)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !334, file: !335, line: 92, baseType: !178, size: 32, offset: 10368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !334, file: !335, line: 93, baseType: !223, size: 64, offset: 10432)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !334, file: !335, line: 94, baseType: !223, size: 64, offset: 10496)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !334, file: !335, line: 95, baseType: !231, size: 64, offset: 10560)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !334, file: !335, line: 96, baseType: !347, size: 64, offset: 10624)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !334, file: !335, line: 97, baseType: !347, size: 64, offset: 10688)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !334, file: !335, line: 98, baseType: !347, size: 64, offset: 10752)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !334, file: !335, line: 99, baseType: !660, size: 64, offset: 10816)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !334, file: !335, line: 100, baseType: !660, size: 64, offset: 10880)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !334, file: !335, line: 101, baseType: !660, size: 64, offset: 10944)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !334, file: !335, line: 102, baseType: !660, size: 64, offset: 11008)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !334, file: !335, line: 103, baseType: !660, size: 64, offset: 11072)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !334, file: !335, line: 104, baseType: !660, size: 64, offset: 11136)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !334, file: !335, line: 105, baseType: !660, size: 64, offset: 11200)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !334, file: !335, line: 106, baseType: !660, size: 64, offset: 11264)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !334, file: !335, line: 107, baseType: !660, size: 64, offset: 11328)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !334, file: !335, line: 108, baseType: !660, size: 64, offset: 11392)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !334, file: !335, line: 109, baseType: !660, size: 64, offset: 11456)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !334, file: !335, line: 110, baseType: !528, size: 64, offset: 11520)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !334, file: !335, line: 111, baseType: !528, size: 64, offset: 11584)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !334, file: !335, line: 112, baseType: !232, size: 64, offset: 11648)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !334, file: !335, line: 113, baseType: !232, size: 64, offset: 11712)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !334, file: !335, line: 114, baseType: !232, size: 64, offset: 11776)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !334, file: !335, line: 115, baseType: !232, size: 64, offset: 11840)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !334, file: !335, line: 116, baseType: !232, size: 64, offset: 11904)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !334, file: !335, line: 117, baseType: !232, size: 64, offset: 11968)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !334, file: !335, line: 119, baseType: !178, size: 32, offset: 12032)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !334, file: !335, line: 120, baseType: !178, size: 32, offset: 12064)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !334, file: !335, line: 121, baseType: !178, size: 32, offset: 12096)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !334, file: !335, line: 122, baseType: !178, size: 32, offset: 12128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !334, file: !335, line: 123, baseType: !178, size: 32, offset: 12160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !334, file: !335, line: 124, baseType: !178, size: 32, offset: 12192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !334, file: !335, line: 125, baseType: !178, size: 32, offset: 12224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !334, file: !335, line: 126, baseType: !178, size: 32, offset: 12256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !334, file: !335, line: 127, baseType: !178, size: 32, offset: 12288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !334, file: !335, line: 128, baseType: !178, size: 32, offset: 12320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !334, file: !335, line: 129, baseType: !178, size: 32, offset: 12352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !334, file: !335, line: 130, baseType: !178, size: 32, offset: 12384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !334, file: !335, line: 131, baseType: !178, size: 32, offset: 12416)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !334, file: !335, line: 132, baseType: !178, size: 32, offset: 12448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !334, file: !335, line: 133, baseType: !178, size: 32, offset: 12480)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !334, file: !335, line: 134, baseType: !178, size: 32, offset: 12512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !334, file: !335, line: 135, baseType: !178, size: 32, offset: 12544)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !334, file: !335, line: 137, baseType: !178, size: 32, offset: 12576)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !334, file: !335, line: 138, baseType: !178, size: 32, offset: 12608)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !334, file: !335, line: 140, baseType: !806, size: 64, offset: 12672)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !807, line: 5, baseType: !808)
!807 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !807, line: 5, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !334, file: !335, line: 141, baseType: !293, size: 32, offset: 12736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !334, file: !335, line: 142, baseType: !812, size: 64, offset: 12800)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !813, line: 22, baseType: !814)
!813 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !813, line: 22, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !334, file: !335, line: 143, baseType: !232, size: 64, offset: 12864)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !334, file: !335, line: 144, baseType: !232, size: 64, offset: 12928)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !334, file: !335, line: 146, baseType: !232, size: 64, offset: 12992)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !334, file: !335, line: 147, baseType: !232, size: 64, offset: 13056)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !334, file: !335, line: 148, baseType: !232, size: 64, offset: 13120)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !334, file: !335, line: 149, baseType: !232, size: 64, offset: 13184)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !334, file: !335, line: 150, baseType: !232, size: 64, offset: 13248)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !334, file: !335, line: 151, baseType: !232, size: 64, offset: 13312)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !334, file: !335, line: 152, baseType: !232, size: 64, offset: 13376)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !334, file: !335, line: 153, baseType: !293, size: 32, offset: 13440)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !334, file: !335, line: 154, baseType: !293, size: 32, offset: 13472)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !334, file: !335, line: 155, baseType: !293, size: 32, offset: 13504)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !334, file: !335, line: 156, baseType: !293, size: 32, offset: 13536)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !334, file: !335, line: 157, baseType: !293, size: 32, offset: 13568)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !334, file: !335, line: 158, baseType: !293, size: 32, offset: 13600)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !334, file: !335, line: 159, baseType: !293, size: 32, offset: 13632)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !334, file: !335, line: 160, baseType: !293, size: 32, offset: 13664)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !334, file: !335, line: 161, baseType: !293, size: 32, offset: 13696)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !334, file: !335, line: 162, baseType: !293, size: 32, offset: 13728)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !334, file: !335, line: 163, baseType: !293, size: 32, offset: 13760)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !334, file: !335, line: 164, baseType: !293, size: 32, offset: 13792)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !334, file: !335, line: 165, baseType: !293, size: 32, offset: 13824)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !334, file: !335, line: 166, baseType: !293, size: 32, offset: 13856)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !334, file: !335, line: 167, baseType: !293, size: 32, offset: 13888)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !334, file: !335, line: 168, baseType: !293, size: 32, offset: 13920)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !334, file: !335, line: 169, baseType: !293, size: 32, offset: 13952)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !334, file: !335, line: 170, baseType: !293, size: 32, offset: 13984)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !334, file: !335, line: 171, baseType: !293, size: 32, offset: 14016)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !334, file: !335, line: 172, baseType: !293, size: 32, offset: 14048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !334, file: !335, line: 173, baseType: !293, size: 32, offset: 14080)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !334, file: !335, line: 174, baseType: !293, size: 32, offset: 14112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !334, file: !335, line: 175, baseType: !293, size: 32, offset: 14144)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !334, file: !335, line: 177, baseType: !849, size: 32, offset: 14176)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !63, line: 26, baseType: !79)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !334, file: !335, line: 178, baseType: !178, size: 32, offset: 14208)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !334, file: !335, line: 179, baseType: !231, size: 64, offset: 14272)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !334, file: !335, line: 180, baseType: !231, size: 64, offset: 14336)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !334, file: !335, line: 181, baseType: !231, size: 64, offset: 14400)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !334, file: !335, line: 182, baseType: !223, size: 64, offset: 14464)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !334, file: !335, line: 183, baseType: !178, size: 32, offset: 14528)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !334, file: !335, line: 184, baseType: !293, size: 32, offset: 14560)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !334, file: !335, line: 185, baseType: !293, size: 32, offset: 14592)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !328, line: 6, baseType: !332, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sub_obj", scope: !329, file: !328, line: 7, baseType: !695, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !328, line: 8, baseType: !861, size: 32, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoALMMType", file: !63, line: 115, baseType: !84)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Pis", scope: !329, file: !328, line: 10, baseType: !572, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Yis", scope: !329, file: !328, line: 10, baseType: !572, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Pscatter", scope: !329, file: !328, line: 11, baseType: !865, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !867, line: 59, baseType: !868)
!867 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !867, line: 15, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !867, line: 15, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Yscatter", scope: !329, file: !328, line: 11, baseType: !865, size: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Ae", scope: !329, file: !328, line: 13, baseType: !660, size: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Ai", scope: !329, file: !328, line: 13, baseType: !660, size: 64, offset: 576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Px", scope: !329, file: !328, line: 14, baseType: !347, size: 64, offset: 640)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LgradX", scope: !329, file: !328, line: 14, baseType: !347, size: 64, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Ce", scope: !329, file: !328, line: 14, baseType: !347, size: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Ci", scope: !329, file: !328, line: 14, baseType: !347, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !329, file: !328, line: 14, baseType: !347, size: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Ps", scope: !329, file: !328, line: 15, baseType: !347, size: 64, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "LgradS", scope: !329, file: !328, line: 15, baseType: !347, size: 64, offset: 1024)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Yi", scope: !329, file: !328, line: 15, baseType: !347, size: 64, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Ye", scope: !329, file: !328, line: 15, baseType: !347, size: 64, offset: 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Parr", scope: !329, file: !328, line: 16, baseType: !361, size: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !329, file: !328, line: 16, baseType: !347, size: 64, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "PL", scope: !329, file: !328, line: 16, baseType: !347, size: 64, offset: 1344)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "PU", scope: !329, file: !328, line: 16, baseType: !347, size: 64, offset: 1408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Yarr", scope: !329, file: !328, line: 16, baseType: !361, size: 64, offset: 1472)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !329, file: !328, line: 16, baseType: !347, size: 64, offset: 1536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !329, file: !328, line: 16, baseType: !347, size: 64, offset: 1600)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !329, file: !328, line: 17, baseType: !347, size: 64, offset: 1664)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Cework", scope: !329, file: !328, line: 17, baseType: !347, size: 64, offset: 1728)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Ciwork", scope: !329, file: !328, line: 17, baseType: !347, size: 64, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Cizero", scope: !329, file: !328, line: 17, baseType: !347, size: 64, offset: 1856)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Lval", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 1920)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fval", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 1984)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 2048)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 2112)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cenorm", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 2176)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cinorm", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 2240)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm_old", scope: !329, file: !328, line: 19, baseType: !232, size: 64, offset: 2304)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mu0", scope: !329, file: !328, line: 20, baseType: !232, size: 64, offset: 2368)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !329, file: !328, line: 20, baseType: !232, size: 64, offset: 2432)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mu_fac", scope: !329, file: !328, line: 20, baseType: !232, size: 64, offset: 2496)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mu_pow_good", scope: !329, file: !328, line: 20, baseType: !232, size: 64, offset: 2560)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "mu_pow_bad", scope: !329, file: !328, line: 20, baseType: !232, size: 64, offset: 2624)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ytol0", scope: !329, file: !328, line: 21, baseType: !232, size: 64, offset: 2688)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ytol", scope: !329, file: !328, line: 21, baseType: !232, size: 64, offset: 2752)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gtol0", scope: !329, file: !328, line: 21, baseType: !232, size: 64, offset: 2816)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !329, file: !328, line: 21, baseType: !232, size: 64, offset: 2880)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mu_max", scope: !329, file: !328, line: 22, baseType: !232, size: 64, offset: 2944)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ye_min", scope: !329, file: !328, line: 22, baseType: !232, size: 64, offset: 3008)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "yi_min", scope: !329, file: !328, line: 22, baseType: !232, size: 64, offset: 3072)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ye_max", scope: !329, file: !328, line: 22, baseType: !232, size: 64, offset: 3136)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "yi_max", scope: !329, file: !328, line: 22, baseType: !232, size: 64, offset: 3200)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !329, file: !328, line: 24, baseType: !293, size: 32, offset: 3264)
!916 = !{i32 7, !"Dwarf Version", i32 4}
!917 = !{i32 2, !"Debug Info Version", i32 3}
!918 = !{i32 1, !"wchar_size", i32 4}
!919 = !{i32 7, !"PIC Level", i32 2}
!920 = !{i32 7, !"uwtable", i32 1}
!921 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!922 = distinct !DISubprogram(name: "TaoALMMGetType", scope: !923, file: !923, line: 19, type: !924, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !927)
!923 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almmutils.c", directory: "/home/users/ndemeye/xSDK")
!924 = !DISubroutineType(types: !925)
!925 = !{!136, !332, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!927 = !{!928, !929, !930, !931, !934, !935, !937, !941}
!928 = !DILocalVariable(name: "tao", arg: 1, scope: !922, file: !923, line: 19, type: !332)
!929 = !DILocalVariable(name: "type", arg: 2, scope: !922, file: !923, line: 19, type: !926)
!930 = !DILocalVariable(name: "ierr", scope: !922, file: !923, line: 21, type: !136)
!931 = !DILocalVariable(name: "_7_f", scope: !932, file: !923, line: 26, type: !933)
!932 = distinct !DILexicalBlock(scope: !922, file: !923, line: 26, column: 10)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!934 = !DILocalVariable(name: "_7_ierr", scope: !932, file: !923, line: 26, type: !136)
!935 = !DILocalVariable(name: "ierr__", scope: !936, file: !923, line: 26, type: !136)
!936 = distinct !DILexicalBlock(scope: !932, file: !923, line: 26, column: 10)
!937 = !DILocalVariable(name: "ierr__", scope: !938, file: !923, line: 26, type: !136)
!938 = distinct !DILexicalBlock(scope: !939, file: !923, line: 26, column: 10)
!939 = distinct !DILexicalBlock(scope: !940, file: !923, line: 26, column: 10)
!940 = distinct !DILexicalBlock(scope: !932, file: !923, line: 26, column: 10)
!941 = !DILocalVariable(name: "ierr__", scope: !942, file: !923, line: 26, type: !136)
!942 = distinct !DILexicalBlock(scope: !922, file: !923, line: 26, column: 80)
!943 = !DILocation(line: 0, scope: !922)
!944 = !DILocation(line: 23, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !923, line: 23, column: 3)
!946 = distinct !DILexicalBlock(scope: !947, file: !923, line: 23, column: 3)
!947 = distinct !DILexicalBlock(scope: !922, file: !923, line: 23, column: 3)
!948 = !{!949, !949, i64 0}
!949 = !{!"any pointer", !950, i64 0}
!950 = !{!"omnipotent char", !951, i64 0}
!951 = !{!"Simple C/C++ TBAA"}
!952 = !DILocation(line: 23, column: 3, scope: !946)
!953 = !DILocation(line: 23, column: 3, scope: !954)
!954 = distinct !DILexicalBlock(scope: !955, file: !923, line: 23, column: 3)
!955 = distinct !DILexicalBlock(scope: !945, file: !923, line: 23, column: 3)
!956 = !{!957, !958, i64 1536}
!957 = !{!"", !950, i64 0, !950, i64 512, !950, i64 1024, !950, i64 1280, !958, i64 1536, !958, i64 1540, !950, i64 1544}
!958 = !{!"int", !950, i64 0}
!959 = !DILocation(line: 23, column: 3, scope: !955)
!960 = !DILocation(line: 23, column: 3, scope: !961)
!961 = distinct !DILexicalBlock(scope: !954, file: !923, line: 23, column: 3)
!962 = !{!958, !958, i64 0}
!963 = !{!957, !958, i64 1540}
!964 = !DILocation(line: 24, column: 3, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !923, line: 24, column: 3)
!966 = distinct !DILexicalBlock(scope: !922, file: !923, line: 24, column: 3)
!967 = !DILocation(line: 24, column: 3, scope: !966)
!968 = !DILocation(line: 24, column: 3, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !923, line: 24, column: 3)
!970 = !DILocation(line: 24, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !966, file: !923, line: 24, column: 3)
!972 = !{!973, !958, i64 0}
