; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgather/sfallgather.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgather/sfallgather.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 24, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 663, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!75 = !{!76, !189, !137, !165, !168, !134, !237, !85, !84, !377, !438, !374, !213}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Allgather", file: !78, line: 4, baseType: !79)
!78 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/allgather/sfallgather.c", directory: "/home/users/ndemeye/xSDK")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Allgatherv", file: !80, line: 11, baseType: !81)
!80 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.h", directory: "/home/users/ndemeye/xSDK")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 8, size: 1280, elements: !82)
!82 = !{!83, !86, !87, !89, !91, !93, !94, !98, !100, !103, !104, !119, !120, !121, !122, !627, !628, !629}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !81, file: !80, line: 9, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !85)
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !81, file: !80, line: 9, baseType: !84, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !81, file: !80, line: 9, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !81, file: !80, line: 9, baseType: !90, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !85)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !81, file: !80, line: 9, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !81, file: !80, line: 9, baseType: !92, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !81, file: !80, line: 9, baseType: !95, size: 128, offset: 320)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !81, file: !80, line: 9, baseType: !99, size: 64, offset: 448)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !81, file: !80, line: 9, baseType: !101, size: 64, offset: 512)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 64, elements: !96)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !81, file: !80, line: 9, baseType: !99, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !81, file: !80, line: 9, baseType: !105, size: 128, offset: 640)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, elements: !96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !55, line: 41, size: 576, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !108, file: !55, line: 42, baseType: !92, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !108, file: !55, line: 43, baseType: !90, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !108, file: !55, line: 44, baseType: !92, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !108, file: !55, line: 45, baseType: !92, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !108, file: !55, line: 46, baseType: !92, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !108, file: !55, line: 46, baseType: !92, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !108, file: !55, line: 46, baseType: !92, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !108, file: !55, line: 47, baseType: !92, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !108, file: !55, line: 47, baseType: !92, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !81, file: !80, line: 9, baseType: !105, size: 128, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !81, file: !80, line: 9, baseType: !101, size: 64, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !81, file: !80, line: 9, baseType: !90, size: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !81, file: !80, line: 9, baseType: !123, size: 64, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !124, line: 6, baseType: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !55, line: 52, size: 6592, elements: !127)
!127 = !{!128, !140, !529, !530, !531, !532, !536, !537, !541, !542, !543, !547, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !567, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !607, !608, !610, !611, !612, !613, !620, !621, !623, !624, !625, !626}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !126, file: !55, line: 53, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !123, !133, !134, !133, !135, !137}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !85)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 46, baseType: !139)
!138 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!139 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !126, file: !55, line: 54, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!132, !144, !123, !528}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !145, line: 15, baseType: !146)
!145 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !148)
!148 = !{!149, !347, !443, !458, !459, !460, !461, !462, !463, !464, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !489, !490, !491, !492, !493, !495, !496, !521, !522, !523, !524, !525, !527}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !147, file: !44, line: 67, baseType: !150, size: 4480)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !151, line: 122, baseType: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !151, line: 73, size: 4480, elements: !153)
!153 = !{!154, !156, !210, !211, !212, !215, !216, !217, !218, !226, !227, !228, !232, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !249, !250, !251, !253, !254, !255, !257, !258, !259, !260, !261, !264, !266, !267, !268, !269, !270, !273, !275, !276, !277, !285, !286, !287, !291, !292, !337, !342, !344, !345, !346}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !152, file: !151, line: 74, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !85)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !152, file: !151, line: 75, baseType: !157, size: 448, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 448, elements: !208)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !151, line: 53, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 45, size: 448, elements: !160)
!160 = !{!161, !172, !180, !185, !192, !196, !203}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !159, file: !151, line: 46, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!132, !165, !167}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !169, line: 330, baseType: !170)
!169 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !169, line: 330, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !159, file: !151, line: 47, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!132, !165, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !177, line: 16, baseType: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !177, line: 16, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !159, file: !151, line: 48, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!132, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !159, file: !151, line: 49, baseType: !186, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!132, !165, !189, !165}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !159, file: !151, line: 50, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!132, !165, !189, !184}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !159, file: !151, line: 51, baseType: !197, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!132, !165, !189, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !159, file: !151, line: 52, baseType: !204, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!132, !165, !189, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !152, file: !151, line: 76, baseType: !168, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !151, line: 77, baseType: !90, size: 32, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !152, file: !151, line: 78, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !214)
!214 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !152, file: !151, line: 78, baseType: !213, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !152, file: !151, line: 78, baseType: !213, size: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !152, file: !151, line: 78, baseType: !213, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !151, line: 79, baseType: !219, size: 64, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !222, line: 27, baseType: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !224, line: 43, baseType: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!225 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !152, file: !151, line: 80, baseType: !90, size: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !152, file: !151, line: 81, baseType: !84, size: 32, offset: 992)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !152, file: !151, line: 82, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !152, file: !151, line: 83, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !152, file: !151, line: 84, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !152, file: !151, line: 85, baseType: !237, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !152, file: !151, line: 86, baseType: !237, size: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !152, file: !151, line: 87, baseType: !237, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !151, line: 88, baseType: !165, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !152, file: !151, line: 89, baseType: !219, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !151, line: 90, baseType: !237, size: 64, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !152, file: !151, line: 91, baseType: !237, size: 64, offset: 1600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !152, file: !151, line: 92, baseType: !90, size: 32, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !152, file: !151, line: 93, baseType: !134, size: 64, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !152, file: !151, line: 94, baseType: !248, size: 64, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !220)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !152, file: !151, line: 95, baseType: !90, size: 32, offset: 1856)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !152, file: !151, line: 95, baseType: !90, size: 32, offset: 1888)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !152, file: !151, line: 96, baseType: !252, size: 64, offset: 1920)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !152, file: !151, line: 96, baseType: !252, size: 64, offset: 1984)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !152, file: !151, line: 97, baseType: !92, size: 64, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !152, file: !151, line: 97, baseType: !256, size: 64, offset: 2112)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !152, file: !151, line: 98, baseType: !90, size: 32, offset: 2176)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !152, file: !151, line: 98, baseType: !90, size: 32, offset: 2208)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !152, file: !151, line: 99, baseType: !252, size: 64, offset: 2240)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !152, file: !151, line: 99, baseType: !252, size: 64, offset: 2304)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !152, file: !151, line: 100, baseType: !262, size: 64, offset: 2368)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !214)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !152, file: !151, line: 100, baseType: !265, size: 64, offset: 2432)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !152, file: !151, line: 101, baseType: !90, size: 32, offset: 2496)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !152, file: !151, line: 101, baseType: !90, size: 32, offset: 2528)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !152, file: !151, line: 102, baseType: !252, size: 64, offset: 2560)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !152, file: !151, line: 102, baseType: !252, size: 64, offset: 2624)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !152, file: !151, line: 103, baseType: !271, size: 64, offset: 2688)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !263)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !152, file: !151, line: 103, baseType: !274, size: 64, offset: 2752)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !152, file: !151, line: 104, baseType: !207, size: 64, offset: 2816)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !152, file: !151, line: 105, baseType: !90, size: 32, offset: 2880)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !152, file: !151, line: 106, baseType: !278, size: 128, offset: 2944)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !96)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !151, line: 64, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 61, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !281, file: !151, line: 62, baseType: !200, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !281, file: !151, line: 63, baseType: !134, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !152, file: !151, line: 107, baseType: !99, size: 64, offset: 3072)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !152, file: !151, line: 108, baseType: !134, size: 64, offset: 3136)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !152, file: !151, line: 109, baseType: !288, size: 64, offset: 3200)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!132, !134}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !152, file: !151, line: 111, baseType: !90, size: 32, offset: 3264)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !152, file: !151, line: 112, baseType: !293, size: 320, offset: 3328)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !335)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!132, !297, !165, !134}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !300)
!300 = !{!301, !302, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !299, file: !10, line: 100, baseType: !90, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !10, line: 101, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !314, !315, !316, !317, !318, !320, !321, !322}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !305, file: !10, line: 84, baseType: !237, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !305, file: !10, line: 85, baseType: !237, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !10, line: 86, baseType: !134, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !305, file: !10, line: 87, baseType: !229, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !305, file: !10, line: 88, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !305, file: !10, line: 89, baseType: !191, size: 8, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !305, file: !10, line: 90, baseType: !237, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !305, file: !10, line: 91, baseType: !137, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !10, line: 92, baseType: !102, size: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !10, line: 93, baseType: !319, size: 32, offset: 544)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !10, line: 94, baseType: !303, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !305, file: !10, line: 95, baseType: !237, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !305, file: !10, line: 96, baseType: !134, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !299, file: !10, line: 102, baseType: !237, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !299, file: !10, line: 102, baseType: !237, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !299, file: !10, line: 103, baseType: !237, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !299, file: !10, line: 104, baseType: !168, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !299, file: !10, line: 105, baseType: !102, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !299, file: !10, line: 105, baseType: !102, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !299, file: !10, line: 105, baseType: !102, size: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !299, file: !10, line: 106, baseType: !165, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !299, file: !10, line: 107, baseType: !332, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!335 = !{!336}
!336 = !DISubrange(count: 5)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !152, file: !151, line: 113, baseType: !338, size: 320, offset: 3648)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !335)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!132, !165, !134}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !152, file: !151, line: 114, baseType: !343, size: 320, offset: 3968)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 320, elements: !335)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !152, file: !151, line: 115, baseType: !102, size: 32, offset: 4288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !152, file: !151, line: 120, baseType: !332, size: 64, offset: 4352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !152, file: !151, line: 121, baseType: !102, size: 32, offset: 4416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !147, file: !44, line: 67, baseType: !348, size: 1344, offset: 4480)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1344, elements: !208)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !350)
!350 = !{!351, !355, !356, !357, !361, !365, !370, !380, !384, !385, !386, !390, !394, !398, !408, !412, !417, !429, !433, !434, !439}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !349, file: !44, line: 40, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!132, !144}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !349, file: !44, line: 41, baseType: !352, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !349, file: !44, line: 42, baseType: !352, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !349, file: !44, line: 43, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!132, !297, !144}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !349, file: !44, line: 44, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!132, !144, !176}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !349, file: !44, line: 45, baseType: !366, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!132, !144, !369, !144}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !349, file: !44, line: 46, baseType: !371, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!132, !144, !374, !133, !135, !133, !134, !377}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !169, line: 331, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !169, line: 331, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !169, line: 338, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !169, line: 338, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !349, file: !44, line: 47, baseType: !381, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!132, !144, !374, !135, !134, !377}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !349, file: !44, line: 48, baseType: !371, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !349, file: !44, line: 49, baseType: !381, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !349, file: !44, line: 50, baseType: !387, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!132, !144, !374, !133, !134, !133, !135, !134, !377}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !349, file: !44, line: 51, baseType: !391, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!132, !144, !374, !134, !135, !134, !377}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !349, file: !44, line: 52, baseType: !395, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!132, !144, !374, !133, !135, !133, !134}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !349, file: !44, line: 53, baseType: !399, size: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!132, !144, !92, !402, !405, !405, !405}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !349, file: !44, line: 54, baseType: !409, size: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!132, !144, !92, !402, !405, !405}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !349, file: !44, line: 55, baseType: !413, size: 64, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!132, !144, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !349, file: !44, line: 56, baseType: !418, size: 64, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!132, !144, !92, !92, !405, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !145, line: 49, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 46, size: 64, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !425, file: !145, line: 47, baseType: !90, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !425, file: !145, line: 48, baseType: !90, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !349, file: !44, line: 57, baseType: !430, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!132, !144, !90, !406, !416}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !349, file: !44, line: 58, baseType: !430, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !349, file: !44, line: 60, baseType: !435, size: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!132, !133, !137, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !349, file: !44, line: 61, baseType: !440, size: 64, offset: 1280)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!132, !133, !134}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !147, file: !44, line: 78, baseType: !444, size: 512, offset: 5824)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !44, line: 68, size: 512, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !453, !454, !455, !456, !457}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !444, file: !44, line: 69, baseType: !90, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !444, file: !44, line: 69, baseType: !90, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !444, file: !44, line: 70, baseType: !102, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !444, file: !44, line: 71, baseType: !102, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !444, file: !44, line: 72, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !444, file: !44, line: 73, baseType: !271, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !444, file: !44, line: 74, baseType: !144, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !444, file: !44, line: 75, baseType: !90, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !444, file: !44, line: 76, baseType: !374, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !444, file: !44, line: 77, baseType: !102, size: 32, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !147, file: !44, line: 81, baseType: !90, size: 32, offset: 6336)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !147, file: !44, line: 82, baseType: !90, size: 32, offset: 6368)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !147, file: !44, line: 83, baseType: !92, size: 64, offset: 6400)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !147, file: !44, line: 84, baseType: !92, size: 64, offset: 6464)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !147, file: !44, line: 85, baseType: !90, size: 32, offset: 6528)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !147, file: !44, line: 85, baseType: !90, size: 32, offset: 6560)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !147, file: !44, line: 86, baseType: !465, size: 64, offset: 6592)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !147, file: !44, line: 87, baseType: !465, size: 64, offset: 6656)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !147, file: !44, line: 88, baseType: !90, size: 32, offset: 6720)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !147, file: !44, line: 89, baseType: !90, size: 32, offset: 6752)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !147, file: !44, line: 90, baseType: !88, size: 64, offset: 6784)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !147, file: !44, line: 91, baseType: !92, size: 64, offset: 6848)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !147, file: !44, line: 92, baseType: !92, size: 64, offset: 6912)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !147, file: !44, line: 93, baseType: !95, size: 128, offset: 6976)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !147, file: !44, line: 96, baseType: !99, size: 64, offset: 7104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !147, file: !44, line: 97, baseType: !101, size: 64, offset: 7168)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !147, file: !44, line: 98, baseType: !99, size: 64, offset: 7232)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !147, file: !44, line: 99, baseType: !105, size: 128, offset: 7296)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !147, file: !44, line: 100, baseType: !105, size: 128, offset: 7424)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !147, file: !44, line: 101, baseType: !101, size: 64, offset: 7552)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !147, file: !44, line: 103, baseType: !90, size: 32, offset: 7616)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !147, file: !44, line: 104, baseType: !92, size: 64, offset: 7680)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !147, file: !44, line: 105, baseType: !102, size: 32, offset: 7744)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !147, file: !44, line: 106, baseType: !92, size: 64, offset: 7808)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !147, file: !44, line: 107, baseType: !92, size: 64, offset: 7872)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !147, file: !44, line: 108, baseType: !102, size: 32, offset: 7936)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !147, file: !44, line: 109, baseType: !486, size: 64, offset: 8000)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !169, line: 336, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !169, line: 336, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !147, file: !44, line: 110, baseType: !486, size: 64, offset: 8064)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !147, file: !44, line: 111, baseType: !144, size: 64, offset: 8128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !147, file: !44, line: 112, baseType: !102, size: 32, offset: 8192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !147, file: !44, line: 113, baseType: !102, size: 32, offset: 8224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !147, file: !44, line: 114, baseType: !494, size: 32, offset: 8256)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !147, file: !44, line: 115, baseType: !102, size: 32, offset: 8288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !147, file: !44, line: 116, baseType: !497, size: 64, offset: 8320)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !498, line: 60, baseType: !499)
!498 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !501, line: 240, size: 640, elements: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !517, !518, !519, !520}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !500, file: !501, line: 241, baseType: !168, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !501, line: 242, baseType: !84, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !500, file: !501, line: 243, baseType: !90, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !500, file: !501, line: 243, baseType: !90, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !500, file: !501, line: 244, baseType: !90, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !500, file: !501, line: 244, baseType: !90, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !500, file: !501, line: 245, baseType: !92, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !500, file: !501, line: 246, baseType: !102, size: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !500, file: !501, line: 247, baseType: !90, size: 32, offset: 352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !500, file: !501, line: 251, baseType: !90, size: 32, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !500, file: !501, line: 252, baseType: !514, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !498, line: 30, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !498, line: 30, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !500, file: !501, line: 253, baseType: !102, size: 32, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !500, file: !501, line: 254, baseType: !90, size: 32, offset: 544)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !500, file: !501, line: 254, baseType: !90, size: 32, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !500, file: !501, line: 255, baseType: !90, size: 32, offset: 608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !147, file: !44, line: 117, baseType: !102, size: 32, offset: 8384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !147, file: !44, line: 118, baseType: !102, size: 32, offset: 8416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !147, file: !44, line: 119, baseType: !102, size: 32, offset: 8448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !147, file: !44, line: 120, baseType: !90, size: 32, offset: 8480)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !147, file: !44, line: 121, baseType: !526, size: 32, offset: 8512)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !44, line: 122, baseType: !134, size: 64, offset: 8576)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !50)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !126, file: !55, line: 55, baseType: !141, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !126, file: !55, line: 56, baseType: !141, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !126, file: !55, line: 57, baseType: !141, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !126, file: !55, line: 58, baseType: !533, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!132, !123}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !126, file: !55, line: 59, baseType: !533, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !126, file: !55, line: 60, baseType: !538, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!132, !144, !123}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !126, file: !55, line: 62, baseType: !141, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !126, file: !55, line: 63, baseType: !141, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !126, file: !55, line: 65, baseType: !544, size: 64, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!132, !123, !90, !90, !106, !406, !135, !134}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !126, file: !55, line: 66, baseType: !548, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!132, !123, !90, !90, !106, !406, !134, !135}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !126, file: !55, line: 67, baseType: !548, size: 64, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !126, file: !55, line: 68, baseType: !548, size: 64, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !126, file: !55, line: 69, baseType: !548, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !126, file: !55, line: 70, baseType: !548, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !126, file: !55, line: 71, baseType: !548, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !126, file: !55, line: 72, baseType: !548, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !126, file: !55, line: 73, baseType: !548, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !126, file: !55, line: 74, baseType: !548, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !126, file: !55, line: 75, baseType: !548, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !126, file: !55, line: 76, baseType: !548, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !126, file: !55, line: 77, baseType: !548, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !126, file: !55, line: 78, baseType: !548, size: 64, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !126, file: !55, line: 79, baseType: !564, size: 64, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!132, !123, !90, !90, !106, !406, !134, !134}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !126, file: !55, line: 81, baseType: !568, size: 64, offset: 1600)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!132, !123, !90, !90, !106, !406, !135, !90, !106, !406, !134}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !126, file: !55, line: 82, baseType: !568, size: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !126, file: !55, line: 83, baseType: !568, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !126, file: !55, line: 84, baseType: !568, size: 64, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !126, file: !55, line: 85, baseType: !568, size: 64, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !126, file: !55, line: 86, baseType: !568, size: 64, offset: 1920)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !126, file: !55, line: 87, baseType: !568, size: 64, offset: 1984)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !126, file: !55, line: 88, baseType: !568, size: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !126, file: !55, line: 89, baseType: !568, size: 64, offset: 2112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !126, file: !55, line: 90, baseType: !568, size: 64, offset: 2176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !126, file: !55, line: 91, baseType: !568, size: 64, offset: 2240)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !126, file: !55, line: 92, baseType: !568, size: 64, offset: 2304)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !126, file: !55, line: 93, baseType: !568, size: 64, offset: 2368)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !126, file: !55, line: 95, baseType: !584, size: 64, offset: 2432)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!132, !123, !90, !90, !106, !406, !134, !90, !106, !406, !135, !134}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !126, file: !55, line: 97, baseType: !102, size: 32, offset: 2496)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !126, file: !55, line: 168, baseType: !84, size: 32, offset: 2528)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !126, file: !55, line: 169, baseType: !374, size: 64, offset: 2560)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !126, file: !55, line: 170, baseType: !374, size: 64, offset: 2624)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !126, file: !55, line: 171, baseType: !102, size: 32, offset: 2688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !126, file: !55, line: 172, baseType: !137, size: 64, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !126, file: !55, line: 173, baseType: !90, size: 32, offset: 2816)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !126, file: !55, line: 174, baseType: !135, size: 64, offset: 2880)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !126, file: !55, line: 174, baseType: !135, size: 64, offset: 2944)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !126, file: !55, line: 175, baseType: !133, size: 32, offset: 3008)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !126, file: !55, line: 175, baseType: !133, size: 32, offset: 3040)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !126, file: !55, line: 178, baseType: !133, size: 32, offset: 3072)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !126, file: !55, line: 178, baseType: !133, size: 32, offset: 3104)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !126, file: !55, line: 179, baseType: !101, size: 64, offset: 3136)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !126, file: !55, line: 179, baseType: !101, size: 64, offset: 3200)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !126, file: !55, line: 180, baseType: !90, size: 32, offset: 3264)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !126, file: !55, line: 180, baseType: !90, size: 32, offset: 3296)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !126, file: !55, line: 181, baseType: !605, size: 256, offset: 3328)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 256, elements: !606)
!606 = !{!97, !97}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !126, file: !55, line: 182, baseType: !605, size: 256, offset: 3584)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !126, file: !55, line: 183, baseType: !609, size: 256, offset: 3840)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 256, elements: !606)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !126, file: !55, line: 185, baseType: !609, size: 256, offset: 4096)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !126, file: !55, line: 186, baseType: !609, size: 256, offset: 4352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !126, file: !55, line: 187, baseType: !609, size: 256, offset: 4608)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !126, file: !55, line: 188, baseType: !614, size: 512, offset: 4864)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 512, elements: !619)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !169, line: 339, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !169, line: 339, flags: DIFlagFwdDecl)
!619 = !{!97, !97, !97}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !126, file: !55, line: 189, baseType: !614, size: 512, offset: 5376)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !126, file: !55, line: 190, baseType: !622, size: 256, offset: 5888)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !619)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !126, file: !55, line: 191, baseType: !622, size: 256, offset: 6144)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !126, file: !55, line: 192, baseType: !615, size: 64, offset: 6400)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !55, line: 193, baseType: !123, size: 64, offset: 6464)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !126, file: !55, line: 195, baseType: !102, size: 32, offset: 6528)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !81, file: !80, line: 9, baseType: !123, size: 64, offset: 1088)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "displs", scope: !81, file: !80, line: 10, baseType: !88, size: 64, offset: 1152)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "recvcounts", scope: !81, file: !80, line: 10, baseType: !88, size: 64, offset: 1216)
!630 = !{i32 7, !"Dwarf Version", i32 4}
!631 = !{i32 2, !"Debug Info Version", i32 3}
!632 = !{i32 1, !"wchar_size", i32 4}
!633 = !{i32 7, !"PIC Level", i32 2}
!634 = !{i32 7, !"uwtable", i32 1}
!635 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!636 = distinct !DISubprogram(name: "PetscSFSetUp_Allgather", scope: !78, file: !78, line: 8, type: !353, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !637)
!637 = !{!638, !639, !640}
!638 = !DILocalVariable(name: "sf", arg: 1, scope: !636, file: !78, line: 8, type: !144)
!639 = !DILocalVariable(name: "i", scope: !636, file: !78, line: 10, type: !90)
!640 = !DILocalVariable(name: "dat", scope: !636, file: !78, line: 11, type: !76)
!641 = !DILocation(line: 0, scope: !636)
!642 = !DILocation(line: 11, column: 56, scope: !636)
!643 = !{!644, !649, i64 1072}
!644 = !{!"_p_PetscSF", !645, i64 0, !647, i64 560, !652, i64 728, !646, i64 792, !646, i64 796, !649, i64 800, !649, i64 808, !646, i64 816, !646, i64 820, !649, i64 824, !649, i64 832, !646, i64 840, !646, i64 844, !649, i64 848, !649, i64 856, !649, i64 864, !647, i64 872, !647, i64 888, !647, i64 896, !647, i64 904, !647, i64 912, !647, i64 928, !647, i64 944, !646, i64 952, !649, i64 960, !647, i64 968, !649, i64 976, !649, i64 984, !647, i64 992, !649, i64 1000, !649, i64 1008, !649, i64 1016, !647, i64 1024, !647, i64 1028, !647, i64 1032, !647, i64 1036, !649, i64 1040, !647, i64 1048, !647, i64 1052, !647, i64 1056, !646, i64 1060, !647, i64 1064, !649, i64 1072}
!645 = !{!"_p_PetscObject", !646, i64 0, !647, i64 8, !649, i64 64, !646, i64 72, !650, i64 80, !650, i64 88, !650, i64 96, !650, i64 104, !651, i64 112, !646, i64 120, !646, i64 124, !649, i64 128, !649, i64 136, !649, i64 144, !649, i64 152, !649, i64 160, !649, i64 168, !649, i64 176, !651, i64 184, !649, i64 192, !649, i64 200, !646, i64 208, !649, i64 216, !651, i64 224, !646, i64 232, !646, i64 236, !649, i64 240, !649, i64 248, !649, i64 256, !649, i64 264, !646, i64 272, !646, i64 276, !649, i64 280, !649, i64 288, !649, i64 296, !649, i64 304, !646, i64 312, !646, i64 316, !649, i64 320, !649, i64 328, !649, i64 336, !649, i64 344, !649, i64 352, !646, i64 360, !647, i64 368, !647, i64 384, !649, i64 392, !649, i64 400, !646, i64 408, !647, i64 416, !647, i64 456, !647, i64 496, !647, i64 536, !649, i64 544, !647, i64 552}
!646 = !{!"int", !647, i64 0}
!647 = !{!"omnipotent char", !648, i64 0}
!648 = !{!"Simple C/C++ TBAA"}
!649 = !{!"any pointer", !647, i64 0}
!650 = !{!"double", !647, i64 0}
!651 = !{!"long", !647, i64 0}
!652 = !{!"", !646, i64 0, !646, i64 4, !647, i64 8, !647, i64 12, !649, i64 16, !649, i64 24, !649, i64 32, !646, i64 40, !649, i64 48, !647, i64 56}
!653 = !DILocation(line: 13, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !78, line: 13, column: 3)
!655 = distinct !DILexicalBlock(scope: !656, file: !78, line: 13, column: 3)
!656 = distinct !DILexicalBlock(scope: !636, file: !78, line: 13, column: 3)
!657 = !{!649, !649, i64 0}
!658 = !DILocation(line: 13, column: 3, scope: !655)
!659 = !DILocation(line: 13, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !661, file: !78, line: 13, column: 3)
!661 = distinct !DILexicalBlock(scope: !654, file: !78, line: 13, column: 3)
!662 = !{!663, !646, i64 1536}
!663 = !{!"", !647, i64 0, !647, i64 512, !647, i64 1024, !647, i64 1280, !646, i64 1536, !646, i64 1540, !647, i64 1544}
!664 = !DILocation(line: 13, column: 3, scope: !661)
!665 = !DILocation(line: 13, column: 3, scope: !666)
!666 = distinct !DILexicalBlock(scope: !660, file: !78, line: 13, column: 3)
!667 = !{!646, !646, i64 0}
!668 = !{!663, !646, i64 1540}
!669 = !DILocation(line: 30, column: 3, scope: !670)
