; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/ximage.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/ximage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !48, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/ximage.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !36, !42}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 204, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 141, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 663, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!48 = !{!49, !137, !80, !155, !234, !60, !342, !176, !85, !309, !130}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_X", file: !51, line: 43, baseType: !52)
!51 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/x/ximpl.h", directory: "/home/users/ndemeye/xSDK")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 27, size: 23488, elements: !53)
!53 = !{!54, !59, !61, !92, !93, !103, !115, !117, !119, !121, !122, !123, !124, !128, !133, !134, !135, !136}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !52, file: !51, line: 28, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !57, line: 487, baseType: !58)
!57 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !57, line: 255, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !52, file: !51, line: 29, baseType: !60, size: 32, offset: 64)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !52, file: !51, line: 30, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !57, line: 238, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 227, size: 448, elements: !65)
!65 = !{!66, !82, !86, !87, !88, !89, !90, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !64, file: !57, line: 228, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !57, line: 155, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !57, line: 148, size: 256, elements: !70)
!70 = !{!71, !72, !74, !78}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !69, file: !57, line: 149, baseType: !60, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !57, line: 150, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !69, file: !57, line: 151, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!60, !73}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !69, file: !57, line: 154, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !57, line: 80, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !64, file: !57, line: 229, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !84, line: 76, baseType: !85)
!84 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!85 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !64, file: !57, line: 233, baseType: !60, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !64, file: !57, line: 235, baseType: !85, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !64, file: !57, line: 235, baseType: !85, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !64, file: !57, line: 235, baseType: !85, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !64, file: !57, line: 236, baseType: !60, size: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !64, file: !57, line: 237, baseType: !60, size: 32, offset: 416)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !52, file: !51, line: 31, baseType: !60, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !52, file: !51, line: 32, baseType: !94, size: 128, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiGC", file: !51, line: 18, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 15, size: 128, elements: !96)
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !95, file: !51, line: 16, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !57, line: 222, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !57, line: 214, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pix", scope: !95, file: !51, line: 17, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiPixVal", file: !51, line: 13, baseType: !85)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !52, file: !51, line: 33, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiFont", file: !51, line: 25, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 20, size: 256, elements: !107)
!107 = !{!108, !111, !112, !113, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fnt", scope: !106, file: !51, line: 21, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Font", file: !84, line: 100, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !84, line: 66, baseType: !85)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "font_w", scope: !106, file: !51, line: 22, baseType: !60, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "font_h", scope: !106, file: !51, line: 22, baseType: !60, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "font_descent", scope: !106, file: !51, line: 23, baseType: !60, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "font_pix", scope: !106, file: !51, line: 24, baseType: !102, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !52, file: !51, line: 34, baseType: !116, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !84, line: 96, baseType: !110)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "drw", scope: !52, file: !51, line: 35, baseType: !118, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !84, line: 97, baseType: !110)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !52, file: !51, line: 36, baseType: !120, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !84, line: 104, baseType: !110)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cmapsize", scope: !52, file: !51, line: 37, baseType: !60, size: 32, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !52, file: !51, line: 38, baseType: !102, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !52, file: !51, line: 39, baseType: !102, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cmapping", scope: !52, file: !51, line: 40, baseType: !125, size: 16384, offset: 832)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 16384, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cpalette", scope: !52, file: !51, line: 41, baseType: !129, size: 6144, offset: 17216)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 6144, elements: !131)
!130 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !{!127, !132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !51, line: 42, baseType: !60, size: 32, offset: 23360)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !51, line: 42, baseType: !60, size: 32, offset: 23392)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !52, file: !51, line: 42, baseType: !60, size: 32, offset: 23424)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !52, file: !51, line: 42, baseType: !60, size: 32, offset: 23456)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !140, line: 73, size: 4480, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !144, !196, !197, !199, !202, !203, !204, !205, !213, !214, !216, !220, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !235, !237, !238, !239, !241, !242, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !258, !259, !262, !264, !265, !266, !276, !278, !279, !283, !284, !332, !337, !339, !340, !341}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !139, file: !140, line: 74, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !60)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !139, file: !140, line: 75, baseType: !145, size: 448, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 448, elements: !194)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !140, line: 53, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 45, size: 448, elements: !148)
!148 = !{!149, !159, !167, !172, !178, !182, !189}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !147, file: !140, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !60)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !156, line: 330, baseType: !157)
!156 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !156, line: 330, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !147, file: !140, line: 47, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!153, !137, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !164, line: 16, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !164, line: 16, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !140, line: 48, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!153, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !147, file: !140, line: 49, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!153, !137, !176, !137}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !147, file: !140, line: 50, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!153, !137, !176, !171}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !147, file: !140, line: 51, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!153, !137, !176, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !147, file: !140, line: 52, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!153, !137, !176, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !139, file: !140, line: 76, baseType: !155, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !140, line: 77, baseType: !198, size: 32, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !60)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !139, file: !140, line: 78, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !201)
!201 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !139, file: !140, line: 78, baseType: !200, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !139, file: !140, line: 78, baseType: !200, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !139, file: !140, line: 78, baseType: !200, size: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 79, baseType: !206, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !209, line: 27, baseType: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !211, line: 43, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!212 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !139, file: !140, line: 80, baseType: !198, size: 32, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !140, line: 81, baseType: !215, size: 32, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !60)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !139, file: !140, line: 82, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !139, file: !140, line: 83, baseType: !221, size: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !140, line: 84, baseType: !80, size: 64, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !140, line: 85, baseType: !80, size: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !139, file: !140, line: 86, baseType: !80, size: 64, offset: 1280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !139, file: !140, line: 87, baseType: !80, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 88, baseType: !137, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !139, file: !140, line: 89, baseType: !206, size: 64, offset: 1472)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 90, baseType: !80, size: 64, offset: 1536)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !139, file: !140, line: 91, baseType: !80, size: 64, offset: 1600)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !139, file: !140, line: 92, baseType: !198, size: 32, offset: 1664)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !139, file: !140, line: 93, baseType: !234, size: 64, offset: 1728)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 94, baseType: !236, size: 64, offset: 1792)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !207)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !139, file: !140, line: 95, baseType: !198, size: 32, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !139, file: !140, line: 95, baseType: !198, size: 32, offset: 1888)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !139, file: !140, line: 96, baseType: !240, size: 64, offset: 1920)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !139, file: !140, line: 96, baseType: !240, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !139, file: !140, line: 97, baseType: !243, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !139, file: !140, line: 97, baseType: !245, size: 64, offset: 2112)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !139, file: !140, line: 98, baseType: !198, size: 32, offset: 2176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !139, file: !140, line: 98, baseType: !198, size: 32, offset: 2208)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !139, file: !140, line: 99, baseType: !240, size: 64, offset: 2240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !139, file: !140, line: 99, baseType: !240, size: 64, offset: 2304)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !139, file: !140, line: 100, baseType: !251, size: 64, offset: 2368)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !201)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !139, file: !140, line: 100, baseType: !254, size: 64, offset: 2432)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !139, file: !140, line: 101, baseType: !198, size: 32, offset: 2496)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !139, file: !140, line: 101, baseType: !198, size: 32, offset: 2528)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !139, file: !140, line: 102, baseType: !240, size: 64, offset: 2560)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !139, file: !140, line: 102, baseType: !240, size: 64, offset: 2624)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !139, file: !140, line: 103, baseType: !260, size: 64, offset: 2688)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !252)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !139, file: !140, line: 103, baseType: !263, size: 64, offset: 2752)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !139, file: !140, line: 104, baseType: !193, size: 64, offset: 2816)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !139, file: !140, line: 105, baseType: !198, size: 32, offset: 2880)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !139, file: !140, line: 106, baseType: !267, size: 128, offset: 2944)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !274)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !140, line: 64, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 61, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !270, file: !140, line: 62, baseType: !186, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !270, file: !140, line: 63, baseType: !234, size: 64, offset: 64)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !139, file: !140, line: 107, baseType: !277, size: 64, offset: 3072)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !139, file: !140, line: 108, baseType: !234, size: 64, offset: 3136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !139, file: !140, line: 109, baseType: !280, size: 64, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!153, !234}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !139, file: !140, line: 111, baseType: !198, size: 32, offset: 3264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !139, file: !140, line: 112, baseType: !285, size: 320, offset: 3328)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !330)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!153, !289, !137, !234}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !292)
!292 = !{!293, !294, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !291, file: !10, line: 100, baseType: !198, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !10, line: 101, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !306, !307, !308, !311, !313, !315, !316, !317}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !297, file: !10, line: 84, baseType: !80, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !297, file: !10, line: 85, baseType: !80, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !10, line: 86, baseType: !234, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !297, file: !10, line: 87, baseType: !217, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !10, line: 88, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !297, file: !10, line: 89, baseType: !81, size: 8, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !297, file: !10, line: 90, baseType: !80, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !297, file: !10, line: 91, baseType: !309, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 46, baseType: !85)
!310 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !297, file: !10, line: 92, baseType: !312, size: 32, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !10, line: 93, baseType: !314, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 94, baseType: !295, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !297, file: !10, line: 95, baseType: !80, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !297, file: !10, line: 96, baseType: !234, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !10, line: 102, baseType: !80, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !291, file: !10, line: 102, baseType: !80, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !291, file: !10, line: 103, baseType: !80, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !291, file: !10, line: 104, baseType: !155, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !291, file: !10, line: 105, baseType: !312, size: 32, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !291, file: !10, line: 105, baseType: !312, size: 32, offset: 416)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !291, file: !10, line: 105, baseType: !312, size: 32, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !291, file: !10, line: 106, baseType: !137, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !291, file: !10, line: 107, baseType: !327, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!330 = !{!331}
!331 = !DISubrange(count: 5)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !139, file: !140, line: 113, baseType: !333, size: 320, offset: 3648)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !330)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!153, !137, !234}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !139, file: !140, line: 114, baseType: !338, size: 320, offset: 3968)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !330)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !139, file: !140, line: 115, baseType: !312, size: 32, offset: 4288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 120, baseType: !327, size: 64, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !139, file: !140, line: 121, baseType: !312, size: 32, offset: 4416)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !156, line: 338, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !156, line: 338, flags: DIFlagFwdDecl)
!345 = !{i32 7, !"Dwarf Version", i32 4}
!346 = !{i32 2, !"Debug Info Version", i32 3}
!347 = !{i32 1, !"wchar_size", i32 4}
!348 = !{i32 7, !"PIC Level", i32 2}
!349 = !{i32 7, !"uwtable", i32 1}
!350 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!351 = distinct !DISubprogram(name: "PetscDrawGetImage_X", scope: !352, file: !352, line: 53, type: !353, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !512)
!352 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/ximage.c", directory: "/home/users/ndemeye/xSDK")
!353 = !DISubroutineType(types: !354)
!354 = !{!153, !355, !506, !509, !509, !510}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !356, line: 25, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !359, line: 53, size: 11072, elements: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!360 = !{!361, !363, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !482, !483, !484, !485, !486, !487, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !358, file: !359, line: 54, baseType: !362, size: 4480)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !140, line: 122, baseType: !139)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !358, file: !359, line: 54, baseType: !364, size: 2304, offset: 4480)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 2304, elements: !194)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !359, line: 14, size: 2304, elements: !366)
!366 = !{!367, !371, !372, !376, !380, !384, !388, !389, !393, !394, !398, !402, !406, !407, !411, !415, !416, !422, !423, !424, !425, !430, !434, !435, !439, !440, !444, !445, !446, !447, !449, !450, !451, !456, !460, !464}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !365, file: !359, line: 15, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!153, !355}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !365, file: !359, line: 16, baseType: !368, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !365, file: !359, line: 17, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!153, !355, !252, !252, !252, !252, !60}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !365, file: !359, line: 18, baseType: !377, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!153, !355, !252}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !365, file: !359, line: 19, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!153, !355, !251}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !365, file: !359, line: 20, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!153, !355, !252, !252, !60}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !365, file: !359, line: 21, baseType: !377, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !365, file: !359, line: 22, baseType: !390, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!153, !355, !252, !252, !60, !176}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !365, file: !359, line: 23, baseType: !390, size: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !365, file: !359, line: 24, baseType: !395, size: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!153, !355, !252, !252}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !365, file: !359, line: 25, baseType: !399, size: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!153, !355, !251, !251}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !365, file: !359, line: 26, baseType: !403, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!153, !355, !252, !252, !252, !252}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !365, file: !359, line: 27, baseType: !368, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !365, file: !359, line: 28, baseType: !408, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!153, !355, !252, !252, !252, !252, !60, !60, !60, !60}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !365, file: !359, line: 29, baseType: !412, size: 64, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!153, !355, !252, !252, !252, !252, !252, !252, !60, !60, !60}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !365, file: !359, line: 30, baseType: !373, size: 64, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !365, file: !359, line: 31, baseType: !417, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!153, !355, !420, !251, !251, !251, !251}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !25, line: 207, baseType: !24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !365, file: !359, line: 32, baseType: !368, size: 64, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !365, file: !359, line: 33, baseType: !368, size: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !365, file: !359, line: 34, baseType: !368, size: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !365, file: !359, line: 35, baseType: !426, size: 64, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!153, !355, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !365, file: !359, line: 36, baseType: !431, size: 64, offset: 1344)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!153, !355, !176}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !365, file: !359, line: 37, baseType: !368, size: 64, offset: 1408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !365, file: !359, line: 38, baseType: !436, size: 64, offset: 1472)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!153, !355, !60, !60}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !365, file: !359, line: 39, baseType: !368, size: 64, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !365, file: !359, line: 40, baseType: !441, size: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!153, !355, !163}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !365, file: !359, line: 41, baseType: !426, size: 64, offset: 1664)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !365, file: !359, line: 42, baseType: !426, size: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !365, file: !359, line: 43, baseType: !368, size: 64, offset: 1792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !365, file: !359, line: 44, baseType: !448, size: 64, offset: 1856)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !365, file: !359, line: 45, baseType: !403, size: 64, offset: 1920)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !365, file: !359, line: 46, baseType: !373, size: 64, offset: 1984)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !365, file: !359, line: 47, baseType: !452, size: 64, offset: 2048)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!153, !355, !252, !252, !455, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !365, file: !359, line: 48, baseType: !457, size: 64, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!153, !355, !60, !60, !251, !251}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !365, file: !359, line: 49, baseType: !461, size: 64, offset: 2176)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!153, !355, !60, !60, !60}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !365, file: !359, line: 50, baseType: !465, size: 64, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!153, !355, !252, !252, !60, !60, !176, !251, !251}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !358, file: !359, line: 55, baseType: !252, size: 64, offset: 6784)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !358, file: !359, line: 56, baseType: !252, size: 64, offset: 6848)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !358, file: !359, line: 56, baseType: !252, size: 64, offset: 6912)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !358, file: !359, line: 56, baseType: !252, size: 64, offset: 6976)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !358, file: !359, line: 56, baseType: !252, size: 64, offset: 7040)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !358, file: !359, line: 57, baseType: !252, size: 64, offset: 7104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !358, file: !359, line: 57, baseType: !252, size: 64, offset: 7168)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !358, file: !359, line: 57, baseType: !252, size: 64, offset: 7232)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !358, file: !359, line: 57, baseType: !252, size: 64, offset: 7296)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !358, file: !359, line: 58, baseType: !478, size: 1280, offset: 7360)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 1280, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 20)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !358, file: !359, line: 58, baseType: !478, size: 1280, offset: 8640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !358, file: !359, line: 59, baseType: !252, size: 64, offset: 9920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !358, file: !359, line: 59, baseType: !252, size: 64, offset: 9984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !358, file: !359, line: 59, baseType: !252, size: 64, offset: 10048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !358, file: !359, line: 59, baseType: !252, size: 64, offset: 10112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !358, file: !359, line: 60, baseType: !198, size: 32, offset: 10176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !358, file: !359, line: 61, baseType: !488, size: 32, offset: 10208)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !25, line: 141, baseType: !36)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !358, file: !359, line: 62, baseType: !80, size: 64, offset: 10240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !358, file: !359, line: 63, baseType: !80, size: 64, offset: 10304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !358, file: !359, line: 64, baseType: !355, size: 64, offset: 10368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !358, file: !359, line: 65, baseType: !60, size: 32, offset: 10432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !358, file: !359, line: 65, baseType: !60, size: 32, offset: 10464)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !358, file: !359, line: 65, baseType: !60, size: 32, offset: 10496)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !358, file: !359, line: 65, baseType: !60, size: 32, offset: 10528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !358, file: !359, line: 66, baseType: !80, size: 64, offset: 10560)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !358, file: !359, line: 67, baseType: !80, size: 64, offset: 10624)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !358, file: !359, line: 68, baseType: !80, size: 64, offset: 10688)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !358, file: !359, line: 69, baseType: !198, size: 32, offset: 10752)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !358, file: !359, line: 70, baseType: !312, size: 32, offset: 10784)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !358, file: !359, line: 71, baseType: !198, size: 32, offset: 10816)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !358, file: !359, line: 72, baseType: !80, size: 64, offset: 10880)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !358, file: !359, line: 73, baseType: !312, size: 32, offset: 10944)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !358, file: !359, line: 74, baseType: !312, size: 32, offset: 10976)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !359, line: 75, baseType: !234, size: 64, offset: 11008)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 24, elements: !508)
!508 = !{!132}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !523, !527, !528, !530, !552, !558, !559, !560, !561, !563, !567, !574, !576, !579, !580, !584, !586, !588, !592, !594, !597, !598, !602, !604, !606, !609, !610, !612, !613, !614, !615, !616, !617, !619, !623, !630, !632, !635, !636, !640, !642, !644, !647, !697, !699, !700, !701, !702, !703, !704, !705, !706, !708, !710, !712, !718, !722, !724, !727, !728, !732}
!513 = !DILocalVariable(name: "draw", arg: 1, scope: !351, file: !352, line: 53, type: !355)
!514 = !DILocalVariable(name: "palette", arg: 2, scope: !351, file: !352, line: 53, type: !506)
!515 = !DILocalVariable(name: "out_w", arg: 3, scope: !351, file: !352, line: 53, type: !509)
!516 = !DILocalVariable(name: "out_h", arg: 4, scope: !351, file: !352, line: 53, type: !509)
!517 = !DILocalVariable(name: "out_pixels", arg: 5, scope: !351, file: !352, line: 53, type: !510)
!518 = !DILocalVariable(name: "Xwin", scope: !351, file: !352, line: 55, type: !49)
!519 = !DILocalVariable(name: "rank", scope: !351, file: !352, line: 56, type: !215)
!520 = !DILocalVariable(name: "ierr", scope: !351, file: !352, line: 57, type: !153)
!521 = !DILocalVariable(name: "_7_errorcode", scope: !522, file: !352, line: 63, type: !153)
!522 = distinct !DILexicalBlock(scope: !351, file: !352, line: 63, column: 66)
!523 = !DILocalVariable(name: "_7_errorstring", scope: !524, file: !352, line: 63, type: !526)
!524 = distinct !DILexicalBlock(scope: !525, file: !352, line: 63, column: 66)
!525 = distinct !DILexicalBlock(scope: !522, file: !352, line: 63, column: 66)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !126)
!527 = !DILocalVariable(name: "_7_resultlen", scope: !524, file: !352, line: 63, type: !215)
!528 = !DILocalVariable(name: "_Petsc_ierr", scope: !529, file: !352, line: 66, type: !153)
!529 = distinct !DILexicalBlock(scope: !351, file: !352, line: 66, column: 10)
!530 = !DILocalVariable(name: "_Petsc_jmpbuf", scope: !529, file: !352, line: 66, type: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !532, line: 45, baseType: !533)
!532 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 1600, elements: !194)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !532, line: 33, size: 1600, elements: !535)
!535 = !{!536, !542, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !534, file: !532, line: 39, baseType: !537, size: 512)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !538, line: 31, baseType: !539)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 512, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !534, file: !532, line: 40, baseType: !60, size: 32, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !534, file: !532, line: 41, baseType: !544, size: 1024, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !545, line: 8, baseType: !546)
!545 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 5, size: 1024, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !546, file: !545, line: 7, baseType: !549, size: 1024)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 16)
!552 = !DILocalVariable(name: "_Petsc_xioerrhdl", scope: !529, file: !352, line: 66, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscXIOErrorHandler", file: !25, line: 325, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !234}
!558 = !DILocalVariable(name: "_Petsc_isdrawx", scope: !529, file: !352, line: 66, type: !312)
!559 = !DILocalVariable(name: "_Petsc_xioerr", scope: !529, file: !352, line: 66, type: !312)
!560 = !DILocalVariable(name: "_Petsc_xioerr_local", scope: !529, file: !352, line: 66, type: !312)
!561 = !DILocalVariable(name: "ierr__", scope: !562, file: !352, line: 66, type: !153)
!562 = distinct !DILexicalBlock(scope: !529, file: !352, line: 66, column: 10)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !352, line: 66, type: !153)
!564 = distinct !DILexicalBlock(scope: !565, file: !352, line: 66, column: 10)
!565 = distinct !DILexicalBlock(scope: !566, file: !352, line: 66, column: 10)
!566 = distinct !DILexicalBlock(scope: !529, file: !352, line: 66, column: 10)
!567 = !DILocalVariable(name: "ierr__", scope: !568, file: !352, line: 66, type: !153)
!568 = distinct !DILexicalBlock(scope: !569, file: !352, line: 66, column: 10)
!569 = distinct !DILexicalBlock(scope: !570, file: !352, line: 66, column: 10)
!570 = distinct !DILexicalBlock(scope: !571, file: !352, line: 66, column: 10)
!571 = distinct !DILexicalBlock(scope: !572, file: !352, line: 66, column: 10)
!572 = distinct !DILexicalBlock(scope: !573, file: !352, line: 66, column: 10)
!573 = distinct !DILexicalBlock(scope: !565, file: !352, line: 66, column: 10)
!574 = !DILocalVariable(name: "_7_errorcode", scope: !575, file: !352, line: 66, type: !153)
!575 = distinct !DILexicalBlock(scope: !569, file: !352, line: 66, column: 10)
!576 = !DILocalVariable(name: "_7_errorstring", scope: !577, file: !352, line: 66, type: !526)
!577 = distinct !DILexicalBlock(scope: !578, file: !352, line: 66, column: 10)
!578 = distinct !DILexicalBlock(scope: !575, file: !352, line: 66, column: 10)
!579 = !DILocalVariable(name: "_7_resultlen", scope: !577, file: !352, line: 66, type: !215)
!580 = !DILocalVariable(name: "ierr__", scope: !581, file: !352, line: 66, type: !153)
!581 = distinct !DILexicalBlock(scope: !582, file: !352, line: 66, column: 10)
!582 = distinct !DILexicalBlock(scope: !583, file: !352, line: 66, column: 10)
!583 = distinct !DILexicalBlock(scope: !569, file: !352, line: 66, column: 10)
!584 = !DILocalVariable(name: "ierr__", scope: !585, file: !352, line: 66, type: !153)
!585 = distinct !DILexicalBlock(scope: !572, file: !352, line: 66, column: 10)
!586 = !DILocalVariable(name: "ierr__", scope: !587, file: !352, line: 66, type: !153)
!587 = distinct !DILexicalBlock(scope: !529, file: !352, line: 66, column: 41)
!588 = !DILocalVariable(name: "ierr__", scope: !589, file: !352, line: 68, type: !153)
!589 = distinct !DILexicalBlock(scope: !590, file: !352, line: 68, column: 10)
!590 = distinct !DILexicalBlock(scope: !591, file: !352, line: 68, column: 10)
!591 = distinct !DILexicalBlock(scope: !529, file: !352, line: 68, column: 10)
!592 = !DILocalVariable(name: "_7_errorcode", scope: !593, file: !352, line: 68, type: !153)
!593 = distinct !DILexicalBlock(scope: !590, file: !352, line: 68, column: 10)
!594 = !DILocalVariable(name: "_7_errorstring", scope: !595, file: !352, line: 68, type: !526)
!595 = distinct !DILexicalBlock(scope: !596, file: !352, line: 68, column: 10)
!596 = distinct !DILexicalBlock(scope: !593, file: !352, line: 68, column: 10)
!597 = !DILocalVariable(name: "_7_resultlen", scope: !595, file: !352, line: 68, type: !215)
!598 = !DILocalVariable(name: "ierr__", scope: !599, file: !352, line: 68, type: !153)
!599 = distinct !DILexicalBlock(scope: !600, file: !352, line: 68, column: 10)
!600 = distinct !DILexicalBlock(scope: !601, file: !352, line: 68, column: 10)
!601 = distinct !DILexicalBlock(scope: !590, file: !352, line: 68, column: 10)
!602 = !DILocalVariable(name: "ierr__", scope: !603, file: !352, line: 68, type: !153)
!603 = distinct !DILexicalBlock(scope: !351, file: !352, line: 68, column: 39)
!604 = !DILocalVariable(name: "_7_errorcode", scope: !605, file: !352, line: 69, type: !153)
!605 = distinct !DILexicalBlock(scope: !351, file: !352, line: 69, column: 58)
!606 = !DILocalVariable(name: "_7_errorstring", scope: !607, file: !352, line: 69, type: !526)
!607 = distinct !DILexicalBlock(scope: !608, file: !352, line: 69, column: 58)
!608 = distinct !DILexicalBlock(scope: !605, file: !352, line: 69, column: 58)
!609 = !DILocalVariable(name: "_7_resultlen", scope: !607, file: !352, line: 69, type: !215)
!610 = !DILocalVariable(name: "_Petsc_ierr", scope: !611, file: !352, line: 72, type: !153)
!611 = distinct !DILexicalBlock(scope: !351, file: !352, line: 72, column: 10)
!612 = !DILocalVariable(name: "_Petsc_jmpbuf", scope: !611, file: !352, line: 72, type: !531)
!613 = !DILocalVariable(name: "_Petsc_xioerrhdl", scope: !611, file: !352, line: 72, type: !553)
!614 = !DILocalVariable(name: "_Petsc_isdrawx", scope: !611, file: !352, line: 72, type: !312)
!615 = !DILocalVariable(name: "_Petsc_xioerr", scope: !611, file: !352, line: 72, type: !312)
!616 = !DILocalVariable(name: "_Petsc_xioerr_local", scope: !611, file: !352, line: 72, type: !312)
!617 = !DILocalVariable(name: "ierr__", scope: !618, file: !352, line: 72, type: !153)
!618 = distinct !DILexicalBlock(scope: !611, file: !352, line: 72, column: 10)
!619 = !DILocalVariable(name: "ierr__", scope: !620, file: !352, line: 72, type: !153)
!620 = distinct !DILexicalBlock(scope: !621, file: !352, line: 72, column: 10)
!621 = distinct !DILexicalBlock(scope: !622, file: !352, line: 72, column: 10)
!622 = distinct !DILexicalBlock(scope: !611, file: !352, line: 72, column: 10)
!623 = !DILocalVariable(name: "ierr__", scope: !624, file: !352, line: 72, type: !153)
!624 = distinct !DILexicalBlock(scope: !625, file: !352, line: 72, column: 10)
!625 = distinct !DILexicalBlock(scope: !626, file: !352, line: 72, column: 10)
!626 = distinct !DILexicalBlock(scope: !627, file: !352, line: 72, column: 10)
!627 = distinct !DILexicalBlock(scope: !628, file: !352, line: 72, column: 10)
!628 = distinct !DILexicalBlock(scope: !629, file: !352, line: 72, column: 10)
!629 = distinct !DILexicalBlock(scope: !621, file: !352, line: 72, column: 10)
!630 = !DILocalVariable(name: "_7_errorcode", scope: !631, file: !352, line: 72, type: !153)
!631 = distinct !DILexicalBlock(scope: !625, file: !352, line: 72, column: 10)
!632 = !DILocalVariable(name: "_7_errorstring", scope: !633, file: !352, line: 72, type: !526)
!633 = distinct !DILexicalBlock(scope: !634, file: !352, line: 72, column: 10)
!634 = distinct !DILexicalBlock(scope: !631, file: !352, line: 72, column: 10)
!635 = !DILocalVariable(name: "_7_resultlen", scope: !633, file: !352, line: 72, type: !215)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !352, line: 72, type: !153)
!637 = distinct !DILexicalBlock(scope: !638, file: !352, line: 72, column: 10)
!638 = distinct !DILexicalBlock(scope: !639, file: !352, line: 72, column: 10)
!639 = distinct !DILexicalBlock(scope: !625, file: !352, line: 72, column: 10)
!640 = !DILocalVariable(name: "ierr__", scope: !641, file: !352, line: 72, type: !153)
!641 = distinct !DILexicalBlock(scope: !628, file: !352, line: 72, column: 10)
!642 = !DILocalVariable(name: "ierr__", scope: !643, file: !352, line: 72, type: !153)
!643 = distinct !DILexicalBlock(scope: !611, file: !352, line: 72, column: 41)
!644 = !DILocalVariable(name: "root", scope: !645, file: !352, line: 74, type: !116)
!645 = distinct !DILexicalBlock(scope: !646, file: !352, line: 73, column: 14)
!646 = distinct !DILexicalBlock(scope: !611, file: !352, line: 73, column: 7)
!647 = !DILocalVariable(name: "ximage", scope: !645, file: !352, line: 75, type: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "XImage", file: !57, line: 394, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XImage", file: !57, line: 360, size: 1088, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !650, file: !57, line: 361, baseType: !60, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !650, file: !57, line: 361, baseType: !60, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !650, file: !57, line: 362, baseType: !60, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !650, file: !57, line: 363, baseType: !60, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !57, line: 364, baseType: !80, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !650, file: !57, line: 365, baseType: !60, size: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !650, file: !57, line: 366, baseType: !60, size: 32, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !650, file: !57, line: 367, baseType: !60, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !650, file: !57, line: 368, baseType: !60, size: 32, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !650, file: !57, line: 369, baseType: !60, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_line", scope: !650, file: !57, line: 370, baseType: !60, size: 32, offset: 352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !650, file: !57, line: 371, baseType: !60, size: 32, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !650, file: !57, line: 372, baseType: !85, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !650, file: !57, line: 373, baseType: !85, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !650, file: !57, line: 374, baseType: !85, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "obdata", scope: !650, file: !57, line: 375, baseType: !79, size: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !650, file: !57, line: 393, baseType: !669, size: 384, offset: 704)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcs", file: !57, line: 376, size: 384, elements: !670)
!670 = !{!671, !677, !681, !685, !689, !693}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "create_image", scope: !669, file: !57, line: 377, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !676, !62, !5, !60, !60, !80, !5, !5, !60, !60}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_image", scope: !669, file: !57, line: 388, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!60, !675}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel", scope: !669, file: !57, line: 389, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!85, !675, !60, !60}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixel", scope: !669, file: !57, line: 390, baseType: !686, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!60, !675, !60, !60, !85}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sub_image", scope: !669, file: !57, line: 391, baseType: !690, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!675, !675, !60, !60, !5, !5}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixel", scope: !669, file: !57, line: 392, baseType: !694, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!60, !675, !212}
!697 = !DILocalVariable(name: "pmap", scope: !645, file: !352, line: 76, type: !698)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, elements: !126)
!699 = !DILocalVariable(name: "pixels", scope: !645, file: !352, line: 77, type: !511)
!700 = !DILocalVariable(name: "w", scope: !645, file: !352, line: 78, type: !5)
!701 = !DILocalVariable(name: "h", scope: !645, file: !352, line: 78, type: !5)
!702 = !DILocalVariable(name: "dummy", scope: !645, file: !352, line: 78, type: !5)
!703 = !DILocalVariable(name: "x", scope: !645, file: !352, line: 79, type: !60)
!704 = !DILocalVariable(name: "y", scope: !645, file: !352, line: 79, type: !60)
!705 = !DILocalVariable(name: "p", scope: !645, file: !352, line: 79, type: !60)
!706 = !DILocalVariable(name: "ierr__", scope: !707, file: !352, line: 81, type: !153)
!707 = distinct !DILexicalBlock(scope: !645, file: !352, line: 81, column: 71)
!708 = !DILocalVariable(name: "ierr__", scope: !709, file: !352, line: 88, type: !153)
!709 = distinct !DILexicalBlock(scope: !645, file: !352, line: 88, column: 56)
!710 = !DILocalVariable(name: "ierr__", scope: !711, file: !352, line: 90, type: !153)
!711 = distinct !DILexicalBlock(scope: !645, file: !352, line: 90, column: 38)
!712 = !DILocalVariable(name: "pix", scope: !713, file: !352, line: 93, type: !102)
!713 = distinct !DILexicalBlock(scope: !714, file: !352, line: 92, column: 32)
!714 = distinct !DILexicalBlock(scope: !715, file: !352, line: 92, column: 7)
!715 = distinct !DILexicalBlock(scope: !716, file: !352, line: 92, column: 7)
!716 = distinct !DILexicalBlock(scope: !717, file: !352, line: 91, column: 5)
!717 = distinct !DILexicalBlock(scope: !645, file: !352, line: 91, column: 5)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !352, line: 101, type: !153)
!719 = distinct !DILexicalBlock(scope: !720, file: !352, line: 101, column: 10)
!720 = distinct !DILexicalBlock(scope: !721, file: !352, line: 101, column: 10)
!721 = distinct !DILexicalBlock(scope: !611, file: !352, line: 101, column: 10)
!722 = !DILocalVariable(name: "_7_errorcode", scope: !723, file: !352, line: 101, type: !153)
!723 = distinct !DILexicalBlock(scope: !720, file: !352, line: 101, column: 10)
!724 = !DILocalVariable(name: "_7_errorstring", scope: !725, file: !352, line: 101, type: !526)
!725 = distinct !DILexicalBlock(scope: !726, file: !352, line: 101, column: 10)
!726 = distinct !DILexicalBlock(scope: !723, file: !352, line: 101, column: 10)
!727 = !DILocalVariable(name: "_7_resultlen", scope: !725, file: !352, line: 101, type: !215)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !352, line: 101, type: !153)
!729 = distinct !DILexicalBlock(scope: !730, file: !352, line: 101, column: 10)
!730 = distinct !DILexicalBlock(scope: !731, file: !352, line: 101, column: 10)
!731 = distinct !DILexicalBlock(scope: !720, file: !352, line: 101, column: 10)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !352, line: 101, type: !153)
!733 = distinct !DILexicalBlock(scope: !351, file: !352, line: 101, column: 39)
!734 = !DILocation(line: 0, scope: !351)
!735 = !DILocation(line: 55, column: 48, scope: !351)
!736 = !{!737, !742, i64 1376}
