; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/dlregisdmdm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/dlregisdmdm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._n_PetscOptions = type opaque
%struct._p_PetscSectionSym = type { %struct._p_PetscObject, [1 x %struct._PetscSectionSymOps], i8*, %struct._n_SymWorkLink*, %struct._n_SymWorkLink* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!695 = distinct !DILexicalBlock(scope: !273, file: !45, line: 131, column: 53)
!696 = !DILocation(line: 131, column: 53, scope: !273)
!697 = !DILocation(line: 132, column: 3, scope: !137)
!698 = !DILocation(line: 135, column: 10, scope: !137)
!699 = !DILocation(line: 0, scope: !275)
!700 = !DILocation(line: 135, column: 87, scope: !701)
!701 = distinct !DILexicalBlock(scope: !275, file: !45, line: 135, column: 87)
!702 = !DILocation(line: 135, column: 87, scope: !275)
!703 = !DILocation(line: 136, column: 7, scope: !279)
!704 = !DILocation(line: 136, column: 7, scope: !137)
!705 = !DILocation(line: 137, column: 12, scope: !278)
!706 = !DILocation(line: 0, scope: !277)
!707 = !DILocation(line: 137, column: 50, scope: !708)
!708 = distinct !DILexicalBlock(scope: !277, file: !45, line: 137, column: 50)
!709 = !DILocation(line: 137, column: 50, scope: !277)
!710 = !DILocation(line: 138, column: 9, scope: !283)
!711 = !DILocation(line: 138, column: 9, scope: !278)
!712 = !DILocation(line: 138, column: 48, scope: !282)
!713 = !DILocation(line: 138, column: 22, scope: !282)
!714 = !DILocation(line: 0, scope: !281)
!715 = !DILocation(line: 138, column: 60, scope: !716)
!716 = distinct !DILexicalBlock(scope: !281, file: !45, line: 138, column: 60)
!717 = !DILocation(line: 138, column: 60, scope: !281)
!718 = !DILocation(line: 141, column: 10, scope: !137)
!719 = !DILocation(line: 0, scope: !285)
!720 = !DILocation(line: 141, column: 38, scope: !721)
!721 = distinct !DILexicalBlock(scope: !285, file: !45, line: 141, column: 38)
!722 = !DILocation(line: 141, column: 38, scope: !285)
!723 = !DILocation(line: 142, column: 10, scope: !137)
!724 = !DILocation(line: 0, scope: !287)
!725 = !DILocation(line: 142, column: 63, scope: !726)
!726 = distinct !DILexicalBlock(scope: !287, file: !45, line: 142, column: 63)
!727 = !DILocation(line: 142, column: 63, scope: !287)
!728 = !DILocation(line: 143, column: 10, scope: !137)
!729 = !DILocation(line: 0, scope: !289)
!730 = !DILocation(line: 143, column: 51, scope: !731)
!731 = distinct !DILexicalBlock(scope: !289, file: !45, line: 143, column: 51)
!732 = !DILocation(line: 143, column: 51, scope: !289)
!733 = !DILocation(line: 144, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !45, line: 144, column: 3)
!735 = distinct !DILexicalBlock(scope: !736, file: !45, line: 144, column: 3)
!736 = distinct !DILexicalBlock(scope: !137, file: !45, line: 144, column: 3)
!737 = !DILocation(line: 144, column: 3, scope: !735)
!738 = !DILocation(line: 144, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !45, line: 144, column: 3)
!740 = distinct !DILexicalBlock(scope: !734, file: !45, line: 144, column: 3)
!741 = !DILocation(line: 144, column: 3, scope: !740)
!742 = !DILocation(line: 144, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !744, file: !45, line: 144, column: 3)
!744 = distinct !DILexicalBlock(scope: !739, file: !45, line: 144, column: 3)
!745 = !DILocation(line: 144, column: 3, scope: !744)
!746 = !DILocation(line: 144, column: 3, scope: !747)
!747 = distinct !DILexicalBlock(scope: !743, file: !45, line: 144, column: 3)
!748 = !DILocation(line: 144, column: 3, scope: !749)
!749 = distinct !DILexicalBlock(scope: !739, file: !45, line: 144, column: 3)
!750 = !DILocation(line: 144, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !749, file: !45, line: 144, column: 3)
!752 = !DILocation(line: 144, column: 3, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !45, line: 144, column: 3)
!754 = distinct !DILexicalBlock(scope: !751, file: !45, line: 144, column: 3)
!755 = !DILocation(line: 144, column: 3, scope: !754)
!756 = !DILocation(line: 144, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !45, line: 144, column: 3)
!758 = !DILocation(line: 145, column: 1, scope: !137)
!759 = !DISubprogram(name: "PetscClassIdRegister", scope: !127, file: !127, line: 1408, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!760 = !DISubroutineType(types: !761)
!761 = !{!64, !38, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!763 = !DISubprogram(name: "PetscSectionSymRegister", scope: !764, file: !764, line: 86, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!764 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsection.h", directory: "/home/users/ndemeye/xSDK")
!765 = !DISubroutineType(types: !766)
!766 = !{!64, !38, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!64, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !772, line: 72, size: 4864, elements: !773)
!772 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!773 = !{!774, !969, !1057, !1058, !1067}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !771, file: !772, line: 73, baseType: !775, size: 4480)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !776, line: 122, baseType: !777)
!776 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !776, line: 73, size: 4480, elements: !778)
!778 = !{!779, !780, !825, !826, !828, !831, !832, !833, !834, !842, !843, !845, !847, !851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !864, !865, !866, !868, !869, !871, !873, !874, !875, !876, !877, !880, !882, !883, !884, !885, !886, !889, !891, !892, !893, !903, !905, !906, !910, !911, !959, !964, !966, !967, !968}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !777, file: !776, line: 74, baseType: !269, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !777, file: !776, line: 75, baseType: !781, size: 448, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 448, elements: !270)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !776, line: 53, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !776, line: 45, size: 448, elements: !784)
!784 = !{!785, !792, !800, !805, !809, !813, !820}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !783, file: !776, line: 46, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!63, !789, !791}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !783, file: !776, line: 47, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!63, !789, !796}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !797, line: 16, baseType: !798)
!797 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !797, line: 16, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !783, file: !776, line: 48, baseType: !801, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!63, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !783, file: !776, line: 49, baseType: !806, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!63, !789, !38, !789}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !783, file: !776, line: 50, baseType: !810, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!63, !789, !38, !804}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !783, file: !776, line: 51, baseType: !814, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!63, !789, !38, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !783, file: !776, line: 52, baseType: !821, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!63, !789, !38, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !777, file: !776, line: 76, baseType: !33, size: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !776, line: 77, baseType: !827, size: 32, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !777, file: !776, line: 78, baseType: !829, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !830)
!830 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !777, file: !776, line: 78, baseType: !829, size: 64, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !777, file: !776, line: 78, baseType: !829, size: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !777, file: !776, line: 78, baseType: !829, size: 64, offset: 832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !777, file: !776, line: 79, baseType: !835, size: 64, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !838, line: 27, baseType: !839)
!838 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !840, line: 43, baseType: !841)
!840 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!841 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !777, file: !776, line: 80, baseType: !827, size: 32, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !777, file: !776, line: 81, baseType: !844, size: 32, offset: 992)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !777, file: !776, line: 82, baseType: !846, size: 64, offset: 1024)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !131)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !777, file: !776, line: 83, baseType: !848, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !777, file: !776, line: 84, baseType: !852, size: 64, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !777, file: !776, line: 85, baseType: !852, size: 64, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !777, file: !776, line: 86, baseType: !852, size: 64, offset: 1280)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !777, file: !776, line: 87, baseType: !852, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !777, file: !776, line: 88, baseType: !789, size: 64, offset: 1408)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !777, file: !776, line: 89, baseType: !835, size: 64, offset: 1472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !776, line: 90, baseType: !852, size: 64, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !777, file: !776, line: 91, baseType: !852, size: 64, offset: 1600)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !777, file: !776, line: 92, baseType: !827, size: 32, offset: 1664)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !777, file: !776, line: 93, baseType: !37, size: 64, offset: 1728)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !777, file: !776, line: 94, baseType: !863, size: 64, offset: 1792)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !836)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !777, file: !776, line: 95, baseType: !827, size: 32, offset: 1856)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !777, file: !776, line: 95, baseType: !827, size: 32, offset: 1888)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !777, file: !776, line: 96, baseType: !867, size: 64, offset: 1920)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !777, file: !776, line: 96, baseType: !867, size: 64, offset: 1984)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !777, file: !776, line: 97, baseType: !870, size: 64, offset: 2048)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !777, file: !776, line: 97, baseType: !872, size: 64, offset: 2112)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !777, file: !776, line: 98, baseType: !827, size: 32, offset: 2176)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !777, file: !776, line: 98, baseType: !827, size: 32, offset: 2208)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !777, file: !776, line: 99, baseType: !867, size: 64, offset: 2240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !777, file: !776, line: 99, baseType: !867, size: 64, offset: 2304)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !777, file: !776, line: 100, baseType: !878, size: 64, offset: 2368)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !830)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !777, file: !776, line: 100, baseType: !881, size: 64, offset: 2432)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !777, file: !776, line: 101, baseType: !827, size: 32, offset: 2496)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !777, file: !776, line: 101, baseType: !827, size: 32, offset: 2528)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !777, file: !776, line: 102, baseType: !867, size: 64, offset: 2560)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !777, file: !776, line: 102, baseType: !867, size: 64, offset: 2624)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !777, file: !776, line: 103, baseType: !887, size: 64, offset: 2688)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !879)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !777, file: !776, line: 103, baseType: !890, size: 64, offset: 2752)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !777, file: !776, line: 104, baseType: !824, size: 64, offset: 2816)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !777, file: !776, line: 105, baseType: !827, size: 32, offset: 2880)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !777, file: !776, line: 106, baseType: !894, size: 128, offset: 2944)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, elements: !901)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !776, line: 64, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !776, line: 61, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !897, file: !776, line: 62, baseType: !817, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !897, file: !776, line: 63, baseType: !37, size: 64, offset: 64)
!901 = !{!902}
!902 = !DISubrange(count: 2)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !777, file: !776, line: 107, baseType: !904, size: 64, offset: 3072)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 64, elements: !901)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !777, file: !776, line: 108, baseType: !37, size: 64, offset: 3136)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !777, file: !776, line: 109, baseType: !907, size: 64, offset: 3200)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!63, !37}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !777, file: !776, line: 111, baseType: !827, size: 32, offset: 3264)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !777, file: !776, line: 112, baseType: !912, size: 320, offset: 3328)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 320, elements: !957)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!63, !916, !789, !37}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !919)
!919 = !{!920, !921, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !918, file: !18, line: 100, baseType: !827, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !918, file: !18, line: 101, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !933, !934, !935, !939, !940, !942, !943, !944}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !924, file: !18, line: 84, baseType: !852, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !924, file: !18, line: 85, baseType: !852, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !924, file: !18, line: 86, baseType: !37, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !924, file: !18, line: 87, baseType: !846, size: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !924, file: !18, line: 88, baseType: !931, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !924, file: !18, line: 89, baseType: !40, size: 8, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !924, file: !18, line: 90, baseType: !852, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !924, file: !18, line: 91, baseType: !936, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !937, line: 46, baseType: !938)
!937 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!938 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !924, file: !18, line: 92, baseType: !46, size: 32, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !924, file: !18, line: 93, baseType: !941, size: 32, offset: 544)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !18, line: 94, baseType: !922, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !924, file: !18, line: 95, baseType: !852, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !924, file: !18, line: 96, baseType: !37, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !918, file: !18, line: 102, baseType: !852, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !918, file: !18, line: 102, baseType: !852, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !918, file: !18, line: 103, baseType: !852, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !918, file: !18, line: 104, baseType: !33, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !918, file: !18, line: 105, baseType: !46, size: 32, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !918, file: !18, line: 105, baseType: !46, size: 32, offset: 416)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !918, file: !18, line: 105, baseType: !46, size: 32, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !918, file: !18, line: 106, baseType: !789, size: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !918, file: !18, line: 107, baseType: !954, size: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!957 = !{!958}
!958 = !DISubrange(count: 5)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !777, file: !776, line: 113, baseType: !960, size: 320, offset: 3648)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 320, elements: !957)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!63, !789, !37}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !777, file: !776, line: 114, baseType: !965, size: 320, offset: 3968)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 320, elements: !957)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !777, file: !776, line: 115, baseType: !46, size: 32, offset: 4288)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !777, file: !776, line: 120, baseType: !954, size: 64, offset: 4352)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !777, file: !776, line: 121, baseType: !46, size: 32, offset: 4416)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !771, file: !772, line: 73, baseType: !970, size: 192, offset: 4480)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 192, elements: !270)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !772, line: 56, size: 192, elements: !972)
!972 = !{!973, !1049, !1053}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !971, file: !772, line: 57, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!63, !977, !979, !827, !1043, !1045, !1046}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !978, line: 33, baseType: !770)
!978 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !978, line: 18, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !772, line: 29, size: 5760, elements: !982)
!982 = !{!983, !984, !986, !987, !988, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1004, !1005, !1007, !1008, !1010, !1011, !1040, !1041, !1042}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !981, file: !772, line: 30, baseType: !775, size: 4480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !981, file: !772, line: 30, baseType: !985, size: 32, offset: 4480)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !270)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !981, file: !772, line: 31, baseType: !827, size: 32, offset: 4512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !981, file: !772, line: 31, baseType: !827, size: 32, offset: 4544)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !981, file: !772, line: 32, baseType: !989, size: 64, offset: 4608)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !990, line: 11, baseType: !991)
!990 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !990, line: 11, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !981, file: !772, line: 33, baseType: !46, size: 32, offset: 4672)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !981, file: !772, line: 34, baseType: !46, size: 32, offset: 4704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !981, file: !772, line: 35, baseType: !870, size: 64, offset: 4736)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !981, file: !772, line: 36, baseType: !870, size: 64, offset: 4800)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !981, file: !772, line: 37, baseType: !827, size: 32, offset: 4864)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !981, file: !772, line: 38, baseType: !979, size: 64, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !981, file: !772, line: 39, baseType: !870, size: 64, offset: 4992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !981, file: !772, line: 40, baseType: !46, size: 32, offset: 5056)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !981, file: !772, line: 42, baseType: !827, size: 32, offset: 5088)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !981, file: !772, line: 43, baseType: !1003, size: 64, offset: 5120)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !981, file: !772, line: 44, baseType: !870, size: 64, offset: 5184)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !981, file: !772, line: 45, baseType: !1006, size: 64, offset: 5248)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !981, file: !772, line: 46, baseType: !46, size: 32, offset: 5312)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !981, file: !772, line: 47, baseType: !1009, size: 64, offset: 5376)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !981, file: !772, line: 49, baseType: !789, size: 64, offset: 5440)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !981, file: !772, line: 50, baseType: !1012, size: 64, offset: 5504)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !772, line: 27, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !772, line: 27, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !772, line: 27, size: 320, elements: !1016)
!1016 = !{!1017, !1021, !1022, !1023, !1024, !1026, !1033}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1015, file: !772, line: 27, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !1019, line: 166, baseType: !1020)
!1019 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !1019, line: 139, baseType: !7)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1015, file: !772, line: 27, baseType: !1018, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1015, file: !772, line: 27, baseType: !1018, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1015, file: !772, line: 27, baseType: !1018, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !772, line: 27, baseType: !1025, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1015, file: !772, line: 27, baseType: !1027, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !772, line: 10, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !772, line: 8, size: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1029, file: !772, line: 9, baseType: !827, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1029, file: !772, line: 9, baseType: !827, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1015, file: !772, line: 27, baseType: !1034, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !772, line: 14, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !772, line: 12, size: 128, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !1036, file: !772, line: 13, baseType: !870, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !1036, file: !772, line: 13, baseType: !870, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !981, file: !772, line: 51, baseType: !979, size: 64, offset: 5568)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !981, file: !772, line: 52, baseType: !989, size: 64, offset: 5632)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !981, file: !772, line: 53, baseType: !977, size: 64, offset: 5696)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !971, file: !772, line: 58, baseType: !1050, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!63, !977}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !971, file: !772, line: 59, baseType: !1054, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!63, !977, !796}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !771, file: !772, line: 74, baseType: !37, size: 64, offset: 4672)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !771, file: !772, line: 75, baseType: !1059, size: 64, offset: 4736)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !772, line: 62, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !772, line: 64, size: 256, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1061, file: !772, line: 66, baseType: !1059, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !1061, file: !772, line: 67, baseType: !1045, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !1061, file: !772, line: 68, baseType: !1046, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !1061, file: !772, line: 69, baseType: !827, size: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !771, file: !772, line: 76, baseType: !1059, size: 64, offset: 4800)
!1068 = !DISubprogram(name: "DMRegisterAll", scope: !1069, file: !1069, line: 14, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1069 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!64}
!1072 = !DISubprogram(name: "PetscLogEventRegister", scope: !1073, file: !1073, line: 388, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1073 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!64, !38, !64, !762}
!1076 = !DISubprogram(name: "PetscInfoProcessClass", scope: !1073, file: !1073, line: 66, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1077 = !DISubprogram(name: "PetscOptionsGetString", scope: !18, file: !18, line: 26, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!64, !955, !38, !38, !852, !938, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1081 = !DISubprogram(name: "PetscStrInList", scope: !127, file: !127, line: 1376, type: !1082, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!64, !38, !38, !40, !1080}
!1084 = !DISubprogram(name: "PetscLogEventExcludeClass", scope: !1073, file: !1073, line: 391, type: !1085, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!64, !64}
!1087 = !DISubprogram(name: "DMPlexGenerateRegisterAll", scope: !1088, file: !1088, line: 145, type: !1070, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1088 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplex.h", directory: "/home/users/ndemeye/xSDK")
!1089 = !DISubprogram(name: "PetscRegisterFinalize", scope: !127, file: !127, line: 1509, type: !1090, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!64, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1093 = distinct !DISubprogram(name: "PetscFEFinalizePackage", scope: !45, file: !45, line: 157, type: !61, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1094)
!1094 = !{!1095, !1096, !1098, !1100}
!1095 = !DILocalVariable(name: "ierr", scope: !1093, file: !45, line: 159, type: !63)
!1096 = !DILocalVariable(name: "ierr__", scope: !1097, file: !45, line: 162, type: !63)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !45, line: 162, column: 52)
!1098 = !DILocalVariable(name: "ierr__", scope: !1099, file: !45, line: 163, type: !63)
!1099 = distinct !DILexicalBlock(scope: !1093, file: !45, line: 163, column: 56)
!1100 = !DILocalVariable(name: "ierr__", scope: !1101, file: !45, line: 164, type: !63)
!1101 = distinct !DILexicalBlock(scope: !1093, file: !45, line: 164, column: 49)
!1102 = !DILocation(line: 161, column: 3, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !45, line: 161, column: 3)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !45, line: 161, column: 3)
!1105 = distinct !DILexicalBlock(scope: !1093, file: !45, line: 161, column: 3)
!1106 = !DILocation(line: 161, column: 3, scope: !1104)
!1107 = !DILocation(line: 161, column: 3, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !45, line: 161, column: 3)
!1109 = distinct !DILexicalBlock(scope: !1103, file: !45, line: 161, column: 3)
!1110 = !DILocation(line: 161, column: 3, scope: !1109)
