; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/interface/linesearch.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/interface/linesearch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 155, baseType: !7, size: 32, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!113 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 624, baseType: !7, size: 32, elements: !116)
!115 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!121 = !{!122, !125, !126, !162, !330, !296, !333, !334, !202, !335, !338, !212, !133, !238, !157, !239, !188, !341, !435, !441, !442, !7}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !115, line: 330, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !115, line: 330, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !129, line: 73, size: 4480, elements: !130)
!129 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!130 = !{!131, !134, !183, !184, !186, !189, !190, !191, !192, !200, !201, !203, !207, !211, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !224, !225, !226, !228, !229, !231, !233, !234, !235, !236, !237, !240, !242, !243, !244, !245, !246, !249, !251, !252, !253, !263, !265, !266, !270, !271, !320, !325, !327, !328, !329}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !128, file: !129, line: 74, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !133)
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !128, file: !129, line: 75, baseType: !135, size: 448, offset: 64)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 448, elements: !181)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !129, line: 53, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 45, size: 448, elements: !138)
!138 = !{!139, !145, !153, !158, !165, !169, !176}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !137, file: !129, line: 46, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !126, !144}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !133)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !137, file: !129, line: 47, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!143, !126, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !150, line: 16, baseType: !151)
!150 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !150, line: 16, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !137, file: !129, line: 48, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!143, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !137, file: !129, line: 49, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!143, !126, !162, !126}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !137, file: !129, line: 50, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!143, !126, !162, !157}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !137, file: !129, line: 51, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!143, !126, !162, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !137, file: !129, line: 52, baseType: !177, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!143, !126, !162, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!181 = !{!182}
!182 = !DISubrange(count: 1)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !128, file: !129, line: 76, baseType: !122, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !129, line: 77, baseType: !185, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !133)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !128, file: !129, line: 78, baseType: !187, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !188)
!188 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !128, file: !129, line: 78, baseType: !187, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !128, file: !129, line: 78, baseType: !187, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !128, file: !129, line: 78, baseType: !187, size: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !129, line: 79, baseType: !193, size: 64, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !196, line: 27, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !198, line: 43, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!199 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !128, file: !129, line: 80, baseType: !185, size: 32, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !128, file: !129, line: 81, baseType: !202, size: 32, offset: 992)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !133)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !128, file: !129, line: 82, baseType: !204, size: 64, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !128, file: !129, line: 83, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !128, file: !129, line: 84, baseType: !212, size: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !128, file: !129, line: 85, baseType: !212, size: 64, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !128, file: !129, line: 86, baseType: !212, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !128, file: !129, line: 87, baseType: !212, size: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !128, file: !129, line: 88, baseType: !126, size: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !128, file: !129, line: 89, baseType: !193, size: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 90, baseType: !212, size: 64, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !128, file: !129, line: 91, baseType: !212, size: 64, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !128, file: !129, line: 92, baseType: !185, size: 32, offset: 1664)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !128, file: !129, line: 93, baseType: !125, size: 64, offset: 1728)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 94, baseType: !223, size: 64, offset: 1792)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !194)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !128, file: !129, line: 95, baseType: !185, size: 32, offset: 1856)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !128, file: !129, line: 95, baseType: !185, size: 32, offset: 1888)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !128, file: !129, line: 96, baseType: !227, size: 64, offset: 1920)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !128, file: !129, line: 96, baseType: !227, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !128, file: !129, line: 97, baseType: !230, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !128, file: !129, line: 97, baseType: !232, size: 64, offset: 2112)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !128, file: !129, line: 98, baseType: !185, size: 32, offset: 2176)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !128, file: !129, line: 98, baseType: !185, size: 32, offset: 2208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !128, file: !129, line: 99, baseType: !227, size: 64, offset: 2240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !128, file: !129, line: 99, baseType: !227, size: 64, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !128, file: !129, line: 100, baseType: !238, size: 64, offset: 2368)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !188)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !128, file: !129, line: 100, baseType: !241, size: 64, offset: 2432)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !128, file: !129, line: 101, baseType: !185, size: 32, offset: 2496)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !128, file: !129, line: 101, baseType: !185, size: 32, offset: 2528)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !128, file: !129, line: 102, baseType: !227, size: 64, offset: 2560)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !128, file: !129, line: 102, baseType: !227, size: 64, offset: 2624)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !128, file: !129, line: 103, baseType: !247, size: 64, offset: 2688)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !239)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !128, file: !129, line: 103, baseType: !250, size: 64, offset: 2752)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !128, file: !129, line: 104, baseType: !180, size: 64, offset: 2816)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !128, file: !129, line: 105, baseType: !185, size: 32, offset: 2880)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !128, file: !129, line: 106, baseType: !254, size: 128, offset: 2944)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, elements: !261)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !129, line: 64, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 61, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !257, file: !129, line: 62, baseType: !173, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !257, file: !129, line: 63, baseType: !125, size: 64, offset: 64)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !128, file: !129, line: 107, baseType: !264, size: 64, offset: 3072)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !261)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !128, file: !129, line: 108, baseType: !125, size: 64, offset: 3136)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !128, file: !129, line: 109, baseType: !267, size: 64, offset: 3200)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!143, !125}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !128, file: !129, line: 111, baseType: !185, size: 32, offset: 3264)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !128, file: !129, line: 112, baseType: !272, size: 320, offset: 3328)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 320, elements: !318)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!143, !276, !126, !125}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !279)
!279 = !{!280, !281, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !278, file: !12, line: 100, baseType: !185, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !12, line: 101, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !293, !294, !295, !299, !301, !303, !304, !305}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !284, file: !12, line: 84, baseType: !212, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !284, file: !12, line: 85, baseType: !212, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !12, line: 86, baseType: !125, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !284, file: !12, line: 87, baseType: !204, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !284, file: !12, line: 88, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !284, file: !12, line: 89, baseType: !164, size: 8, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !284, file: !12, line: 90, baseType: !212, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !284, file: !12, line: 91, baseType: !296, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !297, line: 46, baseType: !298)
!297 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!298 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !284, file: !12, line: 92, baseType: !300, size: 32, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !12, line: 93, baseType: !302, size: 32, offset: 544)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !12, line: 94, baseType: !282, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !284, file: !12, line: 95, baseType: !212, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !284, file: !12, line: 96, baseType: !125, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !278, file: !12, line: 102, baseType: !212, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !278, file: !12, line: 102, baseType: !212, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !278, file: !12, line: 103, baseType: !212, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !278, file: !12, line: 104, baseType: !122, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !278, file: !12, line: 105, baseType: !300, size: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !278, file: !12, line: 105, baseType: !300, size: 32, offset: 416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !278, file: !12, line: 105, baseType: !300, size: 32, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !278, file: !12, line: 106, baseType: !126, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !278, file: !12, line: 107, baseType: !315, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!318 = !{!319}
!319 = !DISubrange(count: 5)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !128, file: !129, line: 113, baseType: !321, size: 320, offset: 3648)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 320, elements: !318)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!143, !126, !125}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !128, file: !129, line: 114, baseType: !326, size: 320, offset: 3968)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 320, elements: !318)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !128, file: !129, line: 115, baseType: !300, size: 32, offset: 4288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !128, file: !129, line: 120, baseType: !315, size: 64, offset: 4352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !128, file: !129, line: 121, baseType: !300, size: 32, offset: 4416)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!143}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !129, line: 130, baseType: !154)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !129, line: 131, baseType: !146)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !115, line: 331, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !115, line: 331, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !115, line: 338, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !115, line: 338, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!143, !344, !125}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !347, line: 29, size: 8000, elements: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!348 = !{!349, !351, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !411, !412, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !433, !439, !440}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !346, file: !347, line: 30, baseType: !350, size: 4480)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !129, line: 122, baseType: !128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !346, file: !347, line: 30, baseType: !352, size: 704, offset: 4480)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 704, elements: !181)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !347, line: 13, size: 704, elements: !354)
!354 = !{!355, !359, !364, !372, !380, !385, !389, !393, !394, !395, !396}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !353, file: !347, line: 14, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!143, !344, !149}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !353, file: !347, line: 15, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !27, line: 554, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!143, !344}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !353, file: !347, line: 16, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!143, !344, !368, !368, !371, !125}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !107, line: 21, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !107, line: 21, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !353, file: !347, line: 17, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !27, line: 552, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!143, !377, !368}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !27, line: 18, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !353, file: !347, line: 18, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !27, line: 553, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!143, !377, !368, !368, !238}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !353, file: !347, line: 19, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!143, !344, !368, !368, !368, !371, !371, !125}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !353, file: !347, line: 20, baseType: !390, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!143, !276, !344}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !353, file: !347, line: 21, baseType: !361, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !353, file: !347, line: 22, baseType: !361, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !353, file: !347, line: 23, baseType: !361, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !353, file: !347, line: 24, baseType: !397, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!143, !377, !368, !368}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !346, file: !347, line: 32, baseType: !377, size: 64, offset: 5184)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !347, line: 34, baseType: !125, size: 64, offset: 5248)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !346, file: !347, line: 36, baseType: !300, size: 32, offset: 5312)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !346, file: !347, line: 38, baseType: !368, size: 64, offset: 5376)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !346, file: !347, line: 39, baseType: !368, size: 64, offset: 5440)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !346, file: !347, line: 40, baseType: !368, size: 64, offset: 5504)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !346, file: !347, line: 41, baseType: !368, size: 64, offset: 5568)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !346, file: !347, line: 42, baseType: !368, size: 64, offset: 5632)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !346, file: !347, line: 44, baseType: !185, size: 32, offset: 5696)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !346, file: !347, line: 45, baseType: !410, size: 64, offset: 5760)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !346, file: !347, line: 47, baseType: !239, size: 64, offset: 5824)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !346, file: !347, line: 49, baseType: !300, size: 32, offset: 5888)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !346, file: !347, line: 50, baseType: !239, size: 64, offset: 5952)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !346, file: !347, line: 51, baseType: !239, size: 64, offset: 6016)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !346, file: !347, line: 52, baseType: !239, size: 64, offset: 6080)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !346, file: !347, line: 53, baseType: !417, size: 32, offset: 6144)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !27, line: 621, baseType: !26)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !346, file: !347, line: 54, baseType: !300, size: 32, offset: 6176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !346, file: !347, line: 56, baseType: !239, size: 64, offset: 6208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !346, file: !347, line: 57, baseType: !239, size: 64, offset: 6272)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !346, file: !347, line: 58, baseType: !239, size: 64, offset: 6336)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !346, file: !347, line: 59, baseType: !185, size: 32, offset: 6400)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !346, file: !347, line: 60, baseType: !239, size: 64, offset: 6464)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !346, file: !347, line: 61, baseType: !239, size: 64, offset: 6528)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !346, file: !347, line: 62, baseType: !239, size: 64, offset: 6592)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !346, file: !347, line: 63, baseType: !185, size: 32, offset: 6656)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !346, file: !347, line: 65, baseType: !239, size: 64, offset: 6720)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !346, file: !347, line: 67, baseType: !125, size: 64, offset: 6784)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !346, file: !347, line: 68, baseType: !125, size: 64, offset: 6848)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !346, file: !347, line: 70, baseType: !149, size: 64, offset: 6912)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !346, file: !347, line: 71, baseType: !432, size: 320, offset: 6976)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !318)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !346, file: !347, line: 72, baseType: !434, size: 320, offset: 7296)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 320, elements: !318)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!143, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !346, file: !347, line: 73, baseType: !326, size: 320, offset: 7616)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !346, file: !347, line: 74, baseType: !185, size: 32, offset: 7936)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !443, line: 1451, baseType: !173)
!443 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!444 = !{!0, !445, !448, !450}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "SNESLineSearchList", scope: !2, file: !447, line: 4, type: !204, isLocal: false, isDefinition: true)
!447 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/interface/linesearch.c", directory: "/home/users/ndemeye/xSDK")
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "SNESLINESEARCH_CLASSID", scope: !2, file: !447, line: 6, type: !132, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "SNESLINESEARCH_Apply", scope: !2, file: !447, line: 7, type: !452, isLocal: false, isDefinition: true)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !453, line: 80, baseType: !133)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!454 = !{i32 7, !"Dwarf Version", i32 4}
!455 = !{i32 2, !"Debug Info Version", i32 3}
!456 = !{i32 1, !"wchar_size", i32 4}
!457 = !{i32 7, !"PIC Level", i32 2}
!458 = !{i32 7, !"uwtable", i32 1}
!459 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!460 = distinct !DISubprogram(name: "SNESLineSearchMonitorCancel", scope: !447, file: !447, line: 32, type: !362, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DILocalVariable(name: "ls", arg: 1, scope: !460, file: !447, line: 32, type: !344)
!463 = !DILocalVariable(name: "ierr", scope: !460, file: !447, line: 34, type: !143)
!464 = !DILocalVariable(name: "i", scope: !460, file: !447, line: 35, type: !185)
!465 = !DILocalVariable(name: "ierr__", scope: !466, file: !447, line: 41, type: !143)
!466 = distinct !DILexicalBlock(scope: !467, file: !447, line: 41, column: 63)
!467 = distinct !DILexicalBlock(scope: !468, file: !447, line: 40, column: 32)
!468 = distinct !DILexicalBlock(scope: !469, file: !447, line: 40, column: 9)
!469 = distinct !DILexicalBlock(scope: !470, file: !447, line: 39, column: 40)
!470 = distinct !DILexicalBlock(scope: !471, file: !447, line: 39, column: 3)
!471 = distinct !DILexicalBlock(scope: !460, file: !447, line: 39, column: 3)
!472 = !DILocation(line: 0, scope: !460)
!473 = !DILocation(line: 37, column: 3, scope: !474)
!474 = distinct !DILexicalBlock(scope: !475, file: !447, line: 37, column: 3)
!475 = distinct !DILexicalBlock(scope: !476, file: !447, line: 37, column: 3)
!476 = distinct !DILexicalBlock(scope: !460, file: !447, line: 37, column: 3)
!477 = !{!478, !478, i64 0}
!478 = !{!"any pointer", !479, i64 0}
!479 = !{!"omnipotent char", !480, i64 0}
!480 = !{!"Simple C/C++ TBAA"}
!481 = !DILocation(line: 37, column: 3, scope: !475)
!482 = !DILocation(line: 37, column: 3, scope: !483)
!483 = distinct !DILexicalBlock(scope: !484, file: !447, line: 37, column: 3)
!484 = distinct !DILexicalBlock(scope: !474, file: !447, line: 37, column: 3)
!485 = !{!486, !487, i64 1536}
!486 = !{!"", !479, i64 0, !479, i64 512, !479, i64 1024, !479, i64 1280, !487, i64 1536, !487, i64 1540, !479, i64 1544}
!487 = !{!"int", !479, i64 0}
!488 = !DILocation(line: 37, column: 3, scope: !484)
!489 = !DILocation(line: 37, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !483, file: !447, line: 37, column: 3)
!491 = !{!487, !487, i64 0}
!492 = !{!486, !487, i64 1540}
!493 = !DILocation(line: 38, column: 3, scope: !494)
!494 = distinct !DILexicalBlock(scope: !495, file: !447, line: 38, column: 3)
!495 = distinct !DILexicalBlock(scope: !460, file: !447, line: 38, column: 3)
!496 = !DILocation(line: 38, column: 3, scope: !495)
!497 = !DILocation(line: 38, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !495, file: !447, line: 38, column: 3)
!499 = !DILocation(line: 38, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !447, line: 38, column: 3)
!501 = !{!502, !487, i64 0}
!502 = !{!"_p_PetscObject", !487, i64 0, !479, i64 8, !478, i64 64, !487, i64 72, !503, i64 80, !503, i64 88, !503, i64 96, !503, i64 104, !504, i64 112, !487, i64 120, !487, i64 124, !478, i64 128, !478, i64 136, !478, i64 144, !478, i64 152, !478, i64 160, !478, i64 168, !478, i64 176, !504, i64 184, !478, i64 192, !478, i64 200, !487, i64 208, !478, i64 216, !504, i64 224, !487, i64 232, !487, i64 236, !478, i64 240, !478, i64 248, !478, i64 256, !478, i64 264, !487, i64 272, !487, i64 276, !478, i64 280, !478, i64 288, !478, i64 296, !478, i64 304, !487, i64 312, !487, i64 316, !478, i64 320, !478, i64 328, !478, i64 336, !478, i64 344, !478, i64 352, !487, i64 360, !479, i64 368, !479, i64 384, !478, i64 392, !478, i64 400, !487, i64 408, !479, i64 416, !479, i64 456, !479, i64 496, !479, i64 536, !478, i64 544, !479, i64 552}
!503 = !{!"double", !479, i64 0}
!504 = !{!"long", !479, i64 0}
!505 = !DILocation(line: 39, column: 19, scope: !470)
!506 = !{!507, !487, i64 992}
!507 = !{!"_p_LineSearch", !502, i64 0, !479, i64 560, !478, i64 648, !478, i64 656, !479, i64 664, !478, i64 672, !478, i64 680, !478, i64 688, !478, i64 696, !478, i64 704, !487, i64 712, !478, i64 720, !503, i64 728, !479, i64 736, !503, i64 744, !503, i64 752, !503, i64 760, !479, i64 768, !479, i64 772, !503, i64 776, !503, i64 784, !503, i64 792, !487, i64 800, !503, i64 808, !503, i64 816, !503, i64 824, !487, i64 832, !503, i64 840, !478, i64 848, !478, i64 856, !478, i64 864, !479, i64 872, !479, i64 912, !479, i64 952, !487, i64 992}
!508 = !DILocation(line: 39, column: 14, scope: !470)
!509 = !DILocation(line: 39, column: 3, scope: !471)
!510 = !DILocation(line: 38, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !447, line: 38, column: 3)
!512 = distinct !DILexicalBlock(scope: !500, file: !447, line: 38, column: 3)
!513 = !DILocation(line: 38, column: 3, scope: !512)
!514 = !DILocation(line: 40, column: 9, scope: !468)
!515 = !DILocation(line: 40, column: 9, scope: !469)
!516 = !DILocation(line: 41, column: 40, scope: !467)
!517 = !DILocation(line: 41, column: 14, scope: !467)
!518 = !DILocation(line: 0, scope: !466)
!519 = !DILocation(line: 41, column: 63, scope: !520)
!520 = distinct !DILexicalBlock(scope: !466, file: !447, line: 41, column: 63)
!521 = !DILocation(line: 41, column: 63, scope: !466)
!522 = !{!"branch_weights", i32 2000, i32 1}
!523 = !DILocation(line: 39, column: 36, scope: !470)
!524 = distinct !{!524, !509, !525, !526}
!525 = !DILocation(line: 43, column: 3, scope: !471)
!526 = !{!"llvm.loop.mustprogress"}
!527 = !DILocation(line: 44, column: 22, scope: !460)
!528 = !DILocation(line: 45, column: 3, scope: !529)
!529 = distinct !DILexicalBlock(scope: !530, file: !447, line: 45, column: 3)
!530 = distinct !DILexicalBlock(scope: !531, file: !447, line: 45, column: 3)
!531 = distinct !DILexicalBlock(scope: !460, file: !447, line: 45, column: 3)
!532 = !DILocation(line: 45, column: 3, scope: !530)
!533 = !DILocation(line: 45, column: 3, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !447, line: 45, column: 3)
!535 = distinct !DILexicalBlock(scope: !529, file: !447, line: 45, column: 3)
!536 = !DILocation(line: 45, column: 3, scope: !535)
!537 = !DILocation(line: 45, column: 3, scope: !538)
!538 = distinct !DILexicalBlock(scope: !539, file: !447, line: 45, column: 3)
!539 = distinct !DILexicalBlock(scope: !534, file: !447, line: 45, column: 3)
!540 = !{!486, !479, i64 1544}
!541 = !DILocation(line: 45, column: 3, scope: !539)
!542 = !DILocation(line: 45, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !447, line: 45, column: 3)
!544 = !DILocation(line: 45, column: 3, scope: !545)
!545 = distinct !DILexicalBlock(scope: !534, file: !447, line: 45, column: 3)
!546 = !DILocation(line: 45, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !545, file: !447, line: 45, column: 3)
!548 = !DILocation(line: 45, column: 3, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !447, line: 45, column: 3)
!550 = distinct !DILexicalBlock(scope: !547, file: !447, line: 45, column: 3)
!551 = !DILocation(line: 45, column: 3, scope: !550)
!552 = !DILocation(line: 45, column: 3, scope: !553)
!553 = distinct !DILexicalBlock(scope: !549, file: !447, line: 45, column: 3)
!554 = !DILocation(line: 46, column: 1, scope: !460)
!555 = !DISubprogram(name: "PetscError", scope: !36, file: !36, line: 668, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!143, !123, !133, !162, !162, !133, !35, !162, null}
!558 = !{}
!559 = !DISubprogram(name: "PetscCheckPointer", scope: !129, file: !129, line: 183, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !558)
!560 = !DISubroutineType(types: !561)
!561 = !{!5, !562, !41}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!564 = distinct !DISubprogram(name: "SNESLineSearchMonitor", scope: !447, file: !447, line: 64, type: !362, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !565)
!565 = !{!566, !567, !568, !569, !570}
!566 = !DILocalVariable(name: "ls", arg: 1, scope: !564, file: !447, line: 64, type: !344)
!567 = !DILocalVariable(name: "ierr", scope: !564, file: !447, line: 66, type: !143)
!568 = !DILocalVariable(name: "i", scope: !564, file: !447, line: 67, type: !185)
!569 = !DILocalVariable(name: "n", scope: !564, file: !447, line: 67, type: !185)
!570 = !DILocalVariable(name: "ierr__", scope: !571, file: !447, line: 71, type: !143)
!571 = distinct !DILexicalBlock(scope: !572, file: !447, line: 71, column: 60)
!572 = distinct !DILexicalBlock(scope: !573, file: !447, line: 70, column: 23)
!573 = distinct !DILexicalBlock(scope: !574, file: !447, line: 70, column: 3)
!574 = distinct !DILexicalBlock(scope: !564, file: !447, line: 70, column: 3)
!575 = !DILocation(line: 0, scope: !564)
!576 = !DILocation(line: 67, column: 28, scope: !564)
!577 = !DILocation(line: 69, column: 3, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !447, line: 69, column: 3)
!579 = distinct !DILexicalBlock(scope: !580, file: !447, line: 69, column: 3)
!580 = distinct !DILexicalBlock(scope: !564, file: !447, line: 69, column: 3)
!581 = !DILocation(line: 69, column: 3, scope: !579)
!582 = !DILocation(line: 69, column: 3, scope: !583)
!583 = distinct !DILexicalBlock(scope: !584, file: !447, line: 69, column: 3)
!584 = distinct !DILexicalBlock(scope: !578, file: !447, line: 69, column: 3)
!585 = !DILocation(line: 69, column: 3, scope: !584)
!586 = !DILocation(line: 69, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !583, file: !447, line: 69, column: 3)
!588 = !DILocation(line: 70, column: 14, scope: !573)
!589 = !DILocation(line: 70, column: 3, scope: !574)
!590 = distinct !{!590, !589, !591, !526}
!591 = !DILocation(line: 72, column: 3, scope: !574)
!592 = !DILocation(line: 71, column: 14, scope: !572)
!593 = !DILocation(line: 71, column: 37, scope: !572)
!594 = !DILocation(line: 71, column: 12, scope: !572)
!595 = !DILocation(line: 0, scope: !571)
!596 = !DILocation(line: 71, column: 60, scope: !597)
!597 = distinct !DILexicalBlock(scope: !571, file: !447, line: 71, column: 60)
!598 = !DILocation(line: 70, column: 19, scope: !573)
!599 = !DILocation(line: 71, column: 60, scope: !571)
!600 = !DILocation(line: 73, column: 3, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !447, line: 73, column: 3)
!602 = distinct !DILexicalBlock(scope: !603, file: !447, line: 73, column: 3)
!603 = distinct !DILexicalBlock(scope: !564, file: !447, line: 73, column: 3)
!604 = !DILocation(line: 73, column: 3, scope: !602)
!605 = !DILocation(line: 73, column: 3, scope: !606)
!606 = distinct !DILexicalBlock(scope: !607, file: !447, line: 73, column: 3)
!607 = distinct !DILexicalBlock(scope: !601, file: !447, line: 73, column: 3)
!608 = !DILocation(line: 73, column: 3, scope: !607)
!609 = !DILocation(line: 73, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !447, line: 73, column: 3)
!611 = distinct !DILexicalBlock(scope: !606, file: !447, line: 73, column: 3)
!612 = !DILocation(line: 73, column: 3, scope: !611)
!613 = !DILocation(line: 73, column: 3, scope: !614)
!614 = distinct !DILexicalBlock(scope: !610, file: !447, line: 73, column: 3)
!615 = !DILocation(line: 73, column: 3, scope: !616)
!616 = distinct !DILexicalBlock(scope: !606, file: !447, line: 73, column: 3)
!617 = !DILocation(line: 73, column: 3, scope: !618)
!618 = distinct !DILexicalBlock(scope: !616, file: !447, line: 73, column: 3)
!619 = !DILocation(line: 73, column: 3, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !447, line: 73, column: 3)
!621 = distinct !DILexicalBlock(scope: !618, file: !447, line: 73, column: 3)
!622 = !DILocation(line: 73, column: 3, scope: !621)
!623 = !DILocation(line: 73, column: 3, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !447, line: 73, column: 3)
!625 = !DILocation(line: 74, column: 1, scope: !564)
!626 = distinct !DISubprogram(name: "SNESLineSearchMonitorSet", scope: !447, file: !447, line: 103, type: !627, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!143, !344, !341, !125, !435}
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637}
!630 = !DILocalVariable(name: "ls", arg: 1, scope: !626, file: !447, line: 103, type: !344)
!631 = !DILocalVariable(name: "f", arg: 2, scope: !626, file: !447, line: 103, type: !341)
!632 = !DILocalVariable(name: "mctx", arg: 3, scope: !626, file: !447, line: 103, type: !125)
!633 = !DILocalVariable(name: "monitordestroy", arg: 4, scope: !626, file: !447, line: 103, type: !435)
!634 = !DILocalVariable(name: "ierr", scope: !626, file: !447, line: 105, type: !143)
!635 = !DILocalVariable(name: "i", scope: !626, file: !447, line: 106, type: !185)
!636 = !DILocalVariable(name: "identical", scope: !626, file: !447, line: 107, type: !300)
!637 = !DILocalVariable(name: "ierr__", scope: !638, file: !447, line: 112, type: !143)
!638 = distinct !DILexicalBlock(scope: !639, file: !447, line: 112, column: 181)
!639 = distinct !DILexicalBlock(scope: !640, file: !447, line: 111, column: 39)
!640 = distinct !DILexicalBlock(scope: !641, file: !447, line: 111, column: 3)
!641 = distinct !DILexicalBlock(scope: !626, file: !447, line: 111, column: 3)
!642 = !DILocation(line: 0, scope: !626)
!643 = !DILocation(line: 107, column: 3, scope: !626)
!644 = !DILocation(line: 109, column: 3, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !447, line: 109, column: 3)
!646 = distinct !DILexicalBlock(scope: !647, file: !447, line: 109, column: 3)
!647 = distinct !DILexicalBlock(scope: !626, file: !447, line: 109, column: 3)
!648 = !DILocation(line: 109, column: 3, scope: !646)
!649 = !DILocation(line: 109, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !447, line: 109, column: 3)
!651 = distinct !DILexicalBlock(scope: !645, file: !447, line: 109, column: 3)
!652 = !DILocation(line: 109, column: 3, scope: !651)
!653 = !DILocation(line: 109, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !650, file: !447, line: 109, column: 3)
!655 = !DILocation(line: 110, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !447, line: 110, column: 3)
!657 = distinct !DILexicalBlock(scope: !626, file: !447, line: 110, column: 3)
!658 = !DILocation(line: 110, column: 3, scope: !657)
!659 = !DILocation(line: 110, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !657, file: !447, line: 110, column: 3)
!661 = !DILocation(line: 110, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !447, line: 110, column: 3)
!663 = !DILocation(line: 111, column: 19, scope: !640)
!664 = !DILocation(line: 111, column: 14, scope: !640)
!665 = !DILocation(line: 111, column: 3, scope: !641)
!666 = !DILocation(line: 110, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !447, line: 110, column: 3)
!668 = distinct !DILexicalBlock(scope: !662, file: !447, line: 110, column: 3)
!669 = !DILocation(line: 110, column: 3, scope: !668)
!670 = distinct !{!670, !665, !671, !526}
!671 = !DILocation(line: 114, column: 3, scope: !641)
!672 = !DILocation(line: 112, column: 106, scope: !639)
!673 = !DILocation(line: 112, column: 125, scope: !639)
!674 = !DILocation(line: 112, column: 147, scope: !639)
!675 = !DILocation(line: 112, column: 12, scope: !639)
!676 = !DILocation(line: 0, scope: !638)
!677 = !DILocation(line: 112, column: 181, scope: !678)
!678 = distinct !DILexicalBlock(scope: !638, file: !447, line: 112, column: 181)
!679 = !DILocation(line: 112, column: 181, scope: !638)
!680 = !DILocation(line: 113, column: 9, scope: !681)
!681 = distinct !DILexicalBlock(scope: !639, file: !447, line: 113, column: 9)
!682 = !{!479, !479, i64 0}
!683 = !DILocation(line: 111, column: 35, scope: !640)
!684 = !DILocation(line: 113, column: 9, scope: !639)
!685 = !DILocation(line: 113, column: 20, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !447, line: 113, column: 20)
!687 = distinct !DILexicalBlock(scope: !688, file: !447, line: 113, column: 20)
!688 = distinct !DILexicalBlock(scope: !681, file: !447, line: 113, column: 20)
!689 = !DILocation(line: 113, column: 20, scope: !687)
!690 = !DILocation(line: 113, column: 20, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !447, line: 113, column: 20)
!692 = distinct !DILexicalBlock(scope: !686, file: !447, line: 113, column: 20)
!693 = !DILocation(line: 113, column: 20, scope: !692)
!694 = !DILocation(line: 113, column: 20, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !447, line: 113, column: 20)
!696 = distinct !DILexicalBlock(scope: !691, file: !447, line: 113, column: 20)
!697 = !DILocation(line: 113, column: 20, scope: !696)
!698 = !DILocation(line: 113, column: 20, scope: !699)
!699 = distinct !DILexicalBlock(scope: !695, file: !447, line: 113, column: 20)
!700 = !DILocation(line: 113, column: 20, scope: !701)
!701 = distinct !DILexicalBlock(scope: !691, file: !447, line: 113, column: 20)
!702 = !DILocation(line: 113, column: 20, scope: !703)
!703 = distinct !DILexicalBlock(scope: !701, file: !447, line: 113, column: 20)
!704 = !DILocation(line: 113, column: 20, scope: !705)
!705 = distinct !DILexicalBlock(scope: !706, file: !447, line: 113, column: 20)
!706 = distinct !DILexicalBlock(scope: !703, file: !447, line: 113, column: 20)
!707 = !DILocation(line: 113, column: 20, scope: !706)
!708 = !DILocation(line: 113, column: 20, scope: !709)
!709 = distinct !DILexicalBlock(scope: !705, file: !447, line: 113, column: 20)
!710 = !DILocation(line: 115, column: 26, scope: !711)
!711 = distinct !DILexicalBlock(scope: !626, file: !447, line: 115, column: 7)
!712 = !DILocation(line: 115, column: 7, scope: !626)
!713 = !DILocation(line: 115, column: 48, scope: !711)
!714 = !DILocation(line: 116, column: 3, scope: !626)
!715 = !DILocation(line: 116, column: 48, scope: !626)
!716 = !DILocation(line: 117, column: 3, scope: !626)
!717 = !DILocation(line: 117, column: 44, scope: !626)
!718 = !DILocation(line: 118, column: 40, scope: !626)
!719 = !DILocation(line: 118, column: 3, scope: !626)
!720 = !DILocation(line: 118, column: 44, scope: !626)
!721 = !DILocation(line: 119, column: 3, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !447, line: 119, column: 3)
!723 = distinct !DILexicalBlock(scope: !724, file: !447, line: 119, column: 3)
!724 = distinct !DILexicalBlock(scope: !626, file: !447, line: 119, column: 3)
!725 = !DILocation(line: 119, column: 3, scope: !723)
!726 = !DILocation(line: 119, column: 3, scope: !727)
!727 = distinct !DILexicalBlock(scope: !728, file: !447, line: 119, column: 3)
!728 = distinct !DILexicalBlock(scope: !722, file: !447, line: 119, column: 3)
!729 = !DILocation(line: 119, column: 3, scope: !728)
!730 = !DILocation(line: 119, column: 3, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !447, line: 119, column: 3)
!732 = distinct !DILexicalBlock(scope: !727, file: !447, line: 119, column: 3)
!733 = !DILocation(line: 119, column: 3, scope: !732)
!734 = !DILocation(line: 119, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !731, file: !447, line: 119, column: 3)
!736 = !DILocation(line: 119, column: 3, scope: !737)
!737 = distinct !DILexicalBlock(scope: !727, file: !447, line: 119, column: 3)
!738 = !DILocation(line: 119, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !737, file: !447, line: 119, column: 3)
!740 = !DILocation(line: 119, column: 3, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !447, line: 119, column: 3)
!742 = distinct !DILexicalBlock(scope: !739, file: !447, line: 119, column: 3)
!743 = !DILocation(line: 119, column: 3, scope: !742)
!744 = !DILocation(line: 119, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !741, file: !447, line: 119, column: 3)
!746 = !DILocation(line: 120, column: 1, scope: !626)
!747 = !DISubprogram(name: "PetscMonitorCompare", scope: !443, file: !443, line: 1444, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !558)
!748 = !DISubroutineType(types: !749)
!749 = !{!133, !750, !125, !753, !750, !125, !753, !756}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!133}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!133, !438}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!757 = distinct !DISubprogram(name: "SNESLineSearchMonitorSolutionUpdate", scope: !447, file: !447, line: 135, type: !758, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!758 = !DISubroutineType(types: !759)
!759 = !{!143, !344, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !62, line: 178, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 178, size: 256, elements: !763)
!763 = !{!764, !765, !767, !772}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !762, file: !62, line: 178, baseType: !149, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !762, file: !62, line: 178, baseType: !766, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !62, line: 162, baseType: !61)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !762, file: !62, line: 178, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !769, line: 43, baseType: !770)
!769 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !769, line: 43, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !762, file: !62, line: 178, baseType: !125, size: 64, offset: 192)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !783, !785, !787, !789, !791, !793, !795, !797}
!774 = !DILocalVariable(name: "ls", arg: 1, scope: !757, file: !447, line: 135, type: !344)
!775 = !DILocalVariable(name: "vf", arg: 2, scope: !757, file: !447, line: 135, type: !760)
!776 = !DILocalVariable(name: "ierr", scope: !757, file: !447, line: 137, type: !143)
!777 = !DILocalVariable(name: "viewer", scope: !757, file: !447, line: 138, type: !149)
!778 = !DILocalVariable(name: "Y", scope: !757, file: !447, line: 139, type: !368)
!779 = !DILocalVariable(name: "W", scope: !757, file: !447, line: 139, type: !368)
!780 = !DILocalVariable(name: "G", scope: !757, file: !447, line: 139, type: !368)
!781 = !DILocalVariable(name: "ierr__", scope: !782, file: !447, line: 142, type: !143)
!782 = distinct !DILexicalBlock(scope: !757, file: !447, line: 142, column: 55)
!783 = !DILocalVariable(name: "ierr__", scope: !784, file: !447, line: 143, type: !143)
!784 = distinct !DILexicalBlock(scope: !757, file: !447, line: 143, column: 51)
!785 = !DILocalVariable(name: "ierr__", scope: !786, file: !447, line: 144, type: !143)
!786 = distinct !DILexicalBlock(scope: !757, file: !447, line: 144, column: 86)
!787 = !DILocalVariable(name: "ierr__", scope: !788, file: !447, line: 145, type: !143)
!788 = distinct !DILexicalBlock(scope: !757, file: !447, line: 145, column: 28)
!789 = !DILocalVariable(name: "ierr__", scope: !790, file: !447, line: 146, type: !143)
!790 = distinct !DILexicalBlock(scope: !757, file: !447, line: 146, column: 80)
!791 = !DILocalVariable(name: "ierr__", scope: !792, file: !447, line: 147, type: !143)
!792 = distinct !DILexicalBlock(scope: !757, file: !447, line: 147, column: 28)
!793 = !DILocalVariable(name: "ierr__", scope: !794, file: !447, line: 148, type: !143)
!794 = distinct !DILexicalBlock(scope: !757, file: !447, line: 148, column: 89)
!795 = !DILocalVariable(name: "ierr__", scope: !796, file: !447, line: 149, type: !143)
!796 = distinct !DILexicalBlock(scope: !757, file: !447, line: 149, column: 28)
!797 = !DILocalVariable(name: "ierr__", scope: !798, file: !447, line: 150, type: !143)
!798 = distinct !DILexicalBlock(scope: !757, file: !447, line: 150, column: 39)
!799 = !DILocation(line: 0, scope: !757)
!800 = !DILocation(line: 138, column: 31, scope: !757)
!801 = !{!802, !478, i64 0}
!802 = !{!"", !478, i64 0, !479, i64 8, !478, i64 16, !478, i64 24}
!803 = !DILocation(line: 139, column: 3, scope: !757)
!804 = !DILocation(line: 141, column: 3, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !447, line: 141, column: 3)
!806 = distinct !DILexicalBlock(scope: !807, file: !447, line: 141, column: 3)
!807 = distinct !DILexicalBlock(scope: !757, file: !447, line: 141, column: 3)
!808 = !DILocation(line: 141, column: 3, scope: !806)
!809 = !DILocation(line: 141, column: 3, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !447, line: 141, column: 3)
!811 = distinct !DILexicalBlock(scope: !805, file: !447, line: 141, column: 3)
!812 = !DILocation(line: 141, column: 3, scope: !811)
!813 = !DILocation(line: 141, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !810, file: !447, line: 141, column: 3)
!815 = !DILocation(line: 142, column: 10, scope: !757)
!816 = !DILocation(line: 0, scope: !782)
!817 = !DILocation(line: 142, column: 55, scope: !818)
!818 = distinct !DILexicalBlock(scope: !782, file: !447, line: 142, column: 55)
!819 = !DILocation(line: 142, column: 55, scope: !782)
!820 = !DILocation(line: 143, column: 43, scope: !757)
!821 = !{!802, !479, i64 8}
!822 = !DILocation(line: 143, column: 10, scope: !757)
!823 = !DILocation(line: 0, scope: !784)
!824 = !DILocation(line: 143, column: 51, scope: !825)
!825 = distinct !DILexicalBlock(scope: !784, file: !447, line: 143, column: 51)
!826 = !DILocation(line: 143, column: 51, scope: !784)
