; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baijsolvtrann.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baijsolvtrann.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !401, !480, !551, !422, !470, !1395}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqBAIJ", file: !323, line: 31, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/baij/seq/baij.h", directory: "/home/users/ndemeye/xSDK")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 28, size: 2240, elements: !325)
!325 = !{!326, !328, !330, !331, !332, !333, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !353, !354, !355, !356, !357, !358, !359, !366, !368, !373, !374, !375, !376, !1344, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !324, file: !323, line: 29, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 480)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 544)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !324, file: !323, line: 29, baseType: !345, size: 192, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !346, line: 407, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 402, size: 192, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !347, file: !346, line: 403, baseType: !327, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !347, file: !346, line: 404, baseType: !329, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !347, file: !346, line: 405, baseType: !334, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !347, file: !346, line: 406, baseType: !334, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !324, file: !323, line: 29, baseType: !334, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !324, file: !323, line: 29, baseType: !329, size: 32, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 1120)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !324, file: !323, line: 29, baseType: !360, size: 64, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !362, line: 799, baseType: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !365)
!365 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !324, file: !323, line: 29, baseType: !367, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !324, file: !323, line: 29, baseType: !369, size: 64, offset: 1280)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !370, line: 11, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !370, line: 11, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !324, file: !323, line: 29, baseType: !369, size: 64, offset: 1344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !324, file: !323, line: 29, baseType: !369, size: 64, offset: 1408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !324, file: !323, line: 29, baseType: !327, size: 32, offset: 1472)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !324, file: !323, line: 29, baseType: !377, size: 64, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !346, line: 436, size: 23424, elements: !380)
!380 = !{!381, !584, !1087, !1107, !1108, !1109, !1111, !1112, !1113, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1240, !1241, !1257, !1258, !1259, !1260, !1261, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1296, !1316, !1317, !1319, !1320, !1321, !1322, !1323, !1324, !1342, !1343}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !379, file: !346, line: 437, baseType: !382, size: 4480)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !383, line: 122, baseType: !384)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !383, line: 73, size: 4480, elements: !385)
!385 = !{!386, !388, !443, !444, !445, !447, !448, !449, !450, !458, !459, !461, !465, !469, !471, !472, !473, !474, !475, !476, !477, !478, !479, !481, !483, !484, !485, !487, !488, !489, !491, !492, !493, !494, !495, !497, !499, !500, !501, !502, !503, !504, !506, !507, !508, !518, !520, !521, !525, !526, !574, !579, !581, !582, !583}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !384, file: !383, line: 74, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !384, file: !383, line: 75, baseType: !389, size: 448, offset: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 448, elements: !441)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !383, line: 53, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 45, size: 448, elements: !392)
!392 = !{!393, !405, !413, !418, !425, !429, !436}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !391, file: !383, line: 46, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !398, !400}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !402, line: 330, baseType: !403)
!402 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !402, line: 330, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !391, file: !383, line: 47, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!397, !398, !409}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !410, line: 16, baseType: !411)
!410 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !410, line: 16, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !391, file: !383, line: 48, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!397, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !391, file: !383, line: 49, baseType: !419, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!397, !398, !422, !398}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !391, file: !383, line: 50, baseType: !426, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!397, !398, !422, !417}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !391, file: !383, line: 51, baseType: !430, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!397, !398, !422, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !391, file: !383, line: 52, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!397, !398, !422, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!441 = !{!442}
!442 = !DISubrange(count: 1)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !384, file: !383, line: 76, baseType: !401, size: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !383, line: 77, baseType: !329, size: 32, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !384, file: !383, line: 78, baseType: !446, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !365)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !384, file: !383, line: 78, baseType: !446, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !384, file: !383, line: 78, baseType: !446, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !384, file: !383, line: 78, baseType: !446, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !384, file: !383, line: 79, baseType: !451, size: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !454, line: 27, baseType: !455)
!454 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !456, line: 43, baseType: !457)
!456 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!457 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !384, file: !383, line: 80, baseType: !329, size: 32, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !384, file: !383, line: 81, baseType: !460, size: 32, offset: 992)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !384, file: !383, line: 82, baseType: !462, size: 64, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !384, file: !383, line: 83, baseType: !466, size: 64, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !384, file: !383, line: 84, baseType: !470, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !384, file: !383, line: 85, baseType: !470, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !384, file: !383, line: 86, baseType: !470, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !384, file: !383, line: 87, baseType: !470, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !384, file: !383, line: 88, baseType: !398, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !384, file: !383, line: 89, baseType: !451, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !383, line: 90, baseType: !470, size: 64, offset: 1536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !384, file: !383, line: 91, baseType: !470, size: 64, offset: 1600)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !384, file: !383, line: 92, baseType: !329, size: 32, offset: 1664)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !384, file: !383, line: 93, baseType: !480, size: 64, offset: 1728)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !384, file: !383, line: 94, baseType: !482, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !452)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !384, file: !383, line: 95, baseType: !329, size: 32, offset: 1856)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !384, file: !383, line: 95, baseType: !329, size: 32, offset: 1888)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !384, file: !383, line: 96, baseType: !486, size: 64, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !384, file: !383, line: 96, baseType: !486, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !384, file: !383, line: 97, baseType: !334, size: 64, offset: 2048)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !384, file: !383, line: 97, baseType: !490, size: 64, offset: 2112)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !384, file: !383, line: 98, baseType: !329, size: 32, offset: 2176)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !384, file: !383, line: 98, baseType: !329, size: 32, offset: 2208)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !384, file: !383, line: 99, baseType: !486, size: 64, offset: 2240)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !384, file: !383, line: 99, baseType: !486, size: 64, offset: 2304)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !384, file: !383, line: 100, baseType: !496, size: 64, offset: 2368)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !384, file: !383, line: 100, baseType: !498, size: 64, offset: 2432)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !384, file: !383, line: 101, baseType: !329, size: 32, offset: 2496)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !384, file: !383, line: 101, baseType: !329, size: 32, offset: 2528)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !384, file: !383, line: 102, baseType: !486, size: 64, offset: 2560)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !384, file: !383, line: 102, baseType: !486, size: 64, offset: 2624)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !384, file: !383, line: 103, baseType: !367, size: 64, offset: 2688)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !384, file: !383, line: 103, baseType: !505, size: 64, offset: 2752)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !384, file: !383, line: 104, baseType: !440, size: 64, offset: 2816)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !384, file: !383, line: 105, baseType: !329, size: 32, offset: 2880)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !384, file: !383, line: 106, baseType: !509, size: 128, offset: 2944)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 128, elements: !516)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !383, line: 64, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 61, size: 128, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !512, file: !383, line: 62, baseType: !433, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !512, file: !383, line: 63, baseType: !480, size: 64, offset: 64)
!516 = !{!517}
!517 = !DISubrange(count: 2)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !384, file: !383, line: 107, baseType: !519, size: 64, offset: 3072)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, elements: !516)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !384, file: !383, line: 108, baseType: !480, size: 64, offset: 3136)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !384, file: !383, line: 109, baseType: !522, size: 64, offset: 3200)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!397, !480}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !384, file: !383, line: 111, baseType: !329, size: 32, offset: 3264)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !384, file: !383, line: 112, baseType: !527, size: 320, offset: 3328)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !572)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!397, !531, !398, !480}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !534)
!534 = !{!535, !536, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !533, file: !10, line: 100, baseType: !329, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !10, line: 101, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !548, !549, !550, !554, !555, !557, !558, !559}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !539, file: !10, line: 84, baseType: !470, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !539, file: !10, line: 85, baseType: !470, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !10, line: 86, baseType: !480, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !539, file: !10, line: 87, baseType: !462, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !539, file: !10, line: 88, baseType: !546, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !539, file: !10, line: 89, baseType: !424, size: 8, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !539, file: !10, line: 90, baseType: !470, size: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !539, file: !10, line: 91, baseType: !551, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !552, line: 46, baseType: !553)
!552 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!553 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !539, file: !10, line: 92, baseType: !327, size: 32, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !10, line: 93, baseType: !556, size: 32, offset: 544)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !10, line: 94, baseType: !537, size: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !539, file: !10, line: 95, baseType: !470, size: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !539, file: !10, line: 96, baseType: !480, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !533, file: !10, line: 102, baseType: !470, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !533, file: !10, line: 102, baseType: !470, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !533, file: !10, line: 103, baseType: !470, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !533, file: !10, line: 104, baseType: !401, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !533, file: !10, line: 105, baseType: !327, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !533, file: !10, line: 105, baseType: !327, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !533, file: !10, line: 105, baseType: !327, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !533, file: !10, line: 106, baseType: !398, size: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !533, file: !10, line: 107, baseType: !569, size: 64, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!572 = !{!573}
!573 = !DISubrange(count: 5)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !384, file: !383, line: 113, baseType: !575, size: 320, offset: 3648)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 320, elements: !572)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!397, !398, !480}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !384, file: !383, line: 114, baseType: !580, size: 320, offset: 3968)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 320, elements: !572)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !384, file: !383, line: 115, baseType: !327, size: 32, offset: 4288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !384, file: !383, line: 120, baseType: !569, size: 64, offset: 4352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !384, file: !383, line: 121, baseType: !327, size: 32, offset: 4416)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !379, file: !346, line: 437, baseType: !585, size: 9472, offset: 4480)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 9472, elements: !441)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !346, line: 32, size: 9472, elements: !587)
!587 = !{!588, !597, !601, !602, !609, !613, !614, !615, !616, !617, !618, !619, !639, !643, !648, !654, !673, !678, !682, !683, !688, !693, !694, !699, !703, !707, !711, !715, !719, !720, !721, !722, !723, !727, !728, !733, !734, !735, !736, !737, !742, !749, !754, !758, !762, !766, !770, !771, !775, !776, !783, !788, !789, !790, !791, !853, !861, !862, !866, !867, !871, !872, !876, !881, !882, !886, !890, !897, !898, !899, !900, !901, !902, !907, !908, !912, !916, !920, !921, !922, !926, !936, !937, !941, !942, !946, !947, !951, !952, !957, !958, !962, !966, !967, !968, !969, !970, !971, !972, !976, !977, !978, !979, !980, !981, !985, !986, !987, !988, !989, !990, !991, !992, !996, !1000, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1016, !1017, !1018, !1023, !1027, !1028, !1032, !1033, !1034, !1035, !1061, !1065, !1066, !1067, !1068, !1069, !1073, !1074, !1075, !1076, !1077, !1081, !1085, !1086}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !586, file: !346, line: 34, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!397, !377, !329, !592, !329, !592, !594, !596}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !586, file: !346, line: 35, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!397, !377, !329, !334, !490, !505}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !586, file: !346, line: 36, baseType: !598, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !586, file: !346, line: 37, baseType: !603, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!397, !377, !606, !606}
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !586, file: !346, line: 38, baseType: !610, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!397, !377, !606, !606, !606}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !586, file: !346, line: 40, baseType: !603, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !586, file: !346, line: 41, baseType: !610, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !586, file: !346, line: 42, baseType: !603, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !586, file: !346, line: 43, baseType: !610, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !586, file: !346, line: 44, baseType: !603, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !586, file: !346, line: 46, baseType: !610, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !586, file: !346, line: 47, baseType: !620, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!397, !377, !369, !369, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !626, file: !36, line: 1227, baseType: !364, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !626, file: !36, line: 1228, baseType: !364, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !626, file: !36, line: 1229, baseType: !364, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !626, file: !36, line: 1230, baseType: !364, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !626, file: !36, line: 1231, baseType: !364, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !626, file: !36, line: 1232, baseType: !364, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !626, file: !36, line: 1233, baseType: !364, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !626, file: !36, line: 1234, baseType: !364, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !626, file: !36, line: 1236, baseType: !364, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !626, file: !36, line: 1237, baseType: !364, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !626, file: !36, line: 1238, baseType: !364, size: 64, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !586, file: !346, line: 48, baseType: !640, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!397, !377, !369, !623}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !586, file: !346, line: 49, baseType: !644, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!397, !377, !606, !364, !647, !364, !329, !329, !606}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !586, file: !346, line: 50, baseType: !649, size: 64, offset: 896)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!397, !377, !652, !653}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !586, file: !346, line: 52, baseType: !655, size: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!397, !377, !658, !659}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !661, file: !36, line: 593, baseType: !446, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !661, file: !36, line: 594, baseType: !446, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !661, file: !36, line: 594, baseType: !446, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !661, file: !36, line: 594, baseType: !446, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !661, file: !36, line: 595, baseType: !446, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !661, file: !36, line: 596, baseType: !446, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !661, file: !36, line: 597, baseType: !446, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !661, file: !36, line: 598, baseType: !446, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !661, file: !36, line: 598, baseType: !446, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !661, file: !36, line: 599, baseType: !446, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !586, file: !346, line: 53, baseType: !674, size: 64, offset: 1024)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!397, !377, !377, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !586, file: !346, line: 54, baseType: !679, size: 64, offset: 1088)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!397, !377, !606}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !586, file: !346, line: 55, baseType: !603, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !586, file: !346, line: 56, baseType: !684, size: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!397, !377, !687, !496}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !586, file: !346, line: 58, baseType: !689, size: 64, offset: 1280)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!397, !377, !692}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !586, file: !346, line: 59, baseType: !689, size: 64, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !586, file: !346, line: 60, baseType: !695, size: 64, offset: 1408)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!397, !377, !698, !327}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !586, file: !346, line: 61, baseType: !700, size: 64, offset: 1472)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!397, !377}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !586, file: !346, line: 63, baseType: !704, size: 64, offset: 1536)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!397, !377, !329, !592, !363, !606, !606}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !586, file: !346, line: 64, baseType: !708, size: 64, offset: 1600)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!397, !377, !377, !369, !369, !623}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !586, file: !346, line: 65, baseType: !712, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!397, !377, !377, !623}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !586, file: !346, line: 66, baseType: !716, size: 64, offset: 1728)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!397, !377, !377, !369, !623}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !586, file: !346, line: 67, baseType: !712, size: 64, offset: 1792)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !586, file: !346, line: 69, baseType: !700, size: 64, offset: 1856)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !586, file: !346, line: 70, baseType: !708, size: 64, offset: 1920)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !586, file: !346, line: 71, baseType: !716, size: 64, offset: 1984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !586, file: !346, line: 72, baseType: !724, size: 64, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!397, !377, !653}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !586, file: !346, line: 73, baseType: !700, size: 64, offset: 2112)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !586, file: !346, line: 75, baseType: !729, size: 64, offset: 2176)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!397, !377, !732, !653}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !586, file: !346, line: 76, baseType: !603, size: 64, offset: 2240)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !586, file: !346, line: 77, baseType: !603, size: 64, offset: 2304)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !586, file: !346, line: 78, baseType: !620, size: 64, offset: 2368)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !586, file: !346, line: 79, baseType: !640, size: 64, offset: 2432)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !586, file: !346, line: 81, baseType: !738, size: 64, offset: 2496)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!397, !377, !363, !377, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !586, file: !346, line: 82, baseType: !743, size: 64, offset: 2560)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!397, !377, !329, !746, !746, !652, !748}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !586, file: !346, line: 83, baseType: !750, size: 64, offset: 2624)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!397, !377, !329, !753, !329}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !586, file: !346, line: 84, baseType: !755, size: 64, offset: 2688)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!397, !377, !329, !592, !329, !592, !367}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !586, file: !346, line: 85, baseType: !759, size: 64, offset: 2752)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!397, !377, !377, !741}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !586, file: !346, line: 87, baseType: !763, size: 64, offset: 2816)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!397, !377, !606, !334}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !586, file: !346, line: 88, baseType: !767, size: 64, offset: 2880)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!397, !377, !363}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !586, file: !346, line: 89, baseType: !767, size: 64, offset: 2944)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !586, file: !346, line: 90, baseType: !772, size: 64, offset: 3008)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!397, !377, !606, !596}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !586, file: !346, line: 91, baseType: !704, size: 64, offset: 3072)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !586, file: !346, line: 93, baseType: !777, size: 64, offset: 3136)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!397, !377, !780}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !586, file: !346, line: 94, baseType: !784, size: 64, offset: 3200)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!397, !377, !329, !327, !327, !334, !787, !787, !677}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !586, file: !346, line: 95, baseType: !784, size: 64, offset: 3264)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !586, file: !346, line: 96, baseType: !784, size: 64, offset: 3328)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !586, file: !346, line: 97, baseType: !784, size: 64, offset: 3392)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !586, file: !346, line: 99, baseType: !792, size: 64, offset: 3456)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!397, !377, !795, !798}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !370, line: 51, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !370, line: 51, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !346, line: 609, size: 6208, elements: !801)
!801 = !{!802, !803, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !822, !829, !830, !831, !832, !833, !834, !835, !836, !840, !841, !842, !843, !844, !846, !847, !848, !849, !850, !851, !852}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !800, file: !346, line: 610, baseType: !382, size: 4480)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !800, file: !346, line: 610, baseType: !804, size: 32, offset: 4480)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !441)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !800, file: !346, line: 611, baseType: !329, size: 32, offset: 4512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !800, file: !346, line: 611, baseType: !329, size: 32, offset: 4544)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !800, file: !346, line: 611, baseType: !329, size: 32, offset: 4576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !800, file: !346, line: 612, baseType: !329, size: 32, offset: 4608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !800, file: !346, line: 613, baseType: !329, size: 32, offset: 4640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !800, file: !346, line: 614, baseType: !334, size: 64, offset: 4672)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !800, file: !346, line: 615, baseType: !490, size: 64, offset: 4736)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !800, file: !346, line: 616, baseType: !753, size: 64, offset: 4800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !800, file: !346, line: 617, baseType: !334, size: 64, offset: 4864)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !800, file: !346, line: 618, baseType: !815, size: 64, offset: 4928)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !346, line: 602, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 598, size: 128, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !817, file: !346, line: 599, baseType: !329, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !817, file: !346, line: 600, baseType: !329, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !817, file: !346, line: 601, baseType: !367, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !800, file: !346, line: 619, baseType: !823, size: 64, offset: 4992)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !346, line: 607, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 604, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !825, file: !346, line: 605, baseType: !329, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !825, file: !346, line: 606, baseType: !367, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !800, file: !346, line: 620, baseType: !367, size: 64, offset: 5056)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !800, file: !346, line: 621, baseType: !364, size: 64, offset: 5120)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !800, file: !346, line: 622, baseType: !364, size: 64, offset: 5184)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !800, file: !346, line: 623, baseType: !606, size: 64, offset: 5248)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !800, file: !346, line: 623, baseType: !606, size: 64, offset: 5312)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !800, file: !346, line: 623, baseType: !606, size: 64, offset: 5376)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !800, file: !346, line: 624, baseType: !327, size: 32, offset: 5440)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !800, file: !346, line: 625, baseType: !837, size: 64, offset: 5504)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!397}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !800, file: !346, line: 626, baseType: !480, size: 64, offset: 5568)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !800, file: !346, line: 627, baseType: !606, size: 64, offset: 5632)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !800, file: !346, line: 628, baseType: !329, size: 32, offset: 5696)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !800, file: !346, line: 629, baseType: !422, size: 64, offset: 5760)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !800, file: !346, line: 630, baseType: !845, size: 32, offset: 5824)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !800, file: !346, line: 631, baseType: !329, size: 32, offset: 5856)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !800, file: !346, line: 631, baseType: !329, size: 32, offset: 5888)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !800, file: !346, line: 632, baseType: !327, size: 32, offset: 5920)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !800, file: !346, line: 633, baseType: !327, size: 32, offset: 5952)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !800, file: !346, line: 634, baseType: !433, size: 64, offset: 6016)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !800, file: !346, line: 634, baseType: !480, size: 64, offset: 6080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !800, file: !346, line: 635, baseType: !451, size: 64, offset: 6144)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !586, file: !346, line: 100, baseType: !854, size: 64, offset: 3520)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!397, !377, !329, !329, !857, !860}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !859)
!859 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !586, file: !346, line: 101, baseType: !700, size: 64, offset: 3584)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !586, file: !346, line: 102, baseType: !863, size: 64, offset: 3648)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!397, !377, !369, !369, !653}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !586, file: !346, line: 103, baseType: !589, size: 64, offset: 3712)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !586, file: !346, line: 105, baseType: !868, size: 64, offset: 3776)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!397, !377, !369, !369, !652, !653}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !586, file: !346, line: 106, baseType: !700, size: 64, offset: 3840)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !586, file: !346, line: 107, baseType: !873, size: 64, offset: 3904)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!397, !377, !409}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !586, file: !346, line: 108, baseType: !877, size: 64, offset: 3968)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!397, !377, !880, !652, !653}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !422)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !586, file: !346, line: 109, baseType: !837, size: 64, offset: 4032)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !586, file: !346, line: 111, baseType: !883, size: 64, offset: 4096)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!397, !377, !377, !377, !364, !377}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !586, file: !346, line: 112, baseType: !887, size: 64, offset: 4160)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!397, !377, !377, !377, !377}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !586, file: !346, line: 113, baseType: !891, size: 64, offset: 4224)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!397, !377, !894, !894}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !370, line: 30, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !370, line: 30, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !586, file: !346, line: 114, baseType: !589, size: 64, offset: 4288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !586, file: !346, line: 115, baseType: !704, size: 64, offset: 4352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !586, file: !346, line: 117, baseType: !763, size: 64, offset: 4416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !586, file: !346, line: 118, baseType: !763, size: 64, offset: 4480)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !586, file: !346, line: 119, baseType: !877, size: 64, offset: 4544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !586, file: !346, line: 120, baseType: !903, size: 64, offset: 4608)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!397, !377, !906, !677}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !586, file: !346, line: 121, baseType: !837, size: 64, offset: 4672)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !586, file: !346, line: 123, baseType: !909, size: 64, offset: 4736)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!397, !377, !329, !480}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !586, file: !346, line: 124, baseType: !913, size: 64, offset: 4800)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!397, !377, !798, !606, !480}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !586, file: !346, line: 125, baseType: !917, size: 64, offset: 4864)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!397, !531, !377}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !586, file: !346, line: 126, baseType: !603, size: 64, offset: 4928)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !586, file: !346, line: 127, baseType: !603, size: 64, offset: 4992)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !586, file: !346, line: 129, baseType: !923, size: 64, offset: 5056)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!397, !377, !753}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !586, file: !346, line: 130, baseType: !927, size: 64, offset: 5120)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!397, !377, !930, !930}
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !932, file: !60, line: 653, baseType: !329, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !932, file: !60, line: 653, baseType: !606, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !586, file: !346, line: 131, baseType: !927, size: 64, offset: 5184)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !586, file: !346, line: 132, baseType: !938, size: 64, offset: 5248)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!397, !377, !334, !334, !334}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !586, file: !346, line: 133, baseType: !873, size: 64, offset: 5312)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !586, file: !346, line: 135, baseType: !943, size: 64, offset: 5376)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!397, !377, !364, !677}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !586, file: !346, line: 136, baseType: !943, size: 64, offset: 5440)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !586, file: !346, line: 137, baseType: !948, size: 64, offset: 5504)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!397, !377, !677}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !586, file: !346, line: 138, baseType: !589, size: 64, offset: 5568)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !586, file: !346, line: 139, baseType: !953, size: 64, offset: 5632)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!397, !377, !956, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !586, file: !346, line: 141, baseType: !837, size: 64, offset: 5696)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !586, file: !346, line: 142, baseType: !959, size: 64, offset: 5760)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!397, !377, !377, !364, !377}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !586, file: !346, line: 143, baseType: !963, size: 64, offset: 5824)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!397, !377, !377, !377}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !586, file: !346, line: 144, baseType: !837, size: 64, offset: 5888)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !586, file: !346, line: 145, baseType: !959, size: 64, offset: 5952)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !586, file: !346, line: 147, baseType: !963, size: 64, offset: 6016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !586, file: !346, line: 148, baseType: !837, size: 64, offset: 6080)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !586, file: !346, line: 149, baseType: !959, size: 64, offset: 6144)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !586, file: !346, line: 150, baseType: !963, size: 64, offset: 6208)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !586, file: !346, line: 151, baseType: !973, size: 64, offset: 6272)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!397, !377, !327}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !586, file: !346, line: 153, baseType: !700, size: 64, offset: 6336)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !586, file: !346, line: 154, baseType: !700, size: 64, offset: 6400)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !586, file: !346, line: 155, baseType: !700, size: 64, offset: 6464)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !586, file: !346, line: 156, baseType: !700, size: 64, offset: 6528)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !586, file: !346, line: 157, baseType: !873, size: 64, offset: 6592)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !586, file: !346, line: 159, baseType: !982, size: 64, offset: 6656)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!397, !377, !329, !594}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !586, file: !346, line: 160, baseType: !700, size: 64, offset: 6720)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !586, file: !346, line: 161, baseType: !700, size: 64, offset: 6784)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !586, file: !346, line: 162, baseType: !700, size: 64, offset: 6848)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !586, file: !346, line: 163, baseType: !700, size: 64, offset: 6912)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !586, file: !346, line: 165, baseType: !963, size: 64, offset: 6976)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !586, file: !346, line: 166, baseType: !963, size: 64, offset: 7040)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !586, file: !346, line: 167, baseType: !763, size: 64, offset: 7104)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !586, file: !346, line: 168, baseType: !993, size: 64, offset: 7168)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!397, !377, !606, !329}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !586, file: !346, line: 169, baseType: !997, size: 64, offset: 7232)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!397, !377, !677, !334}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !586, file: !346, line: 171, baseType: !724, size: 64, offset: 7296)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !586, file: !346, line: 172, baseType: !700, size: 64, offset: 7360)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !586, file: !346, line: 173, baseType: !1003, size: 64, offset: 7424)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!397, !377, !334, !787}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !586, file: !346, line: 174, baseType: !863, size: 64, offset: 7488)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !586, file: !346, line: 175, baseType: !863, size: 64, offset: 7552)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !586, file: !346, line: 177, baseType: !603, size: 64, offset: 7616)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !586, file: !346, line: 178, baseType: !649, size: 64, offset: 7680)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !586, file: !346, line: 179, baseType: !603, size: 64, offset: 7744)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !586, file: !346, line: 180, baseType: !610, size: 64, offset: 7808)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !586, file: !346, line: 181, baseType: !1013, size: 64, offset: 7872)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!397, !377, !401, !652, !653}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !586, file: !346, line: 183, baseType: !923, size: 64, offset: 7936)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !586, file: !346, line: 184, baseType: !684, size: 64, offset: 8000)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !586, file: !346, line: 185, baseType: !1019, size: 64, offset: 8064)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!397, !377, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !586, file: !346, line: 186, baseType: !1024, size: 64, offset: 8128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!397, !377, !329, !592, !367}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !586, file: !346, line: 187, baseType: !743, size: 64, offset: 8192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !586, file: !346, line: 189, baseType: !1029, size: 64, offset: 8256)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!397, !377, !329, !329, !334, !594}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !586, file: !346, line: 190, baseType: !837, size: 64, offset: 8320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !586, file: !346, line: 191, baseType: !959, size: 64, offset: 8384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !586, file: !346, line: 192, baseType: !963, size: 64, offset: 8448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !586, file: !346, line: 193, baseType: !1036, size: 64, offset: 8512)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!397, !377, !795, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !346, line: 660, size: 5312, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1041, file: !346, line: 661, baseType: !382, size: 4480)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1041, file: !346, line: 661, baseType: !804, size: 32, offset: 4480)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1041, file: !346, line: 662, baseType: !329, size: 32, offset: 4512)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1041, file: !346, line: 662, baseType: !329, size: 32, offset: 4544)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1041, file: !346, line: 662, baseType: !329, size: 32, offset: 4576)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1041, file: !346, line: 663, baseType: !329, size: 32, offset: 4608)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1041, file: !346, line: 664, baseType: !329, size: 32, offset: 4640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1041, file: !346, line: 665, baseType: !334, size: 64, offset: 4672)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1041, file: !346, line: 666, baseType: !334, size: 64, offset: 4736)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1041, file: !346, line: 667, baseType: !329, size: 32, offset: 4800)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1041, file: !346, line: 668, baseType: !845, size: 32, offset: 4832)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1041, file: !346, line: 670, baseType: !334, size: 64, offset: 4864)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1041, file: !346, line: 670, baseType: !334, size: 64, offset: 4928)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1041, file: !346, line: 671, baseType: !334, size: 64, offset: 4992)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1041, file: !346, line: 672, baseType: !334, size: 64, offset: 5056)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1041, file: !346, line: 673, baseType: !334, size: 64, offset: 5120)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1041, file: !346, line: 674, baseType: !329, size: 32, offset: 5184)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1041, file: !346, line: 675, baseType: !334, size: 64, offset: 5248)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !586, file: !346, line: 195, baseType: !1062, size: 64, offset: 8576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!397, !1039, !377, !377}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !586, file: !346, line: 196, baseType: !1062, size: 64, offset: 8640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !586, file: !346, line: 197, baseType: !837, size: 64, offset: 8704)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !586, file: !346, line: 198, baseType: !959, size: 64, offset: 8768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !586, file: !346, line: 199, baseType: !963, size: 64, offset: 8832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !586, file: !346, line: 201, baseType: !1070, size: 64, offset: 8896)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!397, !377, !329, !329}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !586, file: !346, line: 202, baseType: !738, size: 64, offset: 8960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !586, file: !346, line: 203, baseType: !610, size: 64, offset: 9024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !586, file: !346, line: 204, baseType: !792, size: 64, offset: 9088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !586, file: !346, line: 205, baseType: !923, size: 64, offset: 9152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !586, file: !346, line: 206, baseType: !1078, size: 64, offset: 9216)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!397, !401, !377, !329, !652, !653}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !586, file: !346, line: 208, baseType: !1082, size: 64, offset: 9280)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!397, !329, !748}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !586, file: !346, line: 209, baseType: !963, size: 64, offset: 9344)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !586, file: !346, line: 210, baseType: !755, size: 64, offset: 9408)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !379, file: !346, line: 438, baseType: !1088, size: 64, offset: 13952)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !370, line: 60, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1090, file: !114, line: 241, baseType: !401, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !114, line: 242, baseType: !460, size: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1090, file: !114, line: 243, baseType: !329, size: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1090, file: !114, line: 243, baseType: !329, size: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1090, file: !114, line: 244, baseType: !329, size: 32, offset: 160)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1090, file: !114, line: 244, baseType: !329, size: 32, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1090, file: !114, line: 245, baseType: !334, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1090, file: !114, line: 246, baseType: !327, size: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1090, file: !114, line: 247, baseType: !329, size: 32, offset: 352)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1090, file: !114, line: 251, baseType: !329, size: 32, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1090, file: !114, line: 252, baseType: !894, size: 64, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1090, file: !114, line: 253, baseType: !327, size: 32, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1090, file: !114, line: 254, baseType: !329, size: 32, offset: 544)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1090, file: !114, line: 254, baseType: !329, size: 32, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1090, file: !114, line: 255, baseType: !329, size: 32, offset: 608)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !379, file: !346, line: 438, baseType: !1088, size: 64, offset: 14016)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !346, line: 439, baseType: !480, size: 64, offset: 14080)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !379, file: !346, line: 440, baseType: !1110, size: 32, offset: 14144)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !379, file: !346, line: 441, baseType: !327, size: 32, offset: 14176)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !379, file: !346, line: 442, baseType: !327, size: 32, offset: 14208)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !379, file: !346, line: 443, baseType: !1114, size: 448, offset: 14272)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 448, elements: !1116)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !422)
!1116 = !{!1117}
!1117 = !DISubrange(count: 7)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !379, file: !346, line: 444, baseType: !327, size: 32, offset: 14720)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !379, file: !346, line: 445, baseType: !327, size: 32, offset: 14752)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !379, file: !346, line: 446, baseType: !329, size: 32, offset: 14784)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !379, file: !346, line: 447, baseType: !482, size: 64, offset: 14848)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !379, file: !346, line: 448, baseType: !482, size: 64, offset: 14912)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !379, file: !346, line: 449, baseType: !660, size: 640, offset: 14976)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !379, file: !346, line: 450, baseType: !596, size: 32, offset: 15616)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !379, file: !346, line: 451, baseType: !1126, size: 2880, offset: 15680)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !346, line: 318, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !346, line: 319, size: 2880, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1148, !1149, !1154, !1159, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1174, !1175, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1207, !1208, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1231, !1232, !1233, !1237, !1238}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1127, file: !346, line: 320, baseType: !329, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1127, file: !346, line: 321, baseType: !329, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1127, file: !346, line: 322, baseType: !329, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1127, file: !346, line: 323, baseType: !329, size: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1127, file: !346, line: 324, baseType: !329, size: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1127, file: !346, line: 325, baseType: !329, size: 32, offset: 160)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1127, file: !346, line: 326, baseType: !1136, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !346, line: 293, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !346, line: 295, size: 448, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1138, file: !346, line: 296, baseType: !1136, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1138, file: !346, line: 297, baseType: !367, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1138, file: !346, line: 297, baseType: !367, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1138, file: !346, line: 298, baseType: !334, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1138, file: !346, line: 298, baseType: !334, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1138, file: !346, line: 299, baseType: !329, size: 32, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1138, file: !346, line: 300, baseType: !329, size: 32, offset: 352)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1138, file: !346, line: 301, baseType: !329, size: 32, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1127, file: !346, line: 326, baseType: !1136, size: 64, offset: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1127, file: !346, line: 328, baseType: !1150, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!397, !377, !1153, !334}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1127, file: !346, line: 329, baseType: !1155, size: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!397, !1153, !1158, !490, !490, !505, !334}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1127, file: !346, line: 330, baseType: !1160, size: 64, offset: 448)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!397, !1153}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1127, file: !346, line: 331, baseType: !1160, size: 64, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1127, file: !346, line: 334, baseType: !401, size: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !346, line: 335, baseType: !460, size: 32, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1127, file: !346, line: 335, baseType: !460, size: 32, offset: 672)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1127, file: !346, line: 336, baseType: !460, size: 32, offset: 704)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1127, file: !346, line: 336, baseType: !460, size: 32, offset: 736)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1127, file: !346, line: 337, baseType: !1170, size: 64, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !402, line: 339, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !402, line: 339, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1127, file: !346, line: 338, baseType: !1170, size: 64, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1127, file: !346, line: 339, baseType: !1176, size: 64, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !402, line: 341, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !402, line: 351, size: 192, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1178, file: !402, line: 354, baseType: !72, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1178, file: !402, line: 355, baseType: !72, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1178, file: !402, line: 356, baseType: !72, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1178, file: !402, line: 361, baseType: !72, size: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1178, file: !402, line: 362, baseType: !551, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1127, file: !346, line: 340, baseType: !329, size: 32, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1127, file: !346, line: 340, baseType: !329, size: 32, offset: 992)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1127, file: !346, line: 341, baseType: !367, size: 64, offset: 1024)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1127, file: !346, line: 342, baseType: !334, size: 64, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1127, file: !346, line: 343, baseType: !505, size: 64, offset: 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1127, file: !346, line: 344, baseType: !490, size: 64, offset: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1127, file: !346, line: 345, baseType: !329, size: 32, offset: 1280)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1127, file: !346, line: 346, baseType: !1158, size: 64, offset: 1344)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1127, file: !346, line: 347, baseType: !327, size: 32, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1127, file: !346, line: 348, baseType: !329, size: 32, offset: 1440)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1127, file: !346, line: 351, baseType: !327, size: 32, offset: 1472)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1127, file: !346, line: 352, baseType: !327, size: 32, offset: 1504)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1127, file: !346, line: 353, baseType: !460, size: 32, offset: 1536)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1127, file: !346, line: 354, baseType: !460, size: 32, offset: 1568)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1127, file: !346, line: 355, baseType: !1158, size: 64, offset: 1600)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1127, file: !346, line: 356, baseType: !1158, size: 64, offset: 1664)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1127, file: !346, line: 357, baseType: !1202, size: 64, offset: 1728)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !346, line: 310, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 308, size: 32, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1204, file: !346, line: 309, baseType: !329, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1127, file: !346, line: 357, baseType: !1202, size: 64, offset: 1792)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1127, file: !346, line: 358, baseType: !1209, size: 64, offset: 1856)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !346, line: 316, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 312, size: 128, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1211, file: !346, line: 313, baseType: !480, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1211, file: !346, line: 314, baseType: !329, size: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1211, file: !346, line: 315, baseType: !424, size: 8, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1127, file: !346, line: 359, baseType: !1209, size: 64, offset: 1920)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1127, file: !346, line: 360, baseType: !1209, size: 64, offset: 1984)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1127, file: !346, line: 361, baseType: !329, size: 32, offset: 2048)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1127, file: !346, line: 362, baseType: !460, size: 32, offset: 2080)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1127, file: !346, line: 363, baseType: !329, size: 32, offset: 2112)
