; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/cdiagonal/cdiagonal.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/cdiagonal/cdiagonal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!304 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!345 = !{!346, !355, !359, !360, !363, !526}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_ConstantDiagonal", file: !348, line: 6, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/cdiagonal/cdiagonal.c", directory: "/home/users/ndemeye/xSDK")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 4, size: 64, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !349, file: !348, line: 5, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !354)
!354 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !356, line: 330, baseType: !357)
!356 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !356, line: 330, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !366, line: 73, size: 4480, elements: !367)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!367 = !{!368, !370, !416, !417, !419, !421, !422, !423, !424, !432, !433, !435, !439, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !456, !457, !458, !460, !461, !463, !465, !466, !467, !468, !469, !471, !473, !474, !475, !476, !477, !479, !481, !482, !483, !493, !495, !496, !500, !501, !550, !555, !557, !558, !559}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !365, file: !366, line: 74, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !365, file: !366, line: 75, baseType: !371, size: 448, offset: 64)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 448, elements: !414)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !366, line: 53, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 45, size: 448, elements: !374)
!374 = !{!375, !381, !389, !394, !398, !402, !409}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !373, file: !366, line: 46, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !363, !380}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !373, file: !366, line: 47, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!379, !363, !385}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !386, line: 16, baseType: !387)
!386 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !386, line: 16, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !373, file: !366, line: 48, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!379, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !373, file: !366, line: 49, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!379, !363, !360, !363}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !373, file: !366, line: 50, baseType: !399, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!379, !363, !360, !393}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !373, file: !366, line: 51, baseType: !403, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!379, !363, !360, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !373, file: !366, line: 52, baseType: !410, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!379, !363, !360, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!414 = !{!415}
!415 = !DISubrange(count: 1)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !365, file: !366, line: 76, baseType: !355, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !366, line: 77, baseType: !418, size: 32, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !365, file: !366, line: 78, baseType: !420, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !354)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !365, file: !366, line: 78, baseType: !420, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !365, file: !366, line: 78, baseType: !420, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !365, file: !366, line: 78, baseType: !420, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !366, line: 79, baseType: !425, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !428, line: 27, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !430, line: 43, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!431 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !365, file: !366, line: 80, baseType: !418, size: 32, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !365, file: !366, line: 81, baseType: !434, size: 32, offset: 992)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !365, file: !366, line: 82, baseType: !436, size: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !365, file: !366, line: 83, baseType: !440, size: 64, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !365, file: !366, line: 84, baseType: !444, size: 64, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !365, file: !366, line: 85, baseType: !444, size: 64, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !365, file: !366, line: 86, baseType: !444, size: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !365, file: !366, line: 87, baseType: !444, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !365, file: !366, line: 88, baseType: !363, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !365, file: !366, line: 89, baseType: !425, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !366, line: 90, baseType: !444, size: 64, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !365, file: !366, line: 91, baseType: !444, size: 64, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !365, file: !366, line: 92, baseType: !418, size: 32, offset: 1664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !365, file: !366, line: 93, baseType: !359, size: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !365, file: !366, line: 94, baseType: !455, size: 64, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !426)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !365, file: !366, line: 95, baseType: !418, size: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !365, file: !366, line: 95, baseType: !418, size: 32, offset: 1888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !365, file: !366, line: 96, baseType: !459, size: 64, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !365, file: !366, line: 96, baseType: !459, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !365, file: !366, line: 97, baseType: !462, size: 64, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !365, file: !366, line: 97, baseType: !464, size: 64, offset: 2112)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !365, file: !366, line: 98, baseType: !418, size: 32, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !365, file: !366, line: 98, baseType: !418, size: 32, offset: 2208)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !365, file: !366, line: 99, baseType: !459, size: 64, offset: 2240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !365, file: !366, line: 99, baseType: !459, size: 64, offset: 2304)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !365, file: !366, line: 100, baseType: !470, size: 64, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !365, file: !366, line: 100, baseType: !472, size: 64, offset: 2432)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !365, file: !366, line: 101, baseType: !418, size: 32, offset: 2496)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !365, file: !366, line: 101, baseType: !418, size: 32, offset: 2528)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !365, file: !366, line: 102, baseType: !459, size: 64, offset: 2560)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !365, file: !366, line: 102, baseType: !459, size: 64, offset: 2624)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !365, file: !366, line: 103, baseType: !478, size: 64, offset: 2688)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !365, file: !366, line: 103, baseType: !480, size: 64, offset: 2752)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !365, file: !366, line: 104, baseType: !413, size: 64, offset: 2816)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !365, file: !366, line: 105, baseType: !418, size: 32, offset: 2880)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !365, file: !366, line: 106, baseType: !484, size: 128, offset: 2944)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 128, elements: !491)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !366, line: 64, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 61, size: 128, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !487, file: !366, line: 62, baseType: !406, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !487, file: !366, line: 63, baseType: !359, size: 64, offset: 64)
!491 = !{!492}
!492 = !DISubrange(count: 2)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !365, file: !366, line: 107, baseType: !494, size: 64, offset: 3072)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 64, elements: !491)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !365, file: !366, line: 108, baseType: !359, size: 64, offset: 3136)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !365, file: !366, line: 109, baseType: !497, size: 64, offset: 3200)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!379, !359}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !365, file: !366, line: 111, baseType: !418, size: 32, offset: 3264)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !365, file: !366, line: 112, baseType: !502, size: 320, offset: 3328)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 320, elements: !548)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!379, !506, !363, !359}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !509)
!509 = !{!510, !511, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !508, file: !10, line: 100, baseType: !418, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !10, line: 101, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !523, !524, !525, !529, !531, !533, !534, !535}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !514, file: !10, line: 84, baseType: !444, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !514, file: !10, line: 85, baseType: !444, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !10, line: 86, baseType: !359, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !514, file: !10, line: 87, baseType: !436, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !514, file: !10, line: 88, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !514, file: !10, line: 89, baseType: !362, size: 8, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !514, file: !10, line: 90, baseType: !444, size: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !514, file: !10, line: 91, baseType: !526, size: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !527, line: 46, baseType: !528)
!527 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!528 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !514, file: !10, line: 92, baseType: !530, size: 32, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !10, line: 93, baseType: !532, size: 32, offset: 544)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !10, line: 94, baseType: !512, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !514, file: !10, line: 95, baseType: !444, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !514, file: !10, line: 96, baseType: !359, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !508, file: !10, line: 102, baseType: !444, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !508, file: !10, line: 102, baseType: !444, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !508, file: !10, line: 103, baseType: !444, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !508, file: !10, line: 104, baseType: !355, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !508, file: !10, line: 105, baseType: !530, size: 32, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !508, file: !10, line: 105, baseType: !530, size: 32, offset: 416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !508, file: !10, line: 105, baseType: !530, size: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !508, file: !10, line: 106, baseType: !363, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !508, file: !10, line: 107, baseType: !545, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!548 = !{!549}
!549 = !DISubrange(count: 5)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !365, file: !366, line: 113, baseType: !551, size: 320, offset: 3648)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 320, elements: !548)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!379, !363, !359}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !365, file: !366, line: 114, baseType: !556, size: 320, offset: 3968)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 320, elements: !548)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !365, file: !366, line: 115, baseType: !530, size: 32, offset: 4288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !365, file: !366, line: 120, baseType: !545, size: 64, offset: 4352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !365, file: !366, line: 121, baseType: !530, size: 32, offset: 4416)
!560 = !{i32 7, !"Dwarf Version", i32 4}
!561 = !{i32 2, !"Debug Info Version", i32 3}
!562 = !{i32 1, !"wchar_size", i32 4}
!563 = !{i32 7, !"PIC Level", i32 2}
!564 = !{i32 7, !"uwtable", i32 1}
!565 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!566 = distinct !DISubprogram(name: "MatGetDiagonal_ConstantDiagonal", scope: !348, file: !348, line: 162, type: !567, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1338)
!567 = !DISubroutineType(types: !568)
!568 = !{!379, !569, !598}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !572, line: 436, size: 23424, elements: !573)
!572 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!573 = !{!574, !576, !1081, !1101, !1102, !1103, !1105, !1106, !1107, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1234, !1235, !1251, !1252, !1253, !1254, !1255, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1290, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1336, !1337}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !571, file: !572, line: 437, baseType: !575, size: 4480)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !366, line: 122, baseType: !365)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !571, file: !572, line: 437, baseType: !577, size: 9472, offset: 4480)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 9472, elements: !414)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !572, line: 32, size: 9472, elements: !579)
!579 = !{!580, !589, !593, !594, !601, !605, !606, !607, !608, !609, !610, !611, !635, !639, !644, !650, !669, !674, !676, !677, !682, !687, !688, !693, !697, !701, !705, !709, !713, !714, !715, !716, !717, !721, !722, !727, !728, !729, !730, !731, !736, !743, !748, !752, !756, !760, !764, !765, !769, !770, !777, !782, !783, !784, !785, !847, !855, !856, !860, !861, !865, !866, !870, !875, !876, !880, !884, !891, !892, !893, !894, !895, !896, !901, !902, !906, !910, !914, !915, !916, !920, !930, !931, !935, !936, !940, !941, !945, !946, !951, !952, !956, !960, !961, !962, !963, !964, !965, !966, !970, !971, !972, !973, !974, !975, !979, !980, !981, !982, !983, !984, !985, !986, !990, !994, !995, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1017, !1021, !1022, !1026, !1027, !1028, !1029, !1055, !1059, !1060, !1061, !1062, !1063, !1067, !1068, !1069, !1070, !1071, !1075, !1079, !1080}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !578, file: !572, line: 34, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!379, !569, !418, !584, !418, !584, !586, !588}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !578, file: !572, line: 35, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!379, !569, !418, !462, !464, !480}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !578, file: !572, line: 36, baseType: !590, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !578, file: !572, line: 37, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!379, !569, !598, !598}
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !578, file: !572, line: 38, baseType: !602, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!379, !569, !598, !598, !598}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !578, file: !572, line: 40, baseType: !595, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !578, file: !572, line: 41, baseType: !602, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !578, file: !572, line: 42, baseType: !595, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !578, file: !572, line: 43, baseType: !602, size: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !578, file: !572, line: 44, baseType: !595, size: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !578, file: !572, line: 46, baseType: !602, size: 64, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !578, file: !572, line: 47, baseType: !612, size: 64, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!379, !569, !615, !615, !619}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !616, line: 11, baseType: !617)
!616 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !616, line: 11, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !622, file: !36, line: 1227, baseType: !353, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !622, file: !36, line: 1228, baseType: !353, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !622, file: !36, line: 1229, baseType: !353, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !622, file: !36, line: 1230, baseType: !353, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !622, file: !36, line: 1231, baseType: !353, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !622, file: !36, line: 1232, baseType: !353, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !622, file: !36, line: 1233, baseType: !353, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !622, file: !36, line: 1234, baseType: !353, size: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !622, file: !36, line: 1236, baseType: !353, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !622, file: !36, line: 1237, baseType: !353, size: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !622, file: !36, line: 1238, baseType: !353, size: 64, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !578, file: !572, line: 48, baseType: !636, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!379, !569, !615, !619}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !578, file: !572, line: 49, baseType: !640, size: 64, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!379, !569, !598, !353, !643, !353, !418, !418, !598}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !578, file: !572, line: 50, baseType: !645, size: 64, offset: 896)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!379, !569, !648, !649}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !578, file: !572, line: 52, baseType: !651, size: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!379, !569, !654, !655}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !657, file: !36, line: 593, baseType: !420, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !657, file: !36, line: 594, baseType: !420, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !657, file: !36, line: 594, baseType: !420, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !657, file: !36, line: 594, baseType: !420, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !657, file: !36, line: 595, baseType: !420, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !657, file: !36, line: 596, baseType: !420, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !657, file: !36, line: 597, baseType: !420, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !657, file: !36, line: 598, baseType: !420, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !657, file: !36, line: 598, baseType: !420, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !657, file: !36, line: 599, baseType: !420, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !578, file: !572, line: 53, baseType: !670, size: 64, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!379, !569, !569, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !578, file: !572, line: 54, baseType: !675, size: 64, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !578, file: !572, line: 55, baseType: !595, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !578, file: !572, line: 56, baseType: !678, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!379, !569, !681, !470}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !578, file: !572, line: 58, baseType: !683, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!379, !569, !686}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !578, file: !572, line: 59, baseType: !683, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !578, file: !572, line: 60, baseType: !689, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!379, !569, !692, !530}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !578, file: !572, line: 61, baseType: !694, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!379, !569}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !578, file: !572, line: 63, baseType: !698, size: 64, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!379, !569, !418, !584, !352, !598, !598}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !578, file: !572, line: 64, baseType: !702, size: 64, offset: 1600)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!379, !569, !569, !615, !615, !619}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !578, file: !572, line: 65, baseType: !706, size: 64, offset: 1664)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!379, !569, !569, !619}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !578, file: !572, line: 66, baseType: !710, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!379, !569, !569, !615, !619}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !578, file: !572, line: 67, baseType: !706, size: 64, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !578, file: !572, line: 69, baseType: !694, size: 64, offset: 1856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !578, file: !572, line: 70, baseType: !702, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !578, file: !572, line: 71, baseType: !710, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !578, file: !572, line: 72, baseType: !718, size: 64, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!379, !569, !649}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !578, file: !572, line: 73, baseType: !694, size: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !578, file: !572, line: 75, baseType: !723, size: 64, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!379, !569, !726, !649}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !578, file: !572, line: 76, baseType: !595, size: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !578, file: !572, line: 77, baseType: !595, size: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !578, file: !572, line: 78, baseType: !612, size: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !578, file: !572, line: 79, baseType: !636, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !578, file: !572, line: 81, baseType: !732, size: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!379, !569, !352, !569, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !578, file: !572, line: 82, baseType: !737, size: 64, offset: 2560)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!379, !569, !418, !740, !740, !648, !742}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !578, file: !572, line: 83, baseType: !744, size: 64, offset: 2624)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!379, !569, !418, !747, !418}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !578, file: !572, line: 84, baseType: !749, size: 64, offset: 2688)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!379, !569, !418, !584, !418, !584, !478}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !578, file: !572, line: 85, baseType: !753, size: 64, offset: 2752)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!379, !569, !569, !735}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !578, file: !572, line: 87, baseType: !757, size: 64, offset: 2816)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!379, !569, !598, !462}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !578, file: !572, line: 88, baseType: !761, size: 64, offset: 2880)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!379, !569, !352}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !578, file: !572, line: 89, baseType: !761, size: 64, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !578, file: !572, line: 90, baseType: !766, size: 64, offset: 3008)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!379, !569, !598, !588}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !578, file: !572, line: 91, baseType: !698, size: 64, offset: 3072)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !578, file: !572, line: 93, baseType: !771, size: 64, offset: 3136)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!379, !569, !774}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !578, file: !572, line: 94, baseType: !778, size: 64, offset: 3200)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!379, !569, !418, !530, !530, !462, !781, !781, !673}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !578, file: !572, line: 95, baseType: !778, size: 64, offset: 3264)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !578, file: !572, line: 96, baseType: !778, size: 64, offset: 3328)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !578, file: !572, line: 97, baseType: !778, size: 64, offset: 3392)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !578, file: !572, line: 99, baseType: !786, size: 64, offset: 3456)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!379, !569, !789, !792}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !616, line: 51, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !616, line: 51, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !572, line: 609, size: 6208, elements: !795)
!795 = !{!796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !816, !823, !824, !825, !826, !827, !828, !829, !830, !834, !835, !836, !837, !838, !840, !841, !842, !843, !844, !845, !846}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !794, file: !572, line: 610, baseType: !575, size: 4480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !794, file: !572, line: 610, baseType: !798, size: 32, offset: 4480)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !414)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !794, file: !572, line: 611, baseType: !418, size: 32, offset: 4512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !794, file: !572, line: 611, baseType: !418, size: 32, offset: 4544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !794, file: !572, line: 611, baseType: !418, size: 32, offset: 4576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !794, file: !572, line: 612, baseType: !418, size: 32, offset: 4608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !794, file: !572, line: 613, baseType: !418, size: 32, offset: 4640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !794, file: !572, line: 614, baseType: !462, size: 64, offset: 4672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !794, file: !572, line: 615, baseType: !464, size: 64, offset: 4736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !794, file: !572, line: 616, baseType: !747, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !794, file: !572, line: 617, baseType: !462, size: 64, offset: 4864)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !794, file: !572, line: 618, baseType: !809, size: 64, offset: 4928)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !572, line: 602, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 598, size: 128, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !811, file: !572, line: 599, baseType: !418, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !811, file: !572, line: 600, baseType: !418, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !811, file: !572, line: 601, baseType: !478, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !794, file: !572, line: 619, baseType: !817, size: 64, offset: 4992)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !572, line: 607, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 604, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !819, file: !572, line: 605, baseType: !418, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !819, file: !572, line: 606, baseType: !478, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !794, file: !572, line: 620, baseType: !478, size: 64, offset: 5056)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !794, file: !572, line: 621, baseType: !353, size: 64, offset: 5120)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !794, file: !572, line: 622, baseType: !353, size: 64, offset: 5184)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !794, file: !572, line: 623, baseType: !598, size: 64, offset: 5248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !794, file: !572, line: 623, baseType: !598, size: 64, offset: 5312)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !794, file: !572, line: 623, baseType: !598, size: 64, offset: 5376)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !794, file: !572, line: 624, baseType: !530, size: 32, offset: 5440)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !794, file: !572, line: 625, baseType: !831, size: 64, offset: 5504)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!379}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !794, file: !572, line: 626, baseType: !359, size: 64, offset: 5568)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !794, file: !572, line: 627, baseType: !598, size: 64, offset: 5632)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !794, file: !572, line: 628, baseType: !418, size: 32, offset: 5696)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !794, file: !572, line: 629, baseType: !360, size: 64, offset: 5760)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !794, file: !572, line: 630, baseType: !839, size: 32, offset: 5824)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !794, file: !572, line: 631, baseType: !418, size: 32, offset: 5856)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !794, file: !572, line: 631, baseType: !418, size: 32, offset: 5888)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !794, file: !572, line: 632, baseType: !530, size: 32, offset: 5920)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !794, file: !572, line: 633, baseType: !530, size: 32, offset: 5952)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !794, file: !572, line: 634, baseType: !406, size: 64, offset: 6016)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !794, file: !572, line: 634, baseType: !359, size: 64, offset: 6080)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !794, file: !572, line: 635, baseType: !425, size: 64, offset: 6144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !578, file: !572, line: 100, baseType: !848, size: 64, offset: 3520)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!379, !569, !418, !418, !851, !854}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !853)
!853 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !578, file: !572, line: 101, baseType: !694, size: 64, offset: 3584)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !578, file: !572, line: 102, baseType: !857, size: 64, offset: 3648)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!379, !569, !615, !615, !649}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !578, file: !572, line: 103, baseType: !581, size: 64, offset: 3712)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !578, file: !572, line: 105, baseType: !862, size: 64, offset: 3776)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!379, !569, !615, !615, !648, !649}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !578, file: !572, line: 106, baseType: !694, size: 64, offset: 3840)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !578, file: !572, line: 107, baseType: !867, size: 64, offset: 3904)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!379, !569, !385}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !578, file: !572, line: 108, baseType: !871, size: 64, offset: 3968)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!379, !569, !874, !648, !649}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !360)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !578, file: !572, line: 109, baseType: !831, size: 64, offset: 4032)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !578, file: !572, line: 111, baseType: !877, size: 64, offset: 4096)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!379, !569, !569, !569, !353, !569}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !578, file: !572, line: 112, baseType: !881, size: 64, offset: 4160)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!379, !569, !569, !569, !569}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !578, file: !572, line: 113, baseType: !885, size: 64, offset: 4224)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!379, !569, !888, !888}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !616, line: 30, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !616, line: 30, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !578, file: !572, line: 114, baseType: !581, size: 64, offset: 4288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !578, file: !572, line: 115, baseType: !698, size: 64, offset: 4352)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !578, file: !572, line: 117, baseType: !757, size: 64, offset: 4416)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !578, file: !572, line: 118, baseType: !757, size: 64, offset: 4480)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !578, file: !572, line: 119, baseType: !871, size: 64, offset: 4544)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !578, file: !572, line: 120, baseType: !897, size: 64, offset: 4608)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!379, !569, !900, !673}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !578, file: !572, line: 121, baseType: !831, size: 64, offset: 4672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !578, file: !572, line: 123, baseType: !903, size: 64, offset: 4736)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!379, !569, !418, !359}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !578, file: !572, line: 124, baseType: !907, size: 64, offset: 4800)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!379, !569, !792, !598, !359}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !578, file: !572, line: 125, baseType: !911, size: 64, offset: 4864)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!379, !506, !569}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !578, file: !572, line: 126, baseType: !595, size: 64, offset: 4928)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !578, file: !572, line: 127, baseType: !595, size: 64, offset: 4992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !578, file: !572, line: 129, baseType: !917, size: 64, offset: 5056)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!379, !569, !747}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !578, file: !572, line: 130, baseType: !921, size: 64, offset: 5120)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!379, !569, !924, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !926, file: !60, line: 653, baseType: !418, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !926, file: !60, line: 653, baseType: !598, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !578, file: !572, line: 131, baseType: !921, size: 64, offset: 5184)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !578, file: !572, line: 132, baseType: !932, size: 64, offset: 5248)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!379, !569, !462, !462, !462}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !578, file: !572, line: 133, baseType: !867, size: 64, offset: 5312)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !578, file: !572, line: 135, baseType: !937, size: 64, offset: 5376)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!379, !569, !353, !673}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !578, file: !572, line: 136, baseType: !937, size: 64, offset: 5440)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !578, file: !572, line: 137, baseType: !942, size: 64, offset: 5504)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!379, !569, !673}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !578, file: !572, line: 138, baseType: !581, size: 64, offset: 5568)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !578, file: !572, line: 139, baseType: !947, size: 64, offset: 5632)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!379, !569, !950, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !578, file: !572, line: 141, baseType: !831, size: 64, offset: 5696)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !578, file: !572, line: 142, baseType: !953, size: 64, offset: 5760)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!379, !569, !569, !353, !569}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !578, file: !572, line: 143, baseType: !957, size: 64, offset: 5824)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!379, !569, !569, !569}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !578, file: !572, line: 144, baseType: !831, size: 64, offset: 5888)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !578, file: !572, line: 145, baseType: !953, size: 64, offset: 5952)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !578, file: !572, line: 147, baseType: !957, size: 64, offset: 6016)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !578, file: !572, line: 148, baseType: !831, size: 64, offset: 6080)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !578, file: !572, line: 149, baseType: !953, size: 64, offset: 6144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !578, file: !572, line: 150, baseType: !957, size: 64, offset: 6208)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !578, file: !572, line: 151, baseType: !967, size: 64, offset: 6272)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!379, !569, !530}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !578, file: !572, line: 153, baseType: !694, size: 64, offset: 6336)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !578, file: !572, line: 154, baseType: !694, size: 64, offset: 6400)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !578, file: !572, line: 155, baseType: !694, size: 64, offset: 6464)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !578, file: !572, line: 156, baseType: !694, size: 64, offset: 6528)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !578, file: !572, line: 157, baseType: !867, size: 64, offset: 6592)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !578, file: !572, line: 159, baseType: !976, size: 64, offset: 6656)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!379, !569, !418, !586}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !578, file: !572, line: 160, baseType: !694, size: 64, offset: 6720)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !578, file: !572, line: 161, baseType: !694, size: 64, offset: 6784)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !578, file: !572, line: 162, baseType: !694, size: 64, offset: 6848)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !578, file: !572, line: 163, baseType: !694, size: 64, offset: 6912)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !578, file: !572, line: 165, baseType: !957, size: 64, offset: 6976)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !578, file: !572, line: 166, baseType: !957, size: 64, offset: 7040)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !578, file: !572, line: 167, baseType: !757, size: 64, offset: 7104)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !578, file: !572, line: 168, baseType: !987, size: 64, offset: 7168)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!379, !569, !598, !418}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !578, file: !572, line: 169, baseType: !991, size: 64, offset: 7232)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!379, !569, !673, !462}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !578, file: !572, line: 171, baseType: !718, size: 64, offset: 7296)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !578, file: !572, line: 172, baseType: !694, size: 64, offset: 7360)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !578, file: !572, line: 173, baseType: !997, size: 64, offset: 7424)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!379, !569, !462, !781}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !578, file: !572, line: 174, baseType: !857, size: 64, offset: 7488)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !578, file: !572, line: 175, baseType: !857, size: 64, offset: 7552)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !578, file: !572, line: 177, baseType: !595, size: 64, offset: 7616)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !578, file: !572, line: 178, baseType: !645, size: 64, offset: 7680)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !578, file: !572, line: 179, baseType: !595, size: 64, offset: 7744)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !578, file: !572, line: 180, baseType: !602, size: 64, offset: 7808)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !578, file: !572, line: 181, baseType: !1007, size: 64, offset: 7872)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!379, !569, !355, !648, !649}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !578, file: !572, line: 183, baseType: !917, size: 64, offset: 7936)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !578, file: !572, line: 184, baseType: !678, size: 64, offset: 8000)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !578, file: !572, line: 185, baseType: !1013, size: 64, offset: 8064)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!379, !569, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !578, file: !572, line: 186, baseType: !1018, size: 64, offset: 8128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!379, !569, !418, !584, !478}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !578, file: !572, line: 187, baseType: !737, size: 64, offset: 8192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !578, file: !572, line: 189, baseType: !1023, size: 64, offset: 8256)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!379, !569, !418, !418, !462, !586}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !578, file: !572, line: 190, baseType: !831, size: 64, offset: 8320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !578, file: !572, line: 191, baseType: !953, size: 64, offset: 8384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !578, file: !572, line: 192, baseType: !957, size: 64, offset: 8448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !578, file: !572, line: 193, baseType: !1030, size: 64, offset: 8512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!379, !569, !789, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !572, line: 660, size: 5312, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1035, file: !572, line: 661, baseType: !575, size: 4480)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1035, file: !572, line: 661, baseType: !798, size: 32, offset: 4480)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1035, file: !572, line: 662, baseType: !418, size: 32, offset: 4512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1035, file: !572, line: 662, baseType: !418, size: 32, offset: 4544)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1035, file: !572, line: 662, baseType: !418, size: 32, offset: 4576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1035, file: !572, line: 663, baseType: !418, size: 32, offset: 4608)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1035, file: !572, line: 664, baseType: !418, size: 32, offset: 4640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1035, file: !572, line: 665, baseType: !462, size: 64, offset: 4672)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1035, file: !572, line: 666, baseType: !462, size: 64, offset: 4736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1035, file: !572, line: 667, baseType: !418, size: 32, offset: 4800)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1035, file: !572, line: 668, baseType: !839, size: 32, offset: 4832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1035, file: !572, line: 670, baseType: !462, size: 64, offset: 4864)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1035, file: !572, line: 670, baseType: !462, size: 64, offset: 4928)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1035, file: !572, line: 671, baseType: !462, size: 64, offset: 4992)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1035, file: !572, line: 672, baseType: !462, size: 64, offset: 5056)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1035, file: !572, line: 673, baseType: !462, size: 64, offset: 5120)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1035, file: !572, line: 674, baseType: !418, size: 32, offset: 5184)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1035, file: !572, line: 675, baseType: !462, size: 64, offset: 5248)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !578, file: !572, line: 195, baseType: !1056, size: 64, offset: 8576)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!379, !1033, !569, !569}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !578, file: !572, line: 196, baseType: !1056, size: 64, offset: 8640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !578, file: !572, line: 197, baseType: !831, size: 64, offset: 8704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !578, file: !572, line: 198, baseType: !953, size: 64, offset: 8768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !578, file: !572, line: 199, baseType: !957, size: 64, offset: 8832)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !578, file: !572, line: 201, baseType: !1064, size: 64, offset: 8896)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!379, !569, !418, !418}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !578, file: !572, line: 202, baseType: !732, size: 64, offset: 8960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !578, file: !572, line: 203, baseType: !602, size: 64, offset: 9024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !578, file: !572, line: 204, baseType: !786, size: 64, offset: 9088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !578, file: !572, line: 205, baseType: !917, size: 64, offset: 9152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !578, file: !572, line: 206, baseType: !1072, size: 64, offset: 9216)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!379, !355, !569, !418, !648, !649}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !578, file: !572, line: 208, baseType: !1076, size: 64, offset: 9280)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!379, !418, !742}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !578, file: !572, line: 209, baseType: !957, size: 64, offset: 9344)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !578, file: !572, line: 210, baseType: !749, size: 64, offset: 9408)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !571, file: !572, line: 438, baseType: !1082, size: 64, offset: 13952)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !616, line: 60, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1084, file: !114, line: 241, baseType: !355, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !114, line: 242, baseType: !434, size: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1084, file: !114, line: 243, baseType: !418, size: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1084, file: !114, line: 243, baseType: !418, size: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1084, file: !114, line: 244, baseType: !418, size: 32, offset: 160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1084, file: !114, line: 244, baseType: !418, size: 32, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1084, file: !114, line: 245, baseType: !462, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1084, file: !114, line: 246, baseType: !530, size: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1084, file: !114, line: 247, baseType: !418, size: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1084, file: !114, line: 251, baseType: !418, size: 32, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1084, file: !114, line: 252, baseType: !888, size: 64, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1084, file: !114, line: 253, baseType: !530, size: 32, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1084, file: !114, line: 254, baseType: !418, size: 32, offset: 544)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1084, file: !114, line: 254, baseType: !418, size: 32, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1084, file: !114, line: 255, baseType: !418, size: 32, offset: 608)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !571, file: !572, line: 438, baseType: !1082, size: 64, offset: 14016)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !571, file: !572, line: 439, baseType: !359, size: 64, offset: 14080)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !571, file: !572, line: 440, baseType: !1104, size: 32, offset: 14144)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !571, file: !572, line: 441, baseType: !530, size: 32, offset: 14176)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !571, file: !572, line: 442, baseType: !530, size: 32, offset: 14208)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !571, file: !572, line: 443, baseType: !1108, size: 448, offset: 14272)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 448, elements: !1110)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !360)
!1110 = !{!1111}
!1111 = !DISubrange(count: 7)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !571, file: !572, line: 444, baseType: !530, size: 32, offset: 14720)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !571, file: !572, line: 445, baseType: !530, size: 32, offset: 14752)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !571, file: !572, line: 446, baseType: !418, size: 32, offset: 14784)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !571, file: !572, line: 447, baseType: !455, size: 64, offset: 14848)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !571, file: !572, line: 448, baseType: !455, size: 64, offset: 14912)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !571, file: !572, line: 449, baseType: !656, size: 640, offset: 14976)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !571, file: !572, line: 450, baseType: !588, size: 32, offset: 15616)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !571, file: !572, line: 451, baseType: !1120, size: 2880, offset: 15680)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !572, line: 318, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !572, line: 319, size: 2880, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1142, !1143, !1148, !1153, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1168, !1169, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1201, !1202, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1227, !1231, !1232}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1121, file: !572, line: 320, baseType: !418, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1121, file: !572, line: 321, baseType: !418, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1121, file: !572, line: 322, baseType: !418, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1121, file: !572, line: 323, baseType: !418, size: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1121, file: !572, line: 324, baseType: !418, size: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1121, file: !572, line: 325, baseType: !418, size: 32, offset: 160)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1121, file: !572, line: 326, baseType: !1130, size: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !572, line: 293, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !572, line: 295, size: 448, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1132, file: !572, line: 296, baseType: !1130, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1132, file: !572, line: 297, baseType: !478, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1132, file: !572, line: 297, baseType: !478, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1132, file: !572, line: 298, baseType: !462, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1132, file: !572, line: 298, baseType: !462, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1132, file: !572, line: 299, baseType: !418, size: 32, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1132, file: !572, line: 300, baseType: !418, size: 32, offset: 352)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1132, file: !572, line: 301, baseType: !418, size: 32, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1121, file: !572, line: 326, baseType: !1130, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1121, file: !572, line: 328, baseType: !1144, size: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!379, !569, !1147, !462}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1121, file: !572, line: 329, baseType: !1149, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!379, !1147, !1152, !464, !464, !480, !462}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1121, file: !572, line: 330, baseType: !1154, size: 64, offset: 448)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!379, !1147}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1121, file: !572, line: 331, baseType: !1154, size: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1121, file: !572, line: 334, baseType: !355, size: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1121, file: !572, line: 335, baseType: !434, size: 32, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1121, file: !572, line: 335, baseType: !434, size: 32, offset: 672)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1121, file: !572, line: 336, baseType: !434, size: 32, offset: 704)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1121, file: !572, line: 336, baseType: !434, size: 32, offset: 736)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1121, file: !572, line: 337, baseType: !1164, size: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !356, line: 339, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !356, line: 339, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1121, file: !572, line: 338, baseType: !1164, size: 64, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1121, file: !572, line: 339, baseType: !1170, size: 64, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !356, line: 341, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !356, line: 351, size: 192, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1172, file: !356, line: 354, baseType: !72, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1172, file: !356, line: 355, baseType: !72, size: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1172, file: !356, line: 356, baseType: !72, size: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1172, file: !356, line: 361, baseType: !72, size: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1172, file: !356, line: 362, baseType: !526, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1121, file: !572, line: 340, baseType: !418, size: 32, offset: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1121, file: !572, line: 340, baseType: !418, size: 32, offset: 992)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1121, file: !572, line: 341, baseType: !478, size: 64, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1121, file: !572, line: 342, baseType: !462, size: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1121, file: !572, line: 343, baseType: !480, size: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1121, file: !572, line: 344, baseType: !464, size: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1121, file: !572, line: 345, baseType: !418, size: 32, offset: 1280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1121, file: !572, line: 346, baseType: !1152, size: 64, offset: 1344)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1121, file: !572, line: 347, baseType: !530, size: 32, offset: 1408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1121, file: !572, line: 348, baseType: !418, size: 32, offset: 1440)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1121, file: !572, line: 351, baseType: !530, size: 32, offset: 1472)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1121, file: !572, line: 352, baseType: !530, size: 32, offset: 1504)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1121, file: !572, line: 353, baseType: !434, size: 32, offset: 1536)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1121, file: !572, line: 354, baseType: !434, size: 32, offset: 1568)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1121, file: !572, line: 355, baseType: !1152, size: 64, offset: 1600)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1121, file: !572, line: 356, baseType: !1152, size: 64, offset: 1664)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1121, file: !572, line: 357, baseType: !1196, size: 64, offset: 1728)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !572, line: 310, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 308, size: 32, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1198, file: !572, line: 309, baseType: !418, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1121, file: !572, line: 357, baseType: !1196, size: 64, offset: 1792)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1121, file: !572, line: 358, baseType: !1203, size: 64, offset: 1856)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !572, line: 316, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 312, size: 128, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1205, file: !572, line: 313, baseType: !359, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1205, file: !572, line: 314, baseType: !418, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1205, file: !572, line: 315, baseType: !362, size: 8, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1121, file: !572, line: 359, baseType: !1203, size: 64, offset: 1920)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1121, file: !572, line: 360, baseType: !1203, size: 64, offset: 1984)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1121, file: !572, line: 361, baseType: !418, size: 32, offset: 2048)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1121, file: !572, line: 362, baseType: !434, size: 32, offset: 2080)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1121, file: !572, line: 363, baseType: !418, size: 32, offset: 2112)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1121, file: !572, line: 364, baseType: !1152, size: 64, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1121, file: !572, line: 365, baseType: !1170, size: 64, offset: 2240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1121, file: !572, line: 366, baseType: !434, size: 32, offset: 2304)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1121, file: !572, line: 367, baseType: !434, size: 32, offset: 2336)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1121, file: !572, line: 368, baseType: !1164, size: 64, offset: 2368)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1121, file: !572, line: 369, baseType: !1164, size: 64, offset: 2432)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1121, file: !572, line: 370, baseType: !1222, size: 64, offset: 2496)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1121, file: !572, line: 371, baseType: !1222, size: 64, offset: 2560)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1121, file: !572, line: 372, baseType: !1222, size: 64, offset: 2624)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1121, file: !572, line: 373, baseType: !1228, size: 64, offset: 2688)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !356, line: 331, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !356, line: 331, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1121, file: !572, line: 374, baseType: !526, size: 64, offset: 2752)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1121, file: !572, line: 375, baseType: !1233, size: 64, offset: 2816)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !571, file: !572, line: 451, baseType: !1120, size: 2880, offset: 18560)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !571, file: !572, line: 452, baseType: !1236, size: 64, offset: 21440)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1237)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !572, line: 681, size: 4864, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1238, file: !572, line: 682, baseType: !575, size: 4480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1238, file: !572, line: 682, baseType: !798, size: 32, offset: 4480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1238, file: !572, line: 683, baseType: !530, size: 32, offset: 4512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1238, file: !572, line: 684, baseType: !418, size: 32, offset: 4544)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1238, file: !572, line: 685, baseType: !950, size: 64, offset: 4608)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1238, file: !572, line: 686, baseType: !478, size: 64, offset: 4672)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1238, file: !572, line: 687, baseType: !1247, size: 64, offset: 4736)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!379, !1236, !598, !359}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1238, file: !572, line: 688, baseType: !359, size: 64, offset: 4800)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !571, file: !572, line: 453, baseType: !1236, size: 64, offset: 21504)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !571, file: !572, line: 454, baseType: !1236, size: 64, offset: 21568)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !571, file: !572, line: 455, baseType: !418, size: 32, offset: 21632)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !571, file: !572, line: 456, baseType: !530, size: 32, offset: 21664)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !571, file: !572, line: 457, baseType: !1256, size: 320, offset: 21696)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !572, line: 399, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 394, size: 320, elements: !1258)
!1258 = !{!1259, !1260, !1264, !1265}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1257, file: !572, line: 395, baseType: !418, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1257, file: !572, line: 396, baseType: !1261, size: 128, offset: 32)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 128, elements: !1262)
!1262 = !{!1263}
!1263 = !DISubrange(count: 4)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1257, file: !572, line: 397, baseType: !1261, size: 128, offset: 160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1257, file: !572, line: 398, baseType: !530, size: 32, offset: 288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !571, file: !572, line: 458, baseType: !530, size: 32, offset: 22016)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !571, file: !572, line: 458, baseType: !530, size: 32, offset: 22048)
