; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dummy/matdummy.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dummy/matdummy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!236 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!237 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!238 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !{!301, !373, !453, !394, !370, !443}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SubSppt", file: !303, line: 727, baseType: !304)
!303 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 706, size: 1472, elements: !305)
!305 = !{!306, !308, !309, !310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !326, !327, !328, !329, !330, !342, !343, !344, !345}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !304, file: !303, line: 707, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nrqs", scope: !304, file: !303, line: 708, baseType: !307, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nrqr", scope: !304, file: !303, line: 708, baseType: !307, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf1", scope: !304, file: !303, line: 709, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf2", scope: !304, file: !303, line: 709, baseType: !311, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf3", scope: !304, file: !303, line: 709, baseType: !311, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf1", scope: !304, file: !303, line: 709, baseType: !311, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf2", scope: !304, file: !303, line: 709, baseType: !311, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !304, file: !303, line: 710, baseType: !311, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !304, file: !303, line: 711, baseType: !312, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !304, file: !303, line: 712, baseType: !312, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !304, file: !303, line: 713, baseType: !312, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "req_size", scope: !304, file: !303, line: 714, baseType: !312, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "req_source1", scope: !304, file: !303, line: 714, baseType: !312, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "req_source2", scope: !304, file: !303, line: 714, baseType: !312, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "allcolumns", scope: !304, file: !303, line: 715, baseType: !325, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "allrows", scope: !304, file: !303, line: 715, baseType: !325, size: 32, offset: 928)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "singleis", scope: !304, file: !303, line: 716, baseType: !325, size: 32, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "row2proc", scope: !304, file: !303, line: 717, baseType: !312, size: 64, offset: 1024)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nstages", scope: !304, file: !303, line: 718, baseType: !307, size: 32, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !304, file: !303, line: 720, baseType: !331, size: 64, offset: 1152)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTable", file: !332, line: 14, baseType: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscctable.h", directory: "/home/users/ndemeye/xSDK")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscTable", file: !332, line: 5, size: 256, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "keytable", scope: !334, file: !332, line: 6, baseType: !312, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !334, file: !332, line: 7, baseType: !312, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !334, file: !332, line: 8, baseType: !307, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tablesize", scope: !334, file: !332, line: 9, baseType: !307, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !334, file: !332, line: 10, baseType: !307, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "maxkey", scope: !334, file: !332, line: 11, baseType: !307, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !304, file: !303, line: 720, baseType: !331, size: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cmap_loc", scope: !304, file: !303, line: 721, baseType: !312, size: 64, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rmap_loc", scope: !304, file: !303, line: 721, baseType: !312, size: 64, offset: 1344)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !304, file: !303, line: 726, baseType: !346, size: 64, offset: 1408)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !303, line: 436, size: 23424, elements: !353)
!353 = !{!354, !559, !1063, !1083, !1084, !1085, !1087, !1088, !1089, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1216, !1217, !1233, !1234, !1235, !1236, !1237, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1272, !1292, !1293, !1295, !1296, !1297, !1298, !1299, !1300, !1318, !1319}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !352, file: !303, line: 437, baseType: !355, size: 4480)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !356, line: 122, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !356, line: 73, size: 4480, elements: !358)
!358 = !{!359, !361, !415, !416, !417, !420, !421, !422, !423, !431, !432, !434, !438, !442, !444, !445, !446, !447, !448, !449, !450, !451, !452, !454, !456, !457, !458, !460, !461, !462, !463, !464, !465, !466, !467, !470, !472, !473, !474, !475, !476, !479, !481, !482, !483, !493, !495, !496, !500, !501, !549, !554, !556, !557, !558}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !357, file: !356, line: 74, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !357, file: !356, line: 75, baseType: !362, size: 448, offset: 64)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 448, elements: !413)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !356, line: 53, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 45, size: 448, elements: !365)
!365 = !{!366, !377, !385, !390, !397, !401, !408}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !364, file: !356, line: 46, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!349, !370, !372}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !374, line: 330, baseType: !375)
!374 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !374, line: 330, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !364, file: !356, line: 47, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!349, !370, !381}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !382, line: 16, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !364, file: !356, line: 48, baseType: !386, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!349, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !364, file: !356, line: 49, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!349, !370, !394, !370}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !364, file: !356, line: 50, baseType: !398, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!349, !370, !394, !389}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !364, file: !356, line: 51, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!349, !370, !394, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !364, file: !356, line: 52, baseType: !409, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!349, !370, !394, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!413 = !{!414}
!414 = !DISubrange(count: 1)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !357, file: !356, line: 76, baseType: !373, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !356, line: 77, baseType: !307, size: 32, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !357, file: !356, line: 78, baseType: !418, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !419)
!419 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !357, file: !356, line: 78, baseType: !418, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !357, file: !356, line: 78, baseType: !418, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !357, file: !356, line: 78, baseType: !418, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !356, line: 79, baseType: !424, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !427, line: 27, baseType: !428)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !429, line: 43, baseType: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!430 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !357, file: !356, line: 80, baseType: !307, size: 32, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !357, file: !356, line: 81, baseType: !433, size: 32, offset: 992)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !357, file: !356, line: 82, baseType: !435, size: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !357, file: !356, line: 83, baseType: !439, size: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !357, file: !356, line: 84, baseType: !443, size: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !357, file: !356, line: 85, baseType: !443, size: 64, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !357, file: !356, line: 86, baseType: !443, size: 64, offset: 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !357, file: !356, line: 87, baseType: !443, size: 64, offset: 1344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !357, file: !356, line: 88, baseType: !370, size: 64, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !357, file: !356, line: 89, baseType: !424, size: 64, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !356, line: 90, baseType: !443, size: 64, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !357, file: !356, line: 91, baseType: !443, size: 64, offset: 1600)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !357, file: !356, line: 92, baseType: !307, size: 32, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !357, file: !356, line: 93, baseType: !453, size: 64, offset: 1728)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !356, line: 94, baseType: !455, size: 64, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !425)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !357, file: !356, line: 95, baseType: !307, size: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !357, file: !356, line: 95, baseType: !307, size: 32, offset: 1888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !357, file: !356, line: 96, baseType: !459, size: 64, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !357, file: !356, line: 96, baseType: !459, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !357, file: !356, line: 97, baseType: !312, size: 64, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !357, file: !356, line: 97, baseType: !311, size: 64, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !357, file: !356, line: 98, baseType: !307, size: 32, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !357, file: !356, line: 98, baseType: !307, size: 32, offset: 2208)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !357, file: !356, line: 99, baseType: !459, size: 64, offset: 2240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !357, file: !356, line: 99, baseType: !459, size: 64, offset: 2304)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !357, file: !356, line: 100, baseType: !468, size: 64, offset: 2368)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !419)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !357, file: !356, line: 100, baseType: !471, size: 64, offset: 2432)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !357, file: !356, line: 101, baseType: !307, size: 32, offset: 2496)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !357, file: !356, line: 101, baseType: !307, size: 32, offset: 2528)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !357, file: !356, line: 102, baseType: !459, size: 64, offset: 2560)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !357, file: !356, line: 102, baseType: !459, size: 64, offset: 2624)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !357, file: !356, line: 103, baseType: !477, size: 64, offset: 2688)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !469)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !357, file: !356, line: 103, baseType: !480, size: 64, offset: 2752)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !357, file: !356, line: 104, baseType: !412, size: 64, offset: 2816)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !357, file: !356, line: 105, baseType: !307, size: 32, offset: 2880)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !357, file: !356, line: 106, baseType: !484, size: 128, offset: 2944)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 128, elements: !491)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !356, line: 64, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 61, size: 128, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !487, file: !356, line: 62, baseType: !405, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !487, file: !356, line: 63, baseType: !453, size: 64, offset: 64)
!491 = !{!492}
!492 = !DISubrange(count: 2)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !357, file: !356, line: 107, baseType: !494, size: 64, offset: 3072)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 64, elements: !491)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !357, file: !356, line: 108, baseType: !453, size: 64, offset: 3136)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !357, file: !356, line: 109, baseType: !497, size: 64, offset: 3200)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!349, !453}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !357, file: !356, line: 111, baseType: !307, size: 32, offset: 3264)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !357, file: !356, line: 112, baseType: !502, size: 320, offset: 3328)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 320, elements: !547)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!349, !506, !370, !453}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !509)
!509 = !{!510, !511, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !508, file: !10, line: 100, baseType: !307, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !10, line: 101, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !523, !524, !525, !529, !530, !532, !533, !534}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !514, file: !10, line: 84, baseType: !443, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !514, file: !10, line: 85, baseType: !443, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !10, line: 86, baseType: !453, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !514, file: !10, line: 87, baseType: !435, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !514, file: !10, line: 88, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !514, file: !10, line: 89, baseType: !396, size: 8, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !514, file: !10, line: 90, baseType: !443, size: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !514, file: !10, line: 91, baseType: !526, size: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !527, line: 46, baseType: !528)
!527 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!528 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !514, file: !10, line: 92, baseType: !325, size: 32, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !10, line: 93, baseType: !531, size: 32, offset: 544)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !10, line: 94, baseType: !512, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !514, file: !10, line: 95, baseType: !443, size: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !514, file: !10, line: 96, baseType: !453, size: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !508, file: !10, line: 102, baseType: !443, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !508, file: !10, line: 102, baseType: !443, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !508, file: !10, line: 103, baseType: !443, size: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !508, file: !10, line: 104, baseType: !373, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !508, file: !10, line: 105, baseType: !325, size: 32, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !508, file: !10, line: 105, baseType: !325, size: 32, offset: 416)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !508, file: !10, line: 105, baseType: !325, size: 32, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !508, file: !10, line: 106, baseType: !370, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !508, file: !10, line: 107, baseType: !544, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!547 = !{!548}
!548 = !DISubrange(count: 5)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !357, file: !356, line: 113, baseType: !550, size: 320, offset: 3648)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 320, elements: !547)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!349, !370, !453}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !357, file: !356, line: 114, baseType: !555, size: 320, offset: 3968)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 320, elements: !547)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !357, file: !356, line: 115, baseType: !325, size: 32, offset: 4288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !357, file: !356, line: 120, baseType: !544, size: 64, offset: 4352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !357, file: !356, line: 121, baseType: !325, size: 32, offset: 4416)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !352, file: !303, line: 437, baseType: !560, size: 9472, offset: 4480)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 9472, elements: !413)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !303, line: 32, size: 9472, elements: !562)
!562 = !{!563, !572, !576, !577, !584, !588, !589, !590, !591, !592, !593, !594, !618, !622, !627, !633, !652, !657, !661, !662, !667, !672, !673, !678, !679, !683, !687, !691, !695, !696, !697, !698, !699, !703, !704, !709, !710, !711, !712, !713, !718, !725, !730, !734, !738, !742, !746, !747, !751, !752, !759, !764, !765, !766, !767, !829, !837, !838, !842, !843, !847, !848, !852, !857, !858, !862, !866, !873, !874, !875, !876, !877, !878, !883, !884, !888, !892, !896, !897, !898, !902, !912, !913, !917, !918, !922, !923, !927, !928, !933, !934, !938, !942, !943, !944, !945, !946, !947, !948, !952, !953, !954, !955, !956, !957, !961, !962, !963, !964, !965, !966, !967, !968, !972, !976, !977, !978, !982, !983, !984, !985, !986, !987, !988, !992, !993, !994, !999, !1003, !1004, !1008, !1009, !1010, !1011, !1037, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1051, !1052, !1053, !1057, !1061, !1062}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !561, file: !303, line: 34, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!349, !350, !307, !567, !307, !567, !569, !571}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !561, file: !303, line: 35, baseType: !573, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!349, !350, !307, !312, !311, !480}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !561, file: !303, line: 36, baseType: !573, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !561, file: !303, line: 37, baseType: !578, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!349, !350, !581, !581}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !561, file: !303, line: 38, baseType: !585, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!349, !350, !581, !581, !581}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !561, file: !303, line: 40, baseType: !578, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !561, file: !303, line: 41, baseType: !585, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !561, file: !303, line: 42, baseType: !578, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !561, file: !303, line: 43, baseType: !585, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !561, file: !303, line: 44, baseType: !578, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !561, file: !303, line: 46, baseType: !585, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !561, file: !303, line: 47, baseType: !595, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!349, !350, !598, !598, !602}
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !599, line: 11, baseType: !600)
!599 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !599, line: 11, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !605, file: !36, line: 1227, baseType: !469, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !605, file: !36, line: 1228, baseType: !469, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !605, file: !36, line: 1229, baseType: !469, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !605, file: !36, line: 1230, baseType: !469, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !605, file: !36, line: 1231, baseType: !469, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !605, file: !36, line: 1232, baseType: !469, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !605, file: !36, line: 1233, baseType: !469, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !605, file: !36, line: 1234, baseType: !469, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !605, file: !36, line: 1236, baseType: !469, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !605, file: !36, line: 1237, baseType: !469, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !605, file: !36, line: 1238, baseType: !469, size: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !561, file: !303, line: 48, baseType: !619, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!349, !350, !598, !602}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !561, file: !303, line: 49, baseType: !623, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!349, !350, !581, !469, !626, !469, !307, !307, !581}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !561, file: !303, line: 50, baseType: !628, size: 64, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!349, !350, !631, !632}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !561, file: !303, line: 52, baseType: !634, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!349, !350, !637, !638}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !640, file: !36, line: 593, baseType: !418, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !640, file: !36, line: 594, baseType: !418, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !640, file: !36, line: 594, baseType: !418, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !640, file: !36, line: 594, baseType: !418, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !640, file: !36, line: 595, baseType: !418, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !640, file: !36, line: 596, baseType: !418, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !640, file: !36, line: 597, baseType: !418, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !640, file: !36, line: 598, baseType: !418, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !640, file: !36, line: 598, baseType: !418, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !640, file: !36, line: 599, baseType: !418, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !561, file: !303, line: 53, baseType: !653, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!349, !350, !350, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !561, file: !303, line: 54, baseType: !658, size: 64, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!349, !350, !581}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !561, file: !303, line: 55, baseType: !578, size: 64, offset: 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !561, file: !303, line: 56, baseType: !663, size: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!349, !350, !666, !468}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !561, file: !303, line: 58, baseType: !668, size: 64, offset: 1280)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!349, !350, !671}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !561, file: !303, line: 59, baseType: !668, size: 64, offset: 1344)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !561, file: !303, line: 60, baseType: !674, size: 64, offset: 1408)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!349, !350, !677, !325}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !561, file: !303, line: 61, baseType: !346, size: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !561, file: !303, line: 63, baseType: !680, size: 64, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!349, !350, !307, !567, !478, !581, !581}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !561, file: !303, line: 64, baseType: !684, size: 64, offset: 1600)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!349, !350, !350, !598, !598, !602}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !561, file: !303, line: 65, baseType: !688, size: 64, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!349, !350, !350, !602}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !561, file: !303, line: 66, baseType: !692, size: 64, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!349, !350, !350, !598, !602}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !561, file: !303, line: 67, baseType: !688, size: 64, offset: 1792)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !561, file: !303, line: 69, baseType: !346, size: 64, offset: 1856)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !561, file: !303, line: 70, baseType: !684, size: 64, offset: 1920)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !561, file: !303, line: 71, baseType: !692, size: 64, offset: 1984)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !561, file: !303, line: 72, baseType: !700, size: 64, offset: 2048)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!349, !350, !632}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !561, file: !303, line: 73, baseType: !346, size: 64, offset: 2112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !561, file: !303, line: 75, baseType: !705, size: 64, offset: 2176)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!349, !350, !708, !632}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !561, file: !303, line: 76, baseType: !578, size: 64, offset: 2240)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !561, file: !303, line: 77, baseType: !578, size: 64, offset: 2304)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !561, file: !303, line: 78, baseType: !595, size: 64, offset: 2368)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !561, file: !303, line: 79, baseType: !619, size: 64, offset: 2432)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !561, file: !303, line: 81, baseType: !714, size: 64, offset: 2496)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!349, !350, !478, !350, !717}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !561, file: !303, line: 82, baseType: !719, size: 64, offset: 2560)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!349, !350, !307, !722, !722, !631, !724}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !561, file: !303, line: 83, baseType: !726, size: 64, offset: 2624)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!349, !350, !307, !729, !307}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !561, file: !303, line: 84, baseType: !731, size: 64, offset: 2688)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!349, !350, !307, !567, !307, !567, !477}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !561, file: !303, line: 85, baseType: !735, size: 64, offset: 2752)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!349, !350, !350, !717}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !561, file: !303, line: 87, baseType: !739, size: 64, offset: 2816)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!349, !350, !581, !312}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !561, file: !303, line: 88, baseType: !743, size: 64, offset: 2880)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!349, !350, !478}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !561, file: !303, line: 89, baseType: !743, size: 64, offset: 2944)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !561, file: !303, line: 90, baseType: !748, size: 64, offset: 3008)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!349, !350, !581, !571}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !561, file: !303, line: 91, baseType: !680, size: 64, offset: 3072)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !561, file: !303, line: 93, baseType: !753, size: 64, offset: 3136)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!349, !350, !756}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !561, file: !303, line: 94, baseType: !760, size: 64, offset: 3200)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!349, !350, !307, !325, !325, !312, !763, !763, !656}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !561, file: !303, line: 95, baseType: !760, size: 64, offset: 3264)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !561, file: !303, line: 96, baseType: !760, size: 64, offset: 3328)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !561, file: !303, line: 97, baseType: !760, size: 64, offset: 3392)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !561, file: !303, line: 99, baseType: !768, size: 64, offset: 3456)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!349, !350, !771, !774}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !599, line: 51, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !599, line: 51, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !303, line: 609, size: 6208, elements: !777)
!777 = !{!778, !779, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !798, !805, !806, !807, !808, !809, !810, !811, !812, !816, !817, !818, !819, !820, !822, !823, !824, !825, !826, !827, !828}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !776, file: !303, line: 610, baseType: !355, size: 4480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !776, file: !303, line: 610, baseType: !780, size: 32, offset: 4480)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !413)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !776, file: !303, line: 611, baseType: !307, size: 32, offset: 4512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !776, file: !303, line: 611, baseType: !307, size: 32, offset: 4544)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !776, file: !303, line: 611, baseType: !307, size: 32, offset: 4576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !776, file: !303, line: 612, baseType: !307, size: 32, offset: 4608)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !776, file: !303, line: 613, baseType: !307, size: 32, offset: 4640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !776, file: !303, line: 614, baseType: !312, size: 64, offset: 4672)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !776, file: !303, line: 615, baseType: !311, size: 64, offset: 4736)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !776, file: !303, line: 616, baseType: !729, size: 64, offset: 4800)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !776, file: !303, line: 617, baseType: !312, size: 64, offset: 4864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !776, file: !303, line: 618, baseType: !791, size: 64, offset: 4928)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !303, line: 602, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 598, size: 128, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !793, file: !303, line: 599, baseType: !307, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !793, file: !303, line: 600, baseType: !307, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !793, file: !303, line: 601, baseType: !477, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !776, file: !303, line: 619, baseType: !799, size: 64, offset: 4992)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !303, line: 607, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 604, size: 128, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !801, file: !303, line: 605, baseType: !307, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !801, file: !303, line: 606, baseType: !477, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !776, file: !303, line: 620, baseType: !477, size: 64, offset: 5056)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !776, file: !303, line: 621, baseType: !469, size: 64, offset: 5120)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !776, file: !303, line: 622, baseType: !469, size: 64, offset: 5184)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !776, file: !303, line: 623, baseType: !581, size: 64, offset: 5248)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !776, file: !303, line: 623, baseType: !581, size: 64, offset: 5312)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !776, file: !303, line: 623, baseType: !581, size: 64, offset: 5376)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !776, file: !303, line: 624, baseType: !325, size: 32, offset: 5440)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !776, file: !303, line: 625, baseType: !813, size: 64, offset: 5504)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!349}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !776, file: !303, line: 626, baseType: !453, size: 64, offset: 5568)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !776, file: !303, line: 627, baseType: !581, size: 64, offset: 5632)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !776, file: !303, line: 628, baseType: !307, size: 32, offset: 5696)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !776, file: !303, line: 629, baseType: !394, size: 64, offset: 5760)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !776, file: !303, line: 630, baseType: !821, size: 32, offset: 5824)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !776, file: !303, line: 631, baseType: !307, size: 32, offset: 5856)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !776, file: !303, line: 631, baseType: !307, size: 32, offset: 5888)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !776, file: !303, line: 632, baseType: !325, size: 32, offset: 5920)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !776, file: !303, line: 633, baseType: !325, size: 32, offset: 5952)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !776, file: !303, line: 634, baseType: !405, size: 64, offset: 6016)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !776, file: !303, line: 634, baseType: !453, size: 64, offset: 6080)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !776, file: !303, line: 635, baseType: !424, size: 64, offset: 6144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !561, file: !303, line: 100, baseType: !830, size: 64, offset: 3520)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!349, !350, !307, !307, !833, !836}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !835)
!835 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !561, file: !303, line: 101, baseType: !346, size: 64, offset: 3584)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !561, file: !303, line: 102, baseType: !839, size: 64, offset: 3648)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!349, !350, !598, !598, !632}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !561, file: !303, line: 103, baseType: !564, size: 64, offset: 3712)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !561, file: !303, line: 105, baseType: !844, size: 64, offset: 3776)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!349, !350, !598, !598, !631, !632}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !561, file: !303, line: 106, baseType: !346, size: 64, offset: 3840)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !561, file: !303, line: 107, baseType: !849, size: 64, offset: 3904)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!349, !350, !381}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !561, file: !303, line: 108, baseType: !853, size: 64, offset: 3968)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!349, !350, !856, !631, !632}
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !394)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !561, file: !303, line: 109, baseType: !813, size: 64, offset: 4032)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !561, file: !303, line: 111, baseType: !859, size: 64, offset: 4096)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!349, !350, !350, !350, !469, !350}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !561, file: !303, line: 112, baseType: !863, size: 64, offset: 4160)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!349, !350, !350, !350, !350}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !561, file: !303, line: 113, baseType: !867, size: 64, offset: 4224)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!349, !350, !870, !870}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !599, line: 30, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !599, line: 30, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !561, file: !303, line: 114, baseType: !564, size: 64, offset: 4288)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !561, file: !303, line: 115, baseType: !680, size: 64, offset: 4352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !561, file: !303, line: 117, baseType: !739, size: 64, offset: 4416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !561, file: !303, line: 118, baseType: !739, size: 64, offset: 4480)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !561, file: !303, line: 119, baseType: !853, size: 64, offset: 4544)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !561, file: !303, line: 120, baseType: !879, size: 64, offset: 4608)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!349, !350, !882, !656}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !561, file: !303, line: 121, baseType: !813, size: 64, offset: 4672)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !561, file: !303, line: 123, baseType: !885, size: 64, offset: 4736)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!349, !350, !307, !453}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !561, file: !303, line: 124, baseType: !889, size: 64, offset: 4800)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!349, !350, !774, !581, !453}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !561, file: !303, line: 125, baseType: !893, size: 64, offset: 4864)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!349, !506, !350}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !561, file: !303, line: 126, baseType: !578, size: 64, offset: 4928)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !561, file: !303, line: 127, baseType: !578, size: 64, offset: 4992)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !561, file: !303, line: 129, baseType: !899, size: 64, offset: 5056)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!349, !350, !729}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !561, file: !303, line: 130, baseType: !903, size: 64, offset: 5120)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!349, !350, !906, !906}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !908, file: !60, line: 653, baseType: !307, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !908, file: !60, line: 653, baseType: !581, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !561, file: !303, line: 131, baseType: !903, size: 64, offset: 5184)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !561, file: !303, line: 132, baseType: !914, size: 64, offset: 5248)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!349, !350, !312, !312, !312}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !561, file: !303, line: 133, baseType: !849, size: 64, offset: 5312)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !561, file: !303, line: 135, baseType: !919, size: 64, offset: 5376)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!349, !350, !469, !656}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !561, file: !303, line: 136, baseType: !919, size: 64, offset: 5440)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !561, file: !303, line: 137, baseType: !924, size: 64, offset: 5504)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!349, !350, !656}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !561, file: !303, line: 138, baseType: !564, size: 64, offset: 5568)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !561, file: !303, line: 139, baseType: !929, size: 64, offset: 5632)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!349, !350, !932, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !561, file: !303, line: 141, baseType: !813, size: 64, offset: 5696)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !561, file: !303, line: 142, baseType: !935, size: 64, offset: 5760)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!349, !350, !350, !469, !350}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !561, file: !303, line: 143, baseType: !939, size: 64, offset: 5824)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!349, !350, !350, !350}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !561, file: !303, line: 144, baseType: !813, size: 64, offset: 5888)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !561, file: !303, line: 145, baseType: !935, size: 64, offset: 5952)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !561, file: !303, line: 147, baseType: !939, size: 64, offset: 6016)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !561, file: !303, line: 148, baseType: !813, size: 64, offset: 6080)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !561, file: !303, line: 149, baseType: !935, size: 64, offset: 6144)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !561, file: !303, line: 150, baseType: !939, size: 64, offset: 6208)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !561, file: !303, line: 151, baseType: !949, size: 64, offset: 6272)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!349, !350, !325}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !561, file: !303, line: 153, baseType: !346, size: 64, offset: 6336)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !561, file: !303, line: 154, baseType: !346, size: 64, offset: 6400)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !561, file: !303, line: 155, baseType: !346, size: 64, offset: 6464)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !561, file: !303, line: 156, baseType: !346, size: 64, offset: 6528)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !561, file: !303, line: 157, baseType: !849, size: 64, offset: 6592)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !561, file: !303, line: 159, baseType: !958, size: 64, offset: 6656)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!349, !350, !307, !569}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !561, file: !303, line: 160, baseType: !346, size: 64, offset: 6720)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !561, file: !303, line: 161, baseType: !346, size: 64, offset: 6784)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !561, file: !303, line: 162, baseType: !346, size: 64, offset: 6848)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !561, file: !303, line: 163, baseType: !346, size: 64, offset: 6912)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !561, file: !303, line: 165, baseType: !939, size: 64, offset: 6976)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !561, file: !303, line: 166, baseType: !939, size: 64, offset: 7040)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !561, file: !303, line: 167, baseType: !739, size: 64, offset: 7104)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !561, file: !303, line: 168, baseType: !969, size: 64, offset: 7168)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!349, !350, !581, !307}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !561, file: !303, line: 169, baseType: !973, size: 64, offset: 7232)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!349, !350, !656, !312}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !561, file: !303, line: 171, baseType: !700, size: 64, offset: 7296)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !561, file: !303, line: 172, baseType: !346, size: 64, offset: 7360)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !561, file: !303, line: 173, baseType: !979, size: 64, offset: 7424)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!349, !350, !312, !763}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !561, file: !303, line: 174, baseType: !839, size: 64, offset: 7488)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !561, file: !303, line: 175, baseType: !839, size: 64, offset: 7552)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !561, file: !303, line: 177, baseType: !578, size: 64, offset: 7616)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !561, file: !303, line: 178, baseType: !628, size: 64, offset: 7680)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !561, file: !303, line: 179, baseType: !578, size: 64, offset: 7744)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !561, file: !303, line: 180, baseType: !585, size: 64, offset: 7808)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !561, file: !303, line: 181, baseType: !989, size: 64, offset: 7872)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!349, !350, !373, !631, !632}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !561, file: !303, line: 183, baseType: !899, size: 64, offset: 7936)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !561, file: !303, line: 184, baseType: !663, size: 64, offset: 8000)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !561, file: !303, line: 185, baseType: !995, size: 64, offset: 8064)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!349, !350, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !561, file: !303, line: 186, baseType: !1000, size: 64, offset: 8128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!349, !350, !307, !567, !477}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !561, file: !303, line: 187, baseType: !719, size: 64, offset: 8192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !561, file: !303, line: 189, baseType: !1005, size: 64, offset: 8256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!349, !350, !307, !307, !312, !569}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !561, file: !303, line: 190, baseType: !813, size: 64, offset: 8320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !561, file: !303, line: 191, baseType: !935, size: 64, offset: 8384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !561, file: !303, line: 192, baseType: !939, size: 64, offset: 8448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !561, file: !303, line: 193, baseType: !1012, size: 64, offset: 8512)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!349, !350, !771, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !303, line: 660, size: 5312, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1017, file: !303, line: 661, baseType: !355, size: 4480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1017, file: !303, line: 661, baseType: !780, size: 32, offset: 4480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1017, file: !303, line: 662, baseType: !307, size: 32, offset: 4512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1017, file: !303, line: 662, baseType: !307, size: 32, offset: 4544)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1017, file: !303, line: 662, baseType: !307, size: 32, offset: 4576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1017, file: !303, line: 663, baseType: !307, size: 32, offset: 4608)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1017, file: !303, line: 664, baseType: !307, size: 32, offset: 4640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1017, file: !303, line: 665, baseType: !312, size: 64, offset: 4672)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1017, file: !303, line: 666, baseType: !312, size: 64, offset: 4736)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1017, file: !303, line: 667, baseType: !307, size: 32, offset: 4800)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1017, file: !303, line: 668, baseType: !821, size: 32, offset: 4832)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1017, file: !303, line: 670, baseType: !312, size: 64, offset: 4864)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1017, file: !303, line: 670, baseType: !312, size: 64, offset: 4928)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1017, file: !303, line: 671, baseType: !312, size: 64, offset: 4992)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1017, file: !303, line: 672, baseType: !312, size: 64, offset: 5056)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1017, file: !303, line: 673, baseType: !312, size: 64, offset: 5120)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1017, file: !303, line: 674, baseType: !307, size: 32, offset: 5184)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1017, file: !303, line: 675, baseType: !312, size: 64, offset: 5248)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !561, file: !303, line: 195, baseType: !1038, size: 64, offset: 8576)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!349, !1015, !350, !350}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !561, file: !303, line: 196, baseType: !1038, size: 64, offset: 8640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !561, file: !303, line: 197, baseType: !813, size: 64, offset: 8704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !561, file: !303, line: 198, baseType: !935, size: 64, offset: 8768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !561, file: !303, line: 199, baseType: !939, size: 64, offset: 8832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !561, file: !303, line: 201, baseType: !1046, size: 64, offset: 8896)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!349, !350, !307, !307}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !561, file: !303, line: 202, baseType: !714, size: 64, offset: 8960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !561, file: !303, line: 203, baseType: !585, size: 64, offset: 9024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !561, file: !303, line: 204, baseType: !768, size: 64, offset: 9088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !561, file: !303, line: 205, baseType: !899, size: 64, offset: 9152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !561, file: !303, line: 206, baseType: !1054, size: 64, offset: 9216)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!349, !373, !350, !307, !631, !632}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !561, file: !303, line: 208, baseType: !1058, size: 64, offset: 9280)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!349, !307, !724}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !561, file: !303, line: 209, baseType: !939, size: 64, offset: 9344)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !561, file: !303, line: 210, baseType: !731, size: 64, offset: 9408)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !352, file: !303, line: 438, baseType: !1064, size: 64, offset: 13952)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !599, line: 60, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1066, file: !114, line: 241, baseType: !373, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !114, line: 242, baseType: !433, size: 32, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1066, file: !114, line: 243, baseType: !307, size: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1066, file: !114, line: 243, baseType: !307, size: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1066, file: !114, line: 244, baseType: !307, size: 32, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1066, file: !114, line: 244, baseType: !307, size: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1066, file: !114, line: 245, baseType: !312, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1066, file: !114, line: 246, baseType: !325, size: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1066, file: !114, line: 247, baseType: !307, size: 32, offset: 352)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1066, file: !114, line: 251, baseType: !307, size: 32, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1066, file: !114, line: 252, baseType: !870, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1066, file: !114, line: 253, baseType: !325, size: 32, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1066, file: !114, line: 254, baseType: !307, size: 32, offset: 544)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1066, file: !114, line: 254, baseType: !307, size: 32, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1066, file: !114, line: 255, baseType: !307, size: 32, offset: 608)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !352, file: !303, line: 438, baseType: !1064, size: 64, offset: 14016)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !303, line: 439, baseType: !453, size: 64, offset: 14080)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !352, file: !303, line: 440, baseType: !1086, size: 32, offset: 14144)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !352, file: !303, line: 441, baseType: !325, size: 32, offset: 14176)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !352, file: !303, line: 442, baseType: !325, size: 32, offset: 14208)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !352, file: !303, line: 443, baseType: !1090, size: 448, offset: 14272)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 448, elements: !1092)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !394)
!1092 = !{!1093}
!1093 = !DISubrange(count: 7)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !352, file: !303, line: 444, baseType: !325, size: 32, offset: 14720)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !352, file: !303, line: 445, baseType: !325, size: 32, offset: 14752)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !352, file: !303, line: 446, baseType: !307, size: 32, offset: 14784)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !352, file: !303, line: 447, baseType: !455, size: 64, offset: 14848)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !352, file: !303, line: 448, baseType: !455, size: 64, offset: 14912)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !352, file: !303, line: 449, baseType: !639, size: 640, offset: 14976)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !352, file: !303, line: 450, baseType: !571, size: 32, offset: 15616)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !352, file: !303, line: 451, baseType: !1102, size: 2880, offset: 15680)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !303, line: 318, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !303, line: 319, size: 2880, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1124, !1125, !1130, !1135, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1150, !1151, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1183, !1184, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1207, !1208, !1209, !1213, !1214}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1103, file: !303, line: 320, baseType: !307, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1103, file: !303, line: 321, baseType: !307, size: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1103, file: !303, line: 322, baseType: !307, size: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1103, file: !303, line: 323, baseType: !307, size: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1103, file: !303, line: 324, baseType: !307, size: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1103, file: !303, line: 325, baseType: !307, size: 32, offset: 160)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1103, file: !303, line: 326, baseType: !1112, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !303, line: 293, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !303, line: 295, size: 448, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !303, line: 296, baseType: !1112, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1114, file: !303, line: 297, baseType: !477, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1114, file: !303, line: 297, baseType: !477, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1114, file: !303, line: 298, baseType: !312, size: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1114, file: !303, line: 298, baseType: !312, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1114, file: !303, line: 299, baseType: !307, size: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1114, file: !303, line: 300, baseType: !307, size: 32, offset: 352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1114, file: !303, line: 301, baseType: !307, size: 32, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1103, file: !303, line: 326, baseType: !1112, size: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1103, file: !303, line: 328, baseType: !1126, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!349, !350, !1129, !312}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1103, file: !303, line: 329, baseType: !1131, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!349, !1129, !1134, !311, !311, !480, !312}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1103, file: !303, line: 330, baseType: !1136, size: 64, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!349, !1129}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1103, file: !303, line: 331, baseType: !1136, size: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1103, file: !303, line: 334, baseType: !373, size: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !303, line: 335, baseType: !433, size: 32, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1103, file: !303, line: 335, baseType: !433, size: 32, offset: 672)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1103, file: !303, line: 336, baseType: !433, size: 32, offset: 704)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1103, file: !303, line: 336, baseType: !433, size: 32, offset: 736)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1103, file: !303, line: 337, baseType: !1146, size: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !374, line: 339, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !374, line: 339, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1103, file: !303, line: 338, baseType: !1146, size: 64, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1103, file: !303, line: 339, baseType: !1152, size: 64, offset: 896)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !374, line: 341, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !374, line: 351, size: 192, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1154, file: !374, line: 354, baseType: !72, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1154, file: !374, line: 355, baseType: !72, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1154, file: !374, line: 356, baseType: !72, size: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1154, file: !374, line: 361, baseType: !72, size: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1154, file: !374, line: 362, baseType: !526, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1103, file: !303, line: 340, baseType: !307, size: 32, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1103, file: !303, line: 340, baseType: !307, size: 32, offset: 992)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1103, file: !303, line: 341, baseType: !477, size: 64, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1103, file: !303, line: 342, baseType: !312, size: 64, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1103, file: !303, line: 343, baseType: !480, size: 64, offset: 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1103, file: !303, line: 344, baseType: !311, size: 64, offset: 1216)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1103, file: !303, line: 345, baseType: !307, size: 32, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1103, file: !303, line: 346, baseType: !1134, size: 64, offset: 1344)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1103, file: !303, line: 347, baseType: !325, size: 32, offset: 1408)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1103, file: !303, line: 348, baseType: !307, size: 32, offset: 1440)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1103, file: !303, line: 351, baseType: !325, size: 32, offset: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1103, file: !303, line: 352, baseType: !325, size: 32, offset: 1504)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1103, file: !303, line: 353, baseType: !433, size: 32, offset: 1536)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1103, file: !303, line: 354, baseType: !433, size: 32, offset: 1568)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1103, file: !303, line: 355, baseType: !1134, size: 64, offset: 1600)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1103, file: !303, line: 356, baseType: !1134, size: 64, offset: 1664)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1103, file: !303, line: 357, baseType: !1178, size: 64, offset: 1728)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !303, line: 310, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 308, size: 32, elements: !1181)
!1181 = !{!1182}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1180, file: !303, line: 309, baseType: !307, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1103, file: !303, line: 357, baseType: !1178, size: 64, offset: 1792)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1103, file: !303, line: 358, baseType: !1185, size: 64, offset: 1856)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !303, line: 316, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 312, size: 128, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1187, file: !303, line: 313, baseType: !453, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1187, file: !303, line: 314, baseType: !307, size: 32, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1187, file: !303, line: 315, baseType: !396, size: 8, offset: 96)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1103, file: !303, line: 359, baseType: !1185, size: 64, offset: 1920)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1103, file: !303, line: 360, baseType: !1185, size: 64, offset: 1984)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1103, file: !303, line: 361, baseType: !307, size: 32, offset: 2048)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1103, file: !303, line: 362, baseType: !433, size: 32, offset: 2080)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1103, file: !303, line: 363, baseType: !307, size: 32, offset: 2112)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1103, file: !303, line: 364, baseType: !1134, size: 64, offset: 2176)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1103, file: !303, line: 365, baseType: !1152, size: 64, offset: 2240)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1103, file: !303, line: 366, baseType: !433, size: 32, offset: 2304)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1103, file: !303, line: 367, baseType: !433, size: 32, offset: 2336)
