; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bncg/bncg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bncg/bncg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!67 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!68 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!69 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!70 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!71 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!72 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!73 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!74 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!75 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!76 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 119, baseType: !7, size: 32, elements: !79)
!78 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!80 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!122 = !{!123, !205, !209, !210, !213, !376}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNCG", file: !125, line: 50, baseType: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bncg/bncg.h", directory: "/home/users/ndemeye/xSDK")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 10, size: 3456, elements: !127)
!127 = !{!128, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !200, !201, !202, !203, !204}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !126, file: !125, line: 11, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !130, line: 16, baseType: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !130, line: 16, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !126, file: !125, line: 12, baseType: !129, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "G_old", scope: !126, file: !125, line: 13, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !55, line: 21, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !55, line: 21, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "X_old", scope: !126, file: !125, line: 13, baseType: !135, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !126, file: !125, line: 13, baseType: !135, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !126, file: !125, line: 13, baseType: !135, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "g_work", scope: !126, file: !125, line: 14, baseType: !135, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "y_work", scope: !126, file: !125, line: 14, baseType: !135, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "d_work", scope: !126, file: !125, line: 14, baseType: !135, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !126, file: !125, line: 15, baseType: !135, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "yk", scope: !126, file: !125, line: 15, baseType: !135, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient", scope: !126, file: !125, line: 16, baseType: !135, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient_old", scope: !126, file: !125, line: 16, baseType: !135, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_grad", scope: !126, file: !125, line: 17, baseType: !135, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_step", scope: !126, file: !125, line: 17, baseType: !135, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "active_lower", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !152, line: 11, baseType: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !152, line: 11, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "active_upper", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "active_fixed", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "active_idx", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_idx", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_old", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "new_inactives", scope: !126, file: !125, line: 19, baseType: !151, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !126, file: !125, line: 21, baseType: !162, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !163)
!163 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "hz_theta", scope: !126, file: !125, line: 22, baseType: !162, size: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !126, file: !125, line: 23, baseType: !162, size: 64, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !126, file: !125, line: 24, baseType: !162, size: 64, offset: 1600)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "zeta", scope: !126, file: !125, line: 25, baseType: !162, size: 64, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "hz_eta", scope: !126, file: !125, line: 26, baseType: !162, size: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dk_eta", scope: !126, file: !125, line: 26, baseType: !162, size: 64, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_scale", scope: !126, file: !125, line: 27, baseType: !162, size: 64, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dfp_scale", scope: !126, file: !125, line: 27, baseType: !162, size: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tau_bfgs", scope: !126, file: !125, line: 28, baseType: !162, size: 64, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tau_dfp", scope: !126, file: !125, line: 28, baseType: !162, size: 64, offset: 2048)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "as_step", scope: !126, file: !125, line: 29, baseType: !162, size: 64, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "as_tol", scope: !126, file: !125, line: 29, baseType: !162, size: 64, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "yts", scope: !126, file: !125, line: 29, baseType: !162, size: 64, offset: 2240)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "yty", scope: !126, file: !125, line: 29, baseType: !162, size: 64, offset: 2304)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sts", scope: !126, file: !125, line: 29, baseType: !162, size: 64, offset: 2368)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !126, file: !125, line: 30, baseType: !162, size: 64, offset: 2432)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "delta_min", scope: !126, file: !125, line: 30, baseType: !162, size: 64, offset: 2496)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "delta_max", scope: !126, file: !125, line: 30, baseType: !162, size: 64, offset: 2560)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !126, file: !125, line: 31, baseType: !162, size: 64, offset: 2624)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "eps_23", scope: !126, file: !125, line: 32, baseType: !162, size: 64, offset: 2688)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cg_type", scope: !126, file: !125, line: 34, baseType: !185, size: 32, offset: 2752)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "min_restart_num", scope: !126, file: !125, line: 35, baseType: !185, size: 32, offset: 2784)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ls_fails", scope: !126, file: !125, line: 36, baseType: !185, size: 32, offset: 2816)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resets", scope: !126, file: !125, line: 36, baseType: !185, size: 32, offset: 2848)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "descent_error", scope: !126, file: !125, line: 36, baseType: !185, size: 32, offset: 2880)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_updates", scope: !126, file: !125, line: 36, baseType: !185, size: 32, offset: 2912)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pure_gd_steps", scope: !126, file: !125, line: 36, baseType: !185, size: 32, offset: 2944)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "iter_quad", scope: !126, file: !125, line: 37, baseType: !185, size: 32, offset: 2976)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "min_quad", scope: !126, file: !125, line: 37, baseType: !185, size: 32, offset: 3008)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "as_type", scope: !126, file: !125, line: 38, baseType: !185, size: 32, offset: 3040)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "inv_sig", scope: !126, file: !125, line: 40, baseType: !196, size: 32, offset: 3072)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tol_quad", scope: !126, file: !125, line: 41, baseType: !162, size: 64, offset: 3136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_restart", scope: !126, file: !125, line: 42, baseType: !196, size: 32, offset: 3200)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "spaced_restart", scope: !126, file: !125, line: 43, baseType: !196, size: 32, offset: 3232)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "use_dynamic_restart", scope: !126, file: !125, line: 44, baseType: !196, size: 32, offset: 3264)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "neg_xi", scope: !126, file: !125, line: 45, baseType: !196, size: 32, offset: 3296)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "unscaled_restart", scope: !126, file: !125, line: 46, baseType: !196, size: 32, offset: 3328)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "diag_scaling", scope: !126, file: !125, line: 47, baseType: !196, size: 32, offset: 3360)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "no_scaling", scope: !126, file: !125, line: 48, baseType: !196, size: 32, offset: 3392)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !206, line: 330, baseType: !207)
!206 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !206, line: 330, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !216, line: 73, size: 4480, elements: !217)
!216 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!217 = !{!218, !220, !266, !267, !268, !270, !271, !272, !273, !281, !282, !284, !288, !292, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !305, !306, !307, !309, !310, !312, !314, !315, !316, !317, !318, !320, !322, !323, !324, !325, !326, !329, !331, !332, !333, !343, !345, !346, !350, !351, !399, !404, !406, !407, !408}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !215, file: !216, line: 74, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !215, file: !216, line: 75, baseType: !221, size: 448, offset: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 448, elements: !264)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !216, line: 53, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 45, size: 448, elements: !224)
!224 = !{!225, !231, !239, !244, !248, !252, !259}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !223, file: !216, line: 46, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !213, !230}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !223, file: !216, line: 47, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!229, !213, !235}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !236, line: 16, baseType: !237)
!236 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !236, line: 16, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !223, file: !216, line: 48, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!229, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !223, file: !216, line: 49, baseType: !245, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!229, !213, !210, !213}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !223, file: !216, line: 50, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!229, !213, !210, !243}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !223, file: !216, line: 51, baseType: !253, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!229, !213, !210, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !223, file: !216, line: 52, baseType: !260, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!229, !213, !210, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!264 = !{!265}
!265 = !DISubrange(count: 1)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !215, file: !216, line: 76, baseType: !205, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !216, line: 77, baseType: !185, size: 32, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !215, file: !216, line: 78, baseType: !269, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !163)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !215, file: !216, line: 78, baseType: !269, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !215, file: !216, line: 78, baseType: !269, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !215, file: !216, line: 78, baseType: !269, size: 64, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !215, file: !216, line: 79, baseType: !274, size: 64, offset: 896)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !277, line: 27, baseType: !278)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !279, line: 43, baseType: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!280 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !215, file: !216, line: 80, baseType: !185, size: 32, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !215, file: !216, line: 81, baseType: !283, size: 32, offset: 992)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !215, file: !216, line: 82, baseType: !285, size: 64, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !215, file: !216, line: 83, baseType: !289, size: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !215, file: !216, line: 84, baseType: !293, size: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !215, file: !216, line: 85, baseType: !293, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !215, file: !216, line: 86, baseType: !293, size: 64, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !215, file: !216, line: 87, baseType: !293, size: 64, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !215, file: !216, line: 88, baseType: !213, size: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !215, file: !216, line: 89, baseType: !274, size: 64, offset: 1472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !216, line: 90, baseType: !293, size: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !215, file: !216, line: 91, baseType: !293, size: 64, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !215, file: !216, line: 92, baseType: !185, size: 32, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !215, file: !216, line: 93, baseType: !209, size: 64, offset: 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !215, file: !216, line: 94, baseType: !304, size: 64, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !275)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !215, file: !216, line: 95, baseType: !185, size: 32, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !215, file: !216, line: 95, baseType: !185, size: 32, offset: 1888)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !215, file: !216, line: 96, baseType: !308, size: 64, offset: 1920)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !215, file: !216, line: 96, baseType: !308, size: 64, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !215, file: !216, line: 97, baseType: !311, size: 64, offset: 2048)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !215, file: !216, line: 97, baseType: !313, size: 64, offset: 2112)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !215, file: !216, line: 98, baseType: !185, size: 32, offset: 2176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !215, file: !216, line: 98, baseType: !185, size: 32, offset: 2208)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !215, file: !216, line: 99, baseType: !308, size: 64, offset: 2240)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !215, file: !216, line: 99, baseType: !308, size: 64, offset: 2304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !215, file: !216, line: 100, baseType: !319, size: 64, offset: 2368)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !215, file: !216, line: 100, baseType: !321, size: 64, offset: 2432)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !215, file: !216, line: 101, baseType: !185, size: 32, offset: 2496)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !215, file: !216, line: 101, baseType: !185, size: 32, offset: 2528)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !215, file: !216, line: 102, baseType: !308, size: 64, offset: 2560)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !215, file: !216, line: 102, baseType: !308, size: 64, offset: 2624)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !215, file: !216, line: 103, baseType: !327, size: 64, offset: 2688)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !162)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !215, file: !216, line: 103, baseType: !330, size: 64, offset: 2752)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !215, file: !216, line: 104, baseType: !263, size: 64, offset: 2816)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !215, file: !216, line: 105, baseType: !185, size: 32, offset: 2880)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !215, file: !216, line: 106, baseType: !334, size: 128, offset: 2944)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 128, elements: !341)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !216, line: 64, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 61, size: 128, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !337, file: !216, line: 62, baseType: !256, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !337, file: !216, line: 63, baseType: !209, size: 64, offset: 64)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !215, file: !216, line: 107, baseType: !344, size: 64, offset: 3072)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !341)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !215, file: !216, line: 108, baseType: !209, size: 64, offset: 3136)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !215, file: !216, line: 109, baseType: !347, size: 64, offset: 3200)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!229, !209}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !215, file: !216, line: 111, baseType: !185, size: 32, offset: 3264)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !215, file: !216, line: 112, baseType: !352, size: 320, offset: 3328)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 320, elements: !397)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!229, !356, !213, !209}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !359)
!359 = !{!360, !361, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !358, file: !12, line: 100, baseType: !185, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !12, line: 101, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !373, !374, !375, !379, !380, !382, !383, !384}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !364, file: !12, line: 84, baseType: !293, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !364, file: !12, line: 85, baseType: !293, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !12, line: 86, baseType: !209, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !364, file: !12, line: 87, baseType: !285, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !364, file: !12, line: 88, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !364, file: !12, line: 89, baseType: !212, size: 8, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !364, file: !12, line: 90, baseType: !293, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !364, file: !12, line: 91, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !377, line: 46, baseType: !378)
!377 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!378 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !364, file: !12, line: 92, baseType: !196, size: 32, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !12, line: 93, baseType: !381, size: 32, offset: 544)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !12, line: 94, baseType: !362, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !364, file: !12, line: 95, baseType: !293, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !364, file: !12, line: 96, baseType: !209, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !358, file: !12, line: 102, baseType: !293, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !358, file: !12, line: 102, baseType: !293, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !358, file: !12, line: 103, baseType: !293, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !358, file: !12, line: 104, baseType: !205, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !358, file: !12, line: 105, baseType: !196, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !358, file: !12, line: 105, baseType: !196, size: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !358, file: !12, line: 105, baseType: !196, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !358, file: !12, line: 106, baseType: !213, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !358, file: !12, line: 107, baseType: !394, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!397 = !{!398}
!398 = !DISubrange(count: 5)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !215, file: !216, line: 113, baseType: !400, size: 320, offset: 3648)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 320, elements: !397)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!229, !213, !209}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !215, file: !216, line: 114, baseType: !405, size: 320, offset: 3968)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 320, elements: !397)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !215, file: !216, line: 115, baseType: !196, size: 32, offset: 4288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !215, file: !216, line: 120, baseType: !394, size: 64, offset: 4352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !215, file: !216, line: 121, baseType: !196, size: 32, offset: 4416)
!409 = !{!0, !410}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "CG_AS_TYPE", scope: !2, file: !412, line: 26, type: !413, isLocal: true, isDefinition: true)
!412 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bncg/bncg.c", directory: "/home/users/ndemeye/xSDK")
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 4096, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 64)
!416 = !{i32 7, !"Dwarf Version", i32 4}
!417 = !{i32 2, !"Debug Info Version", i32 3}
!418 = !{i32 1, !"wchar_size", i32 4}
!419 = !{i32 7, !"PIC Level", i32 2}
!420 = !{i32 7, !"uwtable", i32 1}
!421 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!422 = distinct !DISubprogram(name: "TaoBNCGEstimateActiveSet", scope: !412, file: !412, line: 28, type: !423, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !645)
!423 = !DISubroutineType(types: !424)
!424 = !{!229, !425, !185}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !428, line: 45, size: 14656, elements: !429)
!428 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!429 = !{!430, !432, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !517, !523, !525, !526, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !597, !598, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !637, !638, !639, !640, !641, !642, !643, !644}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !427, file: !428, line: 46, baseType: !431, size: 4480)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !216, line: 122, baseType: !215)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !427, file: !428, line: 46, baseType: !433, size: 1536, offset: 4480)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1536, elements: !264)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !428, line: 13, size: 1536, elements: !435)
!435 = !{!436, !440, !444, !448, !452, !453, !454, !455, !456, !457, !458, !462, !466, !467, !468, !469, !473, !477, !478, !482, !486, !487, !491, !495}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !434, file: !428, line: 15, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!229, !425, !135, !319, !209}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !434, file: !428, line: 16, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!229, !425, !135, !319, !135, !209}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !434, file: !428, line: 17, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!229, !425, !135, !135, !209}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !434, file: !428, line: 18, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!229, !425, !135, !129, !129, !209}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !434, file: !428, line: 19, baseType: !445, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !434, file: !428, line: 20, baseType: !449, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !434, file: !428, line: 21, baseType: !445, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !434, file: !428, line: 22, baseType: !445, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !434, file: !428, line: 23, baseType: !445, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !434, file: !428, line: 24, baseType: !449, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !434, file: !428, line: 25, baseType: !459, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!229, !425, !135, !129, !129, !129, !209}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !434, file: !428, line: 26, baseType: !463, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!229, !425, !135, !129, !209}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !434, file: !428, line: 27, baseType: !449, size: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !434, file: !428, line: 28, baseType: !449, size: 64, offset: 832)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !434, file: !428, line: 29, baseType: !445, size: 64, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !434, file: !428, line: 30, baseType: !470, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!229, !425, !185, !209}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !434, file: !428, line: 31, baseType: !474, size: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!229, !425, !209}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !434, file: !428, line: 32, baseType: !347, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !434, file: !428, line: 35, baseType: !479, size: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!229, !425, !135, !135}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !434, file: !428, line: 36, baseType: !483, size: 64, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!229, !425}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !434, file: !428, line: 37, baseType: !483, size: 64, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !434, file: !428, line: 38, baseType: !488, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!229, !425, !235}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !434, file: !428, line: 39, baseType: !492, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!229, !356, !425}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !434, file: !428, line: 40, baseType: !483, size: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !427, file: !428, line: 47, baseType: !209, size: 64, offset: 6016)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !427, file: !428, line: 48, baseType: !209, size: 64, offset: 6080)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !427, file: !428, line: 49, baseType: !209, size: 64, offset: 6144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !427, file: !428, line: 50, baseType: !209, size: 64, offset: 6208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !427, file: !428, line: 51, baseType: !209, size: 64, offset: 6272)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !427, file: !428, line: 52, baseType: !209, size: 64, offset: 6336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !427, file: !428, line: 53, baseType: !209, size: 64, offset: 6400)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !427, file: !428, line: 54, baseType: !209, size: 64, offset: 6464)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !427, file: !428, line: 55, baseType: !209, size: 64, offset: 6528)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !427, file: !428, line: 56, baseType: !209, size: 64, offset: 6592)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !427, file: !428, line: 57, baseType: !209, size: 64, offset: 6656)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !427, file: !428, line: 58, baseType: !209, size: 64, offset: 6720)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !427, file: !428, line: 59, baseType: !209, size: 64, offset: 6784)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !427, file: !428, line: 60, baseType: !209, size: 64, offset: 6848)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !427, file: !428, line: 61, baseType: !209, size: 64, offset: 6912)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !427, file: !428, line: 62, baseType: !209, size: 64, offset: 6976)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !427, file: !428, line: 63, baseType: !209, size: 64, offset: 7040)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !427, file: !428, line: 65, baseType: !514, size: 640, offset: 7104)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 640, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 10)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !427, file: !428, line: 66, baseType: !518, size: 640, offset: 7744)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 640, elements: !515)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!229, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !427, file: !428, line: 67, baseType: !524, size: 640, offset: 8384)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 640, elements: !515)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !427, file: !428, line: 68, baseType: !185, size: 32, offset: 9024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !427, file: !428, line: 69, baseType: !209, size: 64, offset: 9088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !427, file: !428, line: 70, baseType: !528, size: 32, offset: 9152)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !427, file: !428, line: 72, baseType: !196, size: 32, offset: 9184)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !428, line: 73, baseType: !209, size: 64, offset: 9216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !427, file: !428, line: 75, baseType: !135, size: 64, offset: 9280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !427, file: !428, line: 76, baseType: !135, size: 64, offset: 9344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !427, file: !428, line: 77, baseType: !135, size: 64, offset: 9408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !427, file: !428, line: 78, baseType: !135, size: 64, offset: 9472)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !427, file: !428, line: 79, baseType: !135, size: 64, offset: 9536)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !427, file: !428, line: 80, baseType: !135, size: 64, offset: 9600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !427, file: !428, line: 81, baseType: !135, size: 64, offset: 9664)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !427, file: !428, line: 82, baseType: !135, size: 64, offset: 9728)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !427, file: !428, line: 83, baseType: !135, size: 64, offset: 9792)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !427, file: !428, line: 84, baseType: !129, size: 64, offset: 9856)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !427, file: !428, line: 85, baseType: !129, size: 64, offset: 9920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !427, file: !428, line: 86, baseType: !129, size: 64, offset: 9984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !427, file: !428, line: 87, baseType: !135, size: 64, offset: 10048)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !427, file: !428, line: 88, baseType: !135, size: 64, offset: 10112)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !427, file: !428, line: 89, baseType: !129, size: 64, offset: 10176)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !427, file: !428, line: 90, baseType: !129, size: 64, offset: 10240)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !427, file: !428, line: 91, baseType: !135, size: 64, offset: 10304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !427, file: !428, line: 92, baseType: !185, size: 32, offset: 10368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !427, file: !428, line: 93, baseType: !311, size: 64, offset: 10432)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !427, file: !428, line: 94, baseType: !311, size: 64, offset: 10496)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !427, file: !428, line: 95, baseType: !319, size: 64, offset: 10560)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !427, file: !428, line: 96, baseType: !135, size: 64, offset: 10624)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !427, file: !428, line: 97, baseType: !135, size: 64, offset: 10688)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !427, file: !428, line: 98, baseType: !135, size: 64, offset: 10752)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !427, file: !428, line: 99, baseType: !129, size: 64, offset: 10816)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !427, file: !428, line: 100, baseType: !129, size: 64, offset: 10880)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !427, file: !428, line: 101, baseType: !129, size: 64, offset: 10944)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !427, file: !428, line: 102, baseType: !129, size: 64, offset: 11008)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !427, file: !428, line: 103, baseType: !129, size: 64, offset: 11072)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !427, file: !428, line: 104, baseType: !129, size: 64, offset: 11136)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !427, file: !428, line: 105, baseType: !129, size: 64, offset: 11200)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !427, file: !428, line: 106, baseType: !129, size: 64, offset: 11264)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !427, file: !428, line: 107, baseType: !129, size: 64, offset: 11328)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !427, file: !428, line: 108, baseType: !129, size: 64, offset: 11392)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !427, file: !428, line: 109, baseType: !129, size: 64, offset: 11456)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !427, file: !428, line: 110, baseType: !151, size: 64, offset: 11520)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !427, file: !428, line: 111, baseType: !151, size: 64, offset: 11584)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !427, file: !428, line: 112, baseType: !162, size: 64, offset: 11648)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !427, file: !428, line: 113, baseType: !162, size: 64, offset: 11712)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !427, file: !428, line: 114, baseType: !162, size: 64, offset: 11776)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !427, file: !428, line: 115, baseType: !162, size: 64, offset: 11840)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !427, file: !428, line: 116, baseType: !162, size: 64, offset: 11904)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !427, file: !428, line: 117, baseType: !162, size: 64, offset: 11968)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !427, file: !428, line: 119, baseType: !185, size: 32, offset: 12032)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !427, file: !428, line: 120, baseType: !185, size: 32, offset: 12064)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !427, file: !428, line: 121, baseType: !185, size: 32, offset: 12096)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !427, file: !428, line: 122, baseType: !185, size: 32, offset: 12128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !427, file: !428, line: 123, baseType: !185, size: 32, offset: 12160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !427, file: !428, line: 124, baseType: !185, size: 32, offset: 12192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !427, file: !428, line: 125, baseType: !185, size: 32, offset: 12224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !427, file: !428, line: 126, baseType: !185, size: 32, offset: 12256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !427, file: !428, line: 127, baseType: !185, size: 32, offset: 12288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !427, file: !428, line: 128, baseType: !185, size: 32, offset: 12320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !427, file: !428, line: 129, baseType: !185, size: 32, offset: 12352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !427, file: !428, line: 130, baseType: !185, size: 32, offset: 12384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !427, file: !428, line: 131, baseType: !185, size: 32, offset: 12416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !427, file: !428, line: 132, baseType: !185, size: 32, offset: 12448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !427, file: !428, line: 133, baseType: !185, size: 32, offset: 12480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !427, file: !428, line: 134, baseType: !185, size: 32, offset: 12512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !427, file: !428, line: 135, baseType: !185, size: 32, offset: 12544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !427, file: !428, line: 137, baseType: !185, size: 32, offset: 12576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !427, file: !428, line: 138, baseType: !185, size: 32, offset: 12608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !427, file: !428, line: 140, baseType: !594, size: 64, offset: 12672)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !63, line: 5, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !63, line: 5, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !427, file: !428, line: 141, baseType: !196, size: 32, offset: 12736)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !427, file: !428, line: 142, baseType: !599, size: 64, offset: 12800)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !600, line: 22, baseType: !601)
!600 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !600, line: 22, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !427, file: !428, line: 143, baseType: !162, size: 64, offset: 12864)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !427, file: !428, line: 144, baseType: !162, size: 64, offset: 12928)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !427, file: !428, line: 146, baseType: !162, size: 64, offset: 12992)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !427, file: !428, line: 147, baseType: !162, size: 64, offset: 13056)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !427, file: !428, line: 148, baseType: !162, size: 64, offset: 13120)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !427, file: !428, line: 149, baseType: !162, size: 64, offset: 13184)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !427, file: !428, line: 150, baseType: !162, size: 64, offset: 13248)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !427, file: !428, line: 151, baseType: !162, size: 64, offset: 13312)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !427, file: !428, line: 152, baseType: !162, size: 64, offset: 13376)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !427, file: !428, line: 153, baseType: !196, size: 32, offset: 13440)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !427, file: !428, line: 154, baseType: !196, size: 32, offset: 13472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !427, file: !428, line: 155, baseType: !196, size: 32, offset: 13504)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !427, file: !428, line: 156, baseType: !196, size: 32, offset: 13536)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !427, file: !428, line: 157, baseType: !196, size: 32, offset: 13568)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !427, file: !428, line: 158, baseType: !196, size: 32, offset: 13600)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !427, file: !428, line: 159, baseType: !196, size: 32, offset: 13632)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !427, file: !428, line: 160, baseType: !196, size: 32, offset: 13664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !427, file: !428, line: 161, baseType: !196, size: 32, offset: 13696)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !427, file: !428, line: 162, baseType: !196, size: 32, offset: 13728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !427, file: !428, line: 163, baseType: !196, size: 32, offset: 13760)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !427, file: !428, line: 164, baseType: !196, size: 32, offset: 13792)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !427, file: !428, line: 165, baseType: !196, size: 32, offset: 13824)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !427, file: !428, line: 166, baseType: !196, size: 32, offset: 13856)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !427, file: !428, line: 167, baseType: !196, size: 32, offset: 13888)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !427, file: !428, line: 168, baseType: !196, size: 32, offset: 13920)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !427, file: !428, line: 169, baseType: !196, size: 32, offset: 13952)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !427, file: !428, line: 170, baseType: !196, size: 32, offset: 13984)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !427, file: !428, line: 171, baseType: !196, size: 32, offset: 14016)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !427, file: !428, line: 172, baseType: !196, size: 32, offset: 14048)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !427, file: !428, line: 173, baseType: !196, size: 32, offset: 14080)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !427, file: !428, line: 174, baseType: !196, size: 32, offset: 14112)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !427, file: !428, line: 175, baseType: !196, size: 32, offset: 14144)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !427, file: !428, line: 177, baseType: !636, size: 32, offset: 14176)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !427, file: !428, line: 178, baseType: !185, size: 32, offset: 14208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !427, file: !428, line: 179, baseType: !319, size: 64, offset: 14272)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !427, file: !428, line: 180, baseType: !319, size: 64, offset: 14336)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !427, file: !428, line: 181, baseType: !319, size: 64, offset: 14400)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !427, file: !428, line: 182, baseType: !311, size: 64, offset: 14464)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !427, file: !428, line: 183, baseType: !185, size: 32, offset: 14528)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !427, file: !428, line: 184, baseType: !196, size: 32, offset: 14560)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !427, file: !428, line: 185, baseType: !196, size: 32, offset: 14592)
!645 = !{!646, !647, !648, !649, !650, !652, !656, !658, !661, !663, !665, !667, !669, !671}
!646 = !DILocalVariable(name: "tao", arg: 1, scope: !422, file: !412, line: 28, type: !425)
!647 = !DILocalVariable(name: "asType", arg: 2, scope: !422, file: !412, line: 28, type: !185)
!648 = !DILocalVariable(name: "ierr", scope: !422, file: !412, line: 30, type: !229)
!649 = !DILocalVariable(name: "cg", scope: !422, file: !412, line: 31, type: !123)
!650 = !DILocalVariable(name: "ierr__", scope: !651, file: !412, line: 34, type: !229)
!651 = distinct !DILexicalBlock(scope: !422, file: !412, line: 34, column: 39)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !412, line: 36, type: !229)
!653 = distinct !DILexicalBlock(scope: !654, file: !412, line: 36, column: 61)
!654 = distinct !DILexicalBlock(scope: !655, file: !412, line: 35, column: 25)
!655 = distinct !DILexicalBlock(scope: !422, file: !412, line: 35, column: 7)
!656 = !DILocalVariable(name: "ierr__", scope: !657, file: !412, line: 37, type: !229)
!657 = distinct !DILexicalBlock(scope: !654, file: !412, line: 37, column: 55)
!658 = !DILocalVariable(name: "ierr__", scope: !659, file: !412, line: 41, type: !229)
!659 = distinct !DILexicalBlock(scope: !660, file: !412, line: 41, column: 41)
!660 = distinct !DILexicalBlock(scope: !422, file: !412, line: 39, column: 19)
!661 = !DILocalVariable(name: "ierr__", scope: !662, file: !412, line: 42, type: !229)
!662 = distinct !DILexicalBlock(scope: !660, file: !412, line: 42, column: 119)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !412, line: 43, type: !229)
!664 = distinct !DILexicalBlock(scope: !660, file: !412, line: 43, column: 39)
!665 = !DILocalVariable(name: "ierr__", scope: !666, file: !412, line: 44, type: !229)
!666 = distinct !DILexicalBlock(scope: !660, file: !412, line: 44, column: 78)
!667 = !DILocalVariable(name: "ierr__", scope: !668, file: !412, line: 49, type: !229)
!668 = distinct !DILexicalBlock(scope: !660, file: !412, line: 49, column: 53)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !412, line: 50, type: !229)
!670 = distinct !DILexicalBlock(scope: !660, file: !412, line: 50, column: 34)
!671 = !DILocalVariable(name: "ierr__", scope: !672, file: !412, line: 52, type: !229)
!672 = distinct !DILexicalBlock(scope: !660, file: !412, line: 52, column: 129)
!673 = !DILocation(line: 0, scope: !422)
!674 = !DILocation(line: 31, column: 55, scope: !422)
!675 = !{!676, !681, i64 1152}
