; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/factimpl.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/factor/factimpl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!376 = !{!377, !405, !408, !489, !429, !1370, !507, !1371, !26, !455, !1372, !452}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Factor", file: !379, line: 19, baseType: !380)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/factor/factor.h", directory: "/home/users/ndemeye/xSDK")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 9, size: 1152, elements: !381)
!381 = !{!382, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fact", scope: !380, file: !379, line: 10, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !386, line: 436, size: 23424, elements: !387)
!386 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!387 = !{!388, !598, !1105, !1125, !1126, !1127, !1129, !1130, !1131, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1258, !1259, !1275, !1276, !1277, !1278, !1279, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1314, !1334, !1335, !1337, !1338, !1339, !1340, !1341, !1342, !1360, !1361}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !385, file: !386, line: 437, baseType: !389, size: 4480)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !390, line: 122, baseType: !391)
!390 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !390, line: 73, size: 4480, elements: !392)
!392 = !{!393, !395, !450, !451, !453, !456, !457, !458, !459, !467, !468, !470, !474, !478, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !492, !493, !494, !496, !497, !499, !501, !502, !503, !504, !505, !508, !510, !511, !512, !513, !514, !517, !519, !520, !521, !531, !533, !534, !538, !539, !588, !593, !595, !596, !597}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !391, file: !390, line: 74, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !391, file: !390, line: 75, baseType: !396, size: 448, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 448, elements: !448)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !390, line: 53, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 45, size: 448, elements: !399)
!399 = !{!400, !412, !420, !425, !432, !436, !443}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !398, file: !390, line: 46, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !405, !407}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !409, line: 330, baseType: !410)
!409 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !409, line: 330, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !398, file: !390, line: 47, baseType: !413, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!404, !405, !416}
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !417, line: 16, baseType: !418)
!417 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !417, line: 16, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !398, file: !390, line: 48, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!404, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !398, file: !390, line: 49, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!404, !405, !429, !405}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !398, file: !390, line: 50, baseType: !433, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!404, !405, !429, !424}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !398, file: !390, line: 51, baseType: !437, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!404, !405, !429, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !398, file: !390, line: 52, baseType: !444, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!404, !405, !429, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!448 = !{!449}
!449 = !DISubrange(count: 1)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !391, file: !390, line: 76, baseType: !408, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !390, line: 77, baseType: !452, size: 32, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !391, file: !390, line: 78, baseType: !454, size: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !455)
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !391, file: !390, line: 78, baseType: !454, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !391, file: !390, line: 78, baseType: !454, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !391, file: !390, line: 78, baseType: !454, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !390, line: 79, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !463, line: 27, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !465, line: 43, baseType: !466)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!466 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !391, file: !390, line: 80, baseType: !452, size: 32, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !391, file: !390, line: 81, baseType: !469, size: 32, offset: 992)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !391, file: !390, line: 82, baseType: !471, size: 64, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !391, file: !390, line: 83, baseType: !475, size: 64, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !391, file: !390, line: 84, baseType: !479, size: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !391, file: !390, line: 85, baseType: !479, size: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !391, file: !390, line: 86, baseType: !479, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !391, file: !390, line: 87, baseType: !479, size: 64, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !391, file: !390, line: 88, baseType: !405, size: 64, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !391, file: !390, line: 89, baseType: !460, size: 64, offset: 1472)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !390, line: 90, baseType: !479, size: 64, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !391, file: !390, line: 91, baseType: !479, size: 64, offset: 1600)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !391, file: !390, line: 92, baseType: !452, size: 32, offset: 1664)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !391, file: !390, line: 93, baseType: !489, size: 64, offset: 1728)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !391, file: !390, line: 94, baseType: !491, size: 64, offset: 1792)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !461)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !391, file: !390, line: 95, baseType: !452, size: 32, offset: 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !391, file: !390, line: 95, baseType: !452, size: 32, offset: 1888)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !391, file: !390, line: 96, baseType: !495, size: 64, offset: 1920)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !391, file: !390, line: 96, baseType: !495, size: 64, offset: 1984)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !391, file: !390, line: 97, baseType: !498, size: 64, offset: 2048)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !391, file: !390, line: 97, baseType: !500, size: 64, offset: 2112)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !391, file: !390, line: 98, baseType: !452, size: 32, offset: 2176)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !391, file: !390, line: 98, baseType: !452, size: 32, offset: 2208)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !391, file: !390, line: 99, baseType: !495, size: 64, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !391, file: !390, line: 99, baseType: !495, size: 64, offset: 2304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !391, file: !390, line: 100, baseType: !506, size: 64, offset: 2368)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !455)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !391, file: !390, line: 100, baseType: !509, size: 64, offset: 2432)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !391, file: !390, line: 101, baseType: !452, size: 32, offset: 2496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !391, file: !390, line: 101, baseType: !452, size: 32, offset: 2528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !391, file: !390, line: 102, baseType: !495, size: 64, offset: 2560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !391, file: !390, line: 102, baseType: !495, size: 64, offset: 2624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !391, file: !390, line: 103, baseType: !515, size: 64, offset: 2688)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !507)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !391, file: !390, line: 103, baseType: !518, size: 64, offset: 2752)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !391, file: !390, line: 104, baseType: !447, size: 64, offset: 2816)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !391, file: !390, line: 105, baseType: !452, size: 32, offset: 2880)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !391, file: !390, line: 106, baseType: !522, size: 128, offset: 2944)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 128, elements: !529)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !390, line: 64, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 61, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !525, file: !390, line: 62, baseType: !440, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !525, file: !390, line: 63, baseType: !489, size: 64, offset: 64)
!529 = !{!530}
!530 = !DISubrange(count: 2)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !391, file: !390, line: 107, baseType: !532, size: 64, offset: 3072)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 64, elements: !529)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !391, file: !390, line: 108, baseType: !489, size: 64, offset: 3136)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !391, file: !390, line: 109, baseType: !535, size: 64, offset: 3200)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!404, !489}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !391, file: !390, line: 111, baseType: !452, size: 32, offset: 3264)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !391, file: !390, line: 112, baseType: !540, size: 320, offset: 3328)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !586)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!404, !544, !405, !489}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !547)
!547 = !{!548, !549, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !546, file: !10, line: 100, baseType: !452, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !10, line: 101, baseType: !550, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !561, !562, !563, !567, !569, !571, !572, !573}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !552, file: !10, line: 84, baseType: !479, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !552, file: !10, line: 85, baseType: !479, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !10, line: 86, baseType: !489, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !552, file: !10, line: 87, baseType: !471, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !552, file: !10, line: 88, baseType: !559, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !552, file: !10, line: 89, baseType: !431, size: 8, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !552, file: !10, line: 90, baseType: !479, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !552, file: !10, line: 91, baseType: !564, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !565, line: 46, baseType: !566)
!565 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!566 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !552, file: !10, line: 92, baseType: !568, size: 32, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !10, line: 93, baseType: !570, size: 32, offset: 544)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !10, line: 94, baseType: !550, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !552, file: !10, line: 95, baseType: !479, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !552, file: !10, line: 96, baseType: !489, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !546, file: !10, line: 102, baseType: !479, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !546, file: !10, line: 102, baseType: !479, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !546, file: !10, line: 103, baseType: !479, size: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !546, file: !10, line: 104, baseType: !408, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !546, file: !10, line: 105, baseType: !568, size: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !546, file: !10, line: 105, baseType: !568, size: 32, offset: 416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !546, file: !10, line: 105, baseType: !568, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !546, file: !10, line: 106, baseType: !405, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !546, file: !10, line: 107, baseType: !583, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!586 = !{!587}
!587 = !DISubrange(count: 5)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !391, file: !390, line: 113, baseType: !589, size: 320, offset: 3648)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 320, elements: !586)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!404, !405, !489}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !391, file: !390, line: 114, baseType: !594, size: 320, offset: 3968)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !586)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !391, file: !390, line: 115, baseType: !568, size: 32, offset: 4288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !391, file: !390, line: 120, baseType: !583, size: 64, offset: 4352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !391, file: !390, line: 121, baseType: !568, size: 32, offset: 4416)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !385, file: !386, line: 437, baseType: !599, size: 9472, offset: 4480)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 9472, elements: !448)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !386, line: 32, size: 9472, elements: !601)
!601 = !{!602, !611, !615, !616, !623, !627, !628, !629, !630, !631, !632, !633, !657, !661, !666, !672, !691, !696, !700, !701, !706, !711, !712, !717, !721, !725, !729, !733, !737, !738, !739, !740, !741, !745, !746, !751, !752, !753, !754, !755, !760, !767, !772, !776, !780, !784, !788, !789, !793, !794, !801, !806, !807, !808, !809, !871, !879, !880, !884, !885, !889, !890, !894, !899, !900, !904, !908, !915, !916, !917, !918, !919, !920, !925, !926, !930, !934, !938, !939, !940, !944, !954, !955, !959, !960, !964, !965, !969, !970, !975, !976, !980, !984, !985, !986, !987, !988, !989, !990, !994, !995, !996, !997, !998, !999, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1014, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1041, !1045, !1046, !1050, !1051, !1052, !1053, !1079, !1083, !1084, !1085, !1086, !1087, !1091, !1092, !1093, !1094, !1095, !1099, !1103, !1104}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !600, file: !386, line: 34, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!404, !383, !452, !606, !452, !606, !608, !610}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !76)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !600, file: !386, line: 35, baseType: !612, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!404, !383, !452, !498, !500, !518}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !600, file: !386, line: 36, baseType: !612, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !600, file: !386, line: 37, baseType: !617, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!404, !383, !620, !620}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !111, line: 21, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !111, line: 21, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !600, file: !386, line: 38, baseType: !624, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!404, !383, !620, !620, !620}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !600, file: !386, line: 40, baseType: !617, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !600, file: !386, line: 41, baseType: !624, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !600, file: !386, line: 42, baseType: !617, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !600, file: !386, line: 43, baseType: !624, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !600, file: !386, line: 44, baseType: !617, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !600, file: !386, line: 46, baseType: !624, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !600, file: !386, line: 47, baseType: !634, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!404, !383, !637, !637, !641}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !638, line: 11, baseType: !639)
!638 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !638, line: 11, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !39, line: 1239, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 1226, size: 704, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !644, file: !39, line: 1227, baseType: !507, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !644, file: !39, line: 1228, baseType: !507, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !644, file: !39, line: 1229, baseType: !507, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !644, file: !39, line: 1230, baseType: !507, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !644, file: !39, line: 1231, baseType: !507, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !644, file: !39, line: 1232, baseType: !507, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !644, file: !39, line: 1233, baseType: !507, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !644, file: !39, line: 1234, baseType: !507, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !644, file: !39, line: 1236, baseType: !507, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !644, file: !39, line: 1237, baseType: !507, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !644, file: !39, line: 1238, baseType: !507, size: 64, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !600, file: !386, line: 48, baseType: !658, size: 64, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!404, !383, !637, !641}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !600, file: !386, line: 49, baseType: !662, size: 64, offset: 832)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!404, !383, !620, !507, !665, !507, !452, !452, !620}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !39, line: 1291, baseType: !87)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !600, file: !386, line: 50, baseType: !667, size: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!404, !383, !670, !671}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !39, line: 238, baseType: !99)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !600, file: !386, line: 52, baseType: !673, size: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!404, !383, !676, !677}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !39, line: 612, baseType: !105)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !39, line: 600, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 592, size: 640, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !679, file: !39, line: 593, baseType: !454, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !679, file: !39, line: 594, baseType: !454, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !679, file: !39, line: 594, baseType: !454, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !679, file: !39, line: 594, baseType: !454, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !679, file: !39, line: 595, baseType: !454, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !679, file: !39, line: 596, baseType: !454, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !679, file: !39, line: 597, baseType: !454, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !679, file: !39, line: 598, baseType: !454, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !679, file: !39, line: 598, baseType: !454, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !679, file: !39, line: 599, baseType: !454, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !600, file: !386, line: 53, baseType: !692, size: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!404, !383, !383, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !600, file: !386, line: 54, baseType: !697, size: 64, offset: 1088)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!404, !383, !620}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !600, file: !386, line: 55, baseType: !617, size: 64, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !600, file: !386, line: 56, baseType: !702, size: 64, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!404, !383, !705, !506}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !111, line: 155, baseType: !110)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !600, file: !386, line: 58, baseType: !707, size: 64, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!404, !383, !710}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !39, line: 424, baseType: !118)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !600, file: !386, line: 59, baseType: !707, size: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !600, file: !386, line: 60, baseType: !713, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!404, !383, !716, !568}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !39, line: 469, baseType: !122)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !600, file: !386, line: 61, baseType: !718, size: 64, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!404, !383}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !600, file: !386, line: 63, baseType: !722, size: 64, offset: 1536)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!404, !383, !452, !606, !516, !620, !620}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !600, file: !386, line: 64, baseType: !726, size: 64, offset: 1600)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!404, !383, !383, !637, !637, !641}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !600, file: !386, line: 65, baseType: !730, size: 64, offset: 1664)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!404, !383, !383, !641}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !600, file: !386, line: 66, baseType: !734, size: 64, offset: 1728)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!404, !383, !383, !637, !641}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !600, file: !386, line: 67, baseType: !730, size: 64, offset: 1792)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !600, file: !386, line: 69, baseType: !718, size: 64, offset: 1856)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !600, file: !386, line: 70, baseType: !726, size: 64, offset: 1920)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !600, file: !386, line: 71, baseType: !734, size: 64, offset: 1984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !600, file: !386, line: 72, baseType: !742, size: 64, offset: 2048)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!404, !383, !671}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !600, file: !386, line: 73, baseType: !718, size: 64, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !600, file: !386, line: 75, baseType: !747, size: 64, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!404, !383, !750, !671}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !39, line: 563, baseType: !152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !600, file: !386, line: 76, baseType: !617, size: 64, offset: 2240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !600, file: !386, line: 77, baseType: !617, size: 64, offset: 2304)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !600, file: !386, line: 78, baseType: !634, size: 64, offset: 2368)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !600, file: !386, line: 79, baseType: !658, size: 64, offset: 2432)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !600, file: !386, line: 81, baseType: !756, size: 64, offset: 2496)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!404, !383, !516, !383, !759}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !600, file: !386, line: 82, baseType: !761, size: 64, offset: 2560)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!404, !383, !452, !764, !764, !670, !766}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !600, file: !386, line: 83, baseType: !768, size: 64, offset: 2624)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!404, !383, !452, !771, !452}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !600, file: !386, line: 84, baseType: !773, size: 64, offset: 2688)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!404, !383, !452, !606, !452, !606, !515}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !600, file: !386, line: 85, baseType: !777, size: 64, offset: 2752)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!404, !383, !383, !759}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !600, file: !386, line: 87, baseType: !781, size: 64, offset: 2816)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!404, !383, !620, !498}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !600, file: !386, line: 88, baseType: !785, size: 64, offset: 2880)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!404, !383, !516}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !600, file: !386, line: 89, baseType: !785, size: 64, offset: 2944)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !600, file: !386, line: 90, baseType: !790, size: 64, offset: 3008)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!404, !383, !620, !610}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !600, file: !386, line: 91, baseType: !722, size: 64, offset: 3072)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !600, file: !386, line: 93, baseType: !795, size: 64, offset: 3136)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!404, !383, !798}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !600, file: !386, line: 94, baseType: !802, size: 64, offset: 3200)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!404, !383, !452, !568, !568, !498, !805, !805, !695}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !600, file: !386, line: 95, baseType: !802, size: 64, offset: 3264)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !600, file: !386, line: 96, baseType: !802, size: 64, offset: 3328)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !600, file: !386, line: 97, baseType: !802, size: 64, offset: 3392)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !600, file: !386, line: 99, baseType: !810, size: 64, offset: 3456)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!404, !383, !813, !816}
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !638, line: 51, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !638, line: 51, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !39, line: 1378, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !386, line: 609, size: 6208, elements: !819)
!819 = !{!820, !821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !840, !847, !848, !849, !850, !851, !852, !853, !854, !858, !859, !860, !861, !862, !864, !865, !866, !867, !868, !869, !870}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !818, file: !386, line: 610, baseType: !389, size: 4480)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !818, file: !386, line: 610, baseType: !822, size: 32, offset: 4480)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !818, file: !386, line: 611, baseType: !452, size: 32, offset: 4512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !818, file: !386, line: 611, baseType: !452, size: 32, offset: 4544)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !818, file: !386, line: 611, baseType: !452, size: 32, offset: 4576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !818, file: !386, line: 612, baseType: !452, size: 32, offset: 4608)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !818, file: !386, line: 613, baseType: !452, size: 32, offset: 4640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !818, file: !386, line: 614, baseType: !498, size: 64, offset: 4672)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !818, file: !386, line: 615, baseType: !500, size: 64, offset: 4736)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !818, file: !386, line: 616, baseType: !771, size: 64, offset: 4800)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !818, file: !386, line: 617, baseType: !498, size: 64, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !818, file: !386, line: 618, baseType: !833, size: 64, offset: 4928)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !386, line: 602, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 598, size: 128, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !835, file: !386, line: 599, baseType: !452, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !835, file: !386, line: 600, baseType: !452, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !835, file: !386, line: 601, baseType: !515, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !818, file: !386, line: 619, baseType: !841, size: 64, offset: 4992)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !386, line: 607, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 604, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !843, file: !386, line: 605, baseType: !452, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !843, file: !386, line: 606, baseType: !515, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !818, file: !386, line: 620, baseType: !515, size: 64, offset: 5056)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !818, file: !386, line: 621, baseType: !507, size: 64, offset: 5120)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !818, file: !386, line: 622, baseType: !507, size: 64, offset: 5184)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !818, file: !386, line: 623, baseType: !620, size: 64, offset: 5248)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !818, file: !386, line: 623, baseType: !620, size: 64, offset: 5312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !818, file: !386, line: 623, baseType: !620, size: 64, offset: 5376)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !818, file: !386, line: 624, baseType: !568, size: 32, offset: 5440)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !818, file: !386, line: 625, baseType: !855, size: 64, offset: 5504)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!404}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !818, file: !386, line: 626, baseType: !489, size: 64, offset: 5568)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !818, file: !386, line: 627, baseType: !620, size: 64, offset: 5632)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !818, file: !386, line: 628, baseType: !452, size: 32, offset: 5696)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !818, file: !386, line: 629, baseType: !429, size: 64, offset: 5760)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !818, file: !386, line: 630, baseType: !863, size: 32, offset: 5824)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !324, line: 213, baseType: !323)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !818, file: !386, line: 631, baseType: !452, size: 32, offset: 5856)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !818, file: !386, line: 631, baseType: !452, size: 32, offset: 5888)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !818, file: !386, line: 632, baseType: !568, size: 32, offset: 5920)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !818, file: !386, line: 633, baseType: !568, size: 32, offset: 5952)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !818, file: !386, line: 634, baseType: !440, size: 64, offset: 6016)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !818, file: !386, line: 634, baseType: !489, size: 64, offset: 6080)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !818, file: !386, line: 635, baseType: !460, size: 64, offset: 6144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !600, file: !386, line: 100, baseType: !872, size: 64, offset: 3520)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!404, !383, !452, !452, !875, !878}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !324, line: 215, baseType: !877)
!877 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !600, file: !386, line: 101, baseType: !718, size: 64, offset: 3584)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !600, file: !386, line: 102, baseType: !881, size: 64, offset: 3648)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!404, !383, !637, !637, !671}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !600, file: !386, line: 103, baseType: !603, size: 64, offset: 3712)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !600, file: !386, line: 105, baseType: !886, size: 64, offset: 3776)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!404, !383, !637, !637, !670, !671}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !600, file: !386, line: 106, baseType: !718, size: 64, offset: 3840)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !600, file: !386, line: 107, baseType: !891, size: 64, offset: 3904)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!404, !383, !416}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !600, file: !386, line: 108, baseType: !895, size: 64, offset: 3968)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!404, !383, !898, !670, !671}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !39, line: 25, baseType: !429)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !600, file: !386, line: 109, baseType: !855, size: 64, offset: 4032)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !600, file: !386, line: 111, baseType: !901, size: 64, offset: 4096)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!404, !383, !383, !383, !507, !383}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !600, file: !386, line: 112, baseType: !905, size: 64, offset: 4160)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!404, !383, !383, !383, !383}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !600, file: !386, line: 113, baseType: !909, size: 64, offset: 4224)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!404, !383, !912, !912}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !638, line: 30, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !638, line: 30, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !600, file: !386, line: 114, baseType: !603, size: 64, offset: 4288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !600, file: !386, line: 115, baseType: !722, size: 64, offset: 4352)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !600, file: !386, line: 117, baseType: !781, size: 64, offset: 4416)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !600, file: !386, line: 118, baseType: !781, size: 64, offset: 4480)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !600, file: !386, line: 119, baseType: !895, size: 64, offset: 4544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !600, file: !386, line: 120, baseType: !921, size: 64, offset: 4608)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!404, !383, !924, !695}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !39, line: 1675, baseType: !157)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !600, file: !386, line: 121, baseType: !855, size: 64, offset: 4672)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !600, file: !386, line: 123, baseType: !927, size: 64, offset: 4736)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!404, !383, !452, !489}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !600, file: !386, line: 124, baseType: !931, size: 64, offset: 4800)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!404, !383, !816, !620, !489}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !600, file: !386, line: 125, baseType: !935, size: 64, offset: 4864)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!404, !544, !383}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !600, file: !386, line: 126, baseType: !617, size: 64, offset: 4928)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !600, file: !386, line: 127, baseType: !617, size: 64, offset: 4992)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !600, file: !386, line: 129, baseType: !941, size: 64, offset: 5056)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!404, !383, !771}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !600, file: !386, line: 130, baseType: !945, size: 64, offset: 5120)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!404, !383, !948, !948}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !111, line: 654, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !111, line: 653, size: 128, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !950, file: !111, line: 653, baseType: !452, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !950, file: !111, line: 653, baseType: !620, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !600, file: !386, line: 131, baseType: !945, size: 64, offset: 5184)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !600, file: !386, line: 132, baseType: !956, size: 64, offset: 5248)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!404, !383, !498, !498, !498}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !600, file: !386, line: 133, baseType: !891, size: 64, offset: 5312)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !600, file: !386, line: 135, baseType: !961, size: 64, offset: 5376)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!404, !383, !507, !695}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !600, file: !386, line: 136, baseType: !961, size: 64, offset: 5440)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !600, file: !386, line: 137, baseType: !966, size: 64, offset: 5504)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!404, !383, !695}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !600, file: !386, line: 138, baseType: !603, size: 64, offset: 5568)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !600, file: !386, line: 139, baseType: !971, size: 64, offset: 5632)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!404, !383, !974, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !600, file: !386, line: 141, baseType: !855, size: 64, offset: 5696)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !600, file: !386, line: 142, baseType: !977, size: 64, offset: 5760)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!404, !383, !383, !507, !383}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !600, file: !386, line: 143, baseType: !981, size: 64, offset: 5824)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!404, !383, !383, !383}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !600, file: !386, line: 144, baseType: !855, size: 64, offset: 5888)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !600, file: !386, line: 145, baseType: !977, size: 64, offset: 5952)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !600, file: !386, line: 147, baseType: !981, size: 64, offset: 6016)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !600, file: !386, line: 148, baseType: !855, size: 64, offset: 6080)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !600, file: !386, line: 149, baseType: !977, size: 64, offset: 6144)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !600, file: !386, line: 150, baseType: !981, size: 64, offset: 6208)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !600, file: !386, line: 151, baseType: !991, size: 64, offset: 6272)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!404, !383, !568}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !600, file: !386, line: 153, baseType: !718, size: 64, offset: 6336)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !600, file: !386, line: 154, baseType: !718, size: 64, offset: 6400)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !600, file: !386, line: 155, baseType: !718, size: 64, offset: 6464)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !600, file: !386, line: 156, baseType: !718, size: 64, offset: 6528)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !600, file: !386, line: 157, baseType: !891, size: 64, offset: 6592)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !600, file: !386, line: 159, baseType: !1000, size: 64, offset: 6656)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!404, !383, !452, !608}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !600, file: !386, line: 160, baseType: !718, size: 64, offset: 6720)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !600, file: !386, line: 161, baseType: !718, size: 64, offset: 6784)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !600, file: !386, line: 162, baseType: !718, size: 64, offset: 6848)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !600, file: !386, line: 163, baseType: !718, size: 64, offset: 6912)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !600, file: !386, line: 165, baseType: !981, size: 64, offset: 6976)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !600, file: !386, line: 166, baseType: !981, size: 64, offset: 7040)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !600, file: !386, line: 167, baseType: !781, size: 64, offset: 7104)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !600, file: !386, line: 168, baseType: !1011, size: 64, offset: 7168)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!404, !383, !620, !452}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !600, file: !386, line: 169, baseType: !1015, size: 64, offset: 7232)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!404, !383, !695, !498}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !600, file: !386, line: 171, baseType: !742, size: 64, offset: 7296)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !600, file: !386, line: 172, baseType: !718, size: 64, offset: 7360)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !600, file: !386, line: 173, baseType: !1021, size: 64, offset: 7424)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!404, !383, !498, !805}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !600, file: !386, line: 174, baseType: !881, size: 64, offset: 7488)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !600, file: !386, line: 175, baseType: !881, size: 64, offset: 7552)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !600, file: !386, line: 177, baseType: !617, size: 64, offset: 7616)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !600, file: !386, line: 178, baseType: !667, size: 64, offset: 7680)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !600, file: !386, line: 179, baseType: !617, size: 64, offset: 7744)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !600, file: !386, line: 180, baseType: !624, size: 64, offset: 7808)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !600, file: !386, line: 181, baseType: !1031, size: 64, offset: 7872)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!404, !383, !408, !670, !671}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !600, file: !386, line: 183, baseType: !941, size: 64, offset: 7936)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !600, file: !386, line: 184, baseType: !702, size: 64, offset: 8000)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !600, file: !386, line: 185, baseType: !1037, size: 64, offset: 8064)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!404, !383, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !600, file: !386, line: 186, baseType: !1042, size: 64, offset: 8128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!404, !383, !452, !606, !515}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !600, file: !386, line: 187, baseType: !761, size: 64, offset: 8192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !600, file: !386, line: 189, baseType: !1047, size: 64, offset: 8256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!404, !383, !452, !452, !498, !608}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !600, file: !386, line: 190, baseType: !855, size: 64, offset: 8320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !600, file: !386, line: 191, baseType: !977, size: 64, offset: 8384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !600, file: !386, line: 192, baseType: !981, size: 64, offset: 8448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !600, file: !386, line: 193, baseType: !1054, size: 64, offset: 8512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!404, !383, !813, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !39, line: 1401, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !386, line: 660, size: 5312, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1059, file: !386, line: 661, baseType: !389, size: 4480)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1059, file: !386, line: 661, baseType: !822, size: 32, offset: 4480)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1059, file: !386, line: 662, baseType: !452, size: 32, offset: 4512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1059, file: !386, line: 662, baseType: !452, size: 32, offset: 4544)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1059, file: !386, line: 662, baseType: !452, size: 32, offset: 4576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1059, file: !386, line: 663, baseType: !452, size: 32, offset: 4608)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1059, file: !386, line: 664, baseType: !452, size: 32, offset: 4640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1059, file: !386, line: 665, baseType: !498, size: 64, offset: 4672)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1059, file: !386, line: 666, baseType: !498, size: 64, offset: 4736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1059, file: !386, line: 667, baseType: !452, size: 32, offset: 4800)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1059, file: !386, line: 668, baseType: !863, size: 32, offset: 4832)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1059, file: !386, line: 670, baseType: !498, size: 64, offset: 4864)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1059, file: !386, line: 670, baseType: !498, size: 64, offset: 4928)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1059, file: !386, line: 671, baseType: !498, size: 64, offset: 4992)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1059, file: !386, line: 672, baseType: !498, size: 64, offset: 5056)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1059, file: !386, line: 673, baseType: !498, size: 64, offset: 5120)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1059, file: !386, line: 674, baseType: !452, size: 32, offset: 5184)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1059, file: !386, line: 675, baseType: !498, size: 64, offset: 5248)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !600, file: !386, line: 195, baseType: !1080, size: 64, offset: 8576)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!404, !1057, !383, !383}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !600, file: !386, line: 196, baseType: !1080, size: 64, offset: 8640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !600, file: !386, line: 197, baseType: !855, size: 64, offset: 8704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !600, file: !386, line: 198, baseType: !977, size: 64, offset: 8768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !600, file: !386, line: 199, baseType: !981, size: 64, offset: 8832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !600, file: !386, line: 201, baseType: !1088, size: 64, offset: 8896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!404, !383, !452, !452}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !600, file: !386, line: 202, baseType: !756, size: 64, offset: 8960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !600, file: !386, line: 203, baseType: !624, size: 64, offset: 9024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !600, file: !386, line: 204, baseType: !810, size: 64, offset: 9088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !600, file: !386, line: 205, baseType: !941, size: 64, offset: 9152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !600, file: !386, line: 206, baseType: !1096, size: 64, offset: 9216)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!404, !408, !383, !452, !670, !671}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !600, file: !386, line: 208, baseType: !1100, size: 64, offset: 9280)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!404, !452, !766}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !600, file: !386, line: 209, baseType: !981, size: 64, offset: 9344)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !600, file: !386, line: 210, baseType: !773, size: 64, offset: 9408)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !385, file: !386, line: 438, baseType: !1106, size: 64, offset: 13952)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !638, line: 60, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !324, line: 240, size: 640, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1108, file: !324, line: 241, baseType: !408, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !324, line: 242, baseType: !469, size: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1108, file: !324, line: 243, baseType: !452, size: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1108, file: !324, line: 243, baseType: !452, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1108, file: !324, line: 244, baseType: !452, size: 32, offset: 160)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1108, file: !324, line: 244, baseType: !452, size: 32, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1108, file: !324, line: 245, baseType: !498, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1108, file: !324, line: 246, baseType: !568, size: 32, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1108, file: !324, line: 247, baseType: !452, size: 32, offset: 352)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1108, file: !324, line: 251, baseType: !452, size: 32, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1108, file: !324, line: 252, baseType: !912, size: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1108, file: !324, line: 253, baseType: !568, size: 32, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1108, file: !324, line: 254, baseType: !452, size: 32, offset: 544)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1108, file: !324, line: 254, baseType: !452, size: 32, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1108, file: !324, line: 255, baseType: !452, size: 32, offset: 608)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !385, file: !386, line: 438, baseType: !1106, size: 64, offset: 14016)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !386, line: 439, baseType: !489, size: 64, offset: 14080)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !385, file: !386, line: 440, baseType: !1128, size: 32, offset: 14144)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !39, line: 161, baseType: !54)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !385, file: !386, line: 441, baseType: !568, size: 32, offset: 14176)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !385, file: !386, line: 442, baseType: !568, size: 32, offset: 14208)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !385, file: !386, line: 443, baseType: !1132, size: 448, offset: 14272)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 448, elements: !1134)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !39, line: 1159, baseType: !429)
!1134 = !{!1135}
!1135 = !DISubrange(count: 7)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !385, file: !386, line: 444, baseType: !568, size: 32, offset: 14720)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !385, file: !386, line: 445, baseType: !568, size: 32, offset: 14752)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !385, file: !386, line: 446, baseType: !452, size: 32, offset: 14784)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !385, file: !386, line: 447, baseType: !491, size: 64, offset: 14848)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !385, file: !386, line: 448, baseType: !491, size: 64, offset: 14912)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !385, file: !386, line: 449, baseType: !678, size: 640, offset: 14976)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !385, file: !386, line: 450, baseType: !610, size: 32, offset: 15616)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !385, file: !386, line: 451, baseType: !1144, size: 2880, offset: 15680)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !386, line: 318, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !386, line: 319, size: 2880, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1166, !1167, !1172, !1177, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1192, !1193, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1225, !1226, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1249, !1250, !1251, !1255, !1256}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1145, file: !386, line: 320, baseType: !452, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1145, file: !386, line: 321, baseType: !452, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1145, file: !386, line: 322, baseType: !452, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1145, file: !386, line: 323, baseType: !452, size: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1145, file: !386, line: 324, baseType: !452, size: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1145, file: !386, line: 325, baseType: !452, size: 32, offset: 160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1145, file: !386, line: 326, baseType: !1154, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !386, line: 293, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !386, line: 295, size: 448, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1156, file: !386, line: 296, baseType: !1154, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1156, file: !386, line: 297, baseType: !515, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1156, file: !386, line: 297, baseType: !515, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1156, file: !386, line: 298, baseType: !498, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1156, file: !386, line: 298, baseType: !498, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1156, file: !386, line: 299, baseType: !452, size: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1156, file: !386, line: 300, baseType: !452, size: 32, offset: 352)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1156, file: !386, line: 301, baseType: !452, size: 32, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1145, file: !386, line: 326, baseType: !1154, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1145, file: !386, line: 328, baseType: !1168, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!404, !383, !1171, !498}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1145, file: !386, line: 329, baseType: !1173, size: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!404, !1171, !1176, !500, !500, !518, !498}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1145, file: !386, line: 330, baseType: !1178, size: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!404, !1171}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1145, file: !386, line: 331, baseType: !1178, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1145, file: !386, line: 334, baseType: !408, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !386, line: 335, baseType: !469, size: 32, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1145, file: !386, line: 335, baseType: !469, size: 32, offset: 672)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1145, file: !386, line: 336, baseType: !469, size: 32, offset: 704)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1145, file: !386, line: 336, baseType: !469, size: 32, offset: 736)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1145, file: !386, line: 337, baseType: !1188, size: 64, offset: 768)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !409, line: 339, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !409, line: 339, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1145, file: !386, line: 338, baseType: !1188, size: 64, offset: 832)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1145, file: !386, line: 339, baseType: !1194, size: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !409, line: 341, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !409, line: 351, size: 192, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1196, file: !409, line: 354, baseType: !26, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1196, file: !409, line: 355, baseType: !26, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1196, file: !409, line: 356, baseType: !26, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1196, file: !409, line: 361, baseType: !26, size: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1196, file: !409, line: 362, baseType: !564, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1145, file: !386, line: 340, baseType: !452, size: 32, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1145, file: !386, line: 340, baseType: !452, size: 32, offset: 992)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1145, file: !386, line: 341, baseType: !515, size: 64, offset: 1024)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1145, file: !386, line: 342, baseType: !498, size: 64, offset: 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1145, file: !386, line: 343, baseType: !518, size: 64, offset: 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1145, file: !386, line: 344, baseType: !500, size: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1145, file: !386, line: 345, baseType: !452, size: 32, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1145, file: !386, line: 346, baseType: !1176, size: 64, offset: 1344)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1145, file: !386, line: 347, baseType: !568, size: 32, offset: 1408)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1145, file: !386, line: 348, baseType: !452, size: 32, offset: 1440)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1145, file: !386, line: 351, baseType: !568, size: 32, offset: 1472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1145, file: !386, line: 352, baseType: !568, size: 32, offset: 1504)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1145, file: !386, line: 353, baseType: !469, size: 32, offset: 1536)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1145, file: !386, line: 354, baseType: !469, size: 32, offset: 1568)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1145, file: !386, line: 355, baseType: !1176, size: 64, offset: 1600)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1145, file: !386, line: 356, baseType: !1176, size: 64, offset: 1664)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1145, file: !386, line: 357, baseType: !1220, size: 64, offset: 1728)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !386, line: 310, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 308, size: 32, elements: !1223)
!1223 = !{!1224}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1222, file: !386, line: 309, baseType: !452, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1145, file: !386, line: 357, baseType: !1220, size: 64, offset: 1792)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1145, file: !386, line: 358, baseType: !1227, size: 64, offset: 1856)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !386, line: 316, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 312, size: 128, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1229, file: !386, line: 313, baseType: !489, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1229, file: !386, line: 314, baseType: !452, size: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1229, file: !386, line: 315, baseType: !431, size: 8, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1145, file: !386, line: 359, baseType: !1227, size: 64, offset: 1920)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1145, file: !386, line: 360, baseType: !1227, size: 64, offset: 1984)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1145, file: !386, line: 361, baseType: !452, size: 32, offset: 2048)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1145, file: !386, line: 362, baseType: !469, size: 32, offset: 2080)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1145, file: !386, line: 363, baseType: !452, size: 32, offset: 2112)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1145, file: !386, line: 364, baseType: !1176, size: 64, offset: 2176)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1145, file: !386, line: 365, baseType: !1194, size: 64, offset: 2240)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1145, file: !386, line: 366, baseType: !469, size: 32, offset: 2304)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1145, file: !386, line: 367, baseType: !469, size: 32, offset: 2336)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1145, file: !386, line: 368, baseType: !1188, size: 64, offset: 2368)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1145, file: !386, line: 369, baseType: !1188, size: 64, offset: 2432)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1145, file: !386, line: 370, baseType: !1246, size: 64, offset: 2496)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1145, file: !386, line: 371, baseType: !1246, size: 64, offset: 2560)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1145, file: !386, line: 372, baseType: !1246, size: 64, offset: 2624)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1145, file: !386, line: 373, baseType: !1252, size: 64, offset: 2688)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !409, line: 331, baseType: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !409, line: 331, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1145, file: !386, line: 374, baseType: !564, size: 64, offset: 2752)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1145, file: !386, line: 375, baseType: !1257, size: 64, offset: 2816)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !385, file: !386, line: 451, baseType: !1144, size: 2880, offset: 18560)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !385, file: !386, line: 452, baseType: !1260, size: 64, offset: 21440)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !39, line: 1723, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !386, line: 681, size: 4864, elements: !1263)
!1263 = !{!1264, !1265, !1266, !1267, !1268, !1269, !1270, !1274}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1262, file: !386, line: 682, baseType: !389, size: 4480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1262, file: !386, line: 682, baseType: !822, size: 32, offset: 4480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1262, file: !386, line: 683, baseType: !568, size: 32, offset: 4512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1262, file: !386, line: 684, baseType: !452, size: 32, offset: 4544)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1262, file: !386, line: 685, baseType: !974, size: 64, offset: 4608)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1262, file: !386, line: 686, baseType: !515, size: 64, offset: 4672)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1262, file: !386, line: 687, baseType: !1271, size: 64, offset: 4736)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!404, !1260, !620, !489}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1262, file: !386, line: 688, baseType: !489, size: 64, offset: 4800)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !385, file: !386, line: 453, baseType: !1260, size: 64, offset: 21504)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !385, file: !386, line: 454, baseType: !1260, size: 64, offset: 21568)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !385, file: !386, line: 455, baseType: !452, size: 32, offset: 21632)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !385, file: !386, line: 456, baseType: !568, size: 32, offset: 21664)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !385, file: !386, line: 457, baseType: !1280, size: 320, offset: 21696)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !386, line: 399, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 394, size: 320, elements: !1282)
!1282 = !{!1283, !1284, !1288, !1289}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1281, file: !386, line: 395, baseType: !452, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1281, file: !386, line: 396, baseType: !1285, size: 128, offset: 32)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 128, elements: !1286)
!1286 = !{!1287}
!1287 = !DISubrange(count: 4)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1281, file: !386, line: 397, baseType: !1285, size: 128, offset: 160)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1281, file: !386, line: 398, baseType: !568, size: 32, offset: 288)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !385, file: !386, line: 458, baseType: !568, size: 32, offset: 22016)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !385, file: !386, line: 458, baseType: !568, size: 32, offset: 22048)
