; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/gpcg/gpcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/gpcg/gpcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 6, baseType: !26, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!56 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!57 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!58 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!59 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!60 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!61 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!62 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!63 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!64 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!65 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!66 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 155, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!75 = !{!76, !79, !97, !178, !118, !284, !144, !340}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !86, !139, !140, !142, !145, !146, !147, !148, !156, !157, !159, !163, !167, !169, !170, !171, !172, !173, !174, !175, !176, !177, !179, !181, !182, !183, !185, !186, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !202, !203, !206, !208, !209, !210, !220, !222, !223, !227, !228, !274, !279, !281, !282, !283}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !87, size: 448, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !137)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !90)
!90 = !{!91, !101, !109, !114, !121, !125, !132}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !89, file: !82, line: 46, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !79, !96}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !98, line: 330, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !98, line: 330, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !89, file: !82, line: 47, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!95, !79, !105}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !106, line: 16, baseType: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !106, line: 16, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !89, file: !82, line: 48, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!95, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !89, file: !82, line: 49, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!95, !79, !118, !79}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !89, file: !82, line: 50, baseType: !122, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!95, !79, !118, !113}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !89, file: !82, line: 51, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!95, !79, !118, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !89, file: !82, line: 52, baseType: !133, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!95, !79, !118, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !97, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !141, size: 32, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !144)
!144 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !149, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !152, line: 27, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !154, line: 43, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!155 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !141, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !158, size: 32, offset: 992)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !160, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !168, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !168, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !168, size: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !149, size: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !168, size: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !168, size: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !141, size: 32, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !178, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !180, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !150)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !141, size: 32, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !141, size: 32, offset: 1888)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !184, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !184, size: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !187, size: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !189, size: 64, offset: 2112)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !141, size: 32, offset: 2176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !141, size: 32, offset: 2208)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !184, size: 64, offset: 2240)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !184, size: 64, offset: 2304)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !195, size: 64, offset: 2368)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !198, size: 64, offset: 2432)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !141, size: 32, offset: 2496)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !141, size: 32, offset: 2528)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !184, size: 64, offset: 2560)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !184, size: 64, offset: 2624)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !204, size: 64, offset: 2688)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !196)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !207, size: 64, offset: 2752)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !136, size: 64, offset: 2816)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !141, size: 32, offset: 2880)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !211, size: 128, offset: 2944)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 128, elements: !218)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !214, file: !82, line: 62, baseType: !129, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !214, file: !82, line: 63, baseType: !178, size: 64, offset: 64)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !221, size: 64, offset: 3072)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !218)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !178, size: 64, offset: 3136)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !224, size: 64, offset: 3200)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!95, !178}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !141, size: 32, offset: 3264)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !229, size: 320, offset: 3328)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 320, elements: !272)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!95, !233, !79, !178}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !236)
!236 = !{!237, !238, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !235, file: !10, line: 100, baseType: !141, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !10, line: 101, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !250, !251, !252, !253, !255, !257, !258, !259}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !241, file: !10, line: 84, baseType: !168, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !241, file: !10, line: 85, baseType: !168, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !10, line: 86, baseType: !178, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !241, file: !10, line: 87, baseType: !160, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !241, file: !10, line: 88, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !241, file: !10, line: 89, baseType: !120, size: 8, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !241, file: !10, line: 90, baseType: !168, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !241, file: !10, line: 91, baseType: !76, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !241, file: !10, line: 92, baseType: !254, size: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !10, line: 93, baseType: !256, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !10, line: 94, baseType: !239, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !241, file: !10, line: 95, baseType: !168, size: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !241, file: !10, line: 96, baseType: !178, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !235, file: !10, line: 102, baseType: !168, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !235, file: !10, line: 102, baseType: !168, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !235, file: !10, line: 103, baseType: !168, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !235, file: !10, line: 104, baseType: !97, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !235, file: !10, line: 106, baseType: !79, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !235, file: !10, line: 107, baseType: !269, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!272 = !{!273}
!273 = !DISubrange(count: 5)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !275, size: 320, offset: 3648)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 320, elements: !272)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!95, !79, !178}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !280, size: 320, offset: 3968)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 320, elements: !272)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !254, size: 32, offset: 4288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !269, size: 64, offset: 4352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !254, size: 32, offset: 4416)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_GPCG", file: !286, line: 59, baseType: !287)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/quadratic/impls/gpcg/gpcg.h", directory: "/home/users/ndemeye/xSDK")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !286, line: 6, size: 2176, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !310, !311, !312, !313, !314, !315, !316, !317, !322, !323, !324, !325, !326, !327, !328, !333, !334, !335, !336, !337, !338, !339}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pg_ftol", scope: !287, file: !286, line: 9, baseType: !196, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "actred", scope: !287, file: !286, line: 10, baseType: !196, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "f_new", scope: !287, file: !286, line: 11, baseType: !196, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "minstep", scope: !287, file: !286, line: 12, baseType: !196, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !287, file: !286, line: 13, baseType: !196, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm", scope: !287, file: !286, line: 14, baseType: !196, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sigma1", scope: !287, file: !286, line: 16, baseType: !196, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sigma2", scope: !287, file: !286, line: 16, baseType: !196, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sigma3", scope: !287, file: !286, line: 16, baseType: !196, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "maxgpits", scope: !287, file: !286, line: 18, baseType: !141, size: 32, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !287, file: !286, line: 24, baseType: !141, size: 32, offset: 608)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "total_cgits", scope: !287, file: !286, line: 26, baseType: !141, size: 32, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cg_iterates", scope: !287, file: !286, line: 27, baseType: !141, size: 32, offset: 672)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "total_gp_its", scope: !287, file: !286, line: 28, baseType: !141, size: 32, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gp_iterates", scope: !287, file: !286, line: 29, baseType: !141, size: 32, offset: 736)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cgits", scope: !287, file: !286, line: 30, baseType: !141, size: 32, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "G_New", scope: !287, file: !286, line: 32, baseType: !306, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !68, line: 21, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !68, line: 21, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "DXFree", scope: !287, file: !286, line: 33, baseType: !306, size: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !287, file: !286, line: 34, baseType: !306, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "DX", scope: !287, file: !286, line: 35, baseType: !306, size: 64, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !287, file: !286, line: 36, baseType: !306, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "X_New", scope: !287, file: !286, line: 37, baseType: !306, size: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !287, file: !286, line: 38, baseType: !306, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PG", scope: !287, file: !286, line: 38, baseType: !306, size: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !287, file: !286, line: 39, baseType: !306, size: 64, offset: 1344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !287, file: !286, line: 41, baseType: !318, size: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !319, line: 16, baseType: !320)
!319 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !319, line: 16, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !287, file: !286, line: 42, baseType: !306, size: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !287, file: !286, line: 43, baseType: !196, size: 64, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !287, file: !286, line: 45, baseType: !196, size: 64, offset: 1600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !287, file: !286, line: 46, baseType: !196, size: 64, offset: 1664)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Hsub", scope: !287, file: !286, line: 47, baseType: !318, size: 64, offset: 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Hsub_pre", scope: !287, file: !286, line: 48, baseType: !318, size: 64, offset: 1792)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Free_Local", scope: !287, file: !286, line: 50, baseType: !329, size: 64, offset: 1856)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !330, line: 11, baseType: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !330, line: 11, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !287, file: !286, line: 51, baseType: !329, size: 64, offset: 1920)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !287, file: !286, line: 53, baseType: !141, size: 32, offset: 1984)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "n_upper", scope: !287, file: !286, line: 54, baseType: !141, size: 32, offset: 2016)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_lower", scope: !287, file: !286, line: 55, baseType: !141, size: 32, offset: 2048)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "n_bind", scope: !287, file: !286, line: 56, baseType: !141, size: 32, offset: 2080)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_type", scope: !287, file: !286, line: 57, baseType: !141, size: 32, offset: 2112)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !287, file: !286, line: 58, baseType: !141, size: 32, offset: 2144)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !343, line: 45, size: 14656, elements: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!344 = !{!345, !347, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !432, !438, !440, !441, !442, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !556, !557, !558, !559}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !342, file: !343, line: 46, baseType: !346, size: 4480)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !343, line: 46, baseType: !348, size: 1536, offset: 4480)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1536, elements: !137)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !343, line: 13, size: 1536, elements: !350)
!350 = !{!351, !355, !359, !363, !367, !368, !369, !370, !371, !372, !373, !377, !381, !382, !383, !384, !388, !392, !393, !397, !401, !402, !406, !410}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !349, file: !343, line: 15, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!95, !340, !306, !195, !178}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !349, file: !343, line: 16, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!95, !340, !306, !195, !306, !178}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !349, file: !343, line: 17, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!95, !340, !306, !306, !178}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !349, file: !343, line: 18, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!95, !340, !306, !318, !318, !178}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !349, file: !343, line: 19, baseType: !360, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !349, file: !343, line: 20, baseType: !364, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !349, file: !343, line: 21, baseType: !360, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !349, file: !343, line: 22, baseType: !360, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !349, file: !343, line: 23, baseType: !360, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !349, file: !343, line: 24, baseType: !364, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !349, file: !343, line: 25, baseType: !374, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!95, !340, !306, !318, !318, !318, !178}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !349, file: !343, line: 26, baseType: !378, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!95, !340, !306, !318, !178}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !349, file: !343, line: 27, baseType: !364, size: 64, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !349, file: !343, line: 28, baseType: !364, size: 64, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !349, file: !343, line: 29, baseType: !360, size: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !349, file: !343, line: 30, baseType: !385, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!95, !340, !141, !178}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !349, file: !343, line: 31, baseType: !389, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!95, !340, !178}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !349, file: !343, line: 32, baseType: !224, size: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !349, file: !343, line: 35, baseType: !394, size: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!95, !340, !306, !306}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !349, file: !343, line: 36, baseType: !398, size: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!95, !340}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !349, file: !343, line: 37, baseType: !398, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !343, line: 38, baseType: !403, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!95, !340, !105}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !349, file: !343, line: 39, baseType: !407, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!95, !233, !340}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !349, file: !343, line: 40, baseType: !398, size: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !342, file: !343, line: 47, baseType: !178, size: 64, offset: 6016)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !342, file: !343, line: 48, baseType: !178, size: 64, offset: 6080)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !342, file: !343, line: 49, baseType: !178, size: 64, offset: 6144)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !342, file: !343, line: 50, baseType: !178, size: 64, offset: 6208)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !342, file: !343, line: 51, baseType: !178, size: 64, offset: 6272)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !342, file: !343, line: 52, baseType: !178, size: 64, offset: 6336)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !342, file: !343, line: 53, baseType: !178, size: 64, offset: 6400)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !342, file: !343, line: 54, baseType: !178, size: 64, offset: 6464)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !342, file: !343, line: 55, baseType: !178, size: 64, offset: 6528)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !342, file: !343, line: 56, baseType: !178, size: 64, offset: 6592)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !342, file: !343, line: 57, baseType: !178, size: 64, offset: 6656)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !342, file: !343, line: 58, baseType: !178, size: 64, offset: 6720)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !342, file: !343, line: 59, baseType: !178, size: 64, offset: 6784)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !342, file: !343, line: 60, baseType: !178, size: 64, offset: 6848)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !342, file: !343, line: 61, baseType: !178, size: 64, offset: 6912)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !342, file: !343, line: 62, baseType: !178, size: 64, offset: 6976)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !342, file: !343, line: 63, baseType: !178, size: 64, offset: 7040)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !342, file: !343, line: 65, baseType: !429, size: 640, offset: 7104)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 640, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 10)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !342, file: !343, line: 66, baseType: !433, size: 640, offset: 7744)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 640, elements: !430)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!95, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !342, file: !343, line: 67, baseType: !439, size: 640, offset: 8384)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 640, elements: !430)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !342, file: !343, line: 68, baseType: !141, size: 32, offset: 9024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !342, file: !343, line: 69, baseType: !178, size: 64, offset: 9088)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !342, file: !343, line: 70, baseType: !443, size: 32, offset: 9152)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !342, file: !343, line: 72, baseType: !254, size: 32, offset: 9184)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !343, line: 73, baseType: !178, size: 64, offset: 9216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !342, file: !343, line: 75, baseType: !306, size: 64, offset: 9280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !342, file: !343, line: 76, baseType: !306, size: 64, offset: 9344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !342, file: !343, line: 77, baseType: !306, size: 64, offset: 9408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !342, file: !343, line: 78, baseType: !306, size: 64, offset: 9472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !342, file: !343, line: 79, baseType: !306, size: 64, offset: 9536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !342, file: !343, line: 80, baseType: !306, size: 64, offset: 9600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !342, file: !343, line: 81, baseType: !306, size: 64, offset: 9664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !342, file: !343, line: 82, baseType: !306, size: 64, offset: 9728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !342, file: !343, line: 83, baseType: !306, size: 64, offset: 9792)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !342, file: !343, line: 84, baseType: !318, size: 64, offset: 9856)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !342, file: !343, line: 85, baseType: !318, size: 64, offset: 9920)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !342, file: !343, line: 86, baseType: !318, size: 64, offset: 9984)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !342, file: !343, line: 87, baseType: !306, size: 64, offset: 10048)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !342, file: !343, line: 88, baseType: !306, size: 64, offset: 10112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !342, file: !343, line: 89, baseType: !318, size: 64, offset: 10176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !342, file: !343, line: 90, baseType: !318, size: 64, offset: 10240)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !342, file: !343, line: 91, baseType: !306, size: 64, offset: 10304)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !342, file: !343, line: 92, baseType: !141, size: 32, offset: 10368)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !342, file: !343, line: 93, baseType: !187, size: 64, offset: 10432)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !342, file: !343, line: 94, baseType: !187, size: 64, offset: 10496)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !342, file: !343, line: 95, baseType: !195, size: 64, offset: 10560)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !342, file: !343, line: 96, baseType: !306, size: 64, offset: 10624)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !342, file: !343, line: 97, baseType: !306, size: 64, offset: 10688)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !342, file: !343, line: 98, baseType: !306, size: 64, offset: 10752)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !342, file: !343, line: 99, baseType: !318, size: 64, offset: 10816)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !342, file: !343, line: 100, baseType: !318, size: 64, offset: 10880)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !342, file: !343, line: 101, baseType: !318, size: 64, offset: 10944)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !342, file: !343, line: 102, baseType: !318, size: 64, offset: 11008)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !342, file: !343, line: 103, baseType: !318, size: 64, offset: 11072)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !342, file: !343, line: 104, baseType: !318, size: 64, offset: 11136)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !342, file: !343, line: 105, baseType: !318, size: 64, offset: 11200)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !342, file: !343, line: 106, baseType: !318, size: 64, offset: 11264)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !342, file: !343, line: 107, baseType: !318, size: 64, offset: 11328)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !342, file: !343, line: 108, baseType: !318, size: 64, offset: 11392)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !342, file: !343, line: 109, baseType: !318, size: 64, offset: 11456)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !342, file: !343, line: 110, baseType: !329, size: 64, offset: 11520)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !342, file: !343, line: 111, baseType: !329, size: 64, offset: 11584)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !342, file: !343, line: 112, baseType: !196, size: 64, offset: 11648)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !342, file: !343, line: 113, baseType: !196, size: 64, offset: 11712)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !342, file: !343, line: 114, baseType: !196, size: 64, offset: 11776)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !342, file: !343, line: 115, baseType: !196, size: 64, offset: 11840)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !342, file: !343, line: 116, baseType: !196, size: 64, offset: 11904)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !342, file: !343, line: 117, baseType: !196, size: 64, offset: 11968)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !342, file: !343, line: 119, baseType: !141, size: 32, offset: 12032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !342, file: !343, line: 120, baseType: !141, size: 32, offset: 12064)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !342, file: !343, line: 121, baseType: !141, size: 32, offset: 12096)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !342, file: !343, line: 122, baseType: !141, size: 32, offset: 12128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !342, file: !343, line: 123, baseType: !141, size: 32, offset: 12160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !342, file: !343, line: 124, baseType: !141, size: 32, offset: 12192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !342, file: !343, line: 125, baseType: !141, size: 32, offset: 12224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !342, file: !343, line: 126, baseType: !141, size: 32, offset: 12256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !342, file: !343, line: 127, baseType: !141, size: 32, offset: 12288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !342, file: !343, line: 128, baseType: !141, size: 32, offset: 12320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !342, file: !343, line: 129, baseType: !141, size: 32, offset: 12352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !342, file: !343, line: 130, baseType: !141, size: 32, offset: 12384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !342, file: !343, line: 131, baseType: !141, size: 32, offset: 12416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !342, file: !343, line: 132, baseType: !141, size: 32, offset: 12448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !342, file: !343, line: 133, baseType: !141, size: 32, offset: 12480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !342, file: !343, line: 134, baseType: !141, size: 32, offset: 12512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !342, file: !343, line: 135, baseType: !141, size: 32, offset: 12544)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !342, file: !343, line: 137, baseType: !141, size: 32, offset: 12576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !342, file: !343, line: 138, baseType: !141, size: 32, offset: 12608)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !342, file: !343, line: 140, baseType: !509, size: 64, offset: 12672)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !53, line: 5, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !53, line: 5, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !342, file: !343, line: 141, baseType: !254, size: 32, offset: 12736)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !342, file: !343, line: 142, baseType: !514, size: 64, offset: 12800)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !515, line: 22, baseType: !516)
!515 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !515, line: 22, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !342, file: !343, line: 143, baseType: !196, size: 64, offset: 12864)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !342, file: !343, line: 144, baseType: !196, size: 64, offset: 12928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !342, file: !343, line: 146, baseType: !196, size: 64, offset: 12992)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !342, file: !343, line: 147, baseType: !196, size: 64, offset: 13056)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !342, file: !343, line: 148, baseType: !196, size: 64, offset: 13120)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !342, file: !343, line: 149, baseType: !196, size: 64, offset: 13184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !342, file: !343, line: 150, baseType: !196, size: 64, offset: 13248)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !342, file: !343, line: 151, baseType: !196, size: 64, offset: 13312)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !342, file: !343, line: 152, baseType: !196, size: 64, offset: 13376)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !342, file: !343, line: 153, baseType: !254, size: 32, offset: 13440)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !342, file: !343, line: 154, baseType: !254, size: 32, offset: 13472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !342, file: !343, line: 155, baseType: !254, size: 32, offset: 13504)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !342, file: !343, line: 156, baseType: !254, size: 32, offset: 13536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !342, file: !343, line: 157, baseType: !254, size: 32, offset: 13568)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !342, file: !343, line: 158, baseType: !254, size: 32, offset: 13600)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !342, file: !343, line: 159, baseType: !254, size: 32, offset: 13632)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !342, file: !343, line: 160, baseType: !254, size: 32, offset: 13664)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !342, file: !343, line: 161, baseType: !254, size: 32, offset: 13696)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !342, file: !343, line: 162, baseType: !254, size: 32, offset: 13728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !342, file: !343, line: 163, baseType: !254, size: 32, offset: 13760)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !342, file: !343, line: 164, baseType: !254, size: 32, offset: 13792)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !342, file: !343, line: 165, baseType: !254, size: 32, offset: 13824)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !342, file: !343, line: 166, baseType: !254, size: 32, offset: 13856)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !342, file: !343, line: 167, baseType: !254, size: 32, offset: 13888)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !342, file: !343, line: 168, baseType: !254, size: 32, offset: 13920)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !342, file: !343, line: 169, baseType: !254, size: 32, offset: 13952)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !342, file: !343, line: 170, baseType: !254, size: 32, offset: 13984)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !342, file: !343, line: 171, baseType: !254, size: 32, offset: 14016)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !342, file: !343, line: 172, baseType: !254, size: 32, offset: 14048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !342, file: !343, line: 173, baseType: !254, size: 32, offset: 14080)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !342, file: !343, line: 174, baseType: !254, size: 32, offset: 14112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !342, file: !343, line: 175, baseType: !254, size: 32, offset: 14144)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !342, file: !343, line: 177, baseType: !551, size: 32, offset: 14176)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !342, file: !343, line: 178, baseType: !141, size: 32, offset: 14208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !342, file: !343, line: 179, baseType: !195, size: 64, offset: 14272)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !342, file: !343, line: 180, baseType: !195, size: 64, offset: 14336)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !342, file: !343, line: 181, baseType: !195, size: 64, offset: 14400)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !342, file: !343, line: 182, baseType: !187, size: 64, offset: 14464)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !342, file: !343, line: 183, baseType: !141, size: 32, offset: 14528)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !342, file: !343, line: 184, baseType: !254, size: 32, offset: 14560)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !342, file: !343, line: 185, baseType: !254, size: 32, offset: 14592)
!560 = !{i32 7, !"Dwarf Version", i32 4}
!561 = !{i32 2, !"Debug Info Version", i32 3}
!562 = !{i32 1, !"wchar_size", i32 4}
!563 = !{i32 7, !"PIC Level", i32 2}
!564 = !{i32 7, !"uwtable", i32 1}
!565 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!566 = distinct !DISubprogram(name: "TaoCreate_GPCG", scope: !567, file: !567, line: 322, type: !399, scopeLine: 323, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !568)
!567 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/gpcg/gpcg.c", directory: "/home/users/ndemeye/xSDK")
!568 = !{!569, !570, !571, !572, !574, !576, !578, !580, !582, !584, !586, !588, !590}
!569 = !DILocalVariable(name: "tao", arg: 1, scope: !566, file: !567, line: 322, type: !340)
!570 = !DILocalVariable(name: "gpcg", scope: !566, file: !567, line: 324, type: !284)
!571 = !DILocalVariable(name: "ierr", scope: !566, file: !567, line: 325, type: !95)
!572 = !DILocalVariable(name: "ierr__", scope: !573, file: !567, line: 335, type: !95)
!573 = distinct !DILexicalBlock(scope: !566, file: !567, line: 335, column: 33)
!574 = !DILocalVariable(name: "ierr__", scope: !575, file: !567, line: 366, type: !95)
!575 = distinct !DILexicalBlock(scope: !566, file: !567, line: 366, column: 57)
!576 = !DILocalVariable(name: "ierr__", scope: !577, file: !567, line: 367, type: !95)
!577 = distinct !DILexicalBlock(scope: !566, file: !567, line: 367, column: 83)
!578 = !DILocalVariable(name: "ierr__", scope: !579, file: !567, line: 368, type: !95)
!579 = distinct !DILexicalBlock(scope: !566, file: !567, line: 368, column: 57)
!580 = !DILocalVariable(name: "ierr__", scope: !581, file: !567, line: 369, type: !95)
!581 = distinct !DILexicalBlock(scope: !566, file: !567, line: 369, column: 39)
!582 = !DILocalVariable(name: "ierr__", scope: !583, file: !567, line: 371, type: !95)
!583 = distinct !DILexicalBlock(scope: !566, file: !567, line: 371, column: 74)
!584 = !DILocalVariable(name: "ierr__", scope: !585, file: !567, line: 372, type: !95)
!585 = distinct !DILexicalBlock(scope: !566, file: !567, line: 372, column: 90)
!586 = !DILocalVariable(name: "ierr__", scope: !587, file: !567, line: 373, type: !95)
!587 = distinct !DILexicalBlock(scope: !566, file: !567, line: 373, column: 67)
!588 = !DILocalVariable(name: "ierr__", scope: !589, file: !567, line: 374, type: !95)
!589 = distinct !DILexicalBlock(scope: !566, file: !567, line: 374, column: 102)
!590 = !DILocalVariable(name: "ierr__", scope: !591, file: !567, line: 375, type: !95)
!591 = distinct !DILexicalBlock(scope: !566, file: !567, line: 375, column: 73)
!592 = !DILocation(line: 0, scope: !566)
!593 = !DILocation(line: 324, column: 3, scope: !566)
!594 = !DILocation(line: 327, column: 3, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !567, line: 327, column: 3)
!596 = distinct !DILexicalBlock(scope: !597, file: !567, line: 327, column: 3)
!597 = distinct !DILexicalBlock(scope: !566, file: !567, line: 327, column: 3)
!598 = !{!599, !599, i64 0}
!599 = !{!"any pointer", !600, i64 0}
!600 = !{!"omnipotent char", !601, i64 0}
!601 = !{!"Simple C/C++ TBAA"}
!602 = !DILocation(line: 327, column: 3, scope: !596)
!603 = !DILocation(line: 327, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !567, line: 327, column: 3)
!605 = distinct !DILexicalBlock(scope: !595, file: !567, line: 327, column: 3)
!606 = !{!607, !608, i64 1536}
!607 = !{!"", !600, i64 0, !600, i64 512, !600, i64 1024, !600, i64 1280, !608, i64 1536, !608, i64 1540, !600, i64 1544}
!608 = !{!"int", !600, i64 0}
!609 = !DILocation(line: 327, column: 3, scope: !605)
!610 = !DILocation(line: 327, column: 3, scope: !611)
!611 = distinct !DILexicalBlock(scope: !604, file: !567, line: 327, column: 3)
