; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/matpart/partmatpart.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/matpart/partmatpart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscPartitioner = type { %struct._p_PetscObject, [1 x %struct._PetscPartitionerOps], i8*, i32, i32, double, %struct._p_PetscViewer*, %struct._p_PetscViewer*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!49 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 119, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!53 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!100 = !{!101, !105, !106, !310, !142, !276, !311, !313, !192}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !102, line: 330, baseType: !103)
!102 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !102, line: 330, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !109, line: 73, size: 4480, elements: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!110 = !{!111, !114, !163, !164, !166, !169, !170, !171, !172, !180, !181, !183, !187, !191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !205, !206, !208, !209, !211, !213, !214, !215, !216, !217, !220, !222, !223, !224, !225, !226, !229, !231, !232, !233, !243, !245, !246, !250, !251, !300, !305, !307, !308, !309}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !108, file: !109, line: 74, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !113)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !108, file: !109, line: 75, baseType: !115, size: 448, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 448, elements: !161)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !109, line: 53, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 45, size: 448, elements: !118)
!118 = !{!119, !125, !133, !138, !145, !149, !156}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !117, file: !109, line: 46, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !106, !124}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !113)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !117, file: !109, line: 47, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!123, !106, !129}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !130, line: 16, baseType: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !130, line: 16, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !117, file: !109, line: 48, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!123, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !117, file: !109, line: 49, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!123, !106, !142, !106}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !117, file: !109, line: 50, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!123, !106, !142, !137}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !117, file: !109, line: 51, baseType: !150, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!123, !106, !142, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !117, file: !109, line: 52, baseType: !157, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!123, !106, !142, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !108, file: !109, line: 76, baseType: !101, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !109, line: 77, baseType: !165, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !113)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !108, file: !109, line: 78, baseType: !167, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !168)
!168 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !108, file: !109, line: 78, baseType: !167, size: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !108, file: !109, line: 78, baseType: !167, size: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !108, file: !109, line: 78, baseType: !167, size: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 79, baseType: !173, size: 64, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !176, line: 27, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !178, line: 43, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!179 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !108, file: !109, line: 80, baseType: !165, size: 32, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !108, file: !109, line: 81, baseType: !182, size: 32, offset: 992)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !113)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !108, file: !109, line: 82, baseType: !184, size: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !108, file: !109, line: 83, baseType: !188, size: 64, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !108, file: !109, line: 84, baseType: !192, size: 64, offset: 1152)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !108, file: !109, line: 85, baseType: !192, size: 64, offset: 1216)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !108, file: !109, line: 86, baseType: !192, size: 64, offset: 1280)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !108, file: !109, line: 87, baseType: !192, size: 64, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !108, file: !109, line: 88, baseType: !106, size: 64, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !108, file: !109, line: 89, baseType: !173, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !109, line: 90, baseType: !192, size: 64, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !108, file: !109, line: 91, baseType: !192, size: 64, offset: 1600)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !108, file: !109, line: 92, baseType: !165, size: 32, offset: 1664)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !108, file: !109, line: 93, baseType: !105, size: 64, offset: 1728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !108, file: !109, line: 94, baseType: !203, size: 64, offset: 1792)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !174)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !108, file: !109, line: 95, baseType: !165, size: 32, offset: 1856)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !108, file: !109, line: 95, baseType: !165, size: 32, offset: 1888)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !108, file: !109, line: 96, baseType: !207, size: 64, offset: 1920)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !108, file: !109, line: 96, baseType: !207, size: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !108, file: !109, line: 97, baseType: !210, size: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !108, file: !109, line: 97, baseType: !212, size: 64, offset: 2112)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !108, file: !109, line: 98, baseType: !165, size: 32, offset: 2176)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !108, file: !109, line: 98, baseType: !165, size: 32, offset: 2208)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !108, file: !109, line: 99, baseType: !207, size: 64, offset: 2240)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !108, file: !109, line: 99, baseType: !207, size: 64, offset: 2304)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !108, file: !109, line: 100, baseType: !218, size: 64, offset: 2368)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !168)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !108, file: !109, line: 100, baseType: !221, size: 64, offset: 2432)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !108, file: !109, line: 101, baseType: !165, size: 32, offset: 2496)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !108, file: !109, line: 101, baseType: !165, size: 32, offset: 2528)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !108, file: !109, line: 102, baseType: !207, size: 64, offset: 2560)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !108, file: !109, line: 102, baseType: !207, size: 64, offset: 2624)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !108, file: !109, line: 103, baseType: !227, size: 64, offset: 2688)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !219)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !108, file: !109, line: 103, baseType: !230, size: 64, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !108, file: !109, line: 104, baseType: !160, size: 64, offset: 2816)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !108, file: !109, line: 105, baseType: !165, size: 32, offset: 2880)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !108, file: !109, line: 106, baseType: !234, size: 128, offset: 2944)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !241)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !109, line: 64, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 61, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !237, file: !109, line: 62, baseType: !153, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !237, file: !109, line: 63, baseType: !105, size: 64, offset: 64)
!241 = !{!242}
!242 = !DISubrange(count: 2)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !108, file: !109, line: 107, baseType: !244, size: 64, offset: 3072)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, elements: !241)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !108, file: !109, line: 108, baseType: !105, size: 64, offset: 3136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !108, file: !109, line: 109, baseType: !247, size: 64, offset: 3200)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!123, !105}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !108, file: !109, line: 111, baseType: !165, size: 32, offset: 3264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !108, file: !109, line: 112, baseType: !252, size: 320, offset: 3328)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !298)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!123, !256, !106, !105}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !259)
!259 = !{!260, !261, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !258, file: !10, line: 100, baseType: !165, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !10, line: 101, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !273, !274, !275, !279, !281, !283, !284, !285}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !264, file: !10, line: 84, baseType: !192, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !264, file: !10, line: 85, baseType: !192, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !10, line: 86, baseType: !105, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !264, file: !10, line: 87, baseType: !184, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !264, file: !10, line: 88, baseType: !271, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !264, file: !10, line: 89, baseType: !144, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !264, file: !10, line: 90, baseType: !192, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !264, file: !10, line: 91, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 46, baseType: !278)
!277 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!278 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !264, file: !10, line: 92, baseType: !280, size: 32, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !10, line: 93, baseType: !282, size: 32, offset: 544)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 94, baseType: !262, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !264, file: !10, line: 95, baseType: !192, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !264, file: !10, line: 96, baseType: !105, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !10, line: 102, baseType: !192, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !258, file: !10, line: 102, baseType: !192, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !258, file: !10, line: 103, baseType: !192, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !258, file: !10, line: 104, baseType: !101, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !258, file: !10, line: 106, baseType: !106, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !258, file: !10, line: 107, baseType: !295, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !108, file: !109, line: 113, baseType: !301, size: 320, offset: 3648)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 320, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!123, !106, !105}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !108, file: !109, line: 114, baseType: !306, size: 320, offset: 3968)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 320, elements: !298)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !108, file: !109, line: 115, baseType: !280, size: 32, offset: 4288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !108, file: !109, line: 120, baseType: !295, size: 64, offset: 4352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !108, file: !109, line: 121, baseType: !280, size: 32, offset: 4416)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !312, line: 1451, baseType: !153)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner_MatPartitioning", file: !315, line: 6, baseType: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/matpart/partmatpart.c", directory: "/home/users/ndemeye/xSDK")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 4, size: 64, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !316, file: !315, line: 5, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !320, line: 1427, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !320, line: 1427, flags: DIFlagFwdDecl)
!323 = !{i32 7, !"Dwarf Version", i32 4}
!324 = !{i32 2, !"Debug Info Version", i32 3}
!325 = !{i32 1, !"wchar_size", i32 4}
!326 = !{i32 7, !"PIC Level", i32 2}
!327 = !{i32 7, !"uwtable", i32 1}
!328 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!329 = distinct !DISubprogram(name: "PetscPartitionerMatPartitioningGetMatPartitioning", scope: !315, file: !315, line: 32, type: !330, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !381)
!330 = !DISubroutineType(types: !331)
!331 = !{!123, !332, !380}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !333, line: 13, baseType: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !336, line: 21, size: 5312, elements: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/partitionerimpl.h", directory: "/home/users/ndemeye/xSDK")
!337 = !{!338, !340, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !335, file: !336, line: 22, baseType: !339, size: 4480)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !109, line: 122, baseType: !108)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !335, file: !336, line: 22, baseType: !341, size: 384, offset: 4480)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 384, elements: !161)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscPartitionerOps", file: !336, line: 12, size: 384, elements: !343)
!343 = !{!344, !348, !352, !353, !357, !358}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !342, file: !336, line: 13, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!123, !256, !332}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !342, file: !336, line: 14, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!123, !332}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !342, file: !336, line: 15, baseType: !349, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !342, file: !336, line: 16, baseType: !354, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!123, !332, !129}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !342, file: !336, line: 17, baseType: !349, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !342, file: !336, line: 18, baseType: !359, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!123, !332, !165, !165, !210, !210, !362, !362, !362, !366}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !363, line: 18, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !363, line: 18, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !368, line: 11, baseType: !369)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !368, line: 11, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !336, line: 23, baseType: !105, size: 64, offset: 4864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !335, file: !336, line: 24, baseType: !165, size: 32, offset: 4928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "edgeCut", scope: !335, file: !336, line: 25, baseType: !165, size: 32, offset: 4960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !335, file: !336, line: 26, baseType: !219, size: 64, offset: 4992)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !335, file: !336, line: 27, baseType: !129, size: 64, offset: 5056)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "viewerGraph", scope: !335, file: !336, line: 28, baseType: !129, size: 64, offset: 5120)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "viewGraph", scope: !335, file: !336, line: 29, baseType: !280, size: 32, offset: 5184)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "noGraph", scope: !335, file: !336, line: 30, baseType: !280, size: 32, offset: 5216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "usevwgt", scope: !335, file: !336, line: 31, baseType: !280, size: 32, offset: 5248)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!381 = !{!382, !383, !384, !385, !388, !389, !391, !395}
!382 = !DILocalVariable(name: "part", arg: 1, scope: !329, file: !315, line: 32, type: !332)
!383 = !DILocalVariable(name: "mp", arg: 2, scope: !329, file: !315, line: 32, type: !380)
!384 = !DILocalVariable(name: "ierr", scope: !329, file: !315, line: 34, type: !123)
!385 = !DILocalVariable(name: "_7_f", scope: !386, file: !315, line: 39, type: !387)
!386 = distinct !DILexicalBlock(scope: !329, file: !315, line: 39, column: 10)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!388 = !DILocalVariable(name: "_7_ierr", scope: !386, file: !315, line: 39, type: !123)
!389 = !DILocalVariable(name: "ierr__", scope: !390, file: !315, line: 39, type: !123)
!390 = distinct !DILexicalBlock(scope: !386, file: !315, line: 39, column: 10)
!391 = !DILocalVariable(name: "ierr__", scope: !392, file: !315, line: 39, type: !123)
!392 = distinct !DILexicalBlock(scope: !393, file: !315, line: 39, column: 10)
!393 = distinct !DILexicalBlock(scope: !394, file: !315, line: 39, column: 10)
!394 = distinct !DILexicalBlock(scope: !386, file: !315, line: 39, column: 10)
!395 = !DILocalVariable(name: "ierr__", scope: !396, file: !315, line: 39, type: !123)
!396 = distinct !DILexicalBlock(scope: !329, file: !315, line: 39, column: 131)
!397 = !DILocation(line: 0, scope: !329)
!398 = !DILocation(line: 36, column: 3, scope: !399)
!399 = distinct !DILexicalBlock(scope: !400, file: !315, line: 36, column: 3)
!400 = distinct !DILexicalBlock(scope: !401, file: !315, line: 36, column: 3)
!401 = distinct !DILexicalBlock(scope: !329, file: !315, line: 36, column: 3)
!402 = !{!403, !403, i64 0}
!403 = !{!"any pointer", !404, i64 0}
!404 = !{!"omnipotent char", !405, i64 0}
!405 = !{!"Simple C/C++ TBAA"}
!406 = !DILocation(line: 36, column: 3, scope: !400)
!407 = !DILocation(line: 36, column: 3, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !315, line: 36, column: 3)
!409 = distinct !DILexicalBlock(scope: !399, file: !315, line: 36, column: 3)
!410 = !{!411, !412, i64 1536}
!411 = !{!"", !404, i64 0, !404, i64 512, !404, i64 1024, !404, i64 1280, !412, i64 1536, !412, i64 1540, !404, i64 1544}
!412 = !{!"int", !404, i64 0}
!413 = !DILocation(line: 36, column: 3, scope: !409)
!414 = !DILocation(line: 36, column: 3, scope: !415)
!415 = distinct !DILexicalBlock(scope: !408, file: !315, line: 36, column: 3)
!416 = !{!412, !412, i64 0}
!417 = !{!411, !412, i64 1540}
!418 = !DILocation(line: 37, column: 3, scope: !419)
!419 = distinct !DILexicalBlock(scope: !420, file: !315, line: 37, column: 3)
!420 = distinct !DILexicalBlock(scope: !329, file: !315, line: 37, column: 3)
!421 = !DILocation(line: 37, column: 3, scope: !420)
!422 = !DILocation(line: 37, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !420, file: !315, line: 37, column: 3)
!424 = !DILocation(line: 37, column: 3, scope: !425)
!425 = distinct !DILexicalBlock(scope: !420, file: !315, line: 37, column: 3)
!426 = !{!427, !412, i64 0}
