; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/neighbor/sfneighbor.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/neighbor/sfneighbor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_info_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 24, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!75 = !{!76, !79, !98, !179, !119, !285, !635, !159, !169, !86, !144, !655, !372, !375}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !87, !140, !141, !143, !146, !147, !148, !149, !157, !158, !160, !164, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !182, !183, !184, !186, !187, !189, !191, !192, !193, !194, !195, !198, !200, !201, !202, !203, !204, !207, !209, !210, !211, !221, !223, !224, !228, !229, !275, !280, !282, !283, !284}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !88, size: 448, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 448, elements: !138)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !91)
!91 = !{!92, !102, !110, !115, !122, !126, !133}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !90, file: !82, line: 46, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !79, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !86)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !90, file: !82, line: 47, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!96, !79, !106}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !107, line: 16, baseType: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !107, line: 16, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !90, file: !82, line: 48, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!96, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !90, file: !82, line: 49, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!96, !79, !119, !79}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !90, file: !82, line: 50, baseType: !123, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!96, !79, !119, !114}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !90, file: !82, line: 51, baseType: !127, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!96, !79, !119, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !90, file: !82, line: 52, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!96, !79, !119, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!138 = !{!139}
!139 = !DISubrange(count: 1)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !98, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !142, size: 32, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !86)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !144, size: 64, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !145)
!145 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !144, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !144, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !144, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !150, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !153, line: 27, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !155, line: 43, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!156 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !142, size: 32, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !159, size: 32, offset: 992)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !86)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !165, size: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !169, size: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !169, size: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !169, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !169, size: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !150, size: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !169, size: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !169, size: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !142, size: 32, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !179, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !181, size: 64, offset: 1792)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !151)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !142, size: 32, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !142, size: 32, offset: 1888)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !185, size: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !185, size: 64, offset: 1984)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !188, size: 64, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !190, size: 64, offset: 2112)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !142, size: 32, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !142, size: 32, offset: 2208)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !185, size: 64, offset: 2240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !185, size: 64, offset: 2304)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !196, size: 64, offset: 2368)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !145)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !199, size: 64, offset: 2432)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !142, size: 32, offset: 2496)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !142, size: 32, offset: 2528)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !185, size: 64, offset: 2560)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !185, size: 64, offset: 2624)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !205, size: 64, offset: 2688)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !197)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !208, size: 64, offset: 2752)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !137, size: 64, offset: 2816)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !142, size: 32, offset: 2880)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !212, size: 128, offset: 2944)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !219)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !215, file: !82, line: 62, baseType: !130, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !215, file: !82, line: 63, baseType: !179, size: 64, offset: 64)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !222, size: 64, offset: 3072)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !219)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !179, size: 64, offset: 3136)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !225, size: 64, offset: 3200)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!96, !179}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !142, size: 32, offset: 3264)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !230, size: 320, offset: 3328)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 320, elements: !273)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!96, !234, !79, !179}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !237)
!237 = !{!238, !239, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !236, file: !10, line: 100, baseType: !142, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !10, line: 101, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !251, !252, !253, !254, !256, !258, !259, !260}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !242, file: !10, line: 84, baseType: !169, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !242, file: !10, line: 85, baseType: !169, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !10, line: 86, baseType: !179, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !242, file: !10, line: 87, baseType: !161, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !242, file: !10, line: 88, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !242, file: !10, line: 89, baseType: !121, size: 8, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !242, file: !10, line: 90, baseType: !169, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !242, file: !10, line: 91, baseType: !76, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !242, file: !10, line: 92, baseType: !255, size: 32, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !10, line: 93, baseType: !257, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !10, line: 94, baseType: !240, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !242, file: !10, line: 95, baseType: !169, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !242, file: !10, line: 96, baseType: !179, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !236, file: !10, line: 102, baseType: !169, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !236, file: !10, line: 102, baseType: !169, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !236, file: !10, line: 103, baseType: !169, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !236, file: !10, line: 104, baseType: !98, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !236, file: !10, line: 105, baseType: !255, size: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !236, file: !10, line: 105, baseType: !255, size: 32, offset: 416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !236, file: !10, line: 105, baseType: !255, size: 32, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !236, file: !10, line: 106, baseType: !79, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !236, file: !10, line: 107, baseType: !270, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!273 = !{!274}
!274 = !DISubrange(count: 5)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !276, size: 320, offset: 3648)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !273)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!96, !79, !179}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !281, size: 320, offset: 3968)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 320, elements: !273)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !255, size: 32, offset: 4288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !270, size: 64, offset: 4352)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !255, size: 32, offset: 4416)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Neighbor", file: !287, line: 12, baseType: !288)
!287 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/neighbor/sfneighbor.c", directory: "/home/users/ndemeye/xSDK")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 6, size: 1664, elements: !289)
!289 = !{!290, !291, !292, !294, !295, !296, !297, !299, !300, !302, !303, !318, !319, !320, !321, !625, !626, !628, !629, !630, !631, !632, !633, !634}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !288, file: !287, line: 7, baseType: !159, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !288, file: !287, line: 7, baseType: !159, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !288, file: !287, line: 7, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !288, file: !287, line: 7, baseType: !142, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !288, file: !287, line: 7, baseType: !188, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !288, file: !287, line: 7, baseType: !188, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !288, file: !287, line: 7, baseType: !298, size: 128, offset: 320)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !219)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !288, file: !287, line: 7, baseType: !222, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !288, file: !287, line: 7, baseType: !301, size: 64, offset: 512)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !219)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !288, file: !287, line: 7, baseType: !222, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !288, file: !287, line: 7, baseType: !304, size: 128, offset: 640)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 128, elements: !219)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !66, line: 41, size: 576, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !307, file: !66, line: 42, baseType: !188, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !307, file: !66, line: 43, baseType: !142, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !307, file: !66, line: 44, baseType: !188, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !307, file: !66, line: 45, baseType: !188, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !307, file: !66, line: 46, baseType: !188, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !307, file: !66, line: 46, baseType: !188, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !307, file: !66, line: 46, baseType: !188, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !307, file: !66, line: 47, baseType: !188, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !307, file: !66, line: 47, baseType: !188, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !288, file: !287, line: 7, baseType: !304, size: 128, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !288, file: !287, line: 7, baseType: !301, size: 64, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !288, file: !287, line: 7, baseType: !142, size: 32, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !288, file: !287, line: 7, baseType: !322, size: 64, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !323, line: 6, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !66, line: 52, size: 6592, elements: !326)
!326 = !{!327, !334, !527, !528, !529, !530, !534, !535, !539, !540, !541, !545, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !608, !609, !610, !611, !618, !619, !621, !622, !623, !624}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !325, file: !66, line: 53, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!96, !322, !331, !179, !331, !332, !76}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !325, file: !66, line: 54, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!96, !338, !322, !526}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !339, line: 15, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !342)
!342 = !{!343, !345, !441, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !487, !488, !489, !490, !491, !493, !494, !519, !520, !521, !522, !523, !525}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !341, file: !44, line: 67, baseType: !344, size: 4480)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !341, file: !44, line: 67, baseType: !346, size: 1344, offset: 4480)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 1344, elements: !138)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !348)
!348 = !{!349, !353, !354, !355, !359, !363, !368, !378, !382, !383, !384, !388, !392, !396, !406, !410, !415, !427, !431, !432, !437}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !347, file: !44, line: 40, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!96, !338}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !347, file: !44, line: 41, baseType: !350, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !347, file: !44, line: 42, baseType: !350, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !347, file: !44, line: 43, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!96, !234, !338}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !347, file: !44, line: 44, baseType: !360, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!96, !338, !106}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !347, file: !44, line: 45, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!96, !338, !367, !338}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !347, file: !44, line: 46, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!96, !338, !372, !331, !332, !331, !179, !375}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !99, line: 331, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !99, line: 331, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !99, line: 338, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !99, line: 338, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !347, file: !44, line: 47, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!96, !338, !372, !332, !179, !375}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !347, file: !44, line: 48, baseType: !369, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !347, file: !44, line: 49, baseType: !379, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !347, file: !44, line: 50, baseType: !385, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!96, !338, !372, !331, !179, !331, !332, !179, !375}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !347, file: !44, line: 51, baseType: !389, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!96, !338, !372, !179, !332, !179, !375}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !347, file: !44, line: 52, baseType: !393, size: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!96, !338, !372, !331, !332, !331, !179}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !347, file: !44, line: 53, baseType: !397, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!96, !338, !188, !400, !403, !403, !403}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !347, file: !44, line: 54, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!96, !338, !188, !400, !403, !403}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !347, file: !44, line: 55, baseType: !411, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!96, !338, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !347, file: !44, line: 56, baseType: !416, size: 64, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!96, !338, !188, !188, !403, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !339, line: 49, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 46, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !423, file: !339, line: 47, baseType: !142, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !423, file: !339, line: 48, baseType: !142, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !347, file: !44, line: 57, baseType: !428, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!96, !338, !142, !404, !414}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !347, file: !44, line: 58, baseType: !428, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !347, file: !44, line: 60, baseType: !433, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!96, !331, !76, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !347, file: !44, line: 61, baseType: !438, size: 64, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!96, !331, !179}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !341, file: !44, line: 78, baseType: !442, size: 512, offset: 5824)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !44, line: 68, size: 512, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !451, !452, !453, !454, !455}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !442, file: !44, line: 69, baseType: !142, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !442, file: !44, line: 69, baseType: !142, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !442, file: !44, line: 70, baseType: !255, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !442, file: !44, line: 71, baseType: !255, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !442, file: !44, line: 72, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !442, file: !44, line: 73, baseType: !205, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !442, file: !44, line: 74, baseType: !338, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !442, file: !44, line: 75, baseType: !142, size: 32, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !442, file: !44, line: 76, baseType: !372, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !442, file: !44, line: 77, baseType: !255, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !341, file: !44, line: 81, baseType: !142, size: 32, offset: 6336)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !341, file: !44, line: 82, baseType: !142, size: 32, offset: 6368)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !341, file: !44, line: 83, baseType: !188, size: 64, offset: 6400)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !341, file: !44, line: 84, baseType: !188, size: 64, offset: 6464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !341, file: !44, line: 85, baseType: !142, size: 32, offset: 6528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !341, file: !44, line: 85, baseType: !142, size: 32, offset: 6560)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !341, file: !44, line: 86, baseType: !463, size: 64, offset: 6592)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !341, file: !44, line: 87, baseType: !463, size: 64, offset: 6656)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !341, file: !44, line: 88, baseType: !142, size: 32, offset: 6720)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !341, file: !44, line: 89, baseType: !142, size: 32, offset: 6752)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !341, file: !44, line: 90, baseType: !293, size: 64, offset: 6784)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !341, file: !44, line: 91, baseType: !188, size: 64, offset: 6848)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !341, file: !44, line: 92, baseType: !188, size: 64, offset: 6912)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !341, file: !44, line: 93, baseType: !298, size: 128, offset: 6976)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !341, file: !44, line: 96, baseType: !222, size: 64, offset: 7104)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !341, file: !44, line: 97, baseType: !301, size: 64, offset: 7168)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !341, file: !44, line: 98, baseType: !222, size: 64, offset: 7232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !341, file: !44, line: 99, baseType: !304, size: 128, offset: 7296)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !341, file: !44, line: 100, baseType: !304, size: 128, offset: 7424)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !341, file: !44, line: 101, baseType: !301, size: 64, offset: 7552)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !341, file: !44, line: 103, baseType: !142, size: 32, offset: 7616)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !341, file: !44, line: 104, baseType: !188, size: 64, offset: 7680)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !341, file: !44, line: 105, baseType: !255, size: 32, offset: 7744)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !341, file: !44, line: 106, baseType: !188, size: 64, offset: 7808)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !341, file: !44, line: 107, baseType: !188, size: 64, offset: 7872)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !341, file: !44, line: 108, baseType: !255, size: 32, offset: 7936)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !341, file: !44, line: 109, baseType: !484, size: 64, offset: 8000)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !99, line: 336, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !99, line: 336, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !341, file: !44, line: 110, baseType: !484, size: 64, offset: 8064)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !341, file: !44, line: 111, baseType: !338, size: 64, offset: 8128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !341, file: !44, line: 112, baseType: !255, size: 32, offset: 8192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !341, file: !44, line: 113, baseType: !255, size: 32, offset: 8224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !341, file: !44, line: 114, baseType: !492, size: 32, offset: 8256)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !341, file: !44, line: 115, baseType: !255, size: 32, offset: 8288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !341, file: !44, line: 116, baseType: !495, size: 64, offset: 8320)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !496, line: 60, baseType: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !499, line: 240, size: 640, elements: !500)
!499 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !517, !518}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !498, file: !499, line: 241, baseType: !98, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !498, file: !499, line: 242, baseType: !159, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !498, file: !499, line: 243, baseType: !142, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !498, file: !499, line: 243, baseType: !142, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !498, file: !499, line: 244, baseType: !142, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !498, file: !499, line: 244, baseType: !142, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !498, file: !499, line: 245, baseType: !188, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !498, file: !499, line: 246, baseType: !255, size: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !498, file: !499, line: 247, baseType: !142, size: 32, offset: 352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !498, file: !499, line: 251, baseType: !142, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !498, file: !499, line: 252, baseType: !512, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !496, line: 30, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !496, line: 30, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !498, file: !499, line: 253, baseType: !255, size: 32, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !498, file: !499, line: 254, baseType: !142, size: 32, offset: 544)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !498, file: !499, line: 254, baseType: !142, size: 32, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !498, file: !499, line: 255, baseType: !142, size: 32, offset: 608)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !341, file: !44, line: 117, baseType: !255, size: 32, offset: 8384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !341, file: !44, line: 118, baseType: !255, size: 32, offset: 8416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !341, file: !44, line: 119, baseType: !255, size: 32, offset: 8448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !341, file: !44, line: 120, baseType: !142, size: 32, offset: 8480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !341, file: !44, line: 121, baseType: !524, size: 32, offset: 8512)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !44, line: 122, baseType: !179, size: 64, offset: 8576)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !50)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !325, file: !66, line: 55, baseType: !335, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !325, file: !66, line: 56, baseType: !335, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !325, file: !66, line: 57, baseType: !335, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !325, file: !66, line: 58, baseType: !531, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!96, !322}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !325, file: !66, line: 59, baseType: !531, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !325, file: !66, line: 60, baseType: !536, size: 64, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!96, !338, !322}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !325, file: !66, line: 62, baseType: !335, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !325, file: !66, line: 63, baseType: !335, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !325, file: !66, line: 65, baseType: !542, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!96, !322, !142, !142, !305, !404, !332, !179}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !325, file: !66, line: 66, baseType: !546, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!96, !322, !142, !142, !305, !404, !179, !332}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !325, file: !66, line: 67, baseType: !546, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !325, file: !66, line: 68, baseType: !546, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !325, file: !66, line: 69, baseType: !546, size: 64, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !325, file: !66, line: 70, baseType: !546, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !325, file: !66, line: 71, baseType: !546, size: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !325, file: !66, line: 72, baseType: !546, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !325, file: !66, line: 73, baseType: !546, size: 64, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !325, file: !66, line: 74, baseType: !546, size: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !325, file: !66, line: 75, baseType: !546, size: 64, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !325, file: !66, line: 76, baseType: !546, size: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !325, file: !66, line: 77, baseType: !546, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !325, file: !66, line: 78, baseType: !546, size: 64, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !325, file: !66, line: 79, baseType: !562, size: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!96, !322, !142, !142, !305, !404, !179, !179}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !325, file: !66, line: 81, baseType: !566, size: 64, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!96, !322, !142, !142, !305, !404, !332, !142, !305, !404, !179}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !325, file: !66, line: 82, baseType: !566, size: 64, offset: 1664)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !325, file: !66, line: 83, baseType: !566, size: 64, offset: 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !325, file: !66, line: 84, baseType: !566, size: 64, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !325, file: !66, line: 85, baseType: !566, size: 64, offset: 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !325, file: !66, line: 86, baseType: !566, size: 64, offset: 1920)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !325, file: !66, line: 87, baseType: !566, size: 64, offset: 1984)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !325, file: !66, line: 88, baseType: !566, size: 64, offset: 2048)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !325, file: !66, line: 89, baseType: !566, size: 64, offset: 2112)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !325, file: !66, line: 90, baseType: !566, size: 64, offset: 2176)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !325, file: !66, line: 91, baseType: !566, size: 64, offset: 2240)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !325, file: !66, line: 92, baseType: !566, size: 64, offset: 2304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !325, file: !66, line: 93, baseType: !566, size: 64, offset: 2368)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !325, file: !66, line: 95, baseType: !582, size: 64, offset: 2432)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!96, !322, !142, !142, !305, !404, !179, !142, !305, !404, !332, !179}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !325, file: !66, line: 97, baseType: !255, size: 32, offset: 2496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !325, file: !66, line: 168, baseType: !159, size: 32, offset: 2528)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !325, file: !66, line: 169, baseType: !372, size: 64, offset: 2560)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !325, file: !66, line: 170, baseType: !372, size: 64, offset: 2624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !325, file: !66, line: 171, baseType: !255, size: 32, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !325, file: !66, line: 172, baseType: !76, size: 64, offset: 2752)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !325, file: !66, line: 173, baseType: !142, size: 32, offset: 2816)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !325, file: !66, line: 174, baseType: !332, size: 64, offset: 2880)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !325, file: !66, line: 174, baseType: !332, size: 64, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !325, file: !66, line: 175, baseType: !331, size: 32, offset: 3008)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !325, file: !66, line: 175, baseType: !331, size: 32, offset: 3040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !325, file: !66, line: 178, baseType: !331, size: 32, offset: 3072)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !325, file: !66, line: 178, baseType: !331, size: 32, offset: 3104)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !325, file: !66, line: 179, baseType: !301, size: 64, offset: 3136)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !325, file: !66, line: 179, baseType: !301, size: 64, offset: 3200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !325, file: !66, line: 180, baseType: !142, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !325, file: !66, line: 180, baseType: !142, size: 32, offset: 3296)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !325, file: !66, line: 181, baseType: !603, size: 256, offset: 3328)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 256, elements: !604)
!604 = !{!220, !220}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !325, file: !66, line: 182, baseType: !603, size: 256, offset: 3584)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !325, file: !66, line: 183, baseType: !607, size: 256, offset: 3840)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 256, elements: !604)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !325, file: !66, line: 185, baseType: !607, size: 256, offset: 4096)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !325, file: !66, line: 186, baseType: !607, size: 256, offset: 4352)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !325, file: !66, line: 187, baseType: !607, size: 256, offset: 4608)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !325, file: !66, line: 188, baseType: !612, size: 512, offset: 4864)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 512, elements: !617)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !99, line: 339, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !99, line: 339, flags: DIFlagFwdDecl)
!617 = !{!220, !220, !220}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !325, file: !66, line: 189, baseType: !612, size: 512, offset: 5376)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !325, file: !66, line: 190, baseType: !620, size: 256, offset: 5888)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !617)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !325, file: !66, line: 191, baseType: !620, size: 256, offset: 6144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !325, file: !66, line: 192, baseType: !613, size: 64, offset: 6400)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !66, line: 193, baseType: !322, size: 64, offset: 6464)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !325, file: !66, line: 195, baseType: !255, size: 32, offset: 6528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !288, file: !287, line: 7, baseType: !322, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "comms", scope: !288, file: !287, line: 8, baseType: !627, size: 128, offset: 1152)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !219)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !288, file: !287, line: 9, baseType: !301, size: 64, offset: 1280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rootdispls", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rootcounts", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "leafdispls", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1472)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "leafcounts", scope: !288, file: !287, line: 10, baseType: !293, size: 64, offset: 1536)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rootdegree", scope: !288, file: !287, line: 11, baseType: !142, size: 32, offset: 1600)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "leafdegree", scope: !288, file: !287, line: 11, baseType: !142, size: 32, offset: 1632)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Basic", file: !323, line: 41, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 26, size: 1152, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !637, file: !323, line: 27, baseType: !159, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !637, file: !323, line: 27, baseType: !159, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !637, file: !323, line: 27, baseType: !293, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !637, file: !323, line: 27, baseType: !142, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !637, file: !323, line: 27, baseType: !188, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !637, file: !323, line: 27, baseType: !188, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !637, file: !323, line: 27, baseType: !298, size: 128, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !637, file: !323, line: 27, baseType: !222, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !637, file: !323, line: 27, baseType: !301, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !637, file: !323, line: 27, baseType: !222, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !637, file: !323, line: 27, baseType: !304, size: 128, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !637, file: !323, line: 27, baseType: !304, size: 128, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !637, file: !323, line: 27, baseType: !301, size: 64, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !637, file: !323, line: 27, baseType: !142, size: 32, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !637, file: !323, line: 27, baseType: !322, size: 64, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !637, file: !323, line: 27, baseType: !322, size: 64, offset: 1088)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Info", file: !99, line: 337, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_info_t", file: !99, line: 337, flags: DIFlagFwdDecl)
!658 = !{i32 7, !"Dwarf Version", i32 4}
!659 = !{i32 2, !"Debug Info Version", i32 3}
!660 = !{i32 1, !"wchar_size", i32 4}
!661 = !{i32 7, !"PIC Level", i32 2}
!662 = !{i32 7, !"uwtable", i32 1}
!663 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!664 = distinct !DISubprogram(name: "PetscSFCreate_Neighbor", scope: !287, file: !287, line: 204, type: !351, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DILocalVariable(name: "sf", arg: 1, scope: !664, file: !287, line: 204, type: !338)
!667 = !DILocalVariable(name: "ierr", scope: !664, file: !287, line: 206, type: !96)
!668 = !DILocalVariable(name: "dat", scope: !664, file: !287, line: 207, type: !285)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !287, line: 224, type: !96)
!670 = distinct !DILexicalBlock(scope: !664, file: !287, line: 224, column: 31)
!671 = !DILocation(line: 0, scope: !664)
!672 = !DILocation(line: 207, column: 3, scope: !664)
!673 = !DILocation(line: 209, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !287, line: 209, column: 3)
!675 = distinct !DILexicalBlock(scope: !676, file: !287, line: 209, column: 3)
!676 = distinct !DILexicalBlock(scope: !664, file: !287, line: 209, column: 3)
!677 = !{!678, !678, i64 0}
!678 = !{!"any pointer", !679, i64 0}
!679 = !{!"omnipotent char", !680, i64 0}
!680 = !{!"Simple C/C++ TBAA"}
!681 = !DILocation(line: 209, column: 3, scope: !675)
!682 = !DILocation(line: 209, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !287, line: 209, column: 3)
!684 = distinct !DILexicalBlock(scope: !674, file: !287, line: 209, column: 3)
!685 = !{!686, !687, i64 1536}
!686 = !{!"", !679, i64 0, !679, i64 512, !679, i64 1024, !679, i64 1280, !687, i64 1536, !687, i64 1540, !679, i64 1544}
!687 = !{!"int", !679, i64 0}
!688 = !DILocation(line: 209, column: 3, scope: !684)
!689 = !DILocation(line: 209, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !683, file: !287, line: 209, column: 3)
!691 = !{!687, !687, i64 0}
!692 = !{!686, !687, i64 1540}
!693 = !DILocation(line: 210, column: 12, scope: !664)
!694 = !DILocation(line: 210, column: 33, scope: !664)
!695 = !{!696, !678, i64 136}
!696 = !{!"_PetscSFOps", !678, i64 0, !678, i64 8, !678, i64 16, !678, i64 24, !678, i64 32, !678, i64 40, !678, i64 48, !678, i64 56, !678, i64 64, !678, i64 72, !678, i64 80, !678, i64 88, !678, i64 96, !678, i64 104, !678, i64 112, !678, i64 120, !678, i64 128, !678, i64 136, !678, i64 144, !678, i64 152, !678, i64 160}
!697 = !DILocation(line: 211, column: 12, scope: !664)
!698 = !DILocation(line: 211, column: 33, scope: !664)
!699 = !{!696, !678, i64 56}
!700 = !DILocation(line: 212, column: 12, scope: !664)
!701 = !DILocation(line: 212, column: 33, scope: !664)
!702 = !{!696, !678, i64 72}
!703 = !DILocation(line: 213, column: 12, scope: !664)
!704 = !DILocation(line: 213, column: 33, scope: !664)
!705 = !{!696, !678, i64 112}
!706 = !DILocation(line: 214, column: 12, scope: !664)
!707 = !DILocation(line: 214, column: 33, scope: !664)
!708 = !{!696, !678, i64 32}
!709 = !DILocation(line: 216, column: 12, scope: !664)
!710 = !DILocation(line: 216, column: 33, scope: !664)
!711 = !{!696, !678, i64 16}
!712 = !DILocation(line: 217, column: 12, scope: !664)
!713 = !DILocation(line: 217, column: 33, scope: !664)
!714 = !{!696, !678, i64 0}
