; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/dmi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/dmi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 213, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39}
!31 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!77 = !{!78, !82, !83, !85, !287, !290, !169, !84, !120, !253, !5}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !79, line: 330, baseType: !80)
!79 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !79, line: 330, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !84)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !88, line: 73, size: 4480, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !92, !141, !142, !144, !147, !148, !149, !150, !158, !159, !160, !164, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !185, !186, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !202, !203, !206, !208, !209, !210, !220, !222, !223, !227, !228, !277, !282, !284, !285, !286}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !87, file: !88, line: 74, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !84)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !87, file: !88, line: 75, baseType: !93, size: 448, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 448, elements: !139)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !88, line: 53, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 45, size: 448, elements: !96)
!96 = !{!97, !103, !111, !116, !123, !127, !134}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !95, file: !88, line: 46, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !85, !102}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !84)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !95, file: !88, line: 47, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!101, !85, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !108, line: 16, baseType: !109)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !108, line: 16, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !95, file: !88, line: 48, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!101, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !95, file: !88, line: 49, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!101, !85, !120, !85}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !95, file: !88, line: 50, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!101, !85, !120, !115}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !95, file: !88, line: 51, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!101, !85, !120, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !95, file: !88, line: 52, baseType: !135, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!101, !85, !120, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!139 = !{!140}
!140 = !DISubrange(count: 1)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !87, file: !88, line: 76, baseType: !78, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 77, baseType: !143, size: 32, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !84)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !87, file: !88, line: 78, baseType: !145, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !146)
!146 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !88, line: 78, baseType: !145, size: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !87, file: !88, line: 78, baseType: !145, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !87, file: !88, line: 78, baseType: !145, size: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !88, line: 79, baseType: !151, size: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !154, line: 27, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !156, line: 43, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!157 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !87, file: !88, line: 80, baseType: !143, size: 32, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !88, line: 81, baseType: !83, size: 32, offset: 992)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !87, file: !88, line: 82, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !87, file: !88, line: 83, baseType: !165, size: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !88, line: 84, baseType: !169, size: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !87, file: !88, line: 85, baseType: !169, size: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !87, file: !88, line: 86, baseType: !169, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !87, file: !88, line: 87, baseType: !169, size: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !88, line: 88, baseType: !85, size: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !87, file: !88, line: 89, baseType: !151, size: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 90, baseType: !169, size: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 91, baseType: !169, size: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !87, file: !88, line: 92, baseType: !143, size: 32, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !87, file: !88, line: 93, baseType: !82, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !88, line: 94, baseType: !180, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !87, file: !88, line: 95, baseType: !143, size: 32, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !87, file: !88, line: 95, baseType: !143, size: 32, offset: 1888)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !87, file: !88, line: 96, baseType: !184, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !87, file: !88, line: 96, baseType: !184, size: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !87, file: !88, line: 97, baseType: !187, size: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !87, file: !88, line: 97, baseType: !189, size: 64, offset: 2112)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !87, file: !88, line: 98, baseType: !143, size: 32, offset: 2176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !87, file: !88, line: 98, baseType: !143, size: 32, offset: 2208)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !87, file: !88, line: 99, baseType: !184, size: 64, offset: 2240)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !87, file: !88, line: 99, baseType: !184, size: 64, offset: 2304)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !87, file: !88, line: 100, baseType: !195, size: 64, offset: 2368)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !146)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !87, file: !88, line: 100, baseType: !198, size: 64, offset: 2432)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !87, file: !88, line: 101, baseType: !143, size: 32, offset: 2496)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !87, file: !88, line: 101, baseType: !143, size: 32, offset: 2528)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !87, file: !88, line: 102, baseType: !184, size: 64, offset: 2560)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !87, file: !88, line: 102, baseType: !184, size: 64, offset: 2624)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !87, file: !88, line: 103, baseType: !204, size: 64, offset: 2688)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !196)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !87, file: !88, line: 103, baseType: !207, size: 64, offset: 2752)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !87, file: !88, line: 104, baseType: !138, size: 64, offset: 2816)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !87, file: !88, line: 105, baseType: !143, size: 32, offset: 2880)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !87, file: !88, line: 106, baseType: !211, size: 128, offset: 2944)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 128, elements: !218)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !88, line: 64, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 61, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !214, file: !88, line: 62, baseType: !131, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !214, file: !88, line: 63, baseType: !82, size: 64, offset: 64)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !87, file: !88, line: 107, baseType: !221, size: 64, offset: 3072)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !218)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !87, file: !88, line: 108, baseType: !82, size: 64, offset: 3136)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !87, file: !88, line: 109, baseType: !224, size: 64, offset: 3200)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!101, !82}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !87, file: !88, line: 111, baseType: !143, size: 32, offset: 3264)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !87, file: !88, line: 112, baseType: !229, size: 320, offset: 3328)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 320, elements: !275)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!101, !233, !85, !82}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !236)
!236 = !{!237, !238, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !235, file: !10, line: 100, baseType: !143, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !10, line: 101, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !250, !251, !252, !256, !258, !260, !261, !262}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !241, file: !10, line: 84, baseType: !169, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !241, file: !10, line: 85, baseType: !169, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !10, line: 86, baseType: !82, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !241, file: !10, line: 87, baseType: !161, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !241, file: !10, line: 88, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !241, file: !10, line: 89, baseType: !122, size: 8, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !241, file: !10, line: 90, baseType: !169, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !241, file: !10, line: 91, baseType: !253, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !254, line: 46, baseType: !255)
!254 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!255 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !241, file: !10, line: 92, baseType: !257, size: 32, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !10, line: 93, baseType: !259, size: 32, offset: 544)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !10, line: 94, baseType: !239, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !241, file: !10, line: 95, baseType: !169, size: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !241, file: !10, line: 96, baseType: !82, size: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !235, file: !10, line: 102, baseType: !169, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !235, file: !10, line: 102, baseType: !169, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !235, file: !10, line: 103, baseType: !169, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !235, file: !10, line: 104, baseType: !78, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !235, file: !10, line: 105, baseType: !257, size: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !235, file: !10, line: 105, baseType: !257, size: 32, offset: 416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !235, file: !10, line: 105, baseType: !257, size: 32, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !235, file: !10, line: 106, baseType: !85, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !235, file: !10, line: 107, baseType: !272, size: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!275 = !{!276}
!276 = !DISubrange(count: 5)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !87, file: !88, line: 113, baseType: !278, size: 320, offset: 3648)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 320, elements: !275)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!101, !85, !82}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !87, file: !88, line: 114, baseType: !283, size: 320, offset: 3968)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 320, elements: !275)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !87, file: !88, line: 115, baseType: !257, size: 32, offset: 4288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !88, line: 120, baseType: !272, size: 64, offset: 4352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !87, file: !88, line: 121, baseType: !257, size: 32, offset: 4416)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !79, line: 331, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !79, line: 331, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !79, line: 338, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !79, line: 338, flags: DIFlagFwdDecl)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{i32 7, !"PIC Level", i32 2}
!297 = !{i32 7, !"uwtable", i32 1}
!298 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!299 = distinct !DISubprogram(name: "DMCreateGlobalVector_Section_Private", scope: !300, file: !300, line: 4, type: !301, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1049)
!300 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/interface/dmi.c", directory: "/home/users/ndemeye/xSDK")
!301 = !DISubroutineType(types: !302)
!302 = !{!101, !303, !380}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !306)
!306 = !{!307, !309, !544, !548, !549, !550, !551, !561, !562, !570, !571, !579, !580, !581, !582, !586, !587, !591, !593, !595, !596, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !624, !636, !648, !660, !669, !670, !693, !694, !695, !696, !697, !698, !700, !791, !792, !812, !813, !814, !815, !816, !817, !821, !822, !826, !827, !828, !829, !830, !831, !832, !833, !834, !837, !849, !850, !851, !860, !948, !949, !1037, !1038, !1039, !1040, !1042, !1044, !1045, !1046, !1047, !1048}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !305, file: !47, line: 203, baseType: !308, size: 4480)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !88, line: 122, baseType: !87)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !305, file: !47, line: 203, baseType: !310, size: 3456, offset: 4480)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 3456, elements: !139)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !312)
!312 = !{!313, !317, !318, !323, !327, !331, !332, !333, !335, !336, !337, !349, !350, !358, !367, !376, !385, !389, !390, !395, !396, !400, !401, !405, !406, !414, !418, !423, !424, !425, !426, !427, !428, !429, !433, !439, !443, !448, !452, !463, !467, !472, !479, !483, !484, !490, !501, !505, !515, !519, !527, !531, !539, !540}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !311, file: !47, line: 31, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!101, !303, !107}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !311, file: !47, line: 32, baseType: !314, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !311, file: !47, line: 33, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!101, !303, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !311, file: !47, line: 34, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!101, !233, !303}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !311, file: !47, line: 35, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!101, !303}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !311, file: !47, line: 36, baseType: !328, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !311, file: !47, line: 37, baseType: !328, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !311, file: !47, line: 38, baseType: !334, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !311, file: !47, line: 39, baseType: !334, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !311, file: !47, line: 40, baseType: !328, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !311, file: !47, line: 41, baseType: !338, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!101, !303, !187, !341, !343}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !346, line: 11, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !346, line: 11, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !311, file: !47, line: 42, baseType: !319, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !311, file: !47, line: 43, baseType: !351, size: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!101, !303, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !311, file: !47, line: 45, baseType: !359, size: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!101, !303, !362, !363}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !346, line: 51, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !346, line: 51, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !311, file: !47, line: 46, baseType: !368, size: 64, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!101, !303, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !373, line: 16, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !373, line: 16, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !311, file: !47, line: 47, baseType: !377, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!101, !303, !303, !371, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !382, line: 21, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !382, line: 21, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !311, file: !47, line: 48, baseType: !386, size: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!101, !303, !303, !371}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !311, file: !47, line: 49, baseType: !386, size: 64, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !311, file: !47, line: 50, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!101, !303, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !311, file: !47, line: 51, baseType: !386, size: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !311, file: !47, line: 53, baseType: !397, size: 64, offset: 1280)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!101, !303, !78, !322}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !311, file: !47, line: 54, baseType: !397, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !311, file: !47, line: 55, baseType: !402, size: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!101, !303, !143, !322}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !311, file: !47, line: 56, baseType: !402, size: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !311, file: !47, line: 57, baseType: !407, size: 64, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!101, !303, !410, !322}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !411, line: 12, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !411, line: 12, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !311, file: !47, line: 58, baseType: !415, size: 64, offset: 1600)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!101, !303, !381, !410, !322}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !311, file: !47, line: 60, baseType: !419, size: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!101, !303, !381, !422, !381}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !311, file: !47, line: 61, baseType: !419, size: 64, offset: 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !311, file: !47, line: 62, baseType: !419, size: 64, offset: 1792)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !311, file: !47, line: 63, baseType: !419, size: 64, offset: 1856)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !311, file: !47, line: 64, baseType: !419, size: 64, offset: 1920)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !311, file: !47, line: 65, baseType: !419, size: 64, offset: 1984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !311, file: !47, line: 67, baseType: !328, size: 64, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !311, file: !47, line: 69, baseType: !430, size: 64, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!101, !303, !381, !381}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !311, file: !47, line: 71, baseType: !434, size: 64, offset: 2176)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!101, !303, !143, !437, !344, !322}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !311, file: !47, line: 72, baseType: !440, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!101, !322, !143, !343, !322}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !311, file: !47, line: 73, baseType: !444, size: 64, offset: 2304)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!101, !303, !187, !341, !343, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !311, file: !47, line: 74, baseType: !449, size: 64, offset: 2368)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!101, !303, !187, !341, !343, !343, !447}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !311, file: !47, line: 75, baseType: !453, size: 64, offset: 2432)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!101, !303, !143, !322, !456, !456, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !459, line: 59, baseType: !460)
!459 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !459, line: 15, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !459, line: 15, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !311, file: !47, line: 77, baseType: !464, size: 64, offset: 2496)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!101, !303, !143, !187, !187}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !311, file: !47, line: 78, baseType: !468, size: 64, offset: 2560)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!101, !303, !381, !471, !460}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !311, file: !47, line: 79, baseType: !473, size: 64, offset: 2624)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!101, !303, !187, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !311, file: !47, line: 80, baseType: !480, size: 64, offset: 2688)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!101, !303, !195, !195}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !311, file: !47, line: 81, baseType: !480, size: 64, offset: 2752)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !311, file: !47, line: 82, baseType: !485, size: 64, offset: 2816)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!101, !303, !381, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !311, file: !47, line: 84, baseType: !491, size: 64, offset: 2880)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!101, !303, !196, !494, !500, !422, !381}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!101, !143, !196, !498, !143, !204, !82}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !311, file: !47, line: 85, baseType: !502, size: 64, offset: 2944)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!101, !303, !196, !410, !143, !437, !143, !437, !494, !500, !422, !381}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !311, file: !47, line: 86, baseType: !506, size: 64, offset: 3008)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!101, !303, !196, !381, !509, !422, !381}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !143, !143, !143, !437, !437, !513, !513, !513, !437, !437, !513, !513, !513, !196, !498, !143, !513, !204}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !311, file: !47, line: 87, baseType: !516, size: 64, offset: 3072)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!101, !303, !196, !410, !143, !437, !143, !437, !381, !509, !422, !381}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !311, file: !47, line: 88, baseType: !520, size: 64, offset: 3136)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!101, !303, !196, !410, !143, !437, !143, !437, !381, !523, !422, !381}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !143, !143, !143, !437, !437, !513, !513, !513, !437, !437, !513, !513, !513, !196, !498, !498, !143, !513, !204}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !311, file: !47, line: 89, baseType: !528, size: 64, offset: 3200)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!101, !303, !196, !494, !500, !381, !195}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !311, file: !47, line: 90, baseType: !532, size: 64, offset: 3264)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!101, !303, !196, !535, !500, !381, !498, !195}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!101, !143, !196, !498, !498, !143, !204, !82}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !311, file: !47, line: 91, baseType: !528, size: 64, offset: 3328)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !311, file: !47, line: 93, baseType: !541, size: 64, offset: 3392)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!101, !303, !303, !394, !394}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !305, file: !47, line: 204, baseType: !545, size: 6400, offset: 7936)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 6400, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 100)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !305, file: !47, line: 204, baseType: !545, size: 6400, offset: 14336)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !305, file: !47, line: 205, baseType: !545, size: 6400, offset: 20736)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !305, file: !47, line: 205, baseType: !545, size: 6400, offset: 27136)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !305, file: !47, line: 206, baseType: !552, size: 64, offset: 33536)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !555)
!555 = !{!556, !557, !558, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !554, file: !47, line: 143, baseType: !381, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !47, line: 144, baseType: !169, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !554, file: !47, line: 145, baseType: !559, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !47, line: 146, baseType: !552, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !305, file: !47, line: 207, baseType: !552, size: 64, offset: 33600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !305, file: !47, line: 208, baseType: !563, size: 64, offset: 33664)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !565, file: !47, line: 151, baseType: !253, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !565, file: !47, line: 152, baseType: !82, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !47, line: 153, baseType: !563, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !305, file: !47, line: 208, baseType: !563, size: 64, offset: 33728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !305, file: !47, line: 209, baseType: !572, size: 64, offset: 33792)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !574, file: !47, line: 159, baseType: !410, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !574, file: !47, line: 160, baseType: !257, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !47, line: 161, baseType: !573, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !305, file: !47, line: 210, baseType: !410, size: 64, offset: 33856)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !305, file: !47, line: 211, baseType: !410, size: 64, offset: 33920)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !305, file: !47, line: 212, baseType: !82, size: 64, offset: 33984)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !305, file: !47, line: 213, baseType: !583, size: 64, offset: 34048)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!101, !500}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !305, file: !47, line: 214, baseType: !362, size: 32, offset: 34112)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !305, file: !47, line: 215, baseType: !588, size: 64, offset: 34176)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !373, line: 1378, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !373, line: 1378, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !305, file: !47, line: 216, baseType: !592, size: 64, offset: 34240)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !382, line: 83, baseType: !120)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !305, file: !47, line: 217, baseType: !594, size: 64, offset: 34304)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !373, line: 25, baseType: !120)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !305, file: !47, line: 218, baseType: !143, size: 32, offset: 34368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !305, file: !47, line: 219, baseType: !597, size: 64, offset: 34432)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !346, line: 30, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !346, line: 30, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !305, file: !47, line: 220, baseType: !257, size: 32, offset: 34496)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !305, file: !47, line: 221, baseType: !257, size: 32, offset: 34528)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !305, file: !47, line: 222, baseType: !143, size: 32, offset: 34560)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !305, file: !47, line: 222, baseType: !143, size: 32, offset: 34592)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !305, file: !47, line: 223, baseType: !257, size: 32, offset: 34624)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !305, file: !47, line: 224, baseType: !257, size: 32, offset: 34656)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !47, line: 225, baseType: !82, size: 64, offset: 34688)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !305, file: !47, line: 227, baseType: !303, size: 64, offset: 34752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !305, file: !47, line: 228, baseType: !303, size: 64, offset: 34816)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !305, file: !47, line: 229, baseType: !610, size: 64, offset: 34880)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !613)
!613 = !{!614, !618, !622, !623}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !612, file: !47, line: 102, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!101, !303, !303, !82}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !612, file: !47, line: 103, baseType: !619, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!101, !303, !372, !381, !372, !303, !82}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !612, file: !47, line: 104, baseType: !82, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !47, line: 105, baseType: !610, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !305, file: !47, line: 230, baseType: !625, size: 64, offset: 34944)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !628)
!628 = !{!629, !630, !634, !635}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !627, file: !47, line: 110, baseType: !615, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !627, file: !47, line: 111, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!101, !303, !372, !303, !82}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !627, file: !47, line: 112, baseType: !82, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !47, line: 113, baseType: !625, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !305, file: !47, line: 231, baseType: !637, size: 64, offset: 35008)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !640)
!640 = !{!641, !642, !646, !647}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !639, file: !47, line: 118, baseType: !615, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !639, file: !47, line: 119, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!101, !303, !458, !458, !303, !82}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !639, file: !47, line: 120, baseType: !82, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !639, file: !47, line: 121, baseType: !637, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !305, file: !47, line: 232, baseType: !649, size: 64, offset: 35072)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !652)
!652 = !{!653, !657, !658, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !651, file: !47, line: 126, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!101, !303, !381, !422, !381, !82}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !651, file: !47, line: 127, baseType: !654, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !651, file: !47, line: 128, baseType: !82, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !651, file: !47, line: 129, baseType: !649, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !305, file: !47, line: 233, baseType: !661, size: 64, offset: 35136)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !664)
!664 = !{!665, !666, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !663, file: !47, line: 134, baseType: !654, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !663, file: !47, line: 135, baseType: !654, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !663, file: !47, line: 136, baseType: !82, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !663, file: !47, line: 137, baseType: !661, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !305, file: !47, line: 235, baseType: !143, size: 32, offset: 35200)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !305, file: !47, line: 237, baseType: !671, size: 64, offset: 35264)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !675)
!675 = !{!676, !680, !681, !682, !683, !685, !692}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !674, file: !47, line: 27, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !678, line: 166, baseType: !679)
!678 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !678, line: 139, baseType: !5)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !674, file: !47, line: 27, baseType: !677, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !674, file: !47, line: 27, baseType: !677, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !674, file: !47, line: 27, baseType: !677, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !47, line: 27, baseType: !684, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !674, file: !47, line: 27, baseType: !686, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !688, file: !47, line: 19, baseType: !410, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !688, file: !47, line: 20, baseType: !143, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !674, file: !47, line: 27, baseType: !380, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !305, file: !47, line: 239, baseType: !460, size: 64, offset: 35328)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !305, file: !47, line: 240, baseType: !460, size: 64, offset: 35392)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !305, file: !47, line: 241, baseType: !460, size: 64, offset: 35456)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !305, file: !47, line: 242, baseType: !460, size: 64, offset: 35520)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !305, file: !47, line: 243, baseType: !257, size: 32, offset: 35584)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !305, file: !47, line: 245, baseType: !699, size: 64, offset: 35616)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 64, elements: !218)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !305, file: !47, line: 246, baseType: !701, size: 64, offset: 35712)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !702, line: 18, baseType: !703)
!702 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !705, line: 29, size: 5760, elements: !706)
!705 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!706 = !{!707, !708, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !726, !727, !728, !729, !754, !755, !756}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !704, file: !705, line: 30, baseType: !308, size: 4480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !704, file: !705, line: 30, baseType: !709, size: 32, offset: 4480)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !139)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !704, file: !705, line: 31, baseType: !143, size: 32, offset: 4512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !704, file: !705, line: 31, baseType: !143, size: 32, offset: 4544)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !704, file: !705, line: 32, baseType: !345, size: 64, offset: 4608)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !704, file: !705, line: 33, baseType: !257, size: 32, offset: 4672)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !704, file: !705, line: 34, baseType: !257, size: 32, offset: 4704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !704, file: !705, line: 35, baseType: !187, size: 64, offset: 4736)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !704, file: !705, line: 36, baseType: !187, size: 64, offset: 4800)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !704, file: !705, line: 37, baseType: !143, size: 32, offset: 4864)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !704, file: !705, line: 38, baseType: !701, size: 64, offset: 4928)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !704, file: !705, line: 39, baseType: !187, size: 64, offset: 4992)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !704, file: !705, line: 40, baseType: !257, size: 32, offset: 5056)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !704, file: !705, line: 42, baseType: !143, size: 32, offset: 5088)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !704, file: !705, line: 43, baseType: !342, size: 64, offset: 5120)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !704, file: !705, line: 44, baseType: !187, size: 64, offset: 5184)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !704, file: !705, line: 45, baseType: !725, size: 64, offset: 5248)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !704, file: !705, line: 46, baseType: !257, size: 32, offset: 5312)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !704, file: !705, line: 47, baseType: !341, size: 64, offset: 5376)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !704, file: !705, line: 49, baseType: !85, size: 64, offset: 5440)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !704, file: !705, line: 50, baseType: !730, size: 64, offset: 5504)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !705, line: 27, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !705, line: 27, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !705, line: 27, size: 320, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !747}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !733, file: !705, line: 27, baseType: !677, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !733, file: !705, line: 27, baseType: !677, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !733, file: !705, line: 27, baseType: !677, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !733, file: !705, line: 27, baseType: !677, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !705, line: 27, baseType: !684, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !733, file: !705, line: 27, baseType: !741, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !705, line: 10, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !705, line: 8, size: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !743, file: !705, line: 9, baseType: !143, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !705, line: 9, baseType: !143, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !733, file: !705, line: 27, baseType: !748, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !705, line: 14, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 12, size: 128, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !750, file: !705, line: 13, baseType: !187, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !750, file: !705, line: 13, baseType: !187, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !704, file: !705, line: 51, baseType: !701, size: 64, offset: 5568)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !704, file: !705, line: 52, baseType: !345, size: 64, offset: 5632)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !704, file: !705, line: 53, baseType: !757, size: 64, offset: 5696)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !702, line: 33, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !705, line: 72, size: 4864, elements: !760)
!760 = !{!761, !762, !780, !781, !790}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !759, file: !705, line: 73, baseType: !308, size: 4480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !759, file: !705, line: 73, baseType: !763, size: 192, offset: 4480)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 192, elements: !139)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !705, line: 56, size: 192, elements: !765)
!765 = !{!766, !772, !776}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !764, file: !705, line: 57, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!101, !757, !701, !143, !437, !770, !771}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !764, file: !705, line: 58, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!101, !757}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !764, file: !705, line: 59, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!101, !757, !107}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !705, line: 74, baseType: !82, size: 64, offset: 4672)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !759, file: !705, line: 75, baseType: !782, size: 64, offset: 4736)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !705, line: 62, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !705, line: 64, size: 256, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !705, line: 66, baseType: !782, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !784, file: !705, line: 67, baseType: !770, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !784, file: !705, line: 68, baseType: !771, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !784, file: !705, line: 69, baseType: !143, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !759, file: !705, line: 76, baseType: !782, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !305, file: !47, line: 247, baseType: !701, size: 64, offset: 35776)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !305, file: !47, line: 248, baseType: !793, size: 64, offset: 35840)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !346, line: 60, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !795, file: !25, line: 241, baseType: !78, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !795, file: !25, line: 242, baseType: !83, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !795, file: !25, line: 243, baseType: !143, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !795, file: !25, line: 243, baseType: !143, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !795, file: !25, line: 244, baseType: !143, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !795, file: !25, line: 244, baseType: !143, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !795, file: !25, line: 245, baseType: !187, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !795, file: !25, line: 246, baseType: !257, size: 32, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !795, file: !25, line: 247, baseType: !143, size: 32, offset: 352)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !795, file: !25, line: 251, baseType: !143, size: 32, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !795, file: !25, line: 252, baseType: !597, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !795, file: !25, line: 253, baseType: !257, size: 32, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !795, file: !25, line: 254, baseType: !143, size: 32, offset: 544)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !795, file: !25, line: 254, baseType: !143, size: 32, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !795, file: !25, line: 255, baseType: !143, size: 32, offset: 608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !305, file: !47, line: 250, baseType: !701, size: 64, offset: 35904)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !305, file: !47, line: 251, baseType: !372, size: 64, offset: 35968)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !305, file: !47, line: 253, baseType: !303, size: 64, offset: 36032)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !305, file: !47, line: 254, baseType: !381, size: 64, offset: 36096)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !305, file: !47, line: 255, baseType: !82, size: 64, offset: 36160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !305, file: !47, line: 256, baseType: !818, size: 64, offset: 36224)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!101, !303, !82}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !305, file: !47, line: 257, baseType: !818, size: 64, offset: 36288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !305, file: !47, line: 258, baseType: !823, size: 64, offset: 36352)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!101, !303, !498, !257, !771, !82}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !305, file: !47, line: 260, baseType: !143, size: 32, offset: 36416)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !305, file: !47, line: 261, baseType: !303, size: 64, offset: 36480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !305, file: !47, line: 262, baseType: !381, size: 64, offset: 36544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !305, file: !47, line: 263, baseType: !381, size: 64, offset: 36608)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !305, file: !47, line: 264, baseType: !257, size: 32, offset: 36672)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !305, file: !47, line: 265, baseType: !355, size: 64, offset: 36736)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !305, file: !47, line: 266, baseType: !195, size: 64, offset: 36800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !305, file: !47, line: 266, baseType: !195, size: 64, offset: 36864)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !305, file: !47, line: 267, baseType: !835, size: 64, offset: 36928)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !305, file: !47, line: 269, baseType: !838, size: 640, offset: 36992)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 640, elements: !847)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!101, !303, !143, !143, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !373, line: 1723, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !373, line: 1723, flags: DIFlagFwdDecl)
!847 = !{!848}
!848 = !DISubrange(count: 10)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !305, file: !47, line: 270, baseType: !838, size: 640, offset: 37632)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !305, file: !47, line: 272, baseType: !143, size: 32, offset: 38272)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !305, file: !47, line: 273, baseType: !852, size: 64, offset: 38336)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !854, file: !47, line: 174, baseType: !85, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !854, file: !47, line: 175, baseType: !410, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !854, file: !47, line: 176, baseType: !699, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !854, file: !47, line: 177, baseType: !257, size: 32, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !305, file: !47, line: 274, baseType: !861, size: 64, offset: 38400)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !864)
!864 = !{!865, !946, !947}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !863, file: !47, line: 168, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !867, line: 11, baseType: !868)
!867 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !867, line: 13, size: 832, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !937, !939, !940, !941, !942, !943, !944, !945}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !867, line: 14, baseType: !120, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !869, file: !867, line: 15, baseType: !410, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !869, file: !867, line: 16, baseType: !120, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !869, file: !867, line: 17, baseType: !143, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !869, file: !867, line: 18, baseType: !187, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !869, file: !867, line: 19, baseType: !877, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !878, line: 22, baseType: !879)
!878 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !867, line: 81, size: 4992, elements: !881)
!881 = !{!882, !883, !897, !898, !899, !908}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !880, file: !867, line: 82, baseType: !308, size: 4480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !880, file: !867, line: 82, baseType: !884, size: 256, offset: 4480)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 256, elements: !139)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !867, line: 74, size: 256, elements: !886)
!886 = !{!887, !891, !892, !896}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !885, file: !867, line: 75, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!101, !877}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !885, file: !867, line: 76, baseType: !888, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !885, file: !867, line: 77, baseType: !893, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!101, !877, !107}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !885, file: !867, line: 78, baseType: !888, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !880, file: !867, line: 83, baseType: !82, size: 64, offset: 4736)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !880, file: !867, line: 85, baseType: !143, size: 32, offset: 4800)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !880, file: !867, line: 86, baseType: !900, size: 64, offset: 4864)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !867, line: 41, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !867, line: 36, size: 256, elements: !903)
!903 = !{!904, !905, !906, !907}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !902, file: !867, line: 37, baseType: !253, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !902, file: !867, line: 38, baseType: !253, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !902, file: !867, line: 39, baseType: !253, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !902, file: !867, line: 40, baseType: !169, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !880, file: !867, line: 87, baseType: !909, size: 64, offset: 4928)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !867, line: 54, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !867, line: 54, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !867, line: 54, size: 320, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !929}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !913, file: !867, line: 54, baseType: !677, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !867, line: 54, baseType: !677, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !913, file: !867, line: 54, baseType: !677, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !913, file: !867, line: 54, baseType: !677, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !913, file: !867, line: 54, baseType: !684, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !913, file: !867, line: 54, baseType: !921, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !878, line: 41, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !878, line: 35, size: 192, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !923, file: !878, line: 37, baseType: !410, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !923, file: !878, line: 38, baseType: !143, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !923, file: !878, line: 39, baseType: !143, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !923, file: !878, line: 40, baseType: !143, size: 32, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !913, file: !867, line: 54, baseType: !930, size: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !867, line: 34, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !867, line: 30, size: 96, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !932, file: !867, line: 31, baseType: !143, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !932, file: !867, line: 32, baseType: !143, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !932, file: !867, line: 33, baseType: !143, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !869, file: !867, line: 20, baseType: !938, size: 32, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !869, file: !867, line: 21, baseType: !143, size: 32, offset: 416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !869, file: !867, line: 22, baseType: !143, size: 32, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !869, file: !867, line: 23, baseType: !187, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !869, file: !867, line: 24, baseType: !131, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !869, file: !867, line: 25, baseType: !131, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !869, file: !867, line: 26, baseType: !82, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !869, file: !867, line: 27, baseType: !866, size: 64, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !863, file: !47, line: 169, baseType: !410, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !47, line: 170, baseType: !861, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !305, file: !47, line: 275, baseType: !143, size: 32, offset: 38464)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !305, file: !47, line: 276, baseType: !950, size: 64, offset: 38528)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !953)
!953 = !{!954, !1035, !1036}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !952, file: !47, line: 181, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !878, line: 13, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !867, line: 98, size: 7232, elements: !958)
!958 = !{!959, !960, !974, !975, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !991, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !957, file: !867, line: 99, baseType: !308, size: 4480)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !957, file: !867, line: 99, baseType: !961, size: 256, offset: 4480)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 256, elements: !139)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !867, line: 91, size: 256, elements: !963)
!963 = !{!964, !968, !969, !973}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !962, file: !867, line: 92, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!101, !955}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !962, file: !867, line: 93, baseType: !965, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !962, file: !867, line: 94, baseType: !970, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!101, !955, !107}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !962, file: !867, line: 95, baseType: !965, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !957, file: !867, line: 100, baseType: !82, size: 64, offset: 4736)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !957, file: !867, line: 101, baseType: !976, size: 64, offset: 4800)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !957, file: !867, line: 102, baseType: !257, size: 32, offset: 4864)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !957, file: !867, line: 103, baseType: !257, size: 32, offset: 4896)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !957, file: !867, line: 104, baseType: !143, size: 32, offset: 4928)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !957, file: !867, line: 105, baseType: !143, size: 32, offset: 4960)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !957, file: !867, line: 106, baseType: !115, size: 64, offset: 4992)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !957, file: !867, line: 108, baseType: !866, size: 64, offset: 5056)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !957, file: !867, line: 109, baseType: !257, size: 32, offset: 5120)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !957, file: !867, line: 110, baseType: !394, size: 64, offset: 5184)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !957, file: !867, line: 111, baseType: !187, size: 64, offset: 5248)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !957, file: !867, line: 112, baseType: !877, size: 64, offset: 5312)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !957, file: !867, line: 113, baseType: !988, size: 64, offset: 5376)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !990, line: 563, baseType: !510)
!990 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!991 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !957, file: !867, line: 114, baseType: !992, size: 64, offset: 5440)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !990, line: 580, baseType: !495)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !957, file: !867, line: 115, baseType: !500, size: 64, offset: 5504)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !957, file: !867, line: 116, baseType: !992, size: 64, offset: 5568)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !957, file: !867, line: 117, baseType: !500, size: 64, offset: 5632)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !957, file: !867, line: 118, baseType: !143, size: 32, offset: 5696)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !957, file: !867, line: 119, baseType: !204, size: 64, offset: 5760)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !957, file: !867, line: 120, baseType: !500, size: 64, offset: 5824)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !957, file: !867, line: 122, baseType: !143, size: 32, offset: 5888)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !957, file: !867, line: 123, baseType: !143, size: 32, offset: 5920)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !957, file: !867, line: 124, baseType: !187, size: 64, offset: 5952)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !957, file: !867, line: 125, baseType: !187, size: 64, offset: 6016)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !957, file: !867, line: 126, baseType: !187, size: 64, offset: 6080)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !957, file: !867, line: 127, baseType: !187, size: 64, offset: 6144)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !957, file: !867, line: 128, baseType: !1007, size: 64, offset: 6208)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1009, line: 481, baseType: !1010)
!1009 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1009, line: 469, size: 256, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1011, file: !1009, line: 470, baseType: !143, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1011, file: !1009, line: 471, baseType: !143, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1011, file: !1009, line: 472, baseType: !143, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1011, file: !1009, line: 473, baseType: !143, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1011, file: !1009, line: 474, baseType: !143, size: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !1011, file: !1009, line: 475, baseType: !143, size: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !1011, file: !1009, line: 476, baseType: !198, size: 64, offset: 192)
