; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/utils/ftn-custom/zdmsnesf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/utils/ftn-custom/zdmsnesf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_DM = type opaque
%struct._p_Vec = type opaque
%struct._p_Mat = type opaque
%struct._p_DMSNES = type { %struct._p_PetscObject, [1 x %struct._DMSNESOps], i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._p_DM* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 238, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!30 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!31 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!32 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!33 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!34 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!35 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!36 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!37 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!38 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!39 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!40 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!41 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!42 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!43 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!44 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!45 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!46 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 85, baseType: !28, size: 32, elements: !49)
!48 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!51 = !DIEnumerator(name: "PC_LEFT", value: 0)
!52 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!53 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 285, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 406, baseType: !28, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!64 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!65 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!67 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!68 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 493, baseType: !28, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!72 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!73 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 55, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 663, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!86 = !{!87, !294, !185, !104, !296, !125}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !75, line: 73, size: 4480, elements: !90)
!90 = !{!91, !93, !146, !147, !149, !152, !153, !154, !155, !163, !164, !166, !170, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !188, !189, !190, !192, !193, !195, !197, !198, !199, !200, !201, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !227, !229, !230, !234, !235, !284, !289, !291, !292, !293}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !89, file: !75, line: 74, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !89, file: !75, line: 75, baseType: !94, size: 448, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 448, elements: !144)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !75, line: 53, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 45, size: 448, elements: !97)
!97 = !{!98, !108, !116, !121, !128, !132, !139}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !96, file: !75, line: 46, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !87, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !105, line: 330, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !105, line: 330, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !96, file: !75, line: 47, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!102, !87, !112}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !113, line: 16, baseType: !114)
!113 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !113, line: 16, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !75, line: 48, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!102, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !96, file: !75, line: 49, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!102, !87, !125, !87}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !96, file: !75, line: 50, baseType: !129, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!102, !87, !125, !120}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !96, file: !75, line: 51, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!102, !87, !125, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !96, file: !75, line: 52, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!102, !87, !125, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!144 = !{!145}
!145 = !DISubrange(count: 1)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !89, file: !75, line: 76, baseType: !104, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !75, line: 77, baseType: !148, size: 32, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !89, file: !75, line: 78, baseType: !150, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !151)
!151 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !89, file: !75, line: 78, baseType: !150, size: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !89, file: !75, line: 78, baseType: !150, size: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !89, file: !75, line: 78, baseType: !150, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !89, file: !75, line: 79, baseType: !156, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !159, line: 27, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !161, line: 43, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!162 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !89, file: !75, line: 80, baseType: !148, size: 32, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !89, file: !75, line: 81, baseType: !165, size: 32, offset: 992)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !89, file: !75, line: 82, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !89, file: !75, line: 83, baseType: !171, size: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !89, file: !75, line: 84, baseType: !175, size: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !89, file: !75, line: 85, baseType: !175, size: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !89, file: !75, line: 86, baseType: !175, size: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !89, file: !75, line: 87, baseType: !175, size: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !89, file: !75, line: 88, baseType: !87, size: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !89, file: !75, line: 89, baseType: !156, size: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !75, line: 90, baseType: !175, size: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !89, file: !75, line: 91, baseType: !175, size: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !89, file: !75, line: 92, baseType: !148, size: 32, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !89, file: !75, line: 93, baseType: !185, size: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !89, file: !75, line: 94, baseType: !187, size: 64, offset: 1792)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !157)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !89, file: !75, line: 95, baseType: !148, size: 32, offset: 1856)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !89, file: !75, line: 95, baseType: !148, size: 32, offset: 1888)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !89, file: !75, line: 96, baseType: !191, size: 64, offset: 1920)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !89, file: !75, line: 96, baseType: !191, size: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !89, file: !75, line: 97, baseType: !194, size: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !89, file: !75, line: 97, baseType: !196, size: 64, offset: 2112)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !89, file: !75, line: 98, baseType: !148, size: 32, offset: 2176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !89, file: !75, line: 98, baseType: !148, size: 32, offset: 2208)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !89, file: !75, line: 99, baseType: !191, size: 64, offset: 2240)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !89, file: !75, line: 99, baseType: !191, size: 64, offset: 2304)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !89, file: !75, line: 100, baseType: !202, size: 64, offset: 2368)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !151)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !89, file: !75, line: 100, baseType: !205, size: 64, offset: 2432)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !89, file: !75, line: 101, baseType: !148, size: 32, offset: 2496)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !89, file: !75, line: 101, baseType: !148, size: 32, offset: 2528)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !89, file: !75, line: 102, baseType: !191, size: 64, offset: 2560)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !89, file: !75, line: 102, baseType: !191, size: 64, offset: 2624)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !89, file: !75, line: 103, baseType: !211, size: 64, offset: 2688)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !203)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !89, file: !75, line: 103, baseType: !214, size: 64, offset: 2752)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !89, file: !75, line: 104, baseType: !143, size: 64, offset: 2816)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !89, file: !75, line: 105, baseType: !148, size: 32, offset: 2880)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !89, file: !75, line: 106, baseType: !218, size: 128, offset: 2944)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !225)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !75, line: 64, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 61, size: 128, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !221, file: !75, line: 62, baseType: !136, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !221, file: !75, line: 63, baseType: !185, size: 64, offset: 64)
!225 = !{!226}
!226 = !DISubrange(count: 2)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !89, file: !75, line: 107, baseType: !228, size: 64, offset: 3072)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !225)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !89, file: !75, line: 108, baseType: !185, size: 64, offset: 3136)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !89, file: !75, line: 109, baseType: !231, size: 64, offset: 3200)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!102, !185}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !89, file: !75, line: 111, baseType: !148, size: 32, offset: 3264)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !89, file: !75, line: 112, baseType: !236, size: 320, offset: 3328)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 320, elements: !282)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!102, !240, !87, !185}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !243)
!243 = !{!244, !245, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !242, file: !12, line: 100, baseType: !148, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !12, line: 101, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !257, !258, !259, !263, !265, !267, !268, !269}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !248, file: !12, line: 84, baseType: !175, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !248, file: !12, line: 85, baseType: !175, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !12, line: 86, baseType: !185, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !248, file: !12, line: 87, baseType: !167, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !248, file: !12, line: 88, baseType: !255, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !248, file: !12, line: 89, baseType: !127, size: 8, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !248, file: !12, line: 90, baseType: !175, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !248, file: !12, line: 91, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !261, line: 46, baseType: !262)
!261 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!262 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !248, file: !12, line: 92, baseType: !264, size: 32, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !12, line: 93, baseType: !266, size: 32, offset: 544)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !12, line: 94, baseType: !246, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !248, file: !12, line: 95, baseType: !175, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !248, file: !12, line: 96, baseType: !185, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !242, file: !12, line: 102, baseType: !175, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !242, file: !12, line: 102, baseType: !175, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !242, file: !12, line: 103, baseType: !175, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !242, file: !12, line: 104, baseType: !104, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !242, file: !12, line: 105, baseType: !264, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !242, file: !12, line: 105, baseType: !264, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !242, file: !12, line: 105, baseType: !264, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !242, file: !12, line: 106, baseType: !87, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !242, file: !12, line: 107, baseType: !279, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!282 = !{!283}
!283 = !DISubrange(count: 5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !89, file: !75, line: 113, baseType: !285, size: 320, offset: 3648)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !282)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!102, !87, !185}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !89, file: !75, line: 114, baseType: !290, size: 320, offset: 3968)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 320, elements: !282)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !89, file: !75, line: 115, baseType: !264, size: 32, offset: 4288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !89, file: !75, line: 120, baseType: !279, size: 64, offset: 4352)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !89, file: !75, line: 121, baseType: !264, size: 32, offset: 4416)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !295, line: 1451, baseType: !136)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!297 = !{!0}
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/utils/ftn-custom/zdmsnesf.c", directory: "/home/users/ndemeye/xSDK")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 11, size: 64, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !299, file: !298, line: 12, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !75, line: 56, baseType: !28)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !299, file: !298, line: 13, baseType: !302, size: 32, offset: 32)
!304 = !{i32 7, !"Dwarf Version", i32 4}
!305 = !{i32 2, !"Debug Info Version", i32 3}
!306 = !{i32 1, !"wchar_size", i32 4}
!307 = !{i32 7, !"PIC Level", i32 2}
!308 = !{i32 7, !"uwtable", i32 1}
!309 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!310 = distinct !DISubprogram(name: "dmsnessetjacobian_", scope: !298, file: !298, line: 31, type: !311, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !331)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313, !318, !185, !330}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !315, line: 14, baseType: !316)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !315, line: 14, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !313, !321, !326, !326, !185, !330}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !323, line: 21, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !323, line: 21, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!331 = !{!332, !333, !334, !335, !336}
!332 = !DILocalVariable(name: "dm", arg: 1, scope: !310, file: !298, line: 31, type: !313)
!333 = !DILocalVariable(name: "jac", arg: 2, scope: !310, file: !298, line: 31, type: !318)
!334 = !DILocalVariable(name: "ctx", arg: 3, scope: !310, file: !298, line: 31, type: !185)
!335 = !DILocalVariable(name: "ierr", arg: 4, scope: !310, file: !298, line: 31, type: !330)
!336 = !DILocalVariable(name: "sdm", scope: !310, file: !298, line: 33, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSNES", file: !338, line: 176, baseType: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSNES", file: !338, line: 197, size: 5568, elements: !341)
!341 = !{!342, !344, !542, !543, !544, !545, !546, !547, !548, !549}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !340, file: !338, line: 198, baseType: !343, size: 4480)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !75, line: 122, baseType: !89)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !340, file: !338, line: 198, baseType: !345, size: 576, offset: 4480)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 576, elements: !144)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSNESOps", file: !338, line: 178, size: 576, elements: !347)
!347 = !{!348, !525, !526, !527, !531, !532, !533, !534, !538}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "computefunction", scope: !346, file: !338, line: 179, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!102, !352, !322, !322, !185}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !338, line: 38, size: 11648, elements: !355)
!355 = !{!356, !357, !414, !415, !416, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !433, !437, !438, !440, !441, !442, !443, !444, !449, !451, !452, !453, !454, !455, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !354, file: !338, line: 39, baseType: !343, size: 4480)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !354, file: !338, line: 39, baseType: !358, size: 1088, offset: 4480)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 1088, elements: !144)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !338, line: 12, size: 1088, elements: !360)
!360 = !{!361, !365, !369, !373, !379, !380, !384, !385, !389, !393, !394, !395, !400, !404, !408, !409, !413}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !359, file: !338, line: 13, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!102, !352, !322, !185}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !359, file: !338, line: 14, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!102, !322, !322, !185}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !359, file: !338, line: 15, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!102, !352, !148}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !359, file: !338, line: 16, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!102, !352, !148, !203, !203, !203, !377, !185}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !359, file: !338, line: 17, baseType: !231, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !359, file: !338, line: 18, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!102, !352}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !359, file: !338, line: 19, baseType: !381, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !359, file: !338, line: 20, baseType: !386, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!102, !352, !112}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !359, file: !338, line: 21, baseType: !390, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!102, !240, !352}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !359, file: !338, line: 22, baseType: !381, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !359, file: !338, line: 23, baseType: !381, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !359, file: !338, line: 24, baseType: !396, size: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!102, !352, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !359, file: !338, line: 25, baseType: !401, size: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!102, !399}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !359, file: !338, line: 26, baseType: !405, size: 64, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!102, !352, !322, !322}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !359, file: !338, line: 27, baseType: !349, size: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !359, file: !338, line: 28, baseType: !410, size: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!102, !352, !322, !327, !327, !185}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !359, file: !338, line: 29, baseType: !386, size: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !354, file: !338, line: 40, baseType: !314, size: 64, offset: 5568)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !354, file: !338, line: 41, baseType: !264, size: 32, offset: 5632)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !354, file: !338, line: 42, baseType: !352, size: 64, offset: 5696)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !354, file: !338, line: 43, baseType: !418, size: 32, offset: 5760)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !354, file: !338, line: 44, baseType: !264, size: 32, offset: 5792)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !354, file: !338, line: 47, baseType: !185, size: 64, offset: 5824)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !354, file: !338, line: 49, baseType: !322, size: 64, offset: 5888)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !354, file: !338, line: 50, baseType: !322, size: 64, offset: 5952)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !354, file: !338, line: 52, baseType: !322, size: 64, offset: 6016)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !354, file: !338, line: 54, baseType: !327, size: 64, offset: 6080)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !354, file: !338, line: 55, baseType: !327, size: 64, offset: 6144)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !354, file: !338, line: 56, baseType: !327, size: 64, offset: 6208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !354, file: !338, line: 57, baseType: !185, size: 64, offset: 6272)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !354, file: !338, line: 58, baseType: !429, size: 64, offset: 6336)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !430, line: 22, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !430, line: 22, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !354, file: !338, line: 59, baseType: !434, size: 64, offset: 6400)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !354, file: !338, line: 60, baseType: !264, size: 32, offset: 6464)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !354, file: !338, line: 61, baseType: !439, size: 32, offset: 6496)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !354, file: !338, line: 63, baseType: !322, size: 64, offset: 6528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !354, file: !338, line: 65, baseType: !322, size: 64, offset: 6592)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !354, file: !338, line: 66, baseType: !185, size: 64, offset: 6656)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !354, file: !338, line: 68, baseType: !203, size: 64, offset: 6720)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !354, file: !338, line: 74, baseType: !445, size: 320, offset: 6784)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 320, elements: !282)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!102, !352, !148, !203, !185}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !354, file: !338, line: 75, baseType: !450, size: 320, offset: 7104)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 320, elements: !282)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !354, file: !338, line: 76, baseType: !290, size: 320, offset: 7424)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !354, file: !338, line: 77, baseType: !148, size: 32, offset: 7744)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !354, file: !338, line: 78, baseType: !185, size: 64, offset: 7808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !354, file: !338, line: 79, baseType: !378, size: 32, offset: 7872)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !354, file: !338, line: 80, baseType: !456, size: 320, offset: 7936)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !282)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!102, !352, !185}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !354, file: !338, line: 81, baseType: !450, size: 320, offset: 8256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !354, file: !338, line: 82, baseType: !290, size: 320, offset: 8576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !354, file: !338, line: 83, baseType: !148, size: 32, offset: 8896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !354, file: !338, line: 84, baseType: !264, size: 32, offset: 8928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !354, file: !338, line: 88, baseType: !264, size: 32, offset: 8960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !338, line: 89, baseType: !185, size: 64, offset: 9024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !354, file: !338, line: 93, baseType: !148, size: 32, offset: 9088)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !354, file: !338, line: 94, baseType: !148, size: 32, offset: 9120)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !354, file: !338, line: 95, baseType: !148, size: 32, offset: 9152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !354, file: !338, line: 96, baseType: !148, size: 32, offset: 9184)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !354, file: !338, line: 97, baseType: !148, size: 32, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !354, file: !338, line: 98, baseType: !203, size: 64, offset: 9280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !354, file: !338, line: 99, baseType: !203, size: 64, offset: 9344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !354, file: !338, line: 100, baseType: !203, size: 64, offset: 9408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !354, file: !338, line: 101, baseType: !203, size: 64, offset: 9472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !354, file: !338, line: 102, baseType: !203, size: 64, offset: 9536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !354, file: !338, line: 103, baseType: !203, size: 64, offset: 9600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !354, file: !338, line: 104, baseType: !203, size: 64, offset: 9664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !354, file: !338, line: 105, baseType: !203, size: 64, offset: 9728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !354, file: !338, line: 106, baseType: !264, size: 32, offset: 9792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !354, file: !338, line: 107, baseType: !148, size: 32, offset: 9824)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !354, file: !338, line: 108, baseType: !148, size: 32, offset: 9856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !354, file: !338, line: 109, baseType: !148, size: 32, offset: 9888)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !354, file: !338, line: 110, baseType: !264, size: 32, offset: 9920)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !354, file: !338, line: 111, baseType: !148, size: 32, offset: 9952)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !354, file: !338, line: 112, baseType: !264, size: 32, offset: 9984)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !354, file: !338, line: 113, baseType: !148, size: 32, offset: 10016)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !354, file: !338, line: 115, baseType: !264, size: 32, offset: 10048)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !354, file: !338, line: 117, baseType: !264, size: 32, offset: 10080)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !354, file: !338, line: 119, baseType: !490, size: 32, offset: 10112)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !354, file: !338, line: 120, baseType: !492, size: 32, offset: 10144)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !354, file: !338, line: 124, baseType: !148, size: 32, offset: 10176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !354, file: !338, line: 125, baseType: !321, size: 64, offset: 10240)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !354, file: !338, line: 129, baseType: !148, size: 32, offset: 10304)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !354, file: !338, line: 130, baseType: !202, size: 64, offset: 10368)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !354, file: !338, line: 132, baseType: !194, size: 64, offset: 10432)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !354, file: !338, line: 133, baseType: !148, size: 32, offset: 10496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !354, file: !338, line: 134, baseType: !148, size: 32, offset: 10528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !354, file: !338, line: 135, baseType: !264, size: 32, offset: 10560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !354, file: !338, line: 136, baseType: !264, size: 32, offset: 10592)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !354, file: !338, line: 137, baseType: !264, size: 32, offset: 10624)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !354, file: !338, line: 140, baseType: !148, size: 32, offset: 10656)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !354, file: !338, line: 141, baseType: !148, size: 32, offset: 10688)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !354, file: !338, line: 143, baseType: !148, size: 32, offset: 10720)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !354, file: !338, line: 144, baseType: !148, size: 32, offset: 10752)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !354, file: !338, line: 146, baseType: !264, size: 32, offset: 10784)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !354, file: !338, line: 147, baseType: !264, size: 32, offset: 10816)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !354, file: !338, line: 148, baseType: !264, size: 32, offset: 10848)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !354, file: !338, line: 150, baseType: !264, size: 32, offset: 10880)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !354, file: !338, line: 151, baseType: !185, size: 64, offset: 10944)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !354, file: !338, line: 154, baseType: !203, size: 64, offset: 11008)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !354, file: !338, line: 155, baseType: !203, size: 64, offset: 11072)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !354, file: !338, line: 157, baseType: !321, size: 64, offset: 11136)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !354, file: !338, line: 158, baseType: !148, size: 32, offset: 11200)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !354, file: !338, line: 160, baseType: !264, size: 32, offset: 11232)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !354, file: !338, line: 161, baseType: !264, size: 32, offset: 11264)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !354, file: !338, line: 162, baseType: !148, size: 32, offset: 11296)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !354, file: !338, line: 164, baseType: !203, size: 64, offset: 11328)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !354, file: !338, line: 165, baseType: !322, size: 64, offset: 11392)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !354, file: !338, line: 165, baseType: !322, size: 64, offset: 11456)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !354, file: !338, line: 166, baseType: !148, size: 32, offset: 11520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !354, file: !338, line: 167, baseType: !264, size: 32, offset: 11552)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !354, file: !338, line: 169, baseType: !264, size: 32, offset: 11584)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "computemffunction", scope: !346, file: !338, line: 180, baseType: !349, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !346, file: !338, line: 181, baseType: !410, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !346, file: !338, line: 184, baseType: !528, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!102, !352, !322, !202, !185}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !346, file: !338, line: 187, baseType: !349, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !346, file: !338, line: 188, baseType: !410, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "computegs", scope: !346, file: !338, line: 191, baseType: !349, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !338, line: 193, baseType: !535, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!102, !337}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !346, file: !338, line: 194, baseType: !539, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!102, !337, !337}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "functionctx", scope: !340, file: !338, line: 199, baseType: !185, size: 64, offset: 5056)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mffunctionctx", scope: !340, file: !338, line: 200, baseType: !185, size: 64, offset: 5120)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gsctx", scope: !340, file: !338, line: 201, baseType: !185, size: 64, offset: 5184)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !340, file: !338, line: 202, baseType: !185, size: 64, offset: 5248)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "jacobianctx", scope: !340, file: !338, line: 203, baseType: !185, size: 64, offset: 5312)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "objectivectx", scope: !340, file: !338, line: 204, baseType: !185, size: 64, offset: 5376)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !338, line: 206, baseType: !185, size: 64, offset: 5440)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "originaldm", scope: !340, file: !338, line: 215, baseType: !314, size: 64, offset: 5504)
!550 = !DILocation(line: 0, scope: !310)
!551 = !DILocation(line: 33, column: 3, scope: !310)
!552 = !DILocation(line: 35, column: 28, scope: !310)
!553 = !{!554, !554, i64 0}
!554 = !{!"any pointer", !555, i64 0}
!555 = !{!"omnipotent char", !556, i64 0}
!556 = !{!"Simple C/C++ TBAA"}
!557 = !DILocation(line: 35, column: 11, scope: !310)
!558 = !DILocation(line: 35, column: 9, scope: !310)
!559 = !{!560, !560, i64 0}
!560 = !{!"int", !555, i64 0}
!561 = !DILocation(line: 35, column: 44, scope: !562)
!562 = distinct !DILexicalBlock(scope: !310, file: !298, line: 35, column: 44)
!563 = !DILocation(line: 35, column: 44, scope: !310)
!564 = !DILocation(line: 36, column: 55, scope: !310)
!565 = !DILocation(line: 36, column: 111, scope: !310)
!566 = !DILocation(line: 36, column: 11, scope: !310)
!567 = !DILocation(line: 36, column: 9, scope: !310)
!568 = !DILocation(line: 36, column: 146, scope: !569)
!569 = distinct !DILexicalBlock(scope: !310, file: !298, line: 36, column: 146)
!570 = !DILocation(line: 36, column: 146, scope: !310)
!571 = !DILocation(line: 37, column: 29, scope: !310)
!572 = !DILocation(line: 37, column: 11, scope: !310)
!573 = !DILocation(line: 37, column: 9, scope: !310)
!574 = !DILocation(line: 38, column: 1, scope: !310)
!575 = !DISubprogram(name: "DMGetDMSNESWrite", scope: !338, file: !338, line: 220, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!576 = !DISubroutineType(types: !577)
!577 = !{!28, !316, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!579 = !{}
!580 = !DISubprogram(name: "PetscObjectSetFortranCallback", scope: !75, file: !75, line: 176, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!581 = !DISubroutineType(types: !582)
!582 = !{!28, !88, !74, !583, !136, !185}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!584 = !DISubprogram(name: "DMSNESSetJacobian", scope: !27, file: !27, line: 694, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!585 = !DISubroutineType(types: !586)
!586 = !{!28, !316, !587, !185}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!28, !353, !324, !328, !328, !185}
!590 = distinct !DISubprogram(name: "ourj", scope: !298, file: !298, line: 16, type: !411, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !603, !604, !605, !606, !608, !610, !612}
!592 = !DILocalVariable(name: "snes", arg: 1, scope: !590, file: !298, line: 16, type: !352)
!593 = !DILocalVariable(name: "X", arg: 2, scope: !590, file: !298, line: 16, type: !322)
!594 = !DILocalVariable(name: "J", arg: 3, scope: !590, file: !298, line: 16, type: !327)
!595 = !DILocalVariable(name: "P", arg: 4, scope: !590, file: !298, line: 16, type: !327)
!596 = !DILocalVariable(name: "ptr", arg: 5, scope: !590, file: !298, line: 16, type: !185)
!597 = !DILocalVariable(name: "ierr", scope: !590, file: !298, line: 18, type: !102)
!598 = !DILocalVariable(name: "func", scope: !590, file: !298, line: 19, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602, !321, !326, !326, !185, !330}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!603 = !DILocalVariable(name: "ctx", scope: !590, file: !298, line: 19, type: !185)
!604 = !DILocalVariable(name: "dm", scope: !590, file: !298, line: 20, type: !314)
!605 = !DILocalVariable(name: "sdm", scope: !590, file: !298, line: 21, type: !337)
!606 = !DILocalVariable(name: "ierr__", scope: !607, file: !298, line: 24, type: !102)
