; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/python/pythonsys.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/python/pythonsys.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._Py_object_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!1 = distinct !DIGlobalVariable(name: "PetscBeganPython", scope: !2, file: !267, line: 161, type: !232, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !263, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/python/pythonsys.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !17, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 663, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !{!53, !56, !60, !61, !62, !63, !262}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !57, line: 330, baseType: !58)
!57 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !57, line: 330, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !66, line: 73, size: 4480, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !70, !116, !117, !119, !122, !123, !124, !125, !133, !134, !136, !140, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !156, !157, !158, !160, !161, !163, !165, !166, !167, !168, !169, !172, !174, !175, !176, !177, !178, !181, !183, !184, !185, !195, !197, !198, !202, !203, !252, !257, !259, !260, !261}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !65, file: !66, line: 74, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !61)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !65, file: !66, line: 75, baseType: !71, size: 448, offset: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 448, elements: !114)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !66, line: 53, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 45, size: 448, elements: !74)
!74 = !{!75, !81, !89, !94, !98, !102, !109}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !73, file: !66, line: 46, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !63, !80}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !61)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !73, file: !66, line: 47, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!79, !63, !85}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !86, line: 16, baseType: !87)
!86 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !86, line: 16, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !73, file: !66, line: 48, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!79, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !73, file: !66, line: 49, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!79, !63, !53, !63}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !73, file: !66, line: 50, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!79, !63, !53, !93}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !73, file: !66, line: 51, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!79, !63, !53, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !73, file: !66, line: 52, baseType: !110, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!79, !63, !53, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !65, file: !66, line: 76, baseType: !56, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !66, line: 77, baseType: !118, size: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !61)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !65, file: !66, line: 78, baseType: !120, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !121)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !65, file: !66, line: 78, baseType: !120, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !65, file: !66, line: 78, baseType: !120, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !65, file: !66, line: 78, baseType: !120, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !66, line: 79, baseType: !126, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !129, line: 27, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !65, file: !66, line: 80, baseType: !118, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !65, file: !66, line: 81, baseType: !135, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !61)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !65, file: !66, line: 82, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !65, file: !66, line: 83, baseType: !141, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !65, file: !66, line: 84, baseType: !62, size: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !65, file: !66, line: 85, baseType: !62, size: 64, offset: 1216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !65, file: !66, line: 86, baseType: !62, size: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !65, file: !66, line: 87, baseType: !62, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !65, file: !66, line: 88, baseType: !63, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !65, file: !66, line: 89, baseType: !126, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 90, baseType: !62, size: 64, offset: 1536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !65, file: !66, line: 91, baseType: !62, size: 64, offset: 1600)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !65, file: !66, line: 92, baseType: !118, size: 32, offset: 1664)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !65, file: !66, line: 93, baseType: !60, size: 64, offset: 1728)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !65, file: !66, line: 94, baseType: !155, size: 64, offset: 1792)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !127)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !65, file: !66, line: 95, baseType: !118, size: 32, offset: 1856)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !65, file: !66, line: 95, baseType: !118, size: 32, offset: 1888)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !65, file: !66, line: 96, baseType: !159, size: 64, offset: 1920)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !65, file: !66, line: 96, baseType: !159, size: 64, offset: 1984)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !65, file: !66, line: 97, baseType: !162, size: 64, offset: 2048)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !65, file: !66, line: 97, baseType: !164, size: 64, offset: 2112)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !65, file: !66, line: 98, baseType: !118, size: 32, offset: 2176)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !65, file: !66, line: 98, baseType: !118, size: 32, offset: 2208)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !65, file: !66, line: 99, baseType: !159, size: 64, offset: 2240)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !65, file: !66, line: 99, baseType: !159, size: 64, offset: 2304)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !65, file: !66, line: 100, baseType: !170, size: 64, offset: 2368)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !121)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !65, file: !66, line: 100, baseType: !173, size: 64, offset: 2432)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !65, file: !66, line: 101, baseType: !118, size: 32, offset: 2496)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !65, file: !66, line: 101, baseType: !118, size: 32, offset: 2528)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !65, file: !66, line: 102, baseType: !159, size: 64, offset: 2560)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !65, file: !66, line: 102, baseType: !159, size: 64, offset: 2624)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !65, file: !66, line: 103, baseType: !179, size: 64, offset: 2688)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !171)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !65, file: !66, line: 103, baseType: !182, size: 64, offset: 2752)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !65, file: !66, line: 104, baseType: !113, size: 64, offset: 2816)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !65, file: !66, line: 105, baseType: !118, size: 32, offset: 2880)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !65, file: !66, line: 106, baseType: !186, size: 128, offset: 2944)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 128, elements: !193)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !66, line: 64, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 61, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !189, file: !66, line: 62, baseType: !106, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !189, file: !66, line: 63, baseType: !60, size: 64, offset: 64)
!193 = !{!194}
!194 = !DISubrange(count: 2)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !65, file: !66, line: 107, baseType: !196, size: 64, offset: 3072)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !193)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !65, file: !66, line: 108, baseType: !60, size: 64, offset: 3136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !65, file: !66, line: 109, baseType: !199, size: 64, offset: 3200)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!79, !60}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !65, file: !66, line: 111, baseType: !118, size: 32, offset: 3264)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !65, file: !66, line: 112, baseType: !204, size: 320, offset: 3328)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !250)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!79, !208, !63, !60}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !211)
!211 = !{!212, !213, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !210, file: !18, line: 100, baseType: !118, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !18, line: 101, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !225, !226, !227, !231, !233, !235, !236, !237}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !216, file: !18, line: 84, baseType: !62, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !216, file: !18, line: 85, baseType: !62, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !18, line: 86, baseType: !60, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !216, file: !18, line: 87, baseType: !137, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !216, file: !18, line: 88, baseType: !223, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !216, file: !18, line: 89, baseType: !55, size: 8, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !216, file: !18, line: 90, baseType: !62, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !216, file: !18, line: 91, baseType: !228, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !229, line: 46, baseType: !230)
!229 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!230 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !216, file: !18, line: 92, baseType: !232, size: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !18, line: 93, baseType: !234, size: 32, offset: 544)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !18, line: 94, baseType: !214, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !216, file: !18, line: 95, baseType: !62, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !216, file: !18, line: 96, baseType: !60, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !210, file: !18, line: 102, baseType: !62, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !210, file: !18, line: 102, baseType: !62, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !210, file: !18, line: 103, baseType: !62, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !210, file: !18, line: 104, baseType: !56, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !210, file: !18, line: 105, baseType: !232, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !210, file: !18, line: 105, baseType: !232, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !210, file: !18, line: 105, baseType: !232, size: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !210, file: !18, line: 106, baseType: !63, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !210, file: !18, line: 107, baseType: !247, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!250 = !{!251}
!251 = !DISubrange(count: 5)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !65, file: !66, line: 113, baseType: !253, size: 320, offset: 3648)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 320, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!79, !63, !60}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !65, file: !66, line: 114, baseType: !258, size: 320, offset: 3968)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 320, elements: !250)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !65, file: !66, line: 115, baseType: !232, size: 32, offset: 4288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !65, file: !66, line: 120, baseType: !247, size: 64, offset: 4352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !65, file: !66, line: 121, baseType: !232, size: 32, offset: 4416)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!263 = !{!264, !326, !331, !336, !341, !346, !348, !353, !358, !363, !365, !370, !375, !381, !383, !388, !390, !391, !393, !395, !397, !399}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "registered", scope: !266, file: !267, line: 211, type: !232, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "PetscPythonInitialize", scope: !267, file: !267, line: 187, type: !268, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !270)
!267 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/python/pythonsys.c", directory: "/home/users/ndemeye/xSDK")
!268 = !DISubroutineType(types: !269)
!269 = !{!79, !53, !53}
!270 = !{!271, !272, !273, !277, !278, !282, !285, !289, !292, !294, !297, !298, !302, !305, !307, !310, !314, !318, !322}
!271 = !DILocalVariable(name: "pyexe", arg: 1, scope: !266, file: !267, line: 187, type: !53)
!272 = !DILocalVariable(name: "pylib", arg: 2, scope: !266, file: !267, line: 187, type: !53)
!273 = !DILocalVariable(name: "module", scope: !266, file: !267, line: 189, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !267, line: 89, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_object_t", file: !267, line: 89, flags: DIFlagFwdDecl)
!277 = !DILocalVariable(name: "ierr", scope: !266, file: !267, line: 190, type: !79)
!278 = !DILocalVariable(name: "ierr__", scope: !279, file: !267, line: 196, type: !79)
!279 = distinct !DILexicalBlock(scope: !280, file: !267, line: 196, column: 70)
!280 = distinct !DILexicalBlock(scope: !281, file: !267, line: 195, column: 31)
!281 = distinct !DILexicalBlock(scope: !266, file: !267, line: 195, column: 7)
!282 = !DILocalVariable(name: "ierr__", scope: !283, file: !267, line: 198, type: !79)
!283 = distinct !DILexicalBlock(scope: !284, file: !267, line: 198, column: 77)
!284 = distinct !DILexicalBlock(scope: !281, file: !267, line: 197, column: 10)
!285 = !DILocalVariable(name: "ierr__", scope: !286, file: !267, line: 202, type: !79)
!286 = distinct !DILexicalBlock(scope: !287, file: !267, line: 202, column: 70)
!287 = distinct !DILexicalBlock(scope: !288, file: !267, line: 201, column: 31)
!288 = distinct !DILexicalBlock(scope: !266, file: !267, line: 201, column: 7)
!289 = !DILocalVariable(name: "ierr__", scope: !290, file: !267, line: 204, type: !79)
!290 = distinct !DILexicalBlock(scope: !291, file: !267, line: 204, column: 89)
!291 = distinct !DILexicalBlock(scope: !288, file: !267, line: 203, column: 10)
!292 = !DILocalVariable(name: "ierr__", scope: !293, file: !267, line: 207, type: !79)
!293 = distinct !DILexicalBlock(scope: !266, file: !267, line: 207, column: 49)
!294 = !DILocalVariable(name: "py_version", scope: !295, file: !267, line: 212, type: !53)
!295 = distinct !DILexicalBlock(scope: !296, file: !267, line: 210, column: 28)
!296 = distinct !DILexicalBlock(scope: !266, file: !267, line: 210, column: 7)
!297 = !DILocalVariable(name: "sys_path", scope: !295, file: !267, line: 213, type: !274)
!298 = !DILocalVariable(name: "path", scope: !295, file: !267, line: 214, type: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32768, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 4096)
!302 = !DILocalVariable(name: "argc", scope: !303, file: !267, line: 221, type: !61)
!303 = distinct !DILexicalBlock(scope: !304, file: !267, line: 220, column: 31)
!304 = distinct !DILexicalBlock(scope: !295, file: !267, line: 220, column: 9)
!305 = !DILocalVariable(name: "argv", scope: !303, file: !267, line: 221, type: !306)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !114)
!307 = !DILocalVariable(name: "argc", scope: !308, file: !267, line: 225, type: !61)
!308 = distinct !DILexicalBlock(scope: !309, file: !267, line: 224, column: 31)
!309 = distinct !DILexicalBlock(scope: !295, file: !267, line: 224, column: 9)
!310 = !DILocalVariable(name: "argv", scope: !308, file: !267, line: 225, type: !311)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 64, elements: !114)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !229, line: 74, baseType: !61)
!314 = !DILocalVariable(name: "ierr__", scope: !315, file: !267, line: 231, type: !79)
!315 = distinct !DILexicalBlock(scope: !316, file: !267, line: 231, column: 84)
!316 = distinct !DILexicalBlock(scope: !317, file: !267, line: 230, column: 19)
!317 = distinct !DILexicalBlock(scope: !295, file: !267, line: 230, column: 9)
!318 = !DILocalVariable(name: "ierr__", scope: !319, file: !267, line: 244, type: !79)
!319 = distinct !DILexicalBlock(scope: !320, file: !267, line: 244, column: 57)
!320 = distinct !DILexicalBlock(scope: !321, file: !267, line: 243, column: 22)
!321 = distinct !DILexicalBlock(scope: !295, file: !267, line: 243, column: 9)
!322 = !DILocalVariable(name: "ierr__", scope: !323, file: !267, line: 252, type: !79)
!323 = distinct !DILexicalBlock(scope: !324, file: !267, line: 252, column: 87)
!324 = distinct !DILexicalBlock(scope: !325, file: !267, line: 251, column: 15)
!325 = distinct !DILexicalBlock(scope: !266, file: !267, line: 251, column: 7)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "PetscPythonMonitorSet_C", scope: !2, file: !267, line: 285, type: !328, isLocal: false, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!79, !63, !53}
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "Py_GetVersion", scope: !2, file: !267, line: 93, type: !333, isLocal: true, isDefinition: true)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!53}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "Py_IsInitialized", scope: !2, file: !267, line: 95, type: !338, isLocal: true, isDefinition: true)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!61}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "Py_InitializeEx", scope: !2, file: !267, line: 96, type: !343, isLocal: true, isDefinition: true)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !61}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "Py_Finalize", scope: !2, file: !267, line: 97, type: !106, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "PySys_SetArgv", scope: !2, file: !267, line: 99, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !61, !60}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "PySys_GetObject", scope: !2, file: !267, line: 100, type: !355, isLocal: true, isDefinition: true)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!274, !53}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "PyObject_CallMethod", scope: !2, file: !267, line: 101, type: !360, isLocal: true, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!274, !274, !53, !53, null}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "PyImport_ImportModule", scope: !2, file: !267, line: 102, type: !355, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "Py_DecRef", scope: !2, file: !267, line: 105, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !274}
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "PyErr_Occurred", scope: !2, file: !267, line: 108, type: !372, isLocal: true, isDefinition: true)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!274}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "PyErr_Fetch", scope: !2, file: !267, line: 109, type: !377, isLocal: true, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380, !380, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "PyErr_NormalizeException", scope: !2, file: !267, line: 110, type: !377, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "PyErr_Display", scope: !2, file: !267, line: 111, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !274, !274, !274}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "PyErr_Restore", scope: !2, file: !267, line: 112, type: !385, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "PetscPythonExe", scope: !2, file: !267, line: 159, type: !299, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "PetscPythonLib", scope: !2, file: !267, line: 160, type: !299, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "Py_IncRef", scope: !2, file: !267, line: 104, type: !367, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "PyErr_Clear", scope: !2, file: !267, line: 107, type: !106, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "Py_None", scope: !2, file: !267, line: 91, type: !274, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!402 = !{i32 7, !"Dwarf Version", i32 4}
!403 = !{i32 2, !"Debug Info Version", i32 3}
!404 = !{i32 1, !"wchar_size", i32 4}
!405 = !{i32 7, !"PIC Level", i32 2}
!406 = !{i32 7, !"uwtable", i32 1}
!407 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!408 = distinct !DISubprogram(name: "PetscPythonFinalize", scope: !267, file: !267, line: 169, type: !409, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{!79}
!411 = !{}
!412 = !DILocation(line: 171, column: 3, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !267, line: 171, column: 3)
!414 = distinct !DILexicalBlock(scope: !415, file: !267, line: 171, column: 3)
!415 = distinct !DILexicalBlock(scope: !408, file: !267, line: 171, column: 3)
!416 = !{!417, !417, i64 0}
!417 = !{!"any pointer", !418, i64 0}
!418 = !{!"omnipotent char", !419, i64 0}
!419 = !{!"Simple C/C++ TBAA"}
!420 = !DILocation(line: 171, column: 3, scope: !414)
!421 = !DILocation(line: 171, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !267, line: 171, column: 3)
!423 = distinct !DILexicalBlock(scope: !413, file: !267, line: 171, column: 3)
!424 = !{!425, !426, i64 1536}
!425 = !{!"", !418, i64 0, !418, i64 512, !418, i64 1024, !418, i64 1280, !426, i64 1536, !426, i64 1540, !418, i64 1544}
!426 = !{!"int", !418, i64 0}
!427 = !DILocation(line: 171, column: 3, scope: !423)
!428 = !DILocation(line: 171, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !422, file: !267, line: 171, column: 3)
!430 = !{!426, !426, i64 0}
!431 = !{!425, !426, i64 1540}
!432 = !DILocation(line: 172, column: 7, scope: !433)
!433 = distinct !DILexicalBlock(scope: !408, file: !267, line: 172, column: 7)
!434 = !DILocation(line: 172, column: 7, scope: !408)
!435 = !DILocation(line: 172, column: 31, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !267, line: 172, column: 31)
!437 = distinct !DILexicalBlock(scope: !433, file: !267, line: 172, column: 25)
!438 = !DILocation(line: 172, column: 31, scope: !437)
!439 = !DILocation(line: 172, column: 51, scope: !436)
!440 = !DILocation(line: 173, column: 20, scope: !408)
!441 = !DILocation(line: 174, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !267, line: 174, column: 3)
!443 = distinct !DILexicalBlock(scope: !444, file: !267, line: 174, column: 3)
!444 = distinct !DILexicalBlock(scope: !408, file: !267, line: 174, column: 3)
!445 = !DILocation(line: 174, column: 3, scope: !443)
!446 = !DILocation(line: 174, column: 3, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !267, line: 174, column: 3)
!448 = distinct !DILexicalBlock(scope: !442, file: !267, line: 174, column: 3)
!449 = !DILocation(line: 174, column: 3, scope: !448)
!450 = !DILocation(line: 174, column: 3, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !267, line: 174, column: 3)
!452 = distinct !DILexicalBlock(scope: !447, file: !267, line: 174, column: 3)
!453 = !{!425, !418, i64 1544}
!454 = !DILocation(line: 174, column: 3, scope: !452)
!455 = !DILocation(line: 174, column: 3, scope: !456)
!456 = distinct !DILexicalBlock(scope: !451, file: !267, line: 174, column: 3)
!457 = !DILocation(line: 174, column: 3, scope: !458)
!458 = distinct !DILexicalBlock(scope: !447, file: !267, line: 174, column: 3)
!459 = !DILocation(line: 174, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !458, file: !267, line: 174, column: 3)
!461 = !DILocation(line: 174, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !267, line: 174, column: 3)
!463 = distinct !DILexicalBlock(scope: !460, file: !267, line: 174, column: 3)
!464 = !DILocation(line: 174, column: 3, scope: !463)
!465 = !DILocation(line: 174, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !267, line: 174, column: 3)
!467 = !DILocation(line: 174, column: 3, scope: !444)
!468 = !DILocation(line: 0, scope: !266)
!469 = !DILocation(line: 192, column: 3, scope: !470)
!470 = distinct !DILexicalBlock(scope: !471, file: !267, line: 192, column: 3)
!471 = distinct !DILexicalBlock(scope: !472, file: !267, line: 192, column: 3)
!472 = distinct !DILexicalBlock(scope: !266, file: !267, line: 192, column: 3)
!473 = !DILocation(line: 192, column: 3, scope: !471)
!474 = !DILocation(line: 192, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !267, line: 192, column: 3)
!476 = distinct !DILexicalBlock(scope: !470, file: !267, line: 192, column: 3)
!477 = !DILocation(line: 192, column: 3, scope: !476)
!478 = !DILocation(line: 192, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !267, line: 192, column: 3)
!480 = !DILocation(line: 193, column: 7, scope: !481)
!481 = distinct !DILexicalBlock(scope: !266, file: !267, line: 193, column: 7)
!482 = !DILocation(line: 193, column: 7, scope: !266)
!483 = !DILocation(line: 193, column: 25, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !267, line: 193, column: 25)
!485 = distinct !DILexicalBlock(scope: !486, file: !267, line: 193, column: 25)
!486 = distinct !DILexicalBlock(scope: !487, file: !267, line: 193, column: 25)
!487 = distinct !DILexicalBlock(scope: !488, file: !267, line: 193, column: 25)
!488 = distinct !DILexicalBlock(scope: !481, file: !267, line: 193, column: 25)
!489 = !DILocation(line: 193, column: 25, scope: !485)
!490 = !DILocation(line: 193, column: 25, scope: !491)
!491 = distinct !DILexicalBlock(scope: !492, file: !267, line: 193, column: 25)
!492 = distinct !DILexicalBlock(scope: !484, file: !267, line: 193, column: 25)
!493 = !DILocation(line: 193, column: 25, scope: !492)
!494 = !DILocation(line: 193, column: 25, scope: !495)
!495 = distinct !DILexicalBlock(scope: !491, file: !267, line: 193, column: 25)
!496 = !DILocation(line: 193, column: 25, scope: !497)
!497 = distinct !DILexicalBlock(scope: !484, file: !267, line: 193, column: 25)
!498 = !DILocation(line: 193, column: 25, scope: !499)
!499 = distinct !DILexicalBlock(scope: !497, file: !267, line: 193, column: 25)
!500 = !DILocation(line: 193, column: 25, scope: !501)
!501 = distinct !DILexicalBlock(scope: !502, file: !267, line: 193, column: 25)
!502 = distinct !DILexicalBlock(scope: !499, file: !267, line: 193, column: 25)
!503 = !DILocation(line: 193, column: 25, scope: !502)
!504 = !DILocation(line: 193, column: 25, scope: !505)
!505 = distinct !DILexicalBlock(scope: !501, file: !267, line: 193, column: 25)
!506 = !DILocation(line: 195, column: 7, scope: !281)
!507 = !DILocation(line: 195, column: 13, scope: !281)
!508 = !DILocation(line: 195, column: 16, scope: !281)
!509 = !{!418, !418, i64 0}
!510 = !DILocation(line: 195, column: 25, scope: !281)
!511 = !DILocation(line: 195, column: 7, scope: !266)
!512 = !DILocation(line: 196, column: 12, scope: !280)
!513 = !DILocation(line: 0, scope: !279)
!514 = !DILocation(line: 196, column: 70, scope: !515)
!515 = distinct !DILexicalBlock(scope: !279, file: !267, line: 196, column: 70)
!516 = !DILocation(line: 196, column: 70, scope: !279)
!517 = !{!"branch_weights", i32 2000, i32 1}
!518 = !DILocalVariable(name: "pythonexe", arg: 1, scope: !519, file: !267, line: 9, type: !62)
!519 = distinct !DISubprogram(name: "PetscPythonFindExecutable", scope: !267, file: !267, line: 9, type: !520, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!79, !62, !228}
!522 = !{!518, !523, !524, !525, !526, !528, !530}
!523 = !DILocalVariable(name: "len", arg: 2, scope: !519, file: !267, line: 9, type: !228)
!524 = !DILocalVariable(name: "flag", scope: !519, file: !267, line: 11, type: !232)
!525 = !DILocalVariable(name: "ierr", scope: !519, file: !267, line: 12, type: !79)
!526 = !DILocalVariable(name: "ierr__", scope: !527, file: !267, line: 16, type: !79)
!527 = distinct !DILexicalBlock(scope: !519, file: !267, line: 16, column: 55)
!528 = !DILocalVariable(name: "ierr__", scope: !529, file: !267, line: 17, type: !79)
!529 = distinct !DILexicalBlock(scope: !519, file: !267, line: 17, column: 73)
!530 = !DILocalVariable(name: "ierr__", scope: !531, file: !267, line: 19, type: !79)
!531 = distinct !DILexicalBlock(scope: !532, file: !267, line: 19, column: 57)
!532 = distinct !DILexicalBlock(scope: !533, file: !267, line: 18, column: 33)
!533 = distinct !DILexicalBlock(scope: !519, file: !267, line: 18, column: 7)
!534 = !DILocation(line: 0, scope: !519, inlinedAt: !535)
!535 = distinct !DILocation(line: 198, column: 12, scope: !284)
!536 = !DILocation(line: 11, column: 3, scope: !519, inlinedAt: !535)
!537 = !DILocation(line: 14, column: 3, scope: !538, inlinedAt: !535)
!538 = distinct !DILexicalBlock(scope: !539, file: !267, line: 14, column: 3)
!539 = distinct !DILexicalBlock(scope: !540, file: !267, line: 14, column: 3)
!540 = distinct !DILexicalBlock(scope: !519, file: !267, line: 14, column: 3)
!541 = !DILocation(line: 14, column: 3, scope: !539, inlinedAt: !535)
!542 = !DILocation(line: 14, column: 3, scope: !543, inlinedAt: !535)
!543 = distinct !DILexicalBlock(scope: !544, file: !267, line: 14, column: 3)
!544 = distinct !DILexicalBlock(scope: !538, file: !267, line: 14, column: 3)
!545 = !DILocation(line: 14, column: 3, scope: !544, inlinedAt: !535)
!546 = !DILocation(line: 14, column: 3, scope: !547, inlinedAt: !535)
!547 = distinct !DILexicalBlock(scope: !543, file: !267, line: 14, column: 3)
!548 = !DILocation(line: 16, column: 10, scope: !519, inlinedAt: !535)
!549 = !DILocation(line: 0, scope: !527, inlinedAt: !535)
!550 = !DILocation(line: 16, column: 55, scope: !551, inlinedAt: !535)
!551 = distinct !DILexicalBlock(scope: !527, file: !267, line: 16, column: 55)
!552 = !DILocation(line: 16, column: 55, scope: !527, inlinedAt: !535)
!553 = !DILocation(line: 17, column: 10, scope: !519, inlinedAt: !535)
!554 = !DILocation(line: 0, scope: !529, inlinedAt: !535)
!555 = !DILocation(line: 17, column: 73, scope: !556, inlinedAt: !535)
!556 = distinct !DILexicalBlock(scope: !529, file: !267, line: 17, column: 73)
!557 = !DILocation(line: 17, column: 73, scope: !529, inlinedAt: !535)
!558 = !DILocation(line: 18, column: 8, scope: !533, inlinedAt: !535)
!559 = !DILocation(line: 18, column: 13, scope: !533, inlinedAt: !535)
!560 = !DILocation(line: 19, column: 12, scope: !532, inlinedAt: !535)
!561 = !DILocation(line: 0, scope: !531, inlinedAt: !535)
!562 = !DILocation(line: 19, column: 57, scope: !563, inlinedAt: !535)
!563 = distinct !DILexicalBlock(scope: !531, file: !267, line: 19, column: 57)
!564 = !DILocation(line: 19, column: 57, scope: !531, inlinedAt: !535)
!565 = !DILocation(line: 21, column: 3, scope: !566, inlinedAt: !535)
!566 = distinct !DILexicalBlock(scope: !567, file: !267, line: 21, column: 3)
!567 = distinct !DILexicalBlock(scope: !568, file: !267, line: 21, column: 3)
!568 = distinct !DILexicalBlock(scope: !519, file: !267, line: 21, column: 3)
!569 = !DILocation(line: 21, column: 3, scope: !567, inlinedAt: !535)
!570 = !DILocation(line: 21, column: 3, scope: !571, inlinedAt: !535)
!571 = distinct !DILexicalBlock(scope: !572, file: !267, line: 21, column: 3)
!572 = distinct !DILexicalBlock(scope: !566, file: !267, line: 21, column: 3)
!573 = !DILocation(line: 21, column: 3, scope: !572, inlinedAt: !535)
!574 = !DILocation(line: 21, column: 3, scope: !575, inlinedAt: !535)
!575 = distinct !DILexicalBlock(scope: !576, file: !267, line: 21, column: 3)
!576 = distinct !DILexicalBlock(scope: !571, file: !267, line: 21, column: 3)
!577 = !DILocation(line: 21, column: 3, scope: !576, inlinedAt: !535)
!578 = !DILocation(line: 21, column: 3, scope: !579, inlinedAt: !535)
!579 = distinct !DILexicalBlock(scope: !575, file: !267, line: 21, column: 3)
!580 = !DILocation(line: 21, column: 3, scope: !581, inlinedAt: !535)
!581 = distinct !DILexicalBlock(scope: !571, file: !267, line: 21, column: 3)
!582 = !DILocation(line: 21, column: 3, scope: !583, inlinedAt: !535)
!583 = distinct !DILexicalBlock(scope: !581, file: !267, line: 21, column: 3)
!584 = !DILocation(line: 21, column: 3, scope: !585, inlinedAt: !535)
!585 = distinct !DILexicalBlock(scope: !586, file: !267, line: 21, column: 3)
!586 = distinct !DILexicalBlock(scope: !583, file: !267, line: 21, column: 3)
!587 = !DILocation(line: 21, column: 3, scope: !586, inlinedAt: !535)
!588 = !DILocation(line: 21, column: 3, scope: !589, inlinedAt: !535)
!589 = distinct !DILexicalBlock(scope: !585, file: !267, line: 21, column: 3)
!590 = !DILocation(line: 22, column: 1, scope: !519, inlinedAt: !535)
!591 = !DILocation(line: 0, scope: !283)
!592 = !DILocation(line: 198, column: 77, scope: !283)
!593 = !DILocation(line: 198, column: 77, scope: !594)
!594 = distinct !DILexicalBlock(scope: !283, file: !267, line: 198, column: 77)
!595 = !DILocation(line: 201, column: 7, scope: !288)
!596 = !DILocation(line: 201, column: 13, scope: !288)
!597 = !DILocation(line: 201, column: 16, scope: !288)
!598 = !DILocation(line: 201, column: 25, scope: !288)
!599 = !DILocation(line: 201, column: 7, scope: !266)
!600 = !DILocation(line: 202, column: 12, scope: !287)
!601 = !DILocation(line: 0, scope: !286)
!602 = !DILocation(line: 202, column: 70, scope: !603)
!603 = distinct !DILexicalBlock(scope: !286, file: !267, line: 202, column: 70)
!604 = !DILocation(line: 202, column: 70, scope: !286)
!605 = !DILocalVariable(name: "pythonexe", arg: 1, scope: !606, file: !267, line: 53, type: !53)
!606 = distinct !DISubprogram(name: "PetscPythonFindLibrary", scope: !267, file: !267, line: 53, type: !607, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{!79, !53, !62, !228}
!609 = !{!605, !610, !611, !612, !616, !620, !624, !628, !632, !633, !634, !636, !640, !644, !648, !652}
!610 = !DILocalVariable(name: "pythonlib", arg: 2, scope: !606, file: !267, line: 53, type: !62)
!611 = !DILocalVariable(name: "pl", arg: 3, scope: !606, file: !267, line: 53, type: !228)
!612 = !DILocalVariable(name: "cmdline1", scope: !606, file: !267, line: 55, type: !613)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1136, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 142)
!616 = !DILocalVariable(name: "cmdline2", scope: !606, file: !267, line: 56, type: !617)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1216, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 152)
!620 = !DILocalVariable(name: "cmdline3", scope: !606, file: !267, line: 57, type: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1128, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 141)
!624 = !DILocalVariable(name: "cmdline4", scope: !606, file: !267, line: 58, type: !625)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 664, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 83)
!628 = !DILocalVariable(name: "cmdline5", scope: !606, file: !267, line: 59, type: !629)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1192, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 149)
!632 = !DILocalVariable(name: "found", scope: !606, file: !267, line: 61, type: !232)
!633 = !DILocalVariable(name: "ierr", scope: !606, file: !267, line: 62, type: !79)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !267, line: 70, type: !79)
!635 = distinct !DILexicalBlock(scope: !606, file: !267, line: 70, column: 77)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !267, line: 72, type: !79)
!637 = distinct !DILexicalBlock(scope: !638, file: !267, line: 72, column: 79)
!638 = distinct !DILexicalBlock(scope: !639, file: !267, line: 71, column: 15)
!639 = distinct !DILexicalBlock(scope: !606, file: !267, line: 71, column: 7)
!640 = !DILocalVariable(name: "ierr__", scope: !641, file: !267, line: 75, type: !79)
!641 = distinct !DILexicalBlock(scope: !642, file: !267, line: 75, column: 79)
!642 = distinct !DILexicalBlock(scope: !643, file: !267, line: 74, column: 15)
!643 = distinct !DILexicalBlock(scope: !606, file: !267, line: 74, column: 7)
!644 = !DILocalVariable(name: "ierr__", scope: !645, file: !267, line: 78, type: !79)
!645 = distinct !DILexicalBlock(scope: !646, file: !267, line: 78, column: 79)
!646 = distinct !DILexicalBlock(scope: !647, file: !267, line: 77, column: 15)
!647 = distinct !DILexicalBlock(scope: !606, file: !267, line: 77, column: 7)
!648 = !DILocalVariable(name: "ierr__", scope: !649, file: !267, line: 81, type: !79)
!649 = distinct !DILexicalBlock(scope: !650, file: !267, line: 81, column: 79)
!650 = distinct !DILexicalBlock(scope: !651, file: !267, line: 80, column: 15)
!651 = distinct !DILexicalBlock(scope: !606, file: !267, line: 80, column: 7)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !267, line: 83, type: !79)
!653 = distinct !DILexicalBlock(scope: !606, file: !267, line: 83, column: 75)
!654 = !DILocation(line: 0, scope: !606, inlinedAt: !655)
!655 = distinct !DILocation(line: 204, column: 12, scope: !291)
!656 = !DILocation(line: 55, column: 3, scope: !606, inlinedAt: !655)
!657 = !DILocation(line: 55, column: 18, scope: !606, inlinedAt: !655)
!658 = !DILocation(line: 56, column: 3, scope: !606, inlinedAt: !655)
!659 = !DILocation(line: 56, column: 18, scope: !606, inlinedAt: !655)
!660 = !DILocation(line: 57, column: 3, scope: !606, inlinedAt: !655)
!661 = !DILocation(line: 57, column: 18, scope: !606, inlinedAt: !655)
!662 = !DILocation(line: 58, column: 3, scope: !606, inlinedAt: !655)
!663 = !DILocation(line: 58, column: 18, scope: !606, inlinedAt: !655)
!664 = !DILocation(line: 59, column: 3, scope: !606, inlinedAt: !655)
!665 = !DILocation(line: 59, column: 18, scope: !606, inlinedAt: !655)
!666 = !DILocation(line: 61, column: 3, scope: !606, inlinedAt: !655)
!667 = !DILocation(line: 61, column: 18, scope: !606, inlinedAt: !655)
!668 = !DILocation(line: 64, column: 3, scope: !669, inlinedAt: !655)
!669 = distinct !DILexicalBlock(scope: !670, file: !267, line: 64, column: 3)
!670 = distinct !DILexicalBlock(scope: !671, file: !267, line: 64, column: 3)
!671 = distinct !DILexicalBlock(scope: !606, file: !267, line: 64, column: 3)
!672 = !DILocation(line: 64, column: 3, scope: !670, inlinedAt: !655)
!673 = !DILocation(line: 64, column: 3, scope: !674, inlinedAt: !655)
!674 = distinct !DILexicalBlock(scope: !675, file: !267, line: 64, column: 3)
!675 = distinct !DILexicalBlock(scope: !669, file: !267, line: 64, column: 3)
!676 = !DILocation(line: 64, column: 3, scope: !675, inlinedAt: !655)
!677 = !DILocation(line: 64, column: 3, scope: !678, inlinedAt: !655)
!678 = distinct !DILexicalBlock(scope: !674, file: !267, line: 64, column: 3)
!679 = !DILocation(line: 70, column: 10, scope: !606, inlinedAt: !655)
!680 = !DILocation(line: 0, scope: !635, inlinedAt: !655)
!681 = !DILocation(line: 70, column: 77, scope: !682, inlinedAt: !655)
!682 = distinct !DILexicalBlock(scope: !635, file: !267, line: 70, column: 77)
!683 = !DILocation(line: 70, column: 77, scope: !635, inlinedAt: !655)
!684 = !DILocation(line: 71, column: 8, scope: !639, inlinedAt: !655)
!685 = !DILocation(line: 71, column: 7, scope: !606, inlinedAt: !655)
!686 = !DILocation(line: 72, column: 12, scope: !638, inlinedAt: !655)
!687 = !DILocation(line: 0, scope: !637, inlinedAt: !655)
!688 = !DILocation(line: 72, column: 79, scope: !689, inlinedAt: !655)
!689 = distinct !DILexicalBlock(scope: !637, file: !267, line: 72, column: 79)
!690 = !DILocation(line: 72, column: 79, scope: !637, inlinedAt: !655)
!691 = !DILocation(line: 74, column: 8, scope: !643, inlinedAt: !655)
!692 = !DILocation(line: 74, column: 7, scope: !606, inlinedAt: !655)
!693 = !DILocation(line: 75, column: 12, scope: !642, inlinedAt: !655)
!694 = !DILocation(line: 0, scope: !641, inlinedAt: !655)
!695 = !DILocation(line: 75, column: 79, scope: !696, inlinedAt: !655)
!696 = distinct !DILexicalBlock(scope: !641, file: !267, line: 75, column: 79)
!697 = !DILocation(line: 75, column: 79, scope: !641, inlinedAt: !655)
!698 = !DILocation(line: 77, column: 8, scope: !647, inlinedAt: !655)
!699 = !DILocation(line: 77, column: 7, scope: !606, inlinedAt: !655)
!700 = !DILocation(line: 78, column: 12, scope: !646, inlinedAt: !655)
!701 = !DILocation(line: 0, scope: !645, inlinedAt: !655)
!702 = !DILocation(line: 78, column: 79, scope: !703, inlinedAt: !655)
!703 = distinct !DILexicalBlock(scope: !645, file: !267, line: 78, column: 79)
!704 = !DILocation(line: 78, column: 79, scope: !645, inlinedAt: !655)
!705 = !DILocation(line: 80, column: 8, scope: !651, inlinedAt: !655)
!706 = !DILocation(line: 80, column: 7, scope: !606, inlinedAt: !655)
!707 = !DILocation(line: 81, column: 12, scope: !650, inlinedAt: !655)
!708 = !DILocation(line: 0, scope: !649, inlinedAt: !655)
!709 = !DILocation(line: 81, column: 79, scope: !710, inlinedAt: !655)
!710 = distinct !DILexicalBlock(scope: !649, file: !267, line: 81, column: 79)
!711 = !DILocation(line: 81, column: 79, scope: !649, inlinedAt: !655)
!712 = !DILocation(line: 83, column: 10, scope: !606, inlinedAt: !655)
!713 = !DILocation(line: 0, scope: !653, inlinedAt: !655)
!714 = !DILocation(line: 83, column: 75, scope: !715, inlinedAt: !655)
!715 = distinct !DILexicalBlock(scope: !653, file: !267, line: 83, column: 75)
!716 = !DILocation(line: 83, column: 75, scope: !653, inlinedAt: !655)
!717 = !DILocation(line: 84, column: 3, scope: !718, inlinedAt: !655)
!718 = distinct !DILexicalBlock(scope: !719, file: !267, line: 84, column: 3)
!719 = distinct !DILexicalBlock(scope: !720, file: !267, line: 84, column: 3)
!720 = distinct !DILexicalBlock(scope: !606, file: !267, line: 84, column: 3)
!721 = !DILocation(line: 84, column: 3, scope: !719, inlinedAt: !655)
!722 = !DILocation(line: 84, column: 3, scope: !723, inlinedAt: !655)
!723 = distinct !DILexicalBlock(scope: !724, file: !267, line: 84, column: 3)
!724 = distinct !DILexicalBlock(scope: !718, file: !267, line: 84, column: 3)
!725 = !DILocation(line: 84, column: 3, scope: !724, inlinedAt: !655)
!726 = !DILocation(line: 84, column: 3, scope: !727, inlinedAt: !655)
!727 = distinct !DILexicalBlock(scope: !728, file: !267, line: 84, column: 3)
!728 = distinct !DILexicalBlock(scope: !723, file: !267, line: 84, column: 3)
!729 = !DILocation(line: 84, column: 3, scope: !728, inlinedAt: !655)
!730 = !DILocation(line: 84, column: 3, scope: !731, inlinedAt: !655)
!731 = distinct !DILexicalBlock(scope: !727, file: !267, line: 84, column: 3)
!732 = !DILocation(line: 84, column: 3, scope: !733, inlinedAt: !655)
!733 = distinct !DILexicalBlock(scope: !723, file: !267, line: 84, column: 3)
!734 = !DILocation(line: 84, column: 3, scope: !735, inlinedAt: !655)
!735 = distinct !DILexicalBlock(scope: !733, file: !267, line: 84, column: 3)
!736 = !DILocation(line: 84, column: 3, scope: !737, inlinedAt: !655)
!737 = distinct !DILexicalBlock(scope: !738, file: !267, line: 84, column: 3)
!738 = distinct !DILexicalBlock(scope: !735, file: !267, line: 84, column: 3)
!739 = !DILocation(line: 84, column: 3, scope: !738, inlinedAt: !655)
!740 = !DILocation(line: 84, column: 3, scope: !741, inlinedAt: !655)
!741 = distinct !DILexicalBlock(scope: !737, file: !267, line: 84, column: 3)
!742 = !DILocation(line: 85, column: 1, scope: !606, inlinedAt: !655)
!743 = !DILocation(line: 0, scope: !290)
!744 = !DILocation(line: 204, column: 89, scope: !745)
!745 = distinct !DILexicalBlock(scope: !290, file: !267, line: 204, column: 89)
!746 = !DILocation(line: 204, column: 89, scope: !290)
!747 = !DILocalVariable(name: "pythonlib", arg: 1, scope: !748, file: !267, line: 121, type: !53)
!748 = distinct !DISubprogram(name: "PetscPythonLoadLibrary", scope: !267, file: !267, line: 121, type: !749, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{!79, !53}
!751 = !{!747, !752, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !789, !791}
!752 = !DILocalVariable(name: "ierr", scope: !748, file: !267, line: 123, type: !79)
!753 = !DILocalVariable(name: "ierr__", scope: !754, file: !267, line: 127, type: !79)
!754 = distinct !DILexicalBlock(scope: !748, file: !267, line: 127, column: 38)
!755 = !DILocalVariable(name: "ierr__", scope: !756, file: !267, line: 128, type: !79)
!756 = distinct !DILexicalBlock(scope: !748, file: !267, line: 128, column: 76)
!757 = !DILocalVariable(name: "ierr__", scope: !758, file: !267, line: 130, type: !79)
!758 = distinct !DILexicalBlock(scope: !748, file: !267, line: 130, column: 62)
!759 = !DILocalVariable(name: "ierr__", scope: !760, file: !267, line: 131, type: !79)
!760 = distinct !DILexicalBlock(scope: !748, file: !267, line: 131, column: 68)
!761 = !DILocalVariable(name: "ierr__", scope: !762, file: !267, line: 132, type: !79)
!762 = distinct !DILexicalBlock(scope: !748, file: !267, line: 132, column: 71)
!763 = !DILocalVariable(name: "ierr__", scope: !764, file: !267, line: 133, type: !79)
!764 = distinct !DILexicalBlock(scope: !748, file: !267, line: 133, column: 70)
!765 = !DILocalVariable(name: "ierr__", scope: !766, file: !267, line: 134, type: !79)
!766 = distinct !DILexicalBlock(scope: !748, file: !267, line: 134, column: 66)
!767 = !DILocalVariable(name: "ierr__", scope: !768, file: !267, line: 135, type: !79)
!768 = distinct !DILexicalBlock(scope: !748, file: !267, line: 135, column: 70)
!769 = !DILocalVariable(name: "ierr__", scope: !770, file: !267, line: 136, type: !79)
!770 = distinct !DILexicalBlock(scope: !748, file: !267, line: 136, column: 68)
!771 = !DILocalVariable(name: "ierr__", scope: !772, file: !267, line: 137, type: !79)
!772 = distinct !DILexicalBlock(scope: !748, file: !267, line: 137, column: 74)
!773 = !DILocalVariable(name: "ierr__", scope: !774, file: !267, line: 138, type: !79)
!774 = distinct !DILexicalBlock(scope: !748, file: !267, line: 138, column: 76)
!775 = !DILocalVariable(name: "ierr__", scope: !776, file: !267, line: 139, type: !79)
!776 = distinct !DILexicalBlock(scope: !748, file: !267, line: 139, column: 64)
!777 = !DILocalVariable(name: "ierr__", scope: !778, file: !267, line: 140, type: !79)
!778 = distinct !DILexicalBlock(scope: !748, file: !267, line: 140, column: 64)
!779 = !DILocalVariable(name: "ierr__", scope: !780, file: !267, line: 141, type: !79)
!780 = distinct !DILexicalBlock(scope: !748, file: !267, line: 141, column: 66)
!781 = !DILocalVariable(name: "ierr__", scope: !782, file: !267, line: 142, type: !79)
!782 = distinct !DILexicalBlock(scope: !748, file: !267, line: 142, column: 69)
!783 = !DILocalVariable(name: "ierr__", scope: !784, file: !267, line: 143, type: !79)
!784 = distinct !DILexicalBlock(scope: !748, file: !267, line: 143, column: 68)
!785 = !DILocalVariable(name: "ierr__", scope: !786, file: !267, line: 144, type: !79)
!786 = distinct !DILexicalBlock(scope: !748, file: !267, line: 144, column: 81)
!787 = !DILocalVariable(name: "ierr__", scope: !788, file: !267, line: 145, type: !79)
!788 = distinct !DILexicalBlock(scope: !748, file: !267, line: 145, column: 70)
!789 = !DILocalVariable(name: "ierr__", scope: !790, file: !267, line: 146, type: !79)
!790 = distinct !DILexicalBlock(scope: !748, file: !267, line: 146, column: 70)
!791 = !DILocalVariable(name: "ierr__", scope: !792, file: !267, line: 153, type: !79)
!792 = distinct !DILexicalBlock(scope: !748, file: !267, line: 153, column: 108)
!793 = !DILocation(line: 0, scope: !748, inlinedAt: !794)
!794 = distinct !DILocation(line: 207, column: 10, scope: !266)
!795 = !DILocation(line: 125, column: 3, scope: !796, inlinedAt: !794)
!796 = distinct !DILexicalBlock(scope: !797, file: !267, line: 125, column: 3)
!797 = distinct !DILexicalBlock(scope: !798, file: !267, line: 125, column: 3)
!798 = distinct !DILexicalBlock(scope: !748, file: !267, line: 125, column: 3)
!799 = !DILocation(line: 125, column: 3, scope: !797, inlinedAt: !794)
!800 = !DILocation(line: 125, column: 3, scope: !801, inlinedAt: !794)
!801 = distinct !DILexicalBlock(scope: !802, file: !267, line: 125, column: 3)
!802 = distinct !DILexicalBlock(scope: !796, file: !267, line: 125, column: 3)
!803 = !DILocation(line: 125, column: 3, scope: !802, inlinedAt: !794)
!804 = !DILocation(line: 125, column: 3, scope: !805, inlinedAt: !794)
!805 = distinct !DILexicalBlock(scope: !801, file: !267, line: 125, column: 3)
!806 = !DILocation(line: 127, column: 10, scope: !748, inlinedAt: !794)
!807 = !DILocation(line: 0, scope: !754, inlinedAt: !794)
!808 = !DILocation(line: 127, column: 38, scope: !809, inlinedAt: !794)
!809 = distinct !DILexicalBlock(scope: !754, file: !267, line: 127, column: 38)
!810 = !DILocation(line: 127, column: 38, scope: !754, inlinedAt: !794)
!811 = !DILocation(line: 128, column: 10, scope: !748, inlinedAt: !794)
!812 = !DILocation(line: 0, scope: !756, inlinedAt: !794)
!813 = !DILocation(line: 128, column: 76, scope: !814, inlinedAt: !794)
!814 = distinct !DILexicalBlock(scope: !756, file: !267, line: 128, column: 76)
!815 = !DILocation(line: 128, column: 76, scope: !756, inlinedAt: !794)
!816 = !DILocation(line: 130, column: 10, scope: !748, inlinedAt: !794)
!817 = !DILocation(line: 0, scope: !758, inlinedAt: !794)
!818 = !DILocation(line: 130, column: 62, scope: !819, inlinedAt: !794)
!819 = distinct !DILexicalBlock(scope: !758, file: !267, line: 130, column: 62)
!820 = !DILocation(line: 130, column: 62, scope: !758, inlinedAt: !794)
!821 = !DILocation(line: 131, column: 10, scope: !748, inlinedAt: !794)
!822 = !DILocation(line: 0, scope: !760, inlinedAt: !794)
!823 = !DILocation(line: 131, column: 68, scope: !824, inlinedAt: !794)
!824 = distinct !DILexicalBlock(scope: !760, file: !267, line: 131, column: 68)
!825 = !DILocation(line: 131, column: 68, scope: !760, inlinedAt: !794)
!826 = !DILocation(line: 132, column: 10, scope: !748, inlinedAt: !794)
!827 = !DILocation(line: 0, scope: !762, inlinedAt: !794)
!828 = !DILocation(line: 132, column: 71, scope: !829, inlinedAt: !794)
!829 = distinct !DILexicalBlock(scope: !762, file: !267, line: 132, column: 71)
!830 = !DILocation(line: 132, column: 71, scope: !762, inlinedAt: !794)
!831 = !DILocation(line: 133, column: 10, scope: !748, inlinedAt: !794)
!832 = !DILocation(line: 0, scope: !764, inlinedAt: !794)
!833 = !DILocation(line: 133, column: 70, scope: !834, inlinedAt: !794)
!834 = distinct !DILexicalBlock(scope: !764, file: !267, line: 133, column: 70)
!835 = !DILocation(line: 133, column: 70, scope: !764, inlinedAt: !794)
!836 = !DILocation(line: 134, column: 10, scope: !748, inlinedAt: !794)
!837 = !DILocation(line: 0, scope: !766, inlinedAt: !794)
!838 = !DILocation(line: 134, column: 66, scope: !839, inlinedAt: !794)
!839 = distinct !DILexicalBlock(scope: !766, file: !267, line: 134, column: 66)
!840 = !DILocation(line: 134, column: 66, scope: !766, inlinedAt: !794)
!841 = !DILocation(line: 135, column: 10, scope: !748, inlinedAt: !794)
!842 = !DILocation(line: 0, scope: !768, inlinedAt: !794)
!843 = !DILocation(line: 135, column: 70, scope: !844, inlinedAt: !794)
!844 = distinct !DILexicalBlock(scope: !768, file: !267, line: 135, column: 70)
!845 = !DILocation(line: 135, column: 70, scope: !768, inlinedAt: !794)
!846 = !DILocation(line: 136, column: 10, scope: !748, inlinedAt: !794)
!847 = !DILocation(line: 0, scope: !770, inlinedAt: !794)
!848 = !DILocation(line: 136, column: 68, scope: !849, inlinedAt: !794)
!849 = distinct !DILexicalBlock(scope: !770, file: !267, line: 136, column: 68)
!850 = !DILocation(line: 136, column: 68, scope: !770, inlinedAt: !794)
!851 = !DILocation(line: 137, column: 10, scope: !748, inlinedAt: !794)
!852 = !DILocation(line: 0, scope: !772, inlinedAt: !794)
!853 = !DILocation(line: 137, column: 74, scope: !854, inlinedAt: !794)
!854 = distinct !DILexicalBlock(scope: !772, file: !267, line: 137, column: 74)
!855 = !DILocation(line: 137, column: 74, scope: !772, inlinedAt: !794)
!856 = !DILocation(line: 138, column: 10, scope: !748, inlinedAt: !794)
!857 = !DILocation(line: 0, scope: !774, inlinedAt: !794)
!858 = !DILocation(line: 138, column: 76, scope: !859, inlinedAt: !794)
!859 = distinct !DILexicalBlock(scope: !774, file: !267, line: 138, column: 76)
!860 = !DILocation(line: 138, column: 76, scope: !774, inlinedAt: !794)
!861 = !DILocation(line: 139, column: 10, scope: !748, inlinedAt: !794)
!862 = !DILocation(line: 0, scope: !776, inlinedAt: !794)
!863 = !DILocation(line: 139, column: 64, scope: !864, inlinedAt: !794)
!864 = distinct !DILexicalBlock(scope: !776, file: !267, line: 139, column: 64)
!865 = !DILocation(line: 139, column: 64, scope: !776, inlinedAt: !794)
!866 = !DILocation(line: 140, column: 10, scope: !748, inlinedAt: !794)
!867 = !DILocation(line: 0, scope: !778, inlinedAt: !794)
!868 = !DILocation(line: 140, column: 64, scope: !869, inlinedAt: !794)
!869 = distinct !DILexicalBlock(scope: !778, file: !267, line: 140, column: 64)
!870 = !DILocation(line: 140, column: 64, scope: !778, inlinedAt: !794)
!871 = !DILocation(line: 141, column: 10, scope: !748, inlinedAt: !794)
!872 = !DILocation(line: 0, scope: !780, inlinedAt: !794)
!873 = !DILocation(line: 141, column: 66, scope: !874, inlinedAt: !794)
!874 = distinct !DILexicalBlock(scope: !780, file: !267, line: 141, column: 66)
!875 = !DILocation(line: 141, column: 66, scope: !780, inlinedAt: !794)
!876 = !DILocation(line: 142, column: 10, scope: !748, inlinedAt: !794)
!877 = !DILocation(line: 0, scope: !782, inlinedAt: !794)
!878 = !DILocation(line: 142, column: 69, scope: !879, inlinedAt: !794)
!879 = distinct !DILexicalBlock(scope: !782, file: !267, line: 142, column: 69)
!880 = !DILocation(line: 142, column: 69, scope: !782, inlinedAt: !794)
!881 = !DILocation(line: 143, column: 10, scope: !748, inlinedAt: !794)
!882 = !DILocation(line: 0, scope: !784, inlinedAt: !794)
!883 = !DILocation(line: 143, column: 68, scope: !884, inlinedAt: !794)
!884 = distinct !DILexicalBlock(scope: !784, file: !267, line: 143, column: 68)
!885 = !DILocation(line: 143, column: 68, scope: !784, inlinedAt: !794)
!886 = !DILocation(line: 144, column: 10, scope: !748, inlinedAt: !794)
!887 = !DILocation(line: 0, scope: !786, inlinedAt: !794)
!888 = !DILocation(line: 144, column: 81, scope: !889, inlinedAt: !794)
!889 = distinct !DILexicalBlock(scope: !786, file: !267, line: 144, column: 81)
!890 = !DILocation(line: 144, column: 81, scope: !786, inlinedAt: !794)
!891 = !DILocation(line: 145, column: 10, scope: !748, inlinedAt: !794)
!892 = !DILocation(line: 0, scope: !788, inlinedAt: !794)
!893 = !DILocation(line: 145, column: 70, scope: !894, inlinedAt: !794)
!894 = distinct !DILexicalBlock(scope: !788, file: !267, line: 145, column: 70)
!895 = !DILocation(line: 145, column: 70, scope: !788, inlinedAt: !794)
!896 = !DILocation(line: 146, column: 10, scope: !748, inlinedAt: !794)
!897 = !DILocation(line: 0, scope: !790, inlinedAt: !794)
!898 = !DILocation(line: 146, column: 70, scope: !899, inlinedAt: !794)
!899 = distinct !DILexicalBlock(scope: !790, file: !267, line: 146, column: 70)
!900 = !DILocation(line: 146, column: 70, scope: !790, inlinedAt: !794)
!901 = !DILocation(line: 148, column: 8, scope: !902, inlinedAt: !794)
!902 = distinct !DILexicalBlock(scope: !748, file: !267, line: 148, column: 7)
!903 = !DILocation(line: 148, column: 7, scope: !748, inlinedAt: !794)
!904 = !DILocation(line: 148, column: 26, scope: !902, inlinedAt: !794)
!905 = !DILocation(line: 149, column: 8, scope: !906, inlinedAt: !794)
!906 = distinct !DILexicalBlock(scope: !748, file: !267, line: 149, column: 7)
!907 = !DILocation(line: 149, column: 7, scope: !748, inlinedAt: !794)
!908 = !DILocation(line: 149, column: 26, scope: !906, inlinedAt: !794)
!909 = !DILocation(line: 150, column: 8, scope: !910, inlinedAt: !794)
!910 = distinct !DILexicalBlock(scope: !748, file: !267, line: 150, column: 7)
!911 = !DILocation(line: 150, column: 7, scope: !748, inlinedAt: !794)
!912 = !DILocation(line: 150, column: 26, scope: !910, inlinedAt: !794)
!913 = !DILocation(line: 151, column: 8, scope: !914, inlinedAt: !794)
!914 = distinct !DILexicalBlock(scope: !748, file: !267, line: 151, column: 7)
!915 = !DILocation(line: 151, column: 7, scope: !748, inlinedAt: !794)
!916 = !DILocation(line: 151, column: 26, scope: !914, inlinedAt: !794)
!917 = !DILocation(line: 152, column: 8, scope: !918, inlinedAt: !794)
!918 = distinct !DILexicalBlock(scope: !748, file: !267, line: 152, column: 7)
!919 = !DILocation(line: 152, column: 7, scope: !748, inlinedAt: !794)
!920 = !DILocation(line: 152, column: 26, scope: !918, inlinedAt: !794)
!921 = !DILocation(line: 153, column: 10, scope: !748, inlinedAt: !794)
!922 = !DILocation(line: 0, scope: !792, inlinedAt: !794)
!923 = !DILocation(line: 153, column: 108, scope: !924, inlinedAt: !794)
!924 = distinct !DILexicalBlock(scope: !792, file: !267, line: 153, column: 108)
!925 = !DILocation(line: 153, column: 108, scope: !792, inlinedAt: !794)
!926 = !DILocation(line: 154, column: 3, scope: !927, inlinedAt: !794)
!927 = distinct !DILexicalBlock(scope: !928, file: !267, line: 154, column: 3)
!928 = distinct !DILexicalBlock(scope: !929, file: !267, line: 154, column: 3)
!929 = distinct !DILexicalBlock(scope: !748, file: !267, line: 154, column: 3)
!930 = !DILocation(line: 154, column: 3, scope: !928, inlinedAt: !794)
!931 = !DILocation(line: 154, column: 3, scope: !932, inlinedAt: !794)
!932 = distinct !DILexicalBlock(scope: !933, file: !267, line: 154, column: 3)
!933 = distinct !DILexicalBlock(scope: !927, file: !267, line: 154, column: 3)
!934 = !DILocation(line: 154, column: 3, scope: !933, inlinedAt: !794)
!935 = !DILocation(line: 154, column: 3, scope: !936, inlinedAt: !794)
!936 = distinct !DILexicalBlock(scope: !937, file: !267, line: 154, column: 3)
!937 = distinct !DILexicalBlock(scope: !932, file: !267, line: 154, column: 3)
!938 = !DILocation(line: 154, column: 3, scope: !937, inlinedAt: !794)
!939 = !DILocation(line: 154, column: 3, scope: !940, inlinedAt: !794)
!940 = distinct !DILexicalBlock(scope: !936, file: !267, line: 154, column: 3)
!941 = !DILocation(line: 154, column: 3, scope: !942, inlinedAt: !794)
!942 = distinct !DILexicalBlock(scope: !932, file: !267, line: 154, column: 3)
!943 = !DILocation(line: 154, column: 3, scope: !944, inlinedAt: !794)
!944 = distinct !DILexicalBlock(scope: !942, file: !267, line: 154, column: 3)
!945 = !DILocation(line: 154, column: 3, scope: !946, inlinedAt: !794)
!946 = distinct !DILexicalBlock(scope: !947, file: !267, line: 154, column: 3)
!947 = distinct !DILexicalBlock(scope: !944, file: !267, line: 154, column: 3)
!948 = !DILocation(line: 154, column: 3, scope: !947, inlinedAt: !794)
!949 = !DILocation(line: 154, column: 3, scope: !950, inlinedAt: !794)
!950 = distinct !DILexicalBlock(scope: !946, file: !267, line: 154, column: 3)
!951 = !DILocation(line: 0, scope: !293)
!952 = !DILocation(line: 207, column: 49, scope: !953)
!953 = distinct !DILexicalBlock(scope: !293, file: !267, line: 207, column: 49)
!954 = !DILocation(line: 207, column: 49, scope: !293)
!955 = !DILocation(line: 209, column: 20, scope: !266)
!956 = !DILocation(line: 210, column: 8, scope: !296)
!957 = !DILocation(line: 210, column: 7, scope: !266)
!958 = !DILocation(line: 214, column: 5, scope: !295)
!959 = !DILocation(line: 214, column: 22, scope: !295)
!960 = !DILocation(line: 217, column: 5, scope: !295)
!961 = !DILocation(line: 219, column: 18, scope: !295)
!962 = !DILocation(line: 0, scope: !295)
!963 = !DILocation(line: 220, column: 9, scope: !304)
!964 = !DILocation(line: 220, column: 23, scope: !304)
!965 = !DILocation(line: 220, column: 9, scope: !295)
!966 = !DILocation(line: 0, scope: !303)
!967 = !DILocation(line: 221, column: 21, scope: !303)
!968 = !DILocation(line: 221, column: 27, scope: !303)
!969 = !DILocation(line: 222, column: 7, scope: !303)
!970 = !DILocation(line: 223, column: 5, scope: !304)
!971 = !DILocation(line: 224, column: 9, scope: !309)
!972 = !DILocation(line: 223, column: 5, scope: !303)
!973 = !DILocation(line: 224, column: 23, scope: !309)
!974 = !DILocation(line: 224, column: 9, scope: !295)
!975 = !DILocation(line: 0, scope: !308)
!976 = !DILocation(line: 225, column: 21, scope: !308)
!977 = !DILocation(line: 225, column: 30, scope: !308)
!978 = !DILocation(line: 226, column: 7, scope: !308)
!979 = !DILocation(line: 227, column: 5, scope: !309)
!980 = !DILocation(line: 227, column: 5, scope: !308)
!981 = !DILocation(line: 229, column: 16, scope: !295)
!982 = !DILocation(line: 230, column: 9, scope: !317)
!983 = !DILocation(line: 230, column: 9, scope: !295)
!984 = !DILocation(line: 231, column: 14, scope: !316)
!985 = !DILocation(line: 0, scope: !315)
!986 = !DILocation(line: 231, column: 84, scope: !987)
!987 = distinct !DILexicalBlock(scope: !315, file: !267, line: 231, column: 84)
!988 = !DILocation(line: 231, column: 84, scope: !315)
!989 = !DILocation(line: 232, column: 7, scope: !316)
!990 = !DILocation(line: 232, column: 17, scope: !316)
!991 = !DILocation(line: 241, column: 5, scope: !316)
!992 = !DILocation(line: 243, column: 10, scope: !321)
!993 = !DILocation(line: 243, column: 9, scope: !295)
!994 = !DILocation(line: 244, column: 14, scope: !320)
!995 = !DILocation(line: 0, scope: !319)
!996 = !DILocation(line: 244, column: 57, scope: !997)
!997 = distinct !DILexicalBlock(scope: !319, file: !267, line: 244, column: 57)
!998 = !DILocation(line: 244, column: 57, scope: !319)
!999 = !DILocation(line: 245, column: 18, scope: !320)
!1000 = !DILocation(line: 246, column: 5, scope: !320)
!1001 = !DILocation(line: 248, column: 3, scope: !296)
!1002 = !DILocation(line: 247, column: 22, scope: !295)
!1003 = !DILocation(line: 250, column: 12, scope: !266)
!1004 = !DILocation(line: 251, column: 7, scope: !325)
!1005 = !DILocation(line: 251, column: 7, scope: !266)
!1006 = !DILocation(line: 252, column: 12, scope: !324)
!1007 = !DILocation(line: 0, scope: !323)
!1008 = !DILocation(line: 252, column: 87, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !323, file: !267, line: 252, column: 87)
!1010 = !DILocation(line: 252, column: 87, scope: !323)
!1011 = !DILocation(line: 254, column: 5, scope: !324)
!1012 = !DILocation(line: 259, column: 3, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !267, line: 259, column: 3)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !267, line: 259, column: 3)
!1015 = distinct !DILexicalBlock(scope: !266, file: !267, line: 259, column: 3)
!1016 = !DILocation(line: 259, column: 3, scope: !1014)
!1017 = !DILocation(line: 256, column: 5, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !325, file: !267, line: 255, column: 10)
!1019 = !DILocation(line: 257, column: 5, scope: !1018)
!1020 = !DILocation(line: 259, column: 3, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !267, line: 259, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1013, file: !267, line: 259, column: 3)
!1023 = !DILocation(line: 259, column: 3, scope: !1022)
!1024 = !DILocation(line: 259, column: 3, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !267, line: 259, column: 3)
!1026 = distinct !DILexicalBlock(scope: !1021, file: !267, line: 259, column: 3)
!1027 = !DILocation(line: 259, column: 3, scope: !1026)
!1028 = !DILocation(line: 259, column: 3, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1025, file: !267, line: 259, column: 3)
!1030 = !DILocation(line: 259, column: 3, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1021, file: !267, line: 259, column: 3)
!1032 = !DILocation(line: 259, column: 3, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1031, file: !267, line: 259, column: 3)
!1034 = !DILocation(line: 259, column: 3, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !267, line: 259, column: 3)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !267, line: 259, column: 3)
!1037 = !DILocation(line: 259, column: 3, scope: !1036)
!1038 = !DILocation(line: 259, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !267, line: 259, column: 3)
!1040 = !DILocation(line: 260, column: 1, scope: !266)
!1041 = !DISubprogram(name: "PetscStrncpy", scope: !1042, file: !1042, line: 1353, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1042 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!61, !62, !53, !230}
!1045 = !DISubprogram(name: "PetscError", scope: !12, file: !12, line: 668, type: !1046, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!79, !58, !61, !53, !53, !61, !11, !53, null}
!1048 = !DISubprogram(name: "PetscStrreplace", scope: !1042, file: !1042, line: 1368, type: !1049, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!61, !58, !53, !62, !230}
!1051 = !DISubprogram(name: "PetscRegisterFinalize", scope: !1042, file: !1042, line: 1509, type: !1052, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!61, !338}
!1054 = !DISubprogram(name: "PetscInfo_Private", scope: !1055, file: !1055, line: 11, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1055 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!79, !53, !64, !53, null}
!1058 = distinct !DISubprogram(name: "PetscPythonPrintError", scope: !267, file: !267, line: 268, type: !409, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DILocalVariable(name: "exc", scope: !1058, file: !267, line: 270, type: !274)
!1061 = !DILocalVariable(name: "val", scope: !1058, file: !267, line: 270, type: !274)
!1062 = !DILocalVariable(name: "tb", scope: !1058, file: !267, line: 270, type: !274)
!1063 = !DILocation(line: 270, column: 3, scope: !1058)
!1064 = !DILocation(line: 0, scope: !1058)
!1065 = !DILocation(line: 270, column: 13, scope: !1058)
!1066 = !DILocation(line: 270, column: 24, scope: !1058)
!1067 = !DILocation(line: 270, column: 35, scope: !1058)
!1068 = !DILocation(line: 272, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !267, line: 272, column: 3)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !267, line: 272, column: 3)
!1071 = distinct !DILexicalBlock(scope: !1058, file: !267, line: 272, column: 3)
!1072 = !DILocation(line: 272, column: 3, scope: !1070)
!1073 = !DILocation(line: 272, column: 3, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !267, line: 272, column: 3)
!1075 = distinct !DILexicalBlock(scope: !1069, file: !267, line: 272, column: 3)
!1076 = !DILocation(line: 272, column: 3, scope: !1075)
!1077 = !DILocation(line: 272, column: 3, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !267, line: 272, column: 3)
!1079 = !DILocation(line: 273, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1058, file: !267, line: 273, column: 7)
!1081 = !DILocation(line: 273, column: 7, scope: !1058)
!1082 = !DILocation(line: 273, column: 26, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !267, line: 273, column: 26)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !267, line: 273, column: 26)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !267, line: 273, column: 26)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !267, line: 273, column: 26)
!1087 = distinct !DILexicalBlock(scope: !1080, file: !267, line: 273, column: 26)
!1088 = !DILocation(line: 273, column: 26, scope: !1084)
!1089 = !DILocation(line: 273, column: 26, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !267, line: 273, column: 26)
!1091 = distinct !DILexicalBlock(scope: !1083, file: !267, line: 273, column: 26)
!1092 = !DILocation(line: 273, column: 26, scope: !1091)
!1093 = !DILocation(line: 273, column: 26, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !267, line: 273, column: 26)
!1095 = !DILocation(line: 273, column: 26, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1083, file: !267, line: 273, column: 26)
!1097 = !DILocation(line: 273, column: 26, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1096, file: !267, line: 273, column: 26)
!1099 = !DILocation(line: 273, column: 26, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !267, line: 273, column: 26)
!1101 = distinct !DILexicalBlock(scope: !1098, file: !267, line: 273, column: 26)
!1102 = !DILocation(line: 273, column: 26, scope: !1101)
!1103 = !DILocation(line: 273, column: 26, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !267, line: 273, column: 26)
!1105 = !DILocation(line: 274, column: 8, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1058, file: !267, line: 274, column: 7)
!1107 = !DILocation(line: 274, column: 7, scope: !1058)
!1108 = !DILocation(line: 274, column: 26, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !267, line: 274, column: 26)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !267, line: 274, column: 26)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !267, line: 274, column: 26)
!1112 = !DILocation(line: 274, column: 26, scope: !1110)
!1113 = !DILocation(line: 274, column: 26, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !267, line: 274, column: 26)
!1115 = distinct !DILexicalBlock(scope: !1109, file: !267, line: 274, column: 26)
!1116 = !DILocation(line: 274, column: 26, scope: !1115)
!1117 = !DILocation(line: 274, column: 26, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !267, line: 274, column: 26)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !267, line: 274, column: 26)
!1120 = !DILocation(line: 274, column: 26, scope: !1119)
!1121 = !DILocation(line: 274, column: 26, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1118, file: !267, line: 274, column: 26)
!1123 = !DILocation(line: 274, column: 26, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1114, file: !267, line: 274, column: 26)
!1125 = !DILocation(line: 274, column: 26, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1124, file: !267, line: 274, column: 26)
!1127 = !DILocation(line: 274, column: 26, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !267, line: 274, column: 26)
!1129 = distinct !DILexicalBlock(scope: !1126, file: !267, line: 274, column: 26)
!1130 = !DILocation(line: 274, column: 26, scope: !1129)
!1131 = !DILocation(line: 274, column: 26, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !267, line: 274, column: 26)
!1133 = !DILocation(line: 275, column: 3, scope: !1058)
!1134 = !DILocation(line: 276, column: 3, scope: !1058)
!1135 = !DILocation(line: 277, column: 3, scope: !1058)
!1136 = !DILocation(line: 277, column: 17, scope: !1058)
!1137 = !DILocation(line: 277, column: 38, scope: !1058)
!1138 = !DILocation(line: 277, column: 59, scope: !1058)
!1139 = !DILocation(line: 278, column: 3, scope: !1058)
!1140 = !DILocation(line: 278, column: 17, scope: !1058)
!1141 = !DILocation(line: 278, column: 21, scope: !1058)
!1142 = !DILocation(line: 278, column: 25, scope: !1058)
!1143 = !DILocation(line: 279, column: 3, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !267, line: 279, column: 3)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !267, line: 279, column: 3)
!1146 = distinct !DILexicalBlock(scope: !1058, file: !267, line: 279, column: 3)
!1147 = !DILocation(line: 279, column: 3, scope: !1145)
!1148 = !DILocation(line: 279, column: 3, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !267, line: 279, column: 3)
!1150 = distinct !DILexicalBlock(scope: !1144, file: !267, line: 279, column: 3)
!1151 = !DILocation(line: 279, column: 3, scope: !1150)
!1152 = !DILocation(line: 279, column: 3, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !267, line: 279, column: 3)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !267, line: 279, column: 3)
!1155 = !DILocation(line: 279, column: 3, scope: !1154)
!1156 = !DILocation(line: 279, column: 3, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !267, line: 279, column: 3)
!1158 = !DILocation(line: 279, column: 3, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1149, file: !267, line: 279, column: 3)
!1160 = !DILocation(line: 279, column: 3, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1159, file: !267, line: 279, column: 3)
!1162 = !DILocation(line: 279, column: 3, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !267, line: 279, column: 3)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !267, line: 279, column: 3)
!1165 = !DILocation(line: 279, column: 3, scope: !1164)
!1166 = !DILocation(line: 279, column: 3, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !267, line: 279, column: 3)
!1168 = !DILocation(line: 280, column: 1, scope: !1058)
!1169 = distinct !DISubprogram(name: "PetscPythonMonitorSet", scope: !267, file: !267, line: 293, type: !329, scopeLine: 294, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1178}
!1171 = !DILocalVariable(name: "obj", arg: 1, scope: !1169, file: !267, line: 293, type: !63)
!1172 = !DILocalVariable(name: "url", arg: 2, scope: !1169, file: !267, line: 293, type: !53)
!1173 = !DILocalVariable(name: "ierr", scope: !1169, file: !267, line: 295, type: !79)
!1174 = !DILocalVariable(name: "ierr__", scope: !1175, file: !267, line: 301, type: !79)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !267, line: 301, column: 45)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !267, line: 300, column: 33)
!1177 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 300, column: 7)
!1178 = !DILocalVariable(name: "ierr__", scope: !1179, file: !267, line: 304, type: !79)
!1179 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 304, column: 43)
!1180 = !DILocation(line: 0, scope: !1169)
!1181 = !DILocation(line: 297, column: 3, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !267, line: 297, column: 3)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !267, line: 297, column: 3)
!1184 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 297, column: 3)
!1185 = !DILocation(line: 297, column: 3, scope: !1183)
!1186 = !DILocation(line: 297, column: 3, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !267, line: 297, column: 3)
!1188 = distinct !DILexicalBlock(scope: !1182, file: !267, line: 297, column: 3)
!1189 = !DILocation(line: 297, column: 3, scope: !1188)
!1190 = !DILocation(line: 297, column: 3, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1187, file: !267, line: 297, column: 3)
!1192 = !DILocation(line: 298, column: 3, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !267, line: 298, column: 3)
!1194 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 298, column: 3)
!1195 = !DILocation(line: 298, column: 3, scope: !1194)
!1196 = !DILocation(line: 298, column: 3, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !267, line: 298, column: 3)
!1198 = !DILocation(line: 298, column: 3, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1194, file: !267, line: 298, column: 3)
!1200 = !{!1201, !426, i64 0}
!1201 = !{!"_p_PetscObject", !426, i64 0, !418, i64 8, !417, i64 64, !426, i64 72, !1202, i64 80, !1202, i64 88, !1202, i64 96, !1202, i64 104, !1203, i64 112, !426, i64 120, !426, i64 124, !417, i64 128, !417, i64 136, !417, i64 144, !417, i64 152, !417, i64 160, !417, i64 168, !417, i64 176, !1203, i64 184, !417, i64 192, !417, i64 200, !426, i64 208, !417, i64 216, !1203, i64 224, !426, i64 232, !426, i64 236, !417, i64 240, !417, i64 248, !417, i64 256, !417, i64 264, !426, i64 272, !426, i64 276, !417, i64 280, !417, i64 288, !417, i64 296, !417, i64 304, !426, i64 312, !426, i64 316, !417, i64 320, !417, i64 328, !417, i64 336, !417, i64 344, !417, i64 352, !426, i64 360, !418, i64 368, !418, i64 384, !417, i64 392, !417, i64 400, !426, i64 408, !418, i64 416, !418, i64 456, !418, i64 496, !418, i64 536, !417, i64 544, !418, i64 552}
!1202 = !{!"double", !418, i64 0}
!1203 = !{!"long", !418, i64 0}
!1204 = !DILocation(line: 298, column: 3, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1199, file: !267, line: 298, column: 3)
!1206 = !DILocation(line: 299, column: 3, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !267, line: 299, column: 3)
!1208 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 299, column: 3)
!1209 = !DILocation(line: 299, column: 3, scope: !1208)
!1210 = !DILocation(line: 299, column: 3, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1208, file: !267, line: 299, column: 3)
!1212 = !DILocation(line: 300, column: 8, scope: !1177)
!1213 = !DILocation(line: 300, column: 7, scope: !1169)
!1214 = !DILocation(line: 301, column: 12, scope: !1176)
!1215 = !DILocation(line: 0, scope: !1175)
!1216 = !DILocation(line: 301, column: 45, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1175, file: !267, line: 301, column: 45)
!1218 = !DILocation(line: 301, column: 45, scope: !1175)
!1219 = !DILocation(line: 302, column: 10, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1176, file: !267, line: 302, column: 9)
!1221 = !DILocation(line: 302, column: 9, scope: !1176)
!1222 = !DILocation(line: 302, column: 35, scope: !1220)
!1223 = !DILocation(line: 304, column: 10, scope: !1169)
!1224 = !DILocation(line: 0, scope: !1179)
!1225 = !DILocation(line: 304, column: 43, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1179, file: !267, line: 304, column: 43)
!1227 = !DILocation(line: 304, column: 43, scope: !1179)
!1228 = !DILocation(line: 305, column: 3, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1230, file: !267, line: 305, column: 3)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !267, line: 305, column: 3)
!1231 = distinct !DILexicalBlock(scope: !1169, file: !267, line: 305, column: 3)
!1232 = !DILocation(line: 305, column: 3, scope: !1230)
!1233 = !DILocation(line: 305, column: 3, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !267, line: 305, column: 3)
!1235 = distinct !DILexicalBlock(scope: !1229, file: !267, line: 305, column: 3)
!1236 = !DILocation(line: 305, column: 3, scope: !1235)
!1237 = !DILocation(line: 305, column: 3, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !267, line: 305, column: 3)
!1239 = distinct !DILexicalBlock(scope: !1234, file: !267, line: 305, column: 3)
!1240 = !DILocation(line: 305, column: 3, scope: !1239)
!1241 = !DILocation(line: 305, column: 3, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1238, file: !267, line: 305, column: 3)
!1243 = !DILocation(line: 305, column: 3, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1234, file: !267, line: 305, column: 3)
!1245 = !DILocation(line: 305, column: 3, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1244, file: !267, line: 305, column: 3)
!1247 = !DILocation(line: 305, column: 3, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !267, line: 305, column: 3)
!1249 = distinct !DILexicalBlock(scope: !1246, file: !267, line: 305, column: 3)
!1250 = !DILocation(line: 305, column: 3, scope: !1249)
!1251 = !DILocation(line: 305, column: 3, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1248, file: !267, line: 305, column: 3)
!1253 = !DILocation(line: 306, column: 1, scope: !1169)
!1254 = !DISubprogram(name: "PetscCheckPointer", scope: !66, file: !66, line: 183, type: !1255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!5, !1257, !32}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1259 = !DISubprogram(name: "PetscOptionsGetString", scope: !18, file: !18, line: 26, type: !1260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !411)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!61, !248, !53, !53, !62, !230, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1263 = distinct !DISubprogram(name: "PetscPythonFindLibraryName", scope: !267, file: !267, line: 27, type: !1264, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1267)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!79, !53, !53, !62, !228, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1277, !1330, !1331, !1332, !1334, !1336, !1338, !1340, !1342, !1344}
!1268 = !DILocalVariable(name: "pythonexe", arg: 1, scope: !1263, file: !267, line: 27, type: !53)
!1269 = !DILocalVariable(name: "attempt", arg: 2, scope: !1263, file: !267, line: 27, type: !53)
!1270 = !DILocalVariable(name: "pythonlib", arg: 3, scope: !1263, file: !267, line: 27, type: !62)
