; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/absolute.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/absolute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_VecTagger = type { %struct._p_PetscObject, [1 x %struct._VecTaggerOps], i8*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 155, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !{!69, !73, !74, !77, !92}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !70, line: 330, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !70, line: 330, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger_Simple", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/utils/tagger/impls/simple.h", directory: "/home/users/ndemeye/xSDK")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 5, size: 64, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !80, file: !79, line: 6, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !25, line: 768, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 765, size: 128, elements: !86)
!86 = !{!87, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !85, file: !25, line: 766, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !90)
!90 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !85, file: !25, line: 767, baseType: !88, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !{i32 7, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 4}
!98 = !{i32 7, !"PIC Level", i32 2}
!99 = !{i32 7, !"uwtable", i32 1}
!100 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!101 = distinct !DISubprogram(name: "VecTaggerAbsoluteSetBox", scope: !102, file: !102, line: 37, type: !103, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !638)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/absolute.c", directory: "/home/users/ndemeye/xSDK")
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !107, !83}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !106)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !25, line: 721, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !110, line: 339, size: 5120, elements: !111)
!110 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!111 = !{!112, !307, !634, !635, !636, !637}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !109, file: !110, line: 340, baseType: !113, size: 4480)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !114, line: 122, baseType: !115)
!114 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !114, line: 73, size: 4480, elements: !116)
!116 = !{!117, !119, !166, !167, !169, !171, !172, !173, !174, !182, !183, !185, !189, !193, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206, !207, !208, !210, !211, !213, !215, !216, !217, !218, !219, !221, !223, !224, !225, !226, !227, !229, !231, !232, !233, !243, !245, !246, !250, !251, !297, !302, !304, !305, !306}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !115, file: !114, line: 74, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !106)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !115, file: !114, line: 75, baseType: !120, size: 448, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 448, elements: !164)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !114, line: 53, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 45, size: 448, elements: !123)
!123 = !{!124, !131, !139, !144, !148, !152, !159}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !122, file: !114, line: 46, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!105, !128, !130}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !122, file: !114, line: 47, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!105, !128, !135}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !136, line: 16, baseType: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !136, line: 16, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !122, file: !114, line: 48, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!105, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !122, file: !114, line: 49, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!105, !128, !74, !128}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !122, file: !114, line: 50, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!105, !128, !74, !143}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !122, file: !114, line: 51, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!105, !128, !74, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !122, file: !114, line: 52, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!105, !128, !74, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !115, file: !114, line: 76, baseType: !69, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !114, line: 77, baseType: !168, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !106)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !115, file: !114, line: 78, baseType: !170, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !90)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !115, file: !114, line: 78, baseType: !170, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !115, file: !114, line: 78, baseType: !170, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !115, file: !114, line: 78, baseType: !170, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !114, line: 79, baseType: !175, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !178, line: 27, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !180, line: 43, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !115, file: !114, line: 80, baseType: !168, size: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !115, file: !114, line: 81, baseType: !184, size: 32, offset: 992)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !106)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !115, file: !114, line: 82, baseType: !186, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !115, file: !114, line: 83, baseType: !190, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !115, file: !114, line: 84, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !115, file: !114, line: 85, baseType: !194, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !115, file: !114, line: 86, baseType: !194, size: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !115, file: !114, line: 87, baseType: !194, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !115, file: !114, line: 88, baseType: !128, size: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !115, file: !114, line: 89, baseType: !175, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !114, line: 90, baseType: !194, size: 64, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !115, file: !114, line: 91, baseType: !194, size: 64, offset: 1600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !115, file: !114, line: 92, baseType: !168, size: 32, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !115, file: !114, line: 93, baseType: !73, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !115, file: !114, line: 94, baseType: !205, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !115, file: !114, line: 95, baseType: !168, size: 32, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !115, file: !114, line: 95, baseType: !168, size: 32, offset: 1888)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !115, file: !114, line: 96, baseType: !209, size: 64, offset: 1920)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !115, file: !114, line: 96, baseType: !209, size: 64, offset: 1984)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !115, file: !114, line: 97, baseType: !212, size: 64, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !115, file: !114, line: 97, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !115, file: !114, line: 98, baseType: !168, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !115, file: !114, line: 98, baseType: !168, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !115, file: !114, line: 99, baseType: !209, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !115, file: !114, line: 99, baseType: !209, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !115, file: !114, line: 100, baseType: !220, size: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !115, file: !114, line: 100, baseType: !222, size: 64, offset: 2432)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !115, file: !114, line: 101, baseType: !168, size: 32, offset: 2496)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !115, file: !114, line: 101, baseType: !168, size: 32, offset: 2528)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !115, file: !114, line: 102, baseType: !209, size: 64, offset: 2560)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !115, file: !114, line: 102, baseType: !209, size: 64, offset: 2624)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !115, file: !114, line: 103, baseType: !228, size: 64, offset: 2688)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !115, file: !114, line: 103, baseType: !230, size: 64, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !115, file: !114, line: 104, baseType: !163, size: 64, offset: 2816)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !115, file: !114, line: 105, baseType: !168, size: 32, offset: 2880)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !115, file: !114, line: 106, baseType: !234, size: 128, offset: 2944)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !241)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !114, line: 64, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 61, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !237, file: !114, line: 62, baseType: !156, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !237, file: !114, line: 63, baseType: !73, size: 64, offset: 64)
!241 = !{!242}
!242 = !DISubrange(count: 2)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !115, file: !114, line: 107, baseType: !244, size: 64, offset: 3072)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !241)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !115, file: !114, line: 108, baseType: !73, size: 64, offset: 3136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !115, file: !114, line: 109, baseType: !247, size: 64, offset: 3200)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!105, !73}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !115, file: !114, line: 111, baseType: !168, size: 32, offset: 3264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !115, file: !114, line: 112, baseType: !252, size: 320, offset: 3328)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !295)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!105, !256, !128, !73}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !259)
!259 = !{!260, !261, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !258, file: !10, line: 100, baseType: !168, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !10, line: 101, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !273, !274, !275, !276, !278, !280, !281, !282}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !264, file: !10, line: 84, baseType: !194, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !264, file: !10, line: 85, baseType: !194, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !10, line: 86, baseType: !73, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !264, file: !10, line: 87, baseType: !186, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !264, file: !10, line: 88, baseType: !271, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !264, file: !10, line: 89, baseType: !76, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !264, file: !10, line: 90, baseType: !194, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !264, file: !10, line: 91, baseType: !92, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !264, file: !10, line: 92, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !10, line: 93, baseType: !279, size: 32, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 94, baseType: !262, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !264, file: !10, line: 95, baseType: !194, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !264, file: !10, line: 96, baseType: !73, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !10, line: 102, baseType: !194, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !258, file: !10, line: 102, baseType: !194, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !258, file: !10, line: 103, baseType: !194, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !258, file: !10, line: 104, baseType: !69, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !258, file: !10, line: 105, baseType: !277, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !258, file: !10, line: 105, baseType: !277, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !258, file: !10, line: 105, baseType: !277, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !258, file: !10, line: 106, baseType: !128, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !258, file: !10, line: 107, baseType: !292, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!295 = !{!296}
!296 = !DISubrange(count: 5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !115, file: !114, line: 113, baseType: !298, size: 320, offset: 3648)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!105, !128, !73}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !115, file: !114, line: 114, baseType: !303, size: 320, offset: 3968)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 320, elements: !295)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !115, file: !114, line: 115, baseType: !277, size: 32, offset: 4288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !115, file: !114, line: 120, baseType: !292, size: 64, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !115, file: !114, line: 121, baseType: !277, size: 32, offset: 4416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !109, file: !110, line: 340, baseType: !308, size: 448, offset: 4480)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 448, elements: !164)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !110, line: 330, size: 448, elements: !310)
!310 = !{!311, !315, !316, !320, !321, !325, !630}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !309, file: !110, line: 331, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!105, !107}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !309, file: !110, line: 332, baseType: !312, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !309, file: !110, line: 333, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!105, !256, !107}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !309, file: !110, line: 334, baseType: !312, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !309, file: !110, line: 335, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!105, !107, !135}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !309, file: !110, line: 336, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!105, !107, !329, !212, !629}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !110, line: 142, size: 12800, elements: !332)
!332 = !{!333, !334, !554, !575, !576, !577, !623, !624, !625, !626, !628}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !331, file: !110, line: 143, baseType: !113, size: 4480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !331, file: !110, line: 143, baseType: !335, size: 5248, offset: 4480)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 5248, elements: !164)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !110, line: 23, size: 5248, elements: !337)
!337 = !{!338, !343, !348, !352, !356, !362, !367, !368, !369, !373, !377, !378, !379, !383, !387, !393, !394, !398, !402, !406, !407, !414, !418, !419, !423, !427, !428, !429, !433, !434, !441, !446, !447, !448, !452, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !473, !474, !475, !479, !483, !484, !485, !486, !490, !491, !492, !493, !494, !495, !496, !500, !501, !505, !512, !513, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !534, !535, !536, !542, !546, !547, !548}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !336, file: !110, line: 24, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!105, !329, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !336, file: !110, line: 25, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!105, !329, !168, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !336, file: !110, line: 26, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!105, !168, !342}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !336, file: !110, line: 27, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!105, !329, !329, !228}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !336, file: !110, line: 28, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!105, !329, !168, !360, !228}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !336, file: !110, line: 29, baseType: !363, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!105, !329, !366, !220}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !336, file: !110, line: 30, baseType: !353, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !336, file: !110, line: 31, baseType: !357, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !336, file: !110, line: 32, baseType: !370, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!105, !329, !88}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !336, file: !110, line: 33, baseType: !374, size: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!105, !329, !329}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !336, file: !110, line: 34, baseType: !370, size: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !336, file: !110, line: 35, baseType: !374, size: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !336, file: !110, line: 36, baseType: !380, size: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!105, !329, !88, !329}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !336, file: !110, line: 37, baseType: !384, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!105, !329, !88, !88, !329}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !336, file: !110, line: 38, baseType: !388, size: 64, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!105, !329, !168, !391, !342}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !336, file: !110, line: 39, baseType: !380, size: 64, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !336, file: !110, line: 40, baseType: !395, size: 64, offset: 1024)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!105, !329, !88, !329, !329}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !336, file: !110, line: 41, baseType: !399, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!105, !329, !88, !88, !88, !329, !329}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !336, file: !110, line: 42, baseType: !403, size: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!105, !329, !329, !329}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !336, file: !110, line: 43, baseType: !403, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !336, file: !110, line: 44, baseType: !408, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!105, !329, !168, !411, !391, !413}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !336, file: !110, line: 45, baseType: !415, size: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!105, !329}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !336, file: !110, line: 46, baseType: !415, size: 64, offset: 1408)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !336, file: !110, line: 47, baseType: !420, size: 64, offset: 1472)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!105, !329, !230}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !336, file: !110, line: 48, baseType: !424, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!105, !329, !212}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !336, file: !110, line: 49, baseType: !424, size: 64, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !336, file: !110, line: 50, baseType: !420, size: 64, offset: 1664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !336, file: !110, line: 51, baseType: !430, size: 64, offset: 1728)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!105, !329, !212, !220}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !336, file: !110, line: 52, baseType: !430, size: 64, offset: 1792)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !336, file: !110, line: 53, baseType: !435, size: 64, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!105, !329, !438}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !336, file: !110, line: 54, baseType: !442, size: 64, offset: 1920)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!105, !329, !445, !277}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !336, file: !110, line: 55, baseType: !408, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !110, line: 56, baseType: !415, size: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !110, line: 57, baseType: !449, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!105, !329, !135}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !336, file: !110, line: 58, baseType: !453, size: 64, offset: 2176)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!105, !329, !391}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !336, file: !110, line: 59, baseType: !453, size: 64, offset: 2240)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !336, file: !110, line: 60, baseType: !353, size: 64, offset: 2304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !336, file: !110, line: 61, baseType: !353, size: 64, offset: 2368)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !336, file: !110, line: 62, baseType: !363, size: 64, offset: 2432)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !336, file: !110, line: 63, baseType: !357, size: 64, offset: 2496)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !336, file: !110, line: 64, baseType: !357, size: 64, offset: 2560)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !336, file: !110, line: 65, baseType: !449, size: 64, offset: 2624)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !336, file: !110, line: 66, baseType: !415, size: 64, offset: 2688)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !336, file: !110, line: 67, baseType: !415, size: 64, offset: 2752)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !336, file: !110, line: 68, baseType: !466, size: 64, offset: 2816)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!105, !329, !469}
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !470, line: 30, baseType: !471)
!470 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !470, line: 30, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !336, file: !110, line: 69, baseType: !408, size: 64, offset: 2880)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !336, file: !110, line: 70, baseType: !415, size: 64, offset: 2944)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !336, file: !110, line: 71, baseType: !476, size: 64, offset: 3008)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!105, !256, !329}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !336, file: !110, line: 72, baseType: !480, size: 64, offset: 3072)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!105, !329, !329, !220}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !336, file: !110, line: 73, baseType: !403, size: 64, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !336, file: !110, line: 74, baseType: !403, size: 64, offset: 3200)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !336, file: !110, line: 75, baseType: !403, size: 64, offset: 3264)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !336, file: !110, line: 76, baseType: !487, size: 64, offset: 3328)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!105, !329, !168, !411, !228}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !336, file: !110, line: 77, baseType: !415, size: 64, offset: 3392)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !336, file: !110, line: 78, baseType: !415, size: 64, offset: 3456)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !336, file: !110, line: 79, baseType: !415, size: 64, offset: 3520)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !336, file: !110, line: 80, baseType: !415, size: 64, offset: 3584)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !336, file: !110, line: 81, baseType: !370, size: 64, offset: 3648)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !336, file: !110, line: 82, baseType: !415, size: 64, offset: 3712)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !336, file: !110, line: 83, baseType: !497, size: 64, offset: 3776)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!105, !329, !168, !329, !413}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !336, file: !110, line: 84, baseType: !497, size: 64, offset: 3840)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !336, file: !110, line: 85, baseType: !502, size: 64, offset: 3904)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!105, !329, !329, !228, !228}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !336, file: !110, line: 86, baseType: !506, size: 64, offset: 3968)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!105, !329, !509, !342}
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !470, line: 11, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !470, line: 11, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !336, file: !110, line: 87, baseType: !506, size: 64, offset: 4032)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !336, file: !110, line: 88, baseType: !514, size: 64, offset: 4096)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!105, !329, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !336, file: !110, line: 89, baseType: !514, size: 64, offset: 4160)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !336, file: !110, line: 90, baseType: !520, size: 64, offset: 4224)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!105, !329, !168, !411, !411, !329, !413}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !336, file: !110, line: 91, baseType: !520, size: 64, offset: 4288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !336, file: !110, line: 92, baseType: !449, size: 64, offset: 4352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !336, file: !110, line: 93, baseType: !449, size: 64, offset: 4416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !336, file: !110, line: 94, baseType: !374, size: 64, offset: 4480)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !336, file: !110, line: 95, baseType: !374, size: 64, offset: 4544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !336, file: !110, line: 96, baseType: !374, size: 64, offset: 4608)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !336, file: !110, line: 97, baseType: !374, size: 64, offset: 4672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !336, file: !110, line: 98, baseType: !531, size: 64, offset: 4736)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!105, !329, !277}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !336, file: !110, line: 99, baseType: !420, size: 64, offset: 4800)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !336, file: !110, line: 100, baseType: !420, size: 64, offset: 4864)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !336, file: !110, line: 101, baseType: !537, size: 64, offset: 4928)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!105, !329, !230, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !336, file: !110, line: 102, baseType: !543, size: 64, offset: 4992)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!105, !329, !517, !540}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !336, file: !110, line: 103, baseType: !420, size: 64, offset: 5056)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !336, file: !110, line: 104, baseType: !514, size: 64, offset: 5120)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !336, file: !110, line: 105, baseType: !549, size: 64, offset: 5184)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!105, !168, !360, !342, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !331, file: !110, line: 144, baseType: !555, size: 64, offset: 9728)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !470, line: 60, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !558, line: 240, size: 640, elements: !559)
!558 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !557, file: !558, line: 241, baseType: !69, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !557, file: !558, line: 242, baseType: !184, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !557, file: !558, line: 243, baseType: !168, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !557, file: !558, line: 243, baseType: !168, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !557, file: !558, line: 244, baseType: !168, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !557, file: !558, line: 244, baseType: !168, size: 32, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !557, file: !558, line: 245, baseType: !212, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !557, file: !558, line: 246, baseType: !277, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !557, file: !558, line: 247, baseType: !168, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !557, file: !558, line: 251, baseType: !168, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !557, file: !558, line: 252, baseType: !469, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !557, file: !558, line: 253, baseType: !277, size: 32, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !557, file: !558, line: 254, baseType: !168, size: 32, offset: 544)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !557, file: !558, line: 254, baseType: !168, size: 32, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !557, file: !558, line: 255, baseType: !168, size: 32, offset: 608)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !110, line: 145, baseType: !73, size: 64, offset: 9792)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !331, file: !110, line: 146, baseType: !277, size: 32, offset: 9856)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !331, file: !110, line: 147, baseType: !578, size: 1344, offset: 9920)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !110, line: 140, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 114, size: 1344, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !599, !600, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !579, file: !110, line: 115, baseType: !168, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !579, file: !110, line: 116, baseType: !168, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !579, file: !110, line: 117, baseType: !168, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !579, file: !110, line: 118, baseType: !168, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !579, file: !110, line: 119, baseType: !168, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !579, file: !110, line: 120, baseType: !168, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !579, file: !110, line: 121, baseType: !212, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !579, file: !110, line: 122, baseType: !228, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !579, file: !110, line: 124, baseType: !69, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !110, line: 125, baseType: !184, size: 32, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !579, file: !110, line: 125, baseType: !184, size: 32, offset: 416)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !579, file: !110, line: 126, baseType: !184, size: 32, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !579, file: !110, line: 126, baseType: !184, size: 32, offset: 480)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !579, file: !110, line: 127, baseType: !595, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !70, line: 339, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !70, line: 339, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !579, file: !110, line: 128, baseType: !595, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !579, file: !110, line: 129, baseType: !601, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !70, line: 341, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !70, line: 351, size: 192, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !603, file: !70, line: 354, baseType: !106, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !603, file: !70, line: 355, baseType: !106, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !603, file: !70, line: 356, baseType: !106, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !603, file: !70, line: 361, baseType: !106, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !603, file: !70, line: 362, baseType: !92, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !579, file: !110, line: 130, baseType: !168, size: 32, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !579, file: !110, line: 130, baseType: !168, size: 32, offset: 736)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !579, file: !110, line: 131, baseType: !228, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !579, file: !110, line: 131, baseType: !228, size: 64, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !579, file: !110, line: 132, baseType: !212, size: 64, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !579, file: !110, line: 132, baseType: !212, size: 64, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !579, file: !110, line: 133, baseType: !168, size: 32, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !579, file: !110, line: 134, baseType: !212, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !579, file: !110, line: 135, baseType: !168, size: 32, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !579, file: !110, line: 136, baseType: !277, size: 32, offset: 1184)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !579, file: !110, line: 137, baseType: !277, size: 32, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !579, file: !110, line: 138, baseType: !413, size: 32, offset: 1248)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !579, file: !110, line: 139, baseType: !212, size: 64, offset: 1280)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !331, file: !110, line: 147, baseType: !578, size: 1344, offset: 11264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !331, file: !110, line: 148, baseType: !277, size: 32, offset: 12608)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !331, file: !110, line: 149, baseType: !168, size: 32, offset: 12640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !331, file: !110, line: 150, baseType: !627, size: 32, offset: 12672)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !331, file: !110, line: 157, baseType: !194, size: 64, offset: 12736)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !309, file: !110, line: 337, baseType: !631, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!105, !107, !329, !553}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 341, baseType: !73, size: 64, offset: 4928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !109, file: !110, line: 342, baseType: !168, size: 32, offset: 4992)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !109, file: !110, line: 343, baseType: !277, size: 32, offset: 5024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !109, file: !110, line: 344, baseType: !277, size: 32, offset: 5056)
!638 = !{!639, !640, !641, !642}
!639 = !DILocalVariable(name: "tagger", arg: 1, scope: !101, file: !102, line: 37, type: !107)
!640 = !DILocalVariable(name: "box", arg: 2, scope: !101, file: !102, line: 37, type: !83)
!641 = !DILocalVariable(name: "ierr", scope: !101, file: !102, line: 39, type: !105)
!642 = !DILocalVariable(name: "ierr__", scope: !643, file: !102, line: 42, type: !105)
!643 = distinct !DILexicalBlock(scope: !101, file: !102, line: 42, column: 45)
!644 = !DILocation(line: 0, scope: !101)
!645 = !DILocation(line: 41, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !102, line: 41, column: 3)
!647 = distinct !DILexicalBlock(scope: !648, file: !102, line: 41, column: 3)
!648 = distinct !DILexicalBlock(scope: !101, file: !102, line: 41, column: 3)
!649 = !{!650, !650, i64 0}
!650 = !{!"any pointer", !651, i64 0}
!651 = !{!"omnipotent char", !652, i64 0}
!652 = !{!"Simple C/C++ TBAA"}
!653 = !DILocation(line: 41, column: 3, scope: !647)
!654 = !DILocation(line: 41, column: 3, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !102, line: 41, column: 3)
!656 = distinct !DILexicalBlock(scope: !646, file: !102, line: 41, column: 3)
!657 = !{!658, !659, i64 1536}
!658 = !{!"", !651, i64 0, !651, i64 512, !651, i64 1024, !651, i64 1280, !659, i64 1536, !659, i64 1540, !651, i64 1544}
!659 = !{!"int", !651, i64 0}
!660 = !DILocation(line: 41, column: 3, scope: !656)
!661 = !DILocation(line: 41, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !655, file: !102, line: 41, column: 3)
!663 = !{!659, !659, i64 0}
!664 = !{!658, !659, i64 1540}
!665 = !DILocation(line: 42, column: 10, scope: !101)
!666 = !DILocation(line: 0, scope: !643)
!667 = !DILocation(line: 42, column: 45, scope: !668)
!668 = distinct !DILexicalBlock(scope: !643, file: !102, line: 42, column: 45)
!669 = !DILocation(line: 42, column: 45, scope: !643)
!670 = !{!"branch_weights", i32 2000, i32 1}
!671 = !DILocation(line: 43, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !102, line: 43, column: 3)
!673 = distinct !DILexicalBlock(scope: !674, file: !102, line: 43, column: 3)
!674 = distinct !DILexicalBlock(scope: !101, file: !102, line: 43, column: 3)
!675 = !DILocation(line: 43, column: 3, scope: !673)
!676 = !DILocation(line: 43, column: 3, scope: !677)
!677 = distinct !DILexicalBlock(scope: !678, file: !102, line: 43, column: 3)
!678 = distinct !DILexicalBlock(scope: !672, file: !102, line: 43, column: 3)
!679 = !DILocation(line: 43, column: 3, scope: !678)
!680 = !DILocation(line: 43, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !102, line: 43, column: 3)
!682 = distinct !DILexicalBlock(scope: !677, file: !102, line: 43, column: 3)
!683 = !{!658, !651, i64 1544}
!684 = !DILocation(line: 43, column: 3, scope: !682)
!685 = !DILocation(line: 43, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !681, file: !102, line: 43, column: 3)
!687 = !DILocation(line: 43, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !677, file: !102, line: 43, column: 3)
!689 = !DILocation(line: 43, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !688, file: !102, line: 43, column: 3)
!691 = !DILocation(line: 43, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !102, line: 43, column: 3)
!693 = distinct !DILexicalBlock(scope: !690, file: !102, line: 43, column: 3)
!694 = !DILocation(line: 43, column: 3, scope: !693)
!695 = !DILocation(line: 43, column: 3, scope: !696)
!696 = distinct !DILexicalBlock(scope: !692, file: !102, line: 43, column: 3)
!697 = !DILocation(line: 44, column: 1, scope: !101)
!698 = !DISubprogram(name: "VecTaggerSetBox_Simple", scope: !79, file: !79, line: 13, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !702)
