; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/schurm/schurm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/schurm/schurm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!381 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!382 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!383 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!384 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 787, baseType: !7, size: 32, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_DIAG", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_LUMP", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_BLOCK_DIAG", value: 2, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 663, baseType: !7, size: 32, elements: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!392 = !{!393, !394, !395}
!393 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!401 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!402 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!403 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!405 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!406 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!407 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!408 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!409 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!410 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!411 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!412 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!413 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!414 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!415 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!416 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!417 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!418 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 624, baseType: !7, size: 32, elements: !421)
!420 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!421 = !{!422, !423, !424, !425}
!422 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!423 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!426 = !{!427, !458, !538, !478, !1654, !1655, !455, !528, !74, !518, !1301, !1656, !1659, !613, !7}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SchurComplement", file: !429, line: 10, baseType: !430)
!429 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/schurm/schurm.h", directory: "/home/users/ndemeye/xSDK")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 5, size: 576, elements: !431)
!431 = !{!432, !1411, !1412, !1413, !1414, !1415, !1650, !1651, !1652}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !430, file: !429, line: 6, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !436, line: 436, size: 23424, elements: !437)
!436 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!437 = !{!438, !647, !1154, !1174, !1175, !1176, !1178, !1179, !1180, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1307, !1308, !1324, !1325, !1326, !1327, !1328, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1363, !1383, !1384, !1386, !1387, !1388, !1389, !1390, !1391, !1409, !1410}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !435, file: !436, line: 437, baseType: !439, size: 4480)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !440, line: 122, baseType: !441)
!440 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !440, line: 73, size: 4480, elements: !442)
!442 = !{!443, !445, !499, !500, !502, !505, !506, !507, !508, !516, !517, !519, !523, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !539, !541, !542, !543, !545, !546, !548, !550, !551, !552, !553, !554, !557, !559, !560, !561, !562, !563, !566, !568, !569, !570, !580, !582, !583, !587, !588, !637, !642, !644, !645, !646}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !441, file: !440, line: 74, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !441, file: !440, line: 75, baseType: !446, size: 448, offset: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 448, elements: !497)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !440, line: 53, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 45, size: 448, elements: !449)
!449 = !{!450, !461, !469, !474, !481, !485, !492}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !448, file: !440, line: 46, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !455, !457}
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !420, line: 330, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !420, line: 330, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !448, file: !440, line: 47, baseType: !462, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!454, !455, !465}
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !466, line: 16, baseType: !467)
!466 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !466, line: 16, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !448, file: !440, line: 48, baseType: !470, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!454, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !448, file: !440, line: 49, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!454, !455, !478, !455}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !448, file: !440, line: 50, baseType: !482, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!454, !455, !478, !473}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !448, file: !440, line: 51, baseType: !486, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!454, !455, !478, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !448, file: !440, line: 52, baseType: !493, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!454, !455, !478, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!497 = !{!498}
!498 = !DISubrange(count: 1)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !441, file: !440, line: 76, baseType: !458, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !440, line: 77, baseType: !501, size: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !441, file: !440, line: 78, baseType: !503, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !504)
!504 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !441, file: !440, line: 78, baseType: !503, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !441, file: !440, line: 78, baseType: !503, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !441, file: !440, line: 78, baseType: !503, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !441, file: !440, line: 79, baseType: !509, size: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !512, line: 27, baseType: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !514, line: 43, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!515 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !441, file: !440, line: 80, baseType: !501, size: 32, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !441, file: !440, line: 81, baseType: !518, size: 32, offset: 992)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !441, file: !440, line: 82, baseType: !520, size: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !441, file: !440, line: 83, baseType: !524, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !441, file: !440, line: 84, baseType: !528, size: 64, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !441, file: !440, line: 85, baseType: !528, size: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !441, file: !440, line: 86, baseType: !528, size: 64, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !441, file: !440, line: 87, baseType: !528, size: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !441, file: !440, line: 88, baseType: !455, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !441, file: !440, line: 89, baseType: !509, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !440, line: 90, baseType: !528, size: 64, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !441, file: !440, line: 91, baseType: !528, size: 64, offset: 1600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !441, file: !440, line: 92, baseType: !501, size: 32, offset: 1664)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !441, file: !440, line: 93, baseType: !538, size: 64, offset: 1728)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !441, file: !440, line: 94, baseType: !540, size: 64, offset: 1792)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !510)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !441, file: !440, line: 95, baseType: !501, size: 32, offset: 1856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !441, file: !440, line: 95, baseType: !501, size: 32, offset: 1888)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !441, file: !440, line: 96, baseType: !544, size: 64, offset: 1920)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !441, file: !440, line: 96, baseType: !544, size: 64, offset: 1984)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !441, file: !440, line: 97, baseType: !547, size: 64, offset: 2048)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !441, file: !440, line: 97, baseType: !549, size: 64, offset: 2112)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !441, file: !440, line: 98, baseType: !501, size: 32, offset: 2176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !441, file: !440, line: 98, baseType: !501, size: 32, offset: 2208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !441, file: !440, line: 99, baseType: !544, size: 64, offset: 2240)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !441, file: !440, line: 99, baseType: !544, size: 64, offset: 2304)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !441, file: !440, line: 100, baseType: !555, size: 64, offset: 2368)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !504)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !441, file: !440, line: 100, baseType: !558, size: 64, offset: 2432)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !441, file: !440, line: 101, baseType: !501, size: 32, offset: 2496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !441, file: !440, line: 101, baseType: !501, size: 32, offset: 2528)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !441, file: !440, line: 102, baseType: !544, size: 64, offset: 2560)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !441, file: !440, line: 102, baseType: !544, size: 64, offset: 2624)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !441, file: !440, line: 103, baseType: !564, size: 64, offset: 2688)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !556)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !441, file: !440, line: 103, baseType: !567, size: 64, offset: 2752)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !441, file: !440, line: 104, baseType: !496, size: 64, offset: 2816)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !441, file: !440, line: 105, baseType: !501, size: 32, offset: 2880)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !441, file: !440, line: 106, baseType: !571, size: 128, offset: 2944)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 128, elements: !578)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !440, line: 64, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 61, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !574, file: !440, line: 62, baseType: !489, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !574, file: !440, line: 63, baseType: !538, size: 64, offset: 64)
!578 = !{!579}
!579 = !DISubrange(count: 2)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !441, file: !440, line: 107, baseType: !581, size: 64, offset: 3072)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 64, elements: !578)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !441, file: !440, line: 108, baseType: !538, size: 64, offset: 3136)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !441, file: !440, line: 109, baseType: !584, size: 64, offset: 3200)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!454, !538}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !441, file: !440, line: 111, baseType: !501, size: 32, offset: 3264)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !441, file: !440, line: 112, baseType: !589, size: 320, offset: 3328)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 320, elements: !635)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!454, !593, !455, !538}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !596)
!596 = !{!597, !598, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !595, file: !12, line: 100, baseType: !501, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !12, line: 101, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !610, !611, !612, !616, !618, !620, !621, !622}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !601, file: !12, line: 84, baseType: !528, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !601, file: !12, line: 85, baseType: !528, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !12, line: 86, baseType: !538, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !601, file: !12, line: 87, baseType: !520, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !601, file: !12, line: 88, baseType: !608, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !601, file: !12, line: 89, baseType: !480, size: 8, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !601, file: !12, line: 90, baseType: !528, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !601, file: !12, line: 91, baseType: !613, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !614, line: 46, baseType: !615)
!614 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!615 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !601, file: !12, line: 92, baseType: !617, size: 32, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !12, line: 93, baseType: !619, size: 32, offset: 544)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !601, file: !12, line: 94, baseType: !599, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !601, file: !12, line: 95, baseType: !528, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !601, file: !12, line: 96, baseType: !538, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !595, file: !12, line: 102, baseType: !528, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !595, file: !12, line: 102, baseType: !528, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !595, file: !12, line: 103, baseType: !528, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !595, file: !12, line: 104, baseType: !458, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !595, file: !12, line: 105, baseType: !617, size: 32, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !595, file: !12, line: 105, baseType: !617, size: 32, offset: 416)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !595, file: !12, line: 105, baseType: !617, size: 32, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !595, file: !12, line: 106, baseType: !455, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !595, file: !12, line: 107, baseType: !632, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!635 = !{!636}
!636 = !DISubrange(count: 5)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !441, file: !440, line: 113, baseType: !638, size: 320, offset: 3648)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 320, elements: !635)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!454, !455, !538}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !441, file: !440, line: 114, baseType: !643, size: 320, offset: 3968)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !635)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !441, file: !440, line: 115, baseType: !617, size: 32, offset: 4288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !441, file: !440, line: 120, baseType: !632, size: 64, offset: 4352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !441, file: !440, line: 121, baseType: !617, size: 32, offset: 4416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !435, file: !436, line: 437, baseType: !648, size: 9472, offset: 4480)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 9472, elements: !497)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !436, line: 32, size: 9472, elements: !650)
!650 = !{!651, !660, !664, !665, !672, !676, !677, !678, !679, !680, !681, !682, !706, !710, !715, !721, !740, !745, !749, !750, !755, !760, !761, !766, !770, !774, !778, !782, !786, !787, !788, !789, !790, !794, !795, !800, !801, !802, !803, !804, !809, !816, !821, !825, !829, !833, !837, !838, !842, !843, !850, !855, !856, !857, !858, !920, !928, !929, !933, !934, !938, !939, !943, !948, !949, !953, !957, !964, !965, !966, !967, !968, !969, !974, !975, !979, !983, !987, !988, !989, !993, !1003, !1004, !1008, !1009, !1013, !1014, !1018, !1019, !1024, !1025, !1029, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1043, !1044, !1045, !1046, !1047, !1048, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1067, !1068, !1069, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1083, !1084, !1085, !1090, !1094, !1095, !1099, !1100, !1101, !1102, !1128, !1132, !1133, !1134, !1135, !1136, !1140, !1141, !1142, !1143, !1144, !1148, !1152, !1153}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !649, file: !436, line: 34, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!454, !433, !501, !655, !501, !655, !657, !659}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !649, file: !436, line: 35, baseType: !661, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!454, !433, !501, !547, !549, !567}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !649, file: !436, line: 36, baseType: !661, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !649, file: !436, line: 37, baseType: !666, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!454, !433, !669, !669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !649, file: !436, line: 38, baseType: !673, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!454, !433, !669, !669, !669}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !649, file: !436, line: 40, baseType: !666, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !649, file: !436, line: 41, baseType: !673, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !649, file: !436, line: 42, baseType: !666, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !649, file: !436, line: 43, baseType: !673, size: 64, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !649, file: !436, line: 44, baseType: !666, size: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !649, file: !436, line: 46, baseType: !673, size: 64, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !649, file: !436, line: 47, baseType: !683, size: 64, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!454, !433, !686, !686, !690}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !687, line: 11, baseType: !688)
!687 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !687, line: 11, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !693, file: !38, line: 1227, baseType: !556, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !693, file: !38, line: 1228, baseType: !556, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !693, file: !38, line: 1229, baseType: !556, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !693, file: !38, line: 1230, baseType: !556, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !693, file: !38, line: 1231, baseType: !556, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !693, file: !38, line: 1232, baseType: !556, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !693, file: !38, line: 1233, baseType: !556, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !693, file: !38, line: 1234, baseType: !556, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !693, file: !38, line: 1236, baseType: !556, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !693, file: !38, line: 1237, baseType: !556, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !693, file: !38, line: 1238, baseType: !556, size: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !649, file: !436, line: 48, baseType: !707, size: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!454, !433, !686, !690}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !649, file: !436, line: 49, baseType: !711, size: 64, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!454, !433, !669, !556, !714, !556, !501, !501, !669}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !649, file: !436, line: 50, baseType: !716, size: 64, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!454, !433, !719, !720}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !649, file: !436, line: 52, baseType: !722, size: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!454, !433, !725, !726}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !728, file: !38, line: 593, baseType: !503, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !728, file: !38, line: 594, baseType: !503, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !728, file: !38, line: 594, baseType: !503, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !728, file: !38, line: 594, baseType: !503, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !728, file: !38, line: 595, baseType: !503, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !728, file: !38, line: 596, baseType: !503, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !728, file: !38, line: 597, baseType: !503, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !728, file: !38, line: 598, baseType: !503, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !728, file: !38, line: 598, baseType: !503, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !728, file: !38, line: 599, baseType: !503, size: 64, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !649, file: !436, line: 53, baseType: !741, size: 64, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!454, !433, !433, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !649, file: !436, line: 54, baseType: !746, size: 64, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!454, !433, !669}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !649, file: !436, line: 55, baseType: !666, size: 64, offset: 1152)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !649, file: !436, line: 56, baseType: !751, size: 64, offset: 1216)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!454, !433, !754, !555}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !649, file: !436, line: 58, baseType: !756, size: 64, offset: 1280)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!454, !433, !759}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !649, file: !436, line: 59, baseType: !756, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !649, file: !436, line: 60, baseType: !762, size: 64, offset: 1408)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!454, !433, !765, !617}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !649, file: !436, line: 61, baseType: !767, size: 64, offset: 1472)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!454, !433}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !649, file: !436, line: 63, baseType: !771, size: 64, offset: 1536)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!454, !433, !501, !655, !565, !669, !669}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !649, file: !436, line: 64, baseType: !775, size: 64, offset: 1600)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!454, !433, !433, !686, !686, !690}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !649, file: !436, line: 65, baseType: !779, size: 64, offset: 1664)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!454, !433, !433, !690}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !649, file: !436, line: 66, baseType: !783, size: 64, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!454, !433, !433, !686, !690}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !649, file: !436, line: 67, baseType: !779, size: 64, offset: 1792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !649, file: !436, line: 69, baseType: !767, size: 64, offset: 1856)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !649, file: !436, line: 70, baseType: !775, size: 64, offset: 1920)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !649, file: !436, line: 71, baseType: !783, size: 64, offset: 1984)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !649, file: !436, line: 72, baseType: !791, size: 64, offset: 2048)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!454, !433, !720}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !649, file: !436, line: 73, baseType: !767, size: 64, offset: 2112)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !649, file: !436, line: 75, baseType: !796, size: 64, offset: 2176)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!454, !433, !799, !720}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !649, file: !436, line: 76, baseType: !666, size: 64, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !649, file: !436, line: 77, baseType: !666, size: 64, offset: 2304)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !649, file: !436, line: 78, baseType: !683, size: 64, offset: 2368)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !649, file: !436, line: 79, baseType: !707, size: 64, offset: 2432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !649, file: !436, line: 81, baseType: !805, size: 64, offset: 2496)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!454, !433, !565, !433, !808}
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !649, file: !436, line: 82, baseType: !810, size: 64, offset: 2560)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!454, !433, !501, !813, !813, !719, !815}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !649, file: !436, line: 83, baseType: !817, size: 64, offset: 2624)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!454, !433, !501, !820, !501}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !649, file: !436, line: 84, baseType: !822, size: 64, offset: 2688)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!454, !433, !501, !655, !501, !655, !564}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !649, file: !436, line: 85, baseType: !826, size: 64, offset: 2752)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!454, !433, !433, !808}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !649, file: !436, line: 87, baseType: !830, size: 64, offset: 2816)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!454, !433, !669, !547}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !649, file: !436, line: 88, baseType: !834, size: 64, offset: 2880)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!454, !433, !565}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !649, file: !436, line: 89, baseType: !834, size: 64, offset: 2944)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !649, file: !436, line: 90, baseType: !839, size: 64, offset: 3008)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!454, !433, !669, !659}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !649, file: !436, line: 91, baseType: !771, size: 64, offset: 3072)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !649, file: !436, line: 93, baseType: !844, size: 64, offset: 3136)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!454, !433, !847}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !649, file: !436, line: 94, baseType: !851, size: 64, offset: 3200)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!454, !433, !501, !617, !617, !547, !854, !854, !744}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !649, file: !436, line: 95, baseType: !851, size: 64, offset: 3264)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !649, file: !436, line: 96, baseType: !851, size: 64, offset: 3328)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !649, file: !436, line: 97, baseType: !851, size: 64, offset: 3392)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !649, file: !436, line: 99, baseType: !859, size: 64, offset: 3456)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!454, !433, !862, !865}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !687, line: 51, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !687, line: 51, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !436, line: 609, size: 6208, elements: !868)
!868 = !{!869, !870, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !889, !896, !897, !898, !899, !900, !901, !902, !903, !907, !908, !909, !910, !911, !913, !914, !915, !916, !917, !918, !919}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !867, file: !436, line: 610, baseType: !439, size: 4480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !867, file: !436, line: 610, baseType: !871, size: 32, offset: 4480)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !497)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !867, file: !436, line: 611, baseType: !501, size: 32, offset: 4512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !867, file: !436, line: 611, baseType: !501, size: 32, offset: 4544)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !867, file: !436, line: 611, baseType: !501, size: 32, offset: 4576)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !867, file: !436, line: 612, baseType: !501, size: 32, offset: 4608)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !867, file: !436, line: 613, baseType: !501, size: 32, offset: 4640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !867, file: !436, line: 614, baseType: !547, size: 64, offset: 4672)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !867, file: !436, line: 615, baseType: !549, size: 64, offset: 4736)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !867, file: !436, line: 616, baseType: !820, size: 64, offset: 4800)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !867, file: !436, line: 617, baseType: !547, size: 64, offset: 4864)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !867, file: !436, line: 618, baseType: !882, size: 64, offset: 4928)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !436, line: 602, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 598, size: 128, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !884, file: !436, line: 599, baseType: !501, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !884, file: !436, line: 600, baseType: !501, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !884, file: !436, line: 601, baseType: !564, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !867, file: !436, line: 619, baseType: !890, size: 64, offset: 4992)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !436, line: 607, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 604, size: 128, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !892, file: !436, line: 605, baseType: !501, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !892, file: !436, line: 606, baseType: !564, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !867, file: !436, line: 620, baseType: !564, size: 64, offset: 5056)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !867, file: !436, line: 621, baseType: !556, size: 64, offset: 5120)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !867, file: !436, line: 622, baseType: !556, size: 64, offset: 5184)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !867, file: !436, line: 623, baseType: !669, size: 64, offset: 5248)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !867, file: !436, line: 623, baseType: !669, size: 64, offset: 5312)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !867, file: !436, line: 623, baseType: !669, size: 64, offset: 5376)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !867, file: !436, line: 624, baseType: !617, size: 32, offset: 5440)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !867, file: !436, line: 625, baseType: !904, size: 64, offset: 5504)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!454}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !867, file: !436, line: 626, baseType: !538, size: 64, offset: 5568)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !867, file: !436, line: 627, baseType: !669, size: 64, offset: 5632)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !867, file: !436, line: 628, baseType: !501, size: 32, offset: 5696)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !867, file: !436, line: 629, baseType: !478, size: 64, offset: 5760)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !867, file: !436, line: 630, baseType: !912, size: 32, offset: 5824)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !867, file: !436, line: 631, baseType: !501, size: 32, offset: 5856)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !867, file: !436, line: 631, baseType: !501, size: 32, offset: 5888)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !867, file: !436, line: 632, baseType: !617, size: 32, offset: 5920)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !867, file: !436, line: 633, baseType: !617, size: 32, offset: 5952)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !867, file: !436, line: 634, baseType: !489, size: 64, offset: 6016)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !867, file: !436, line: 634, baseType: !538, size: 64, offset: 6080)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !867, file: !436, line: 635, baseType: !509, size: 64, offset: 6144)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !649, file: !436, line: 100, baseType: !921, size: 64, offset: 3520)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!454, !433, !501, !501, !924, !927}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !926)
!926 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !649, file: !436, line: 101, baseType: !767, size: 64, offset: 3584)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !649, file: !436, line: 102, baseType: !930, size: 64, offset: 3648)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!454, !433, !686, !686, !720}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !649, file: !436, line: 103, baseType: !652, size: 64, offset: 3712)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !649, file: !436, line: 105, baseType: !935, size: 64, offset: 3776)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!454, !433, !686, !686, !719, !720}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !649, file: !436, line: 106, baseType: !767, size: 64, offset: 3840)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !649, file: !436, line: 107, baseType: !940, size: 64, offset: 3904)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!454, !433, !465}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !649, file: !436, line: 108, baseType: !944, size: 64, offset: 3968)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!454, !433, !947, !719, !720}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !478)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !649, file: !436, line: 109, baseType: !904, size: 64, offset: 4032)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !649, file: !436, line: 111, baseType: !950, size: 64, offset: 4096)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!454, !433, !433, !433, !556, !433}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !649, file: !436, line: 112, baseType: !954, size: 64, offset: 4160)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!454, !433, !433, !433, !433}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !649, file: !436, line: 113, baseType: !958, size: 64, offset: 4224)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!454, !433, !961, !961}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !687, line: 30, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !687, line: 30, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !649, file: !436, line: 114, baseType: !652, size: 64, offset: 4288)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !649, file: !436, line: 115, baseType: !771, size: 64, offset: 4352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !649, file: !436, line: 117, baseType: !830, size: 64, offset: 4416)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !649, file: !436, line: 118, baseType: !830, size: 64, offset: 4480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !649, file: !436, line: 119, baseType: !944, size: 64, offset: 4544)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !649, file: !436, line: 120, baseType: !970, size: 64, offset: 4608)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!454, !433, !973, !744}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !649, file: !436, line: 121, baseType: !904, size: 64, offset: 4672)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !649, file: !436, line: 123, baseType: !976, size: 64, offset: 4736)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!454, !433, !501, !538}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !649, file: !436, line: 124, baseType: !980, size: 64, offset: 4800)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!454, !433, !865, !669, !538}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !649, file: !436, line: 125, baseType: !984, size: 64, offset: 4864)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!454, !593, !433}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !649, file: !436, line: 126, baseType: !666, size: 64, offset: 4928)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !649, file: !436, line: 127, baseType: !666, size: 64, offset: 4992)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !649, file: !436, line: 129, baseType: !990, size: 64, offset: 5056)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!454, !433, !820}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !649, file: !436, line: 130, baseType: !994, size: 64, offset: 5120)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!454, !433, !997, !997}
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !999, file: !62, line: 653, baseType: !501, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !999, file: !62, line: 653, baseType: !669, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !649, file: !436, line: 131, baseType: !994, size: 64, offset: 5184)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !649, file: !436, line: 132, baseType: !1005, size: 64, offset: 5248)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!454, !433, !547, !547, !547}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !649, file: !436, line: 133, baseType: !940, size: 64, offset: 5312)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !649, file: !436, line: 135, baseType: !1010, size: 64, offset: 5376)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!454, !433, !556, !744}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !649, file: !436, line: 136, baseType: !1010, size: 64, offset: 5440)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !649, file: !436, line: 137, baseType: !1015, size: 64, offset: 5504)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!454, !433, !744}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !649, file: !436, line: 138, baseType: !652, size: 64, offset: 5568)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !649, file: !436, line: 139, baseType: !1020, size: 64, offset: 5632)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!454, !433, !1023, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !649, file: !436, line: 141, baseType: !904, size: 64, offset: 5696)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !649, file: !436, line: 142, baseType: !1026, size: 64, offset: 5760)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!454, !433, !433, !556, !433}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !649, file: !436, line: 143, baseType: !1030, size: 64, offset: 5824)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!454, !433, !433, !433}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !649, file: !436, line: 144, baseType: !904, size: 64, offset: 5888)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !649, file: !436, line: 145, baseType: !1026, size: 64, offset: 5952)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !649, file: !436, line: 147, baseType: !1030, size: 64, offset: 6016)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !649, file: !436, line: 148, baseType: !904, size: 64, offset: 6080)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !649, file: !436, line: 149, baseType: !1026, size: 64, offset: 6144)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !649, file: !436, line: 150, baseType: !1030, size: 64, offset: 6208)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !649, file: !436, line: 151, baseType: !1040, size: 64, offset: 6272)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!454, !433, !617}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !649, file: !436, line: 153, baseType: !767, size: 64, offset: 6336)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !649, file: !436, line: 154, baseType: !767, size: 64, offset: 6400)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !649, file: !436, line: 155, baseType: !767, size: 64, offset: 6464)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !649, file: !436, line: 156, baseType: !767, size: 64, offset: 6528)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !649, file: !436, line: 157, baseType: !940, size: 64, offset: 6592)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !649, file: !436, line: 159, baseType: !1049, size: 64, offset: 6656)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!454, !433, !501, !657}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !649, file: !436, line: 160, baseType: !767, size: 64, offset: 6720)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !649, file: !436, line: 161, baseType: !767, size: 64, offset: 6784)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !649, file: !436, line: 162, baseType: !767, size: 64, offset: 6848)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !649, file: !436, line: 163, baseType: !767, size: 64, offset: 6912)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !649, file: !436, line: 165, baseType: !1030, size: 64, offset: 6976)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !649, file: !436, line: 166, baseType: !1030, size: 64, offset: 7040)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !649, file: !436, line: 167, baseType: !830, size: 64, offset: 7104)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !649, file: !436, line: 168, baseType: !1060, size: 64, offset: 7168)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!454, !433, !669, !501}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !649, file: !436, line: 169, baseType: !1064, size: 64, offset: 7232)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!454, !433, !744, !547}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !649, file: !436, line: 171, baseType: !791, size: 64, offset: 7296)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !649, file: !436, line: 172, baseType: !767, size: 64, offset: 7360)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !649, file: !436, line: 173, baseType: !1070, size: 64, offset: 7424)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!454, !433, !547, !854}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !649, file: !436, line: 174, baseType: !930, size: 64, offset: 7488)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !649, file: !436, line: 175, baseType: !930, size: 64, offset: 7552)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !649, file: !436, line: 177, baseType: !666, size: 64, offset: 7616)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !649, file: !436, line: 178, baseType: !716, size: 64, offset: 7680)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !649, file: !436, line: 179, baseType: !666, size: 64, offset: 7744)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !649, file: !436, line: 180, baseType: !673, size: 64, offset: 7808)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !649, file: !436, line: 181, baseType: !1080, size: 64, offset: 7872)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!454, !433, !458, !719, !720}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !649, file: !436, line: 183, baseType: !990, size: 64, offset: 7936)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !649, file: !436, line: 184, baseType: !751, size: 64, offset: 8000)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !649, file: !436, line: 185, baseType: !1086, size: 64, offset: 8064)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!454, !433, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !649, file: !436, line: 186, baseType: !1091, size: 64, offset: 8128)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!454, !433, !501, !655, !564}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !649, file: !436, line: 187, baseType: !810, size: 64, offset: 8192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !649, file: !436, line: 189, baseType: !1096, size: 64, offset: 8256)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!454, !433, !501, !501, !547, !657}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !649, file: !436, line: 190, baseType: !904, size: 64, offset: 8320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !649, file: !436, line: 191, baseType: !1026, size: 64, offset: 8384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !649, file: !436, line: 192, baseType: !1030, size: 64, offset: 8448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !649, file: !436, line: 193, baseType: !1103, size: 64, offset: 8512)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!454, !433, !862, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !436, line: 660, size: 5312, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1108, file: !436, line: 661, baseType: !439, size: 4480)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1108, file: !436, line: 661, baseType: !871, size: 32, offset: 4480)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1108, file: !436, line: 662, baseType: !501, size: 32, offset: 4512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1108, file: !436, line: 662, baseType: !501, size: 32, offset: 4544)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1108, file: !436, line: 662, baseType: !501, size: 32, offset: 4576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1108, file: !436, line: 663, baseType: !501, size: 32, offset: 4608)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1108, file: !436, line: 664, baseType: !501, size: 32, offset: 4640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1108, file: !436, line: 665, baseType: !547, size: 64, offset: 4672)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1108, file: !436, line: 666, baseType: !547, size: 64, offset: 4736)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1108, file: !436, line: 667, baseType: !501, size: 32, offset: 4800)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1108, file: !436, line: 668, baseType: !912, size: 32, offset: 4832)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1108, file: !436, line: 670, baseType: !547, size: 64, offset: 4864)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1108, file: !436, line: 670, baseType: !547, size: 64, offset: 4928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1108, file: !436, line: 671, baseType: !547, size: 64, offset: 4992)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1108, file: !436, line: 672, baseType: !547, size: 64, offset: 5056)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1108, file: !436, line: 673, baseType: !547, size: 64, offset: 5120)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1108, file: !436, line: 674, baseType: !501, size: 32, offset: 5184)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1108, file: !436, line: 675, baseType: !547, size: 64, offset: 5248)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !649, file: !436, line: 195, baseType: !1129, size: 64, offset: 8576)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!454, !1106, !433, !433}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !649, file: !436, line: 196, baseType: !1129, size: 64, offset: 8640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !649, file: !436, line: 197, baseType: !904, size: 64, offset: 8704)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !649, file: !436, line: 198, baseType: !1026, size: 64, offset: 8768)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !649, file: !436, line: 199, baseType: !1030, size: 64, offset: 8832)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !649, file: !436, line: 201, baseType: !1137, size: 64, offset: 8896)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!454, !433, !501, !501}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !649, file: !436, line: 202, baseType: !805, size: 64, offset: 8960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !649, file: !436, line: 203, baseType: !673, size: 64, offset: 9024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !649, file: !436, line: 204, baseType: !859, size: 64, offset: 9088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !649, file: !436, line: 205, baseType: !990, size: 64, offset: 9152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !649, file: !436, line: 206, baseType: !1145, size: 64, offset: 9216)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!454, !458, !433, !501, !719, !720}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !649, file: !436, line: 208, baseType: !1149, size: 64, offset: 9280)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!454, !501, !815}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !649, file: !436, line: 209, baseType: !1030, size: 64, offset: 9344)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !649, file: !436, line: 210, baseType: !822, size: 64, offset: 9408)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !435, file: !436, line: 438, baseType: !1155, size: 64, offset: 13952)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !687, line: 60, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1157, file: !116, line: 241, baseType: !458, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !116, line: 242, baseType: !518, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1157, file: !116, line: 243, baseType: !501, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1157, file: !116, line: 243, baseType: !501, size: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1157, file: !116, line: 244, baseType: !501, size: 32, offset: 160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1157, file: !116, line: 244, baseType: !501, size: 32, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1157, file: !116, line: 245, baseType: !547, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1157, file: !116, line: 246, baseType: !617, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1157, file: !116, line: 247, baseType: !501, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1157, file: !116, line: 251, baseType: !501, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1157, file: !116, line: 252, baseType: !961, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1157, file: !116, line: 253, baseType: !617, size: 32, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1157, file: !116, line: 254, baseType: !501, size: 32, offset: 544)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1157, file: !116, line: 254, baseType: !501, size: 32, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1157, file: !116, line: 255, baseType: !501, size: 32, offset: 608)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !435, file: !436, line: 438, baseType: !1155, size: 64, offset: 14016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !435, file: !436, line: 439, baseType: !538, size: 64, offset: 14080)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !435, file: !436, line: 440, baseType: !1177, size: 32, offset: 14144)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !435, file: !436, line: 441, baseType: !617, size: 32, offset: 14176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !435, file: !436, line: 442, baseType: !617, size: 32, offset: 14208)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !435, file: !436, line: 443, baseType: !1181, size: 448, offset: 14272)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 448, elements: !1183)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !478)
!1183 = !{!1184}
!1184 = !DISubrange(count: 7)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !435, file: !436, line: 444, baseType: !617, size: 32, offset: 14720)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !435, file: !436, line: 445, baseType: !617, size: 32, offset: 14752)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !435, file: !436, line: 446, baseType: !501, size: 32, offset: 14784)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !435, file: !436, line: 447, baseType: !540, size: 64, offset: 14848)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !435, file: !436, line: 448, baseType: !540, size: 64, offset: 14912)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !435, file: !436, line: 449, baseType: !727, size: 640, offset: 14976)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !435, file: !436, line: 450, baseType: !659, size: 32, offset: 15616)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !435, file: !436, line: 451, baseType: !1193, size: 2880, offset: 15680)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !436, line: 318, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !436, line: 319, size: 2880, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201, !1202, !1215, !1216, !1221, !1226, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1241, !1242, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1274, !1275, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1298, !1299, !1300, !1304, !1305}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1194, file: !436, line: 320, baseType: !501, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1194, file: !436, line: 321, baseType: !501, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1194, file: !436, line: 322, baseType: !501, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1194, file: !436, line: 323, baseType: !501, size: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1194, file: !436, line: 324, baseType: !501, size: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1194, file: !436, line: 325, baseType: !501, size: 32, offset: 160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1194, file: !436, line: 326, baseType: !1203, size: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !436, line: 293, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !436, line: 295, size: 448, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1205, file: !436, line: 296, baseType: !1203, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1205, file: !436, line: 297, baseType: !564, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1205, file: !436, line: 297, baseType: !564, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1205, file: !436, line: 298, baseType: !547, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1205, file: !436, line: 298, baseType: !547, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1205, file: !436, line: 299, baseType: !501, size: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1205, file: !436, line: 300, baseType: !501, size: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1205, file: !436, line: 301, baseType: !501, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1194, file: !436, line: 326, baseType: !1203, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1194, file: !436, line: 328, baseType: !1217, size: 64, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!454, !433, !1220, !547}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1194, file: !436, line: 329, baseType: !1222, size: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!454, !1220, !1225, !549, !549, !567, !547}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1194, file: !436, line: 330, baseType: !1227, size: 64, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!454, !1220}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1194, file: !436, line: 331, baseType: !1227, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1194, file: !436, line: 334, baseType: !458, size: 64, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1194, file: !436, line: 335, baseType: !518, size: 32, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1194, file: !436, line: 335, baseType: !518, size: 32, offset: 672)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1194, file: !436, line: 336, baseType: !518, size: 32, offset: 704)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1194, file: !436, line: 336, baseType: !518, size: 32, offset: 736)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1194, file: !436, line: 337, baseType: !1237, size: 64, offset: 768)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !420, line: 339, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !420, line: 339, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1194, file: !436, line: 338, baseType: !1237, size: 64, offset: 832)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1194, file: !436, line: 339, baseType: !1243, size: 64, offset: 896)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !420, line: 341, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !420, line: 351, size: 192, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1245, file: !420, line: 354, baseType: !74, size: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1245, file: !420, line: 355, baseType: !74, size: 32, offset: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1245, file: !420, line: 356, baseType: !74, size: 32, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1245, file: !420, line: 361, baseType: !74, size: 32, offset: 96)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1245, file: !420, line: 362, baseType: !613, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1194, file: !436, line: 340, baseType: !501, size: 32, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1194, file: !436, line: 340, baseType: !501, size: 32, offset: 992)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1194, file: !436, line: 341, baseType: !564, size: 64, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1194, file: !436, line: 342, baseType: !547, size: 64, offset: 1088)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1194, file: !436, line: 343, baseType: !567, size: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1194, file: !436, line: 344, baseType: !549, size: 64, offset: 1216)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1194, file: !436, line: 345, baseType: !501, size: 32, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1194, file: !436, line: 346, baseType: !1225, size: 64, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1194, file: !436, line: 347, baseType: !617, size: 32, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1194, file: !436, line: 348, baseType: !501, size: 32, offset: 1440)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1194, file: !436, line: 351, baseType: !617, size: 32, offset: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1194, file: !436, line: 352, baseType: !617, size: 32, offset: 1504)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1194, file: !436, line: 353, baseType: !518, size: 32, offset: 1536)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1194, file: !436, line: 354, baseType: !518, size: 32, offset: 1568)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1194, file: !436, line: 355, baseType: !1225, size: 64, offset: 1600)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1194, file: !436, line: 356, baseType: !1225, size: 64, offset: 1664)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1194, file: !436, line: 357, baseType: !1269, size: 64, offset: 1728)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !436, line: 310, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 308, size: 32, elements: !1272)
!1272 = !{!1273}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1271, file: !436, line: 309, baseType: !501, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1194, file: !436, line: 357, baseType: !1269, size: 64, offset: 1792)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1194, file: !436, line: 358, baseType: !1276, size: 64, offset: 1856)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !436, line: 316, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 312, size: 128, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1278, file: !436, line: 313, baseType: !538, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1278, file: !436, line: 314, baseType: !501, size: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1278, file: !436, line: 315, baseType: !480, size: 8, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1194, file: !436, line: 359, baseType: !1276, size: 64, offset: 1920)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1194, file: !436, line: 360, baseType: !1276, size: 64, offset: 1984)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1194, file: !436, line: 361, baseType: !501, size: 32, offset: 2048)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1194, file: !436, line: 362, baseType: !518, size: 32, offset: 2080)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1194, file: !436, line: 363, baseType: !501, size: 32, offset: 2112)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1194, file: !436, line: 364, baseType: !1225, size: 64, offset: 2176)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1194, file: !436, line: 365, baseType: !1243, size: 64, offset: 2240)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1194, file: !436, line: 366, baseType: !518, size: 32, offset: 2304)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1194, file: !436, line: 367, baseType: !518, size: 32, offset: 2336)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1194, file: !436, line: 368, baseType: !1237, size: 64, offset: 2368)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1194, file: !436, line: 369, baseType: !1237, size: 64, offset: 2432)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1194, file: !436, line: 370, baseType: !1295, size: 64, offset: 2496)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1194, file: !436, line: 371, baseType: !1295, size: 64, offset: 2560)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1194, file: !436, line: 372, baseType: !1295, size: 64, offset: 2624)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1194, file: !436, line: 373, baseType: !1301, size: 64, offset: 2688)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !420, line: 331, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !420, line: 331, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1194, file: !436, line: 374, baseType: !613, size: 64, offset: 2752)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1194, file: !436, line: 375, baseType: !1306, size: 64, offset: 2816)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !435, file: !436, line: 451, baseType: !1193, size: 2880, offset: 18560)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !435, file: !436, line: 452, baseType: !1309, size: 64, offset: 21440)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !436, line: 681, size: 4864, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1317, !1318, !1319, !1323}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1311, file: !436, line: 682, baseType: !439, size: 4480)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1311, file: !436, line: 682, baseType: !871, size: 32, offset: 4480)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1311, file: !436, line: 683, baseType: !617, size: 32, offset: 4512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1311, file: !436, line: 684, baseType: !501, size: 32, offset: 4544)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1311, file: !436, line: 685, baseType: !1023, size: 64, offset: 4608)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1311, file: !436, line: 686, baseType: !564, size: 64, offset: 4672)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1311, file: !436, line: 687, baseType: !1320, size: 64, offset: 4736)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!454, !1309, !669, !538}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1311, file: !436, line: 688, baseType: !538, size: 64, offset: 4800)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !435, file: !436, line: 453, baseType: !1309, size: 64, offset: 21504)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !435, file: !436, line: 454, baseType: !1309, size: 64, offset: 21568)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !435, file: !436, line: 455, baseType: !501, size: 32, offset: 21632)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !435, file: !436, line: 456, baseType: !617, size: 32, offset: 21664)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !435, file: !436, line: 457, baseType: !1329, size: 320, offset: 21696)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !436, line: 399, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 394, size: 320, elements: !1331)
!1331 = !{!1332, !1333, !1337, !1338}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1330, file: !436, line: 395, baseType: !501, size: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1330, file: !436, line: 396, baseType: !1334, size: 128, offset: 32)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !1335)
!1335 = !{!1336}
!1336 = !DISubrange(count: 4)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1330, file: !436, line: 397, baseType: !1334, size: 128, offset: 160)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1330, file: !436, line: 398, baseType: !617, size: 32, offset: 288)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !435, file: !436, line: 458, baseType: !617, size: 32, offset: 22016)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !435, file: !436, line: 458, baseType: !617, size: 32, offset: 22048)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !435, file: !436, line: 458, baseType: !617, size: 32, offset: 22080)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !435, file: !436, line: 458, baseType: !617, size: 32, offset: 22112)
