; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/commonmpvec.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/commonmpvec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 30, baseType: !5, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!95 = !{!96, !100, !101, !305, !137}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !97, line: 330, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !97, line: 330, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !104, line: 73, size: 4480, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !109, !158, !159, !161, !164, !165, !166, !167, !175, !176, !178, !182, !186, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199, !200, !201, !203, !204, !206, !208, !209, !210, !211, !212, !215, !217, !218, !219, !220, !221, !224, !226, !227, !228, !238, !240, !241, !245, !246, !295, !300, !302, !303, !304}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !103, file: !104, line: 74, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !108)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !103, file: !104, line: 75, baseType: !110, size: 448, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 448, elements: !156)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !104, line: 53, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 45, size: 448, elements: !113)
!113 = !{!114, !120, !128, !133, !140, !144, !151}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !112, file: !104, line: 46, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !101, !119}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !108)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !112, file: !104, line: 47, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!118, !101, !124}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !125, line: 16, baseType: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !125, line: 16, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !112, file: !104, line: 48, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!118, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !112, file: !104, line: 49, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!118, !101, !137, !101}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !112, file: !104, line: 50, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!118, !101, !137, !132}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !112, file: !104, line: 51, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!118, !101, !137, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !112, file: !104, line: 52, baseType: !152, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!118, !101, !137, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!156 = !{!157}
!157 = !DISubrange(count: 1)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !103, file: !104, line: 76, baseType: !96, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !104, line: 77, baseType: !160, size: 32, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !108)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !103, file: !104, line: 78, baseType: !162, size: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !163)
!163 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !103, file: !104, line: 78, baseType: !162, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !103, file: !104, line: 78, baseType: !162, size: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !103, file: !104, line: 78, baseType: !162, size: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !103, file: !104, line: 79, baseType: !168, size: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !171, line: 27, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !173, line: 43, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!174 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !103, file: !104, line: 80, baseType: !160, size: 32, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !103, file: !104, line: 81, baseType: !177, size: 32, offset: 992)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !108)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !103, file: !104, line: 82, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !103, file: !104, line: 83, baseType: !183, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !103, file: !104, line: 84, baseType: !187, size: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !103, file: !104, line: 85, baseType: !187, size: 64, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !103, file: !104, line: 86, baseType: !187, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !103, file: !104, line: 87, baseType: !187, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !103, file: !104, line: 88, baseType: !101, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !103, file: !104, line: 89, baseType: !168, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !104, line: 90, baseType: !187, size: 64, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !103, file: !104, line: 91, baseType: !187, size: 64, offset: 1600)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !103, file: !104, line: 92, baseType: !160, size: 32, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !103, file: !104, line: 93, baseType: !100, size: 64, offset: 1728)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !103, file: !104, line: 94, baseType: !198, size: 64, offset: 1792)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !169)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !103, file: !104, line: 95, baseType: !160, size: 32, offset: 1856)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !103, file: !104, line: 95, baseType: !160, size: 32, offset: 1888)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !103, file: !104, line: 96, baseType: !202, size: 64, offset: 1920)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !103, file: !104, line: 96, baseType: !202, size: 64, offset: 1984)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !103, file: !104, line: 97, baseType: !205, size: 64, offset: 2048)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !103, file: !104, line: 97, baseType: !207, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !103, file: !104, line: 98, baseType: !160, size: 32, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !103, file: !104, line: 98, baseType: !160, size: 32, offset: 2208)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !103, file: !104, line: 99, baseType: !202, size: 64, offset: 2240)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !103, file: !104, line: 99, baseType: !202, size: 64, offset: 2304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !103, file: !104, line: 100, baseType: !213, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !163)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !103, file: !104, line: 100, baseType: !216, size: 64, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !103, file: !104, line: 101, baseType: !160, size: 32, offset: 2496)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !103, file: !104, line: 101, baseType: !160, size: 32, offset: 2528)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !103, file: !104, line: 102, baseType: !202, size: 64, offset: 2560)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !103, file: !104, line: 102, baseType: !202, size: 64, offset: 2624)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !103, file: !104, line: 103, baseType: !222, size: 64, offset: 2688)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !214)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !103, file: !104, line: 103, baseType: !225, size: 64, offset: 2752)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !103, file: !104, line: 104, baseType: !155, size: 64, offset: 2816)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !103, file: !104, line: 105, baseType: !160, size: 32, offset: 2880)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !103, file: !104, line: 106, baseType: !229, size: 128, offset: 2944)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 128, elements: !236)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !104, line: 64, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 61, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !232, file: !104, line: 62, baseType: !148, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !232, file: !104, line: 63, baseType: !100, size: 64, offset: 64)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !103, file: !104, line: 107, baseType: !239, size: 64, offset: 3072)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !236)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !103, file: !104, line: 108, baseType: !100, size: 64, offset: 3136)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !103, file: !104, line: 109, baseType: !242, size: 64, offset: 3200)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!118, !100}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !103, file: !104, line: 111, baseType: !160, size: 32, offset: 3264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !103, file: !104, line: 112, baseType: !247, size: 320, offset: 3328)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 320, elements: !293)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!118, !251, !101, !100}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !254)
!254 = !{!255, !256, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !253, file: !10, line: 100, baseType: !160, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !10, line: 101, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !268, !269, !270, !274, !276, !278, !279, !280}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !259, file: !10, line: 84, baseType: !187, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !259, file: !10, line: 85, baseType: !187, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !10, line: 86, baseType: !100, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !259, file: !10, line: 87, baseType: !179, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !259, file: !10, line: 88, baseType: !266, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !259, file: !10, line: 89, baseType: !139, size: 8, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !259, file: !10, line: 90, baseType: !187, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !259, file: !10, line: 91, baseType: !271, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !272, line: 46, baseType: !273)
!272 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!273 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !259, file: !10, line: 92, baseType: !275, size: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !10, line: 93, baseType: !277, size: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !10, line: 94, baseType: !257, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !259, file: !10, line: 95, baseType: !187, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !259, file: !10, line: 96, baseType: !100, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !253, file: !10, line: 102, baseType: !187, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !253, file: !10, line: 102, baseType: !187, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !253, file: !10, line: 103, baseType: !187, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !253, file: !10, line: 104, baseType: !96, size: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !253, file: !10, line: 105, baseType: !275, size: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !253, file: !10, line: 105, baseType: !275, size: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !253, file: !10, line: 105, baseType: !275, size: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !253, file: !10, line: 106, baseType: !101, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !253, file: !10, line: 107, baseType: !290, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!293 = !{!294}
!294 = !DISubrange(count: 5)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !103, file: !104, line: 113, baseType: !296, size: 320, offset: 3648)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !293)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!118, !101, !100}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !103, file: !104, line: 114, baseType: !301, size: 320, offset: 3968)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 320, elements: !293)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !103, file: !104, line: 115, baseType: !275, size: 32, offset: 4288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !103, file: !104, line: 120, baseType: !290, size: 64, offset: 4352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !103, file: !104, line: 121, baseType: !275, size: 32, offset: 4416)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_MPI", file: !307, line: 45, baseType: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/impls/mpi/pvecimpl.h", directory: "/home/users/ndemeye/xSDK")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 22, size: 1216, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !617, !623, !624, !625, !626, !627, !628, !630, !631, !639, !640, !651, !652, !653, !657, !658}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !308, file: !307, line: 23, baseType: !222, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "array_allocated", scope: !308, file: !307, line: 23, baseType: !222, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "unplacedarray", scope: !308, file: !307, line: 23, baseType: !222, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nghost", scope: !308, file: !307, line: 24, baseType: !160, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "localrep", scope: !308, file: !307, line: 25, baseType: !315, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !318, line: 142, size: 12800, elements: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = !{!320, !322, !542, !563, !564, !565, !611, !612, !613, !614, !616}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !317, file: !318, line: 143, baseType: !321, size: 4480)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !104, line: 122, baseType: !103)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !317, file: !318, line: 143, baseType: !323, size: 5248, offset: 4480)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 5248, elements: !156)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !318, line: 23, size: 5248, elements: !325)
!325 = !{!326, !331, !336, !340, !344, !350, !355, !356, !357, !361, !365, !366, !367, !371, !375, !381, !382, !386, !390, !394, !395, !402, !406, !407, !411, !415, !416, !417, !421, !422, !429, !434, !435, !436, !440, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !461, !462, !463, !467, !471, !472, !473, !474, !478, !479, !480, !481, !482, !483, !484, !488, !489, !493, !500, !501, !506, !507, !511, !512, !513, !514, !515, !516, !517, !518, !522, !523, !524, !530, !534, !535, !536}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !324, file: !318, line: 24, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!118, !315, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !324, file: !318, line: 25, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!118, !315, !160, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !324, file: !318, line: 26, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!118, !160, !330}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !324, file: !318, line: 27, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!118, !315, !315, !222}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !324, file: !318, line: 28, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!118, !315, !160, !348, !222}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !324, file: !318, line: 29, baseType: !351, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!118, !315, !354, !213}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !324, file: !318, line: 30, baseType: !341, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !324, file: !318, line: 31, baseType: !345, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !324, file: !318, line: 32, baseType: !358, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!118, !315, !223}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !324, file: !318, line: 33, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!118, !315, !315}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !318, line: 34, baseType: !358, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !324, file: !318, line: 35, baseType: !362, size: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !324, file: !318, line: 36, baseType: !368, size: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!118, !315, !223, !315}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !324, file: !318, line: 37, baseType: !372, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!118, !315, !223, !223, !315}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !324, file: !318, line: 38, baseType: !376, size: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!118, !315, !160, !379, !330}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !324, file: !318, line: 39, baseType: !368, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !324, file: !318, line: 40, baseType: !383, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!118, !315, !223, !315, !315}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !324, file: !318, line: 41, baseType: !387, size: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!118, !315, !223, !223, !223, !315, !315}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !324, file: !318, line: 42, baseType: !391, size: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!118, !315, !315, !315}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !324, file: !318, line: 43, baseType: !391, size: 64, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !324, file: !318, line: 44, baseType: !396, size: 64, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!118, !315, !160, !399, !379, !401}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !324, file: !318, line: 45, baseType: !403, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!118, !315}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !324, file: !318, line: 46, baseType: !403, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !324, file: !318, line: 47, baseType: !408, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!118, !315, !225}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !324, file: !318, line: 48, baseType: !412, size: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!118, !315, !205}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !324, file: !318, line: 49, baseType: !412, size: 64, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !324, file: !318, line: 50, baseType: !408, size: 64, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !324, file: !318, line: 51, baseType: !418, size: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!118, !315, !205, !213}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !324, file: !318, line: 52, baseType: !418, size: 64, offset: 1792)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !324, file: !318, line: 53, baseType: !423, size: 64, offset: 1856)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!118, !315, !426}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !324, file: !318, line: 54, baseType: !430, size: 64, offset: 1920)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!118, !315, !433, !275}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !324, file: !318, line: 55, baseType: !396, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !324, file: !318, line: 56, baseType: !403, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !324, file: !318, line: 57, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!118, !315, !124}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !324, file: !318, line: 58, baseType: !441, size: 64, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!118, !315, !379}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !324, file: !318, line: 59, baseType: !441, size: 64, offset: 2240)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !324, file: !318, line: 60, baseType: !341, size: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !324, file: !318, line: 61, baseType: !341, size: 64, offset: 2368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !324, file: !318, line: 62, baseType: !351, size: 64, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !324, file: !318, line: 63, baseType: !345, size: 64, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !324, file: !318, line: 64, baseType: !345, size: 64, offset: 2560)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !324, file: !318, line: 65, baseType: !437, size: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !324, file: !318, line: 66, baseType: !403, size: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !324, file: !318, line: 67, baseType: !403, size: 64, offset: 2752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !324, file: !318, line: 68, baseType: !454, size: 64, offset: 2816)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!118, !315, !457}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !458, line: 30, baseType: !459)
!458 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !458, line: 30, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !324, file: !318, line: 69, baseType: !396, size: 64, offset: 2880)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !324, file: !318, line: 70, baseType: !403, size: 64, offset: 2944)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !324, file: !318, line: 71, baseType: !464, size: 64, offset: 3008)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!118, !251, !315}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !324, file: !318, line: 72, baseType: !468, size: 64, offset: 3072)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!118, !315, !315, !213}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !324, file: !318, line: 73, baseType: !391, size: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !324, file: !318, line: 74, baseType: !391, size: 64, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !324, file: !318, line: 75, baseType: !391, size: 64, offset: 3264)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !324, file: !318, line: 76, baseType: !475, size: 64, offset: 3328)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!118, !315, !160, !399, !222}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !324, file: !318, line: 77, baseType: !403, size: 64, offset: 3392)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !324, file: !318, line: 78, baseType: !403, size: 64, offset: 3456)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !324, file: !318, line: 79, baseType: !403, size: 64, offset: 3520)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !324, file: !318, line: 80, baseType: !403, size: 64, offset: 3584)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !324, file: !318, line: 81, baseType: !358, size: 64, offset: 3648)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !324, file: !318, line: 82, baseType: !403, size: 64, offset: 3712)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !324, file: !318, line: 83, baseType: !485, size: 64, offset: 3776)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!118, !315, !160, !315, !401}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !324, file: !318, line: 84, baseType: !485, size: 64, offset: 3840)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !324, file: !318, line: 85, baseType: !490, size: 64, offset: 3904)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!118, !315, !315, !222, !222}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !324, file: !318, line: 86, baseType: !494, size: 64, offset: 3968)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!118, !315, !497, !330}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !458, line: 11, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !458, line: 11, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !324, file: !318, line: 87, baseType: !494, size: 64, offset: 4032)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !324, file: !318, line: 88, baseType: !502, size: 64, offset: 4096)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!118, !315, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !324, file: !318, line: 89, baseType: !502, size: 64, offset: 4160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !324, file: !318, line: 90, baseType: !508, size: 64, offset: 4224)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!118, !315, !160, !399, !399, !315, !401}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !324, file: !318, line: 91, baseType: !508, size: 64, offset: 4288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !324, file: !318, line: 92, baseType: !437, size: 64, offset: 4352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !324, file: !318, line: 93, baseType: !437, size: 64, offset: 4416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !324, file: !318, line: 94, baseType: !362, size: 64, offset: 4480)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !324, file: !318, line: 95, baseType: !362, size: 64, offset: 4544)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !324, file: !318, line: 96, baseType: !362, size: 64, offset: 4608)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !324, file: !318, line: 97, baseType: !362, size: 64, offset: 4672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !324, file: !318, line: 98, baseType: !519, size: 64, offset: 4736)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!118, !315, !275}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !324, file: !318, line: 99, baseType: !408, size: 64, offset: 4800)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !324, file: !318, line: 100, baseType: !408, size: 64, offset: 4864)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !324, file: !318, line: 101, baseType: !525, size: 64, offset: 4928)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!118, !315, !225, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !324, file: !318, line: 102, baseType: !531, size: 64, offset: 4992)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!118, !315, !505, !528}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !324, file: !318, line: 103, baseType: !408, size: 64, offset: 5056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !324, file: !318, line: 104, baseType: !502, size: 64, offset: 5120)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !324, file: !318, line: 105, baseType: !537, size: 64, offset: 5184)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!118, !160, !348, !330, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !317, file: !318, line: 144, baseType: !543, size: 64, offset: 9728)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !458, line: 60, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !546, line: 240, size: 640, elements: !547)
!546 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !545, file: !546, line: 241, baseType: !96, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !545, file: !546, line: 242, baseType: !177, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !545, file: !546, line: 243, baseType: !160, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !545, file: !546, line: 243, baseType: !160, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !545, file: !546, line: 244, baseType: !160, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !545, file: !546, line: 244, baseType: !160, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !545, file: !546, line: 245, baseType: !205, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !545, file: !546, line: 246, baseType: !275, size: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !545, file: !546, line: 247, baseType: !160, size: 32, offset: 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !545, file: !546, line: 251, baseType: !160, size: 32, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !545, file: !546, line: 252, baseType: !457, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !545, file: !546, line: 253, baseType: !275, size: 32, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !545, file: !546, line: 254, baseType: !160, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !545, file: !546, line: 254, baseType: !160, size: 32, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !545, file: !546, line: 255, baseType: !160, size: 32, offset: 608)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !318, line: 145, baseType: !100, size: 64, offset: 9792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !317, file: !318, line: 146, baseType: !275, size: 32, offset: 9856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !317, file: !318, line: 147, baseType: !566, size: 1344, offset: 9920)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !318, line: 140, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 114, size: 1344, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !587, !588, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !567, file: !318, line: 115, baseType: !160, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !567, file: !318, line: 116, baseType: !160, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !567, file: !318, line: 117, baseType: !160, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !567, file: !318, line: 118, baseType: !160, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !567, file: !318, line: 119, baseType: !160, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !567, file: !318, line: 120, baseType: !160, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !567, file: !318, line: 121, baseType: !205, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !567, file: !318, line: 122, baseType: !222, size: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !567, file: !318, line: 124, baseType: !96, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !567, file: !318, line: 125, baseType: !177, size: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !567, file: !318, line: 125, baseType: !177, size: 32, offset: 416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !567, file: !318, line: 126, baseType: !177, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !567, file: !318, line: 126, baseType: !177, size: 32, offset: 480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !567, file: !318, line: 127, baseType: !583, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !97, line: 339, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !97, line: 339, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !567, file: !318, line: 128, baseType: !583, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !567, file: !318, line: 129, baseType: !589, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !97, line: 341, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !97, line: 351, size: 192, elements: !592)
!592 = !{!593, !594, !595, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !591, file: !97, line: 354, baseType: !108, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !591, file: !97, line: 355, baseType: !108, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !591, file: !97, line: 356, baseType: !108, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !591, file: !97, line: 361, baseType: !108, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !591, file: !97, line: 362, baseType: !271, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !567, file: !318, line: 130, baseType: !160, size: 32, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !567, file: !318, line: 130, baseType: !160, size: 32, offset: 736)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !567, file: !318, line: 131, baseType: !222, size: 64, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !567, file: !318, line: 131, baseType: !222, size: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !567, file: !318, line: 132, baseType: !205, size: 64, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !567, file: !318, line: 132, baseType: !205, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !567, file: !318, line: 133, baseType: !160, size: 32, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !567, file: !318, line: 134, baseType: !205, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !567, file: !318, line: 135, baseType: !160, size: 32, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !567, file: !318, line: 136, baseType: !275, size: 32, offset: 1184)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !567, file: !318, line: 137, baseType: !275, size: 32, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !567, file: !318, line: 138, baseType: !401, size: 32, offset: 1248)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !567, file: !318, line: 139, baseType: !205, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !317, file: !318, line: 147, baseType: !566, size: 1344, offset: 11264)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !317, file: !318, line: 148, baseType: !275, size: 32, offset: 12608)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !317, file: !318, line: 149, baseType: !160, size: 32, offset: 12640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !317, file: !318, line: 150, baseType: !615, size: 32, offset: 12672)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !317, file: !318, line: 157, baseType: !187, size: 64, offset: 12736)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "localupdate", scope: !308, file: !307, line: 26, baseType: !618, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !619, line: 59, baseType: !620)
!619 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !619, line: 15, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !619, line: 15, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !308, file: !307, line: 28, baseType: !275, size: 32, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !308, file: !307, line: 29, baseType: !275, size: 32, offset: 416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !308, file: !307, line: 30, baseType: !275, size: 32, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !308, file: !307, line: 31, baseType: !177, size: 32, offset: 480)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !308, file: !307, line: 32, baseType: !177, size: 32, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !308, file: !307, line: 33, baseType: !629, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !308, file: !307, line: 34, baseType: !629, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !308, file: !307, line: 35, baseType: !632, size: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecAssemblyHeader", file: !307, line: 11, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 7, size: 96, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !634, file: !307, line: 8, baseType: !160, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !634, file: !307, line: 9, baseType: !160, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bcount", scope: !634, file: !307, line: 10, baseType: !160, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !308, file: !307, line: 35, baseType: !632, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sendptrs", scope: !308, file: !307, line: 36, baseType: !641, size: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecAssemblyFrame", file: !307, line: 20, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 13, size: 320, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !643, file: !307, line: 14, baseType: !205, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "intb", scope: !643, file: !307, line: 15, baseType: !205, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "scalars", scope: !643, file: !307, line: 16, baseType: !222, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "scalarb", scope: !643, file: !307, line: 17, baseType: !222, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pendings", scope: !643, file: !307, line: 18, baseType: !139, size: 8, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pendingb", scope: !643, file: !307, line: 19, baseType: !139, size: 8, offset: 264)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !308, file: !307, line: 37, baseType: !583, size: 64, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !308, file: !307, line: 38, baseType: !583, size: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvint", scope: !308, file: !307, line: 39, baseType: !654, size: 64, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvscalar", scope: !308, file: !307, line: 40, baseType: !654, size: 64, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !308, file: !307, line: 41, baseType: !654, size: 64, offset: 1152)
!659 = !{i32 7, !"Dwarf Version", i32 4}
!660 = !{i32 2, !"Debug Info Version", i32 3}
!661 = !{i32 1, !"wchar_size", i32 4}
!662 = !{i32 7, !"PIC Level", i32 2}
!663 = !{i32 7, !"uwtable", i32 1}
!664 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!665 = distinct !DISubprogram(name: "VecGhostGetLocalForm", scope: !666, file: !666, line: 69, type: !328, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !667)
!666 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/commonmpvec.c", directory: "/home/users/ndemeye/xSDK")
!667 = !{!668, !669, !670, !671, !672, !673, !675, !677, !680, !684}
!668 = !DILocalVariable(name: "g", arg: 1, scope: !665, file: !666, line: 69, type: !315)
!669 = !DILocalVariable(name: "l", arg: 2, scope: !665, file: !666, line: 69, type: !330)
!670 = !DILocalVariable(name: "ierr", scope: !665, file: !666, line: 71, type: !118)
!671 = !DILocalVariable(name: "isseq", scope: !665, file: !666, line: 72, type: !275)
!672 = !DILocalVariable(name: "ismpi", scope: !665, file: !666, line: 72, type: !275)
!673 = !DILocalVariable(name: "ierr__", scope: !674, file: !666, line: 78, type: !118)
!674 = distinct !DILexicalBlock(scope: !665, file: !666, line: 78, column: 63)
!675 = !DILocalVariable(name: "ierr__", scope: !676, file: !666, line: 79, type: !118)
!676 = distinct !DILexicalBlock(scope: !665, file: !666, line: 79, column: 63)
!677 = !DILocalVariable(name: "v", scope: !678, file: !666, line: 81, type: !305)
!678 = distinct !DILexicalBlock(scope: !679, file: !666, line: 80, column: 14)
!679 = distinct !DILexicalBlock(scope: !665, file: !666, line: 80, column: 7)
!680 = !DILocalVariable(name: "ierr__", scope: !681, file: !666, line: 89, type: !118)
!681 = distinct !DILexicalBlock(scope: !682, file: !666, line: 89, column: 44)
!682 = distinct !DILexicalBlock(scope: !683, file: !666, line: 88, column: 11)
!683 = distinct !DILexicalBlock(scope: !665, file: !666, line: 88, column: 7)
!684 = !DILocalVariable(name: "ierr__", scope: !685, file: !666, line: 90, type: !118)
!685 = distinct !DILexicalBlock(scope: !682, file: !666, line: 90, column: 50)
!686 = !DILocation(line: 0, scope: !665)
!687 = !DILocation(line: 72, column: 3, scope: !665)
!688 = !DILocation(line: 74, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !666, line: 74, column: 3)
!690 = distinct !DILexicalBlock(scope: !691, file: !666, line: 74, column: 3)
!691 = distinct !DILexicalBlock(scope: !665, file: !666, line: 74, column: 3)
!692 = !{!693, !693, i64 0}
!693 = !{!"any pointer", !694, i64 0}
!694 = !{!"omnipotent char", !695, i64 0}
!695 = !{!"Simple C/C++ TBAA"}
!696 = !DILocation(line: 74, column: 3, scope: !690)
!697 = !DILocation(line: 74, column: 3, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !666, line: 74, column: 3)
!699 = distinct !DILexicalBlock(scope: !689, file: !666, line: 74, column: 3)
!700 = !{!701, !702, i64 1536}
!701 = !{!"", !694, i64 0, !694, i64 512, !694, i64 1024, !694, i64 1280, !702, i64 1536, !702, i64 1540, !694, i64 1544}
!702 = !{!"int", !694, i64 0}
!703 = !DILocation(line: 74, column: 3, scope: !699)
!704 = !DILocation(line: 74, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !698, file: !666, line: 74, column: 3)
!706 = !{!702, !702, i64 0}
!707 = !{!701, !702, i64 1540}
!708 = !DILocation(line: 75, column: 3, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !666, line: 75, column: 3)
!710 = distinct !DILexicalBlock(scope: !665, file: !666, line: 75, column: 3)
!711 = !DILocation(line: 75, column: 3, scope: !710)
!712 = !DILocation(line: 75, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !666, line: 75, column: 3)
