; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcscalingbasic.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcscalingbasic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 318, baseType: !5, size: 32, elements: !317)
!317 = !{!318, !319}
!318 = !DIEnumerator(name: "PC_BDDC_INTERFACE_EXT_DIRICHLET", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "PC_BDDC_INTERFACE_EXT_LUMP", value: 1, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 663, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!322 = !{!323, !324, !325}
!323 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!328 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352}
!348 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!349 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!350 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!351 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!352 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 149, baseType: !5, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIEnumerator(name: "IS_GTOLM_MASK", value: 0, isUnsigned: true)
!356 = !DIEnumerator(name: "IS_GTOLM_DROP", value: 1, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !358)
!358 = !{!359, !360, !361}
!359 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!362 = !{!363, !410, !490, !407, !1754, !431, !1757, !1755, !1249, !1758, !480, !72, !565, !1761, !1772}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BDDC", file: !365, line: 191, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bddc/bddc.h", directory: "/home/users/ndemeye/xSDK")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 25, size: 9664, elements: !367)
!367 = !{!368, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1518, !1519, !1520, !1521, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1586, !1587, !1588, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pcis", scope: !366, file: !365, line: 27, baseType: !369, size: 2432)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !370, line: 78, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 13, size: 2432, elements: !372)
!372 = !{!373, !375, !376, !381, !382, !383, !384, !1359, !1360, !1361, !1362, !1363, !1364, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !371, file: !370, line: 24, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !371, file: !370, line: 25, baseType: !374, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !371, file: !370, line: 26, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !378, line: 11, baseType: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !378, line: 11, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !371, file: !370, line: 27, baseType: !377, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !371, file: !370, line: 28, baseType: !377, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !371, file: !370, line: 29, baseType: !377, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !371, file: !370, line: 31, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !388, line: 436, size: 23424, elements: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!389 = !{!390, !599, !1102, !1122, !1123, !1124, !1126, !1127, !1128, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1255, !1256, !1272, !1273, !1274, !1275, !1276, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1311, !1331, !1332, !1334, !1335, !1336, !1337, !1338, !1339, !1357, !1358}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !387, file: !388, line: 437, baseType: !391, size: 4480)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !392, line: 122, baseType: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !392, line: 73, size: 4480, elements: !394)
!394 = !{!395, !397, !452, !453, !454, !457, !458, !459, !460, !468, !469, !471, !475, !479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !493, !494, !495, !497, !498, !500, !502, !503, !504, !505, !506, !509, !511, !512, !513, !514, !515, !518, !520, !521, !522, !532, !534, !535, !539, !540, !589, !594, !596, !597, !598}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !393, file: !392, line: 74, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !393, file: !392, line: 75, baseType: !398, size: 448, offset: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 448, elements: !450)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !392, line: 53, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 45, size: 448, elements: !401)
!401 = !{!402, !414, !422, !427, !434, !438, !445}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !400, file: !392, line: 46, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !407, !409}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !411, line: 330, baseType: !412)
!411 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !411, line: 330, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !400, file: !392, line: 47, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!406, !407, !418}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !419, line: 16, baseType: !420)
!419 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !419, line: 16, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !400, file: !392, line: 48, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!406, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !400, file: !392, line: 49, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!406, !407, !431, !407}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !400, file: !392, line: 50, baseType: !435, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!406, !407, !431, !426}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !400, file: !392, line: 51, baseType: !439, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!406, !407, !431, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !400, file: !392, line: 52, baseType: !446, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!406, !407, !431, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!450 = !{!451}
!451 = !DISubrange(count: 1)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !393, file: !392, line: 76, baseType: !410, size: 64, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !392, line: 77, baseType: !374, size: 32, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !393, file: !392, line: 78, baseType: !455, size: 64, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !456)
!456 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !393, file: !392, line: 78, baseType: !455, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !393, file: !392, line: 78, baseType: !455, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !393, file: !392, line: 78, baseType: !455, size: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !393, file: !392, line: 79, baseType: !461, size: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !464, line: 27, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !466, line: 43, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!467 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !393, file: !392, line: 80, baseType: !374, size: 32, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !393, file: !392, line: 81, baseType: !470, size: 32, offset: 992)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !393, file: !392, line: 82, baseType: !472, size: 64, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !393, file: !392, line: 83, baseType: !476, size: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !393, file: !392, line: 84, baseType: !480, size: 64, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !393, file: !392, line: 85, baseType: !480, size: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !393, file: !392, line: 86, baseType: !480, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !393, file: !392, line: 87, baseType: !480, size: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !393, file: !392, line: 88, baseType: !407, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !393, file: !392, line: 89, baseType: !461, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !392, line: 90, baseType: !480, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !393, file: !392, line: 91, baseType: !480, size: 64, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !393, file: !392, line: 92, baseType: !374, size: 32, offset: 1664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !393, file: !392, line: 93, baseType: !490, size: 64, offset: 1728)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !392, line: 94, baseType: !492, size: 64, offset: 1792)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !462)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !393, file: !392, line: 95, baseType: !374, size: 32, offset: 1856)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !393, file: !392, line: 95, baseType: !374, size: 32, offset: 1888)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !393, file: !392, line: 96, baseType: !496, size: 64, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !393, file: !392, line: 96, baseType: !496, size: 64, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !393, file: !392, line: 97, baseType: !499, size: 64, offset: 2048)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !393, file: !392, line: 97, baseType: !501, size: 64, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !393, file: !392, line: 98, baseType: !374, size: 32, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !393, file: !392, line: 98, baseType: !374, size: 32, offset: 2208)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !393, file: !392, line: 99, baseType: !496, size: 64, offset: 2240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !393, file: !392, line: 99, baseType: !496, size: 64, offset: 2304)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !393, file: !392, line: 100, baseType: !507, size: 64, offset: 2368)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !456)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !393, file: !392, line: 100, baseType: !510, size: 64, offset: 2432)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !393, file: !392, line: 101, baseType: !374, size: 32, offset: 2496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !393, file: !392, line: 101, baseType: !374, size: 32, offset: 2528)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !393, file: !392, line: 102, baseType: !496, size: 64, offset: 2560)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !393, file: !392, line: 102, baseType: !496, size: 64, offset: 2624)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !393, file: !392, line: 103, baseType: !516, size: 64, offset: 2688)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !508)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !393, file: !392, line: 103, baseType: !519, size: 64, offset: 2752)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !393, file: !392, line: 104, baseType: !449, size: 64, offset: 2816)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !393, file: !392, line: 105, baseType: !374, size: 32, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !393, file: !392, line: 106, baseType: !523, size: 128, offset: 2944)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 128, elements: !530)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !392, line: 64, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 61, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !526, file: !392, line: 62, baseType: !442, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !526, file: !392, line: 63, baseType: !490, size: 64, offset: 64)
!530 = !{!531}
!531 = !DISubrange(count: 2)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !393, file: !392, line: 107, baseType: !533, size: 64, offset: 3072)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 64, elements: !530)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !393, file: !392, line: 108, baseType: !490, size: 64, offset: 3136)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !393, file: !392, line: 109, baseType: !536, size: 64, offset: 3200)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!406, !490}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !393, file: !392, line: 111, baseType: !374, size: 32, offset: 3264)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !393, file: !392, line: 112, baseType: !541, size: 320, offset: 3328)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !587)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!406, !545, !407, !490}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !548)
!548 = !{!549, !550, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !547, file: !10, line: 100, baseType: !374, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !10, line: 101, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !562, !563, !564, !568, !570, !572, !573, !574}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !553, file: !10, line: 84, baseType: !480, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !553, file: !10, line: 85, baseType: !480, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !10, line: 86, baseType: !490, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !553, file: !10, line: 87, baseType: !472, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !553, file: !10, line: 88, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !553, file: !10, line: 89, baseType: !433, size: 8, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !553, file: !10, line: 90, baseType: !480, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !553, file: !10, line: 91, baseType: !565, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !566, line: 46, baseType: !567)
!566 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!567 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !553, file: !10, line: 92, baseType: !569, size: 32, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !10, line: 93, baseType: !571, size: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !10, line: 94, baseType: !551, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !553, file: !10, line: 95, baseType: !480, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !553, file: !10, line: 96, baseType: !490, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !547, file: !10, line: 102, baseType: !480, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !547, file: !10, line: 102, baseType: !480, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !547, file: !10, line: 103, baseType: !480, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !547, file: !10, line: 104, baseType: !410, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 416)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !547, file: !10, line: 105, baseType: !569, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !547, file: !10, line: 106, baseType: !407, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !547, file: !10, line: 107, baseType: !584, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!587 = !{!588}
!588 = !DISubrange(count: 5)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !393, file: !392, line: 113, baseType: !590, size: 320, offset: 3648)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 320, elements: !587)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!406, !407, !490}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !393, file: !392, line: 114, baseType: !595, size: 320, offset: 3968)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !587)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !393, file: !392, line: 115, baseType: !569, size: 32, offset: 4288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !393, file: !392, line: 120, baseType: !584, size: 64, offset: 4352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !393, file: !392, line: 121, baseType: !569, size: 32, offset: 4416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !387, file: !388, line: 437, baseType: !600, size: 9472, offset: 4480)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 9472, elements: !450)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !388, line: 32, size: 9472, elements: !602)
!602 = !{!603, !612, !616, !617, !624, !628, !629, !630, !631, !632, !633, !634, !654, !658, !663, !669, !688, !693, !697, !698, !703, !708, !709, !714, !718, !722, !726, !730, !734, !735, !736, !737, !738, !742, !743, !748, !749, !750, !751, !752, !757, !764, !769, !773, !777, !781, !785, !786, !790, !791, !798, !803, !804, !805, !806, !868, !876, !877, !881, !882, !886, !887, !891, !896, !897, !901, !905, !912, !913, !914, !915, !916, !917, !922, !923, !927, !931, !935, !936, !937, !941, !951, !952, !956, !957, !961, !962, !966, !967, !972, !973, !977, !981, !982, !983, !984, !985, !986, !987, !991, !992, !993, !994, !995, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1011, !1015, !1016, !1017, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1031, !1032, !1033, !1038, !1042, !1043, !1047, !1048, !1049, !1050, !1076, !1080, !1081, !1082, !1083, !1084, !1088, !1089, !1090, !1091, !1092, !1096, !1100, !1101}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !601, file: !388, line: 34, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!406, !385, !374, !607, !374, !607, !609, !611}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !601, file: !388, line: 35, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!406, !385, !374, !499, !501, !519}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !601, file: !388, line: 36, baseType: !613, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !601, file: !388, line: 37, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!406, !385, !621, !621}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !601, file: !388, line: 38, baseType: !625, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!406, !385, !621, !621, !621}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !601, file: !388, line: 40, baseType: !618, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !601, file: !388, line: 41, baseType: !625, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !601, file: !388, line: 42, baseType: !618, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !601, file: !388, line: 43, baseType: !625, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !601, file: !388, line: 44, baseType: !618, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !601, file: !388, line: 46, baseType: !625, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !601, file: !388, line: 47, baseType: !635, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!406, !385, !377, !377, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !641, file: !36, line: 1227, baseType: !508, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !641, file: !36, line: 1228, baseType: !508, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !641, file: !36, line: 1229, baseType: !508, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !641, file: !36, line: 1230, baseType: !508, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !641, file: !36, line: 1231, baseType: !508, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !641, file: !36, line: 1232, baseType: !508, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !641, file: !36, line: 1233, baseType: !508, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !641, file: !36, line: 1234, baseType: !508, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !641, file: !36, line: 1236, baseType: !508, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !641, file: !36, line: 1237, baseType: !508, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !641, file: !36, line: 1238, baseType: !508, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !601, file: !388, line: 48, baseType: !655, size: 64, offset: 768)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!406, !385, !377, !638}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !601, file: !388, line: 49, baseType: !659, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!406, !385, !621, !508, !662, !508, !374, !374, !621}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !601, file: !388, line: 50, baseType: !664, size: 64, offset: 896)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!406, !385, !667, !668}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !601, file: !388, line: 52, baseType: !670, size: 64, offset: 960)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!406, !385, !673, !674}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !676, file: !36, line: 593, baseType: !455, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !676, file: !36, line: 594, baseType: !455, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !676, file: !36, line: 594, baseType: !455, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !676, file: !36, line: 594, baseType: !455, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !676, file: !36, line: 595, baseType: !455, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !676, file: !36, line: 596, baseType: !455, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !676, file: !36, line: 597, baseType: !455, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !676, file: !36, line: 598, baseType: !455, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !676, file: !36, line: 598, baseType: !455, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !676, file: !36, line: 599, baseType: !455, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !601, file: !388, line: 53, baseType: !689, size: 64, offset: 1024)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!406, !385, !385, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !601, file: !388, line: 54, baseType: !694, size: 64, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!406, !385, !621}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !601, file: !388, line: 55, baseType: !618, size: 64, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !601, file: !388, line: 56, baseType: !699, size: 64, offset: 1216)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!406, !385, !702, !507}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !601, file: !388, line: 58, baseType: !704, size: 64, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!406, !385, !707}
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !601, file: !388, line: 59, baseType: !704, size: 64, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !601, file: !388, line: 60, baseType: !710, size: 64, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!406, !385, !713, !569}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !601, file: !388, line: 61, baseType: !715, size: 64, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!406, !385}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !601, file: !388, line: 63, baseType: !719, size: 64, offset: 1536)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!406, !385, !374, !607, !517, !621, !621}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !601, file: !388, line: 64, baseType: !723, size: 64, offset: 1600)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!406, !385, !385, !377, !377, !638}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !601, file: !388, line: 65, baseType: !727, size: 64, offset: 1664)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!406, !385, !385, !638}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !601, file: !388, line: 66, baseType: !731, size: 64, offset: 1728)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!406, !385, !385, !377, !638}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !601, file: !388, line: 67, baseType: !727, size: 64, offset: 1792)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !601, file: !388, line: 69, baseType: !715, size: 64, offset: 1856)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !601, file: !388, line: 70, baseType: !723, size: 64, offset: 1920)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !601, file: !388, line: 71, baseType: !731, size: 64, offset: 1984)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !601, file: !388, line: 72, baseType: !739, size: 64, offset: 2048)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!406, !385, !668}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !601, file: !388, line: 73, baseType: !715, size: 64, offset: 2112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !601, file: !388, line: 75, baseType: !744, size: 64, offset: 2176)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!406, !385, !747, !668}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !601, file: !388, line: 76, baseType: !618, size: 64, offset: 2240)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !601, file: !388, line: 77, baseType: !618, size: 64, offset: 2304)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !601, file: !388, line: 78, baseType: !635, size: 64, offset: 2368)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !601, file: !388, line: 79, baseType: !655, size: 64, offset: 2432)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !601, file: !388, line: 81, baseType: !753, size: 64, offset: 2496)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!406, !385, !517, !385, !756}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !601, file: !388, line: 82, baseType: !758, size: 64, offset: 2560)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!406, !385, !374, !761, !761, !667, !763}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !601, file: !388, line: 83, baseType: !765, size: 64, offset: 2624)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!406, !385, !374, !768, !374}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !601, file: !388, line: 84, baseType: !770, size: 64, offset: 2688)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!406, !385, !374, !607, !374, !607, !516}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !601, file: !388, line: 85, baseType: !774, size: 64, offset: 2752)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!406, !385, !385, !756}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !601, file: !388, line: 87, baseType: !778, size: 64, offset: 2816)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!406, !385, !621, !499}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !601, file: !388, line: 88, baseType: !782, size: 64, offset: 2880)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!406, !385, !517}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !601, file: !388, line: 89, baseType: !782, size: 64, offset: 2944)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !601, file: !388, line: 90, baseType: !787, size: 64, offset: 3008)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!406, !385, !621, !611}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !601, file: !388, line: 91, baseType: !719, size: 64, offset: 3072)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !601, file: !388, line: 93, baseType: !792, size: 64, offset: 3136)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!406, !385, !795}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !601, file: !388, line: 94, baseType: !799, size: 64, offset: 3200)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!406, !385, !374, !569, !569, !499, !802, !802, !692}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !601, file: !388, line: 95, baseType: !799, size: 64, offset: 3264)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !601, file: !388, line: 96, baseType: !799, size: 64, offset: 3328)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !601, file: !388, line: 97, baseType: !799, size: 64, offset: 3392)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !601, file: !388, line: 99, baseType: !807, size: 64, offset: 3456)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!406, !385, !810, !813}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !378, line: 51, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !378, line: 51, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !388, line: 609, size: 6208, elements: !816)
!816 = !{!817, !818, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !837, !844, !845, !846, !847, !848, !849, !850, !851, !855, !856, !857, !858, !859, !861, !862, !863, !864, !865, !866, !867}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !815, file: !388, line: 610, baseType: !391, size: 4480)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !815, file: !388, line: 610, baseType: !819, size: 32, offset: 4480)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !450)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !815, file: !388, line: 611, baseType: !374, size: 32, offset: 4512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !815, file: !388, line: 611, baseType: !374, size: 32, offset: 4544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !815, file: !388, line: 611, baseType: !374, size: 32, offset: 4576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !815, file: !388, line: 612, baseType: !374, size: 32, offset: 4608)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !815, file: !388, line: 613, baseType: !374, size: 32, offset: 4640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !815, file: !388, line: 614, baseType: !499, size: 64, offset: 4672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !815, file: !388, line: 615, baseType: !501, size: 64, offset: 4736)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !815, file: !388, line: 616, baseType: !768, size: 64, offset: 4800)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !815, file: !388, line: 617, baseType: !499, size: 64, offset: 4864)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !815, file: !388, line: 618, baseType: !830, size: 64, offset: 4928)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !388, line: 602, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 598, size: 128, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !832, file: !388, line: 599, baseType: !374, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !832, file: !388, line: 600, baseType: !374, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !832, file: !388, line: 601, baseType: !516, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !815, file: !388, line: 619, baseType: !838, size: 64, offset: 4992)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !388, line: 607, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 604, size: 128, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !840, file: !388, line: 605, baseType: !374, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !840, file: !388, line: 606, baseType: !516, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !815, file: !388, line: 620, baseType: !516, size: 64, offset: 5056)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !815, file: !388, line: 621, baseType: !508, size: 64, offset: 5120)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !815, file: !388, line: 622, baseType: !508, size: 64, offset: 5184)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !815, file: !388, line: 623, baseType: !621, size: 64, offset: 5248)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !815, file: !388, line: 623, baseType: !621, size: 64, offset: 5312)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !815, file: !388, line: 623, baseType: !621, size: 64, offset: 5376)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !815, file: !388, line: 624, baseType: !569, size: 32, offset: 5440)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !815, file: !388, line: 625, baseType: !852, size: 64, offset: 5504)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!406}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !815, file: !388, line: 626, baseType: !490, size: 64, offset: 5568)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !815, file: !388, line: 627, baseType: !621, size: 64, offset: 5632)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !815, file: !388, line: 628, baseType: !374, size: 32, offset: 5696)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !815, file: !388, line: 629, baseType: !431, size: 64, offset: 5760)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !815, file: !388, line: 630, baseType: !860, size: 32, offset: 5824)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !815, file: !388, line: 631, baseType: !374, size: 32, offset: 5856)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !815, file: !388, line: 631, baseType: !374, size: 32, offset: 5888)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !815, file: !388, line: 632, baseType: !569, size: 32, offset: 5920)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !815, file: !388, line: 633, baseType: !569, size: 32, offset: 5952)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !815, file: !388, line: 634, baseType: !442, size: 64, offset: 6016)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !815, file: !388, line: 634, baseType: !490, size: 64, offset: 6080)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !815, file: !388, line: 635, baseType: !461, size: 64, offset: 6144)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !601, file: !388, line: 100, baseType: !869, size: 64, offset: 3520)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!406, !385, !374, !374, !872, !875}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !874)
!874 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !601, file: !388, line: 101, baseType: !715, size: 64, offset: 3584)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !601, file: !388, line: 102, baseType: !878, size: 64, offset: 3648)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!406, !385, !377, !377, !668}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !601, file: !388, line: 103, baseType: !604, size: 64, offset: 3712)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !601, file: !388, line: 105, baseType: !883, size: 64, offset: 3776)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!406, !385, !377, !377, !667, !668}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !601, file: !388, line: 106, baseType: !715, size: 64, offset: 3840)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !601, file: !388, line: 107, baseType: !888, size: 64, offset: 3904)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!406, !385, !418}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !601, file: !388, line: 108, baseType: !892, size: 64, offset: 3968)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!406, !385, !895, !667, !668}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !431)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !601, file: !388, line: 109, baseType: !852, size: 64, offset: 4032)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !601, file: !388, line: 111, baseType: !898, size: 64, offset: 4096)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!406, !385, !385, !385, !508, !385}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !601, file: !388, line: 112, baseType: !902, size: 64, offset: 4160)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!406, !385, !385, !385, !385}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !601, file: !388, line: 113, baseType: !906, size: 64, offset: 4224)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!406, !385, !909, !909}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !378, line: 30, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !378, line: 30, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !601, file: !388, line: 114, baseType: !604, size: 64, offset: 4288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !601, file: !388, line: 115, baseType: !719, size: 64, offset: 4352)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !601, file: !388, line: 117, baseType: !778, size: 64, offset: 4416)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !601, file: !388, line: 118, baseType: !778, size: 64, offset: 4480)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !601, file: !388, line: 119, baseType: !892, size: 64, offset: 4544)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !601, file: !388, line: 120, baseType: !918, size: 64, offset: 4608)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!406, !385, !921, !692}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !601, file: !388, line: 121, baseType: !852, size: 64, offset: 4672)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !601, file: !388, line: 123, baseType: !924, size: 64, offset: 4736)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!406, !385, !374, !490}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !601, file: !388, line: 124, baseType: !928, size: 64, offset: 4800)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!406, !385, !813, !621, !490}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !601, file: !388, line: 125, baseType: !932, size: 64, offset: 4864)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!406, !545, !385}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !601, file: !388, line: 126, baseType: !618, size: 64, offset: 4928)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !601, file: !388, line: 127, baseType: !618, size: 64, offset: 4992)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !601, file: !388, line: 129, baseType: !938, size: 64, offset: 5056)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!406, !385, !768}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !601, file: !388, line: 130, baseType: !942, size: 64, offset: 5120)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!406, !385, !945, !945}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !947, file: !60, line: 653, baseType: !374, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !947, file: !60, line: 653, baseType: !621, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !601, file: !388, line: 131, baseType: !942, size: 64, offset: 5184)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !601, file: !388, line: 132, baseType: !953, size: 64, offset: 5248)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!406, !385, !499, !499, !499}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !601, file: !388, line: 133, baseType: !888, size: 64, offset: 5312)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !601, file: !388, line: 135, baseType: !958, size: 64, offset: 5376)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!406, !385, !508, !692}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !601, file: !388, line: 136, baseType: !958, size: 64, offset: 5440)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !601, file: !388, line: 137, baseType: !963, size: 64, offset: 5504)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!406, !385, !692}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !601, file: !388, line: 138, baseType: !604, size: 64, offset: 5568)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !601, file: !388, line: 139, baseType: !968, size: 64, offset: 5632)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!406, !385, !971, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !601, file: !388, line: 141, baseType: !852, size: 64, offset: 5696)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !601, file: !388, line: 142, baseType: !974, size: 64, offset: 5760)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!406, !385, !385, !508, !385}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !601, file: !388, line: 143, baseType: !978, size: 64, offset: 5824)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!406, !385, !385, !385}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !601, file: !388, line: 144, baseType: !852, size: 64, offset: 5888)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !601, file: !388, line: 145, baseType: !974, size: 64, offset: 5952)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !601, file: !388, line: 147, baseType: !978, size: 64, offset: 6016)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !601, file: !388, line: 148, baseType: !852, size: 64, offset: 6080)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !601, file: !388, line: 149, baseType: !974, size: 64, offset: 6144)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !601, file: !388, line: 150, baseType: !978, size: 64, offset: 6208)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !601, file: !388, line: 151, baseType: !988, size: 64, offset: 6272)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!406, !385, !569}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !601, file: !388, line: 153, baseType: !715, size: 64, offset: 6336)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !601, file: !388, line: 154, baseType: !715, size: 64, offset: 6400)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !601, file: !388, line: 155, baseType: !715, size: 64, offset: 6464)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !601, file: !388, line: 156, baseType: !715, size: 64, offset: 6528)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !601, file: !388, line: 157, baseType: !888, size: 64, offset: 6592)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !601, file: !388, line: 159, baseType: !997, size: 64, offset: 6656)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!406, !385, !374, !609}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !601, file: !388, line: 160, baseType: !715, size: 64, offset: 6720)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !601, file: !388, line: 161, baseType: !715, size: 64, offset: 6784)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !601, file: !388, line: 162, baseType: !715, size: 64, offset: 6848)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !601, file: !388, line: 163, baseType: !715, size: 64, offset: 6912)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !601, file: !388, line: 165, baseType: !978, size: 64, offset: 6976)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !601, file: !388, line: 166, baseType: !978, size: 64, offset: 7040)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !601, file: !388, line: 167, baseType: !778, size: 64, offset: 7104)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !601, file: !388, line: 168, baseType: !1008, size: 64, offset: 7168)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!406, !385, !621, !374}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !601, file: !388, line: 169, baseType: !1012, size: 64, offset: 7232)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!406, !385, !692, !499}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !601, file: !388, line: 171, baseType: !739, size: 64, offset: 7296)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !601, file: !388, line: 172, baseType: !715, size: 64, offset: 7360)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !601, file: !388, line: 173, baseType: !1018, size: 64, offset: 7424)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!406, !385, !499, !802}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !601, file: !388, line: 174, baseType: !878, size: 64, offset: 7488)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !601, file: !388, line: 175, baseType: !878, size: 64, offset: 7552)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !601, file: !388, line: 177, baseType: !618, size: 64, offset: 7616)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !601, file: !388, line: 178, baseType: !664, size: 64, offset: 7680)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !601, file: !388, line: 179, baseType: !618, size: 64, offset: 7744)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !601, file: !388, line: 180, baseType: !625, size: 64, offset: 7808)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !601, file: !388, line: 181, baseType: !1028, size: 64, offset: 7872)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!406, !385, !410, !667, !668}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !601, file: !388, line: 183, baseType: !938, size: 64, offset: 7936)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !601, file: !388, line: 184, baseType: !699, size: 64, offset: 8000)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !601, file: !388, line: 185, baseType: !1034, size: 64, offset: 8064)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!406, !385, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !601, file: !388, line: 186, baseType: !1039, size: 64, offset: 8128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!406, !385, !374, !607, !516}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !601, file: !388, line: 187, baseType: !758, size: 64, offset: 8192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !601, file: !388, line: 189, baseType: !1044, size: 64, offset: 8256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!406, !385, !374, !374, !499, !609}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !601, file: !388, line: 190, baseType: !852, size: 64, offset: 8320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !601, file: !388, line: 191, baseType: !974, size: 64, offset: 8384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !601, file: !388, line: 192, baseType: !978, size: 64, offset: 8448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !601, file: !388, line: 193, baseType: !1051, size: 64, offset: 8512)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!406, !385, !810, !1054}
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !388, line: 660, size: 5312, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1056, file: !388, line: 661, baseType: !391, size: 4480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1056, file: !388, line: 661, baseType: !819, size: 32, offset: 4480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1056, file: !388, line: 662, baseType: !374, size: 32, offset: 4512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1056, file: !388, line: 662, baseType: !374, size: 32, offset: 4544)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1056, file: !388, line: 662, baseType: !374, size: 32, offset: 4576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1056, file: !388, line: 663, baseType: !374, size: 32, offset: 4608)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1056, file: !388, line: 664, baseType: !374, size: 32, offset: 4640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1056, file: !388, line: 665, baseType: !499, size: 64, offset: 4672)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1056, file: !388, line: 666, baseType: !499, size: 64, offset: 4736)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1056, file: !388, line: 667, baseType: !374, size: 32, offset: 4800)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1056, file: !388, line: 668, baseType: !860, size: 32, offset: 4832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1056, file: !388, line: 670, baseType: !499, size: 64, offset: 4864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1056, file: !388, line: 670, baseType: !499, size: 64, offset: 4928)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1056, file: !388, line: 671, baseType: !499, size: 64, offset: 4992)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1056, file: !388, line: 672, baseType: !499, size: 64, offset: 5056)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1056, file: !388, line: 673, baseType: !499, size: 64, offset: 5120)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1056, file: !388, line: 674, baseType: !374, size: 32, offset: 5184)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1056, file: !388, line: 675, baseType: !499, size: 64, offset: 5248)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !601, file: !388, line: 195, baseType: !1077, size: 64, offset: 8576)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!406, !1054, !385, !385}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !601, file: !388, line: 196, baseType: !1077, size: 64, offset: 8640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !601, file: !388, line: 197, baseType: !852, size: 64, offset: 8704)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !601, file: !388, line: 198, baseType: !974, size: 64, offset: 8768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !601, file: !388, line: 199, baseType: !978, size: 64, offset: 8832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !601, file: !388, line: 201, baseType: !1085, size: 64, offset: 8896)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!406, !385, !374, !374}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !601, file: !388, line: 202, baseType: !753, size: 64, offset: 8960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !601, file: !388, line: 203, baseType: !625, size: 64, offset: 9024)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !601, file: !388, line: 204, baseType: !807, size: 64, offset: 9088)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !601, file: !388, line: 205, baseType: !938, size: 64, offset: 9152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !601, file: !388, line: 206, baseType: !1093, size: 64, offset: 9216)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!406, !410, !385, !374, !667, !668}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !601, file: !388, line: 208, baseType: !1097, size: 64, offset: 9280)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!406, !374, !763}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !601, file: !388, line: 209, baseType: !978, size: 64, offset: 9344)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !601, file: !388, line: 210, baseType: !770, size: 64, offset: 9408)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !387, file: !388, line: 438, baseType: !1103, size: 64, offset: 13952)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !378, line: 60, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1105, file: !114, line: 241, baseType: !410, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !114, line: 242, baseType: !470, size: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1105, file: !114, line: 243, baseType: !374, size: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1105, file: !114, line: 243, baseType: !374, size: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1105, file: !114, line: 244, baseType: !374, size: 32, offset: 160)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1105, file: !114, line: 244, baseType: !374, size: 32, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1105, file: !114, line: 245, baseType: !499, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1105, file: !114, line: 246, baseType: !569, size: 32, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1105, file: !114, line: 247, baseType: !374, size: 32, offset: 352)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1105, file: !114, line: 251, baseType: !374, size: 32, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1105, file: !114, line: 252, baseType: !909, size: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1105, file: !114, line: 253, baseType: !569, size: 32, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1105, file: !114, line: 254, baseType: !374, size: 32, offset: 544)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1105, file: !114, line: 254, baseType: !374, size: 32, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1105, file: !114, line: 255, baseType: !374, size: 32, offset: 608)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !387, file: !388, line: 438, baseType: !1103, size: 64, offset: 14016)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !388, line: 439, baseType: !490, size: 64, offset: 14080)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !387, file: !388, line: 440, baseType: !1125, size: 32, offset: 14144)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !387, file: !388, line: 441, baseType: !569, size: 32, offset: 14176)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !387, file: !388, line: 442, baseType: !569, size: 32, offset: 14208)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !387, file: !388, line: 443, baseType: !1129, size: 448, offset: 14272)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 448, elements: !1131)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !431)
!1131 = !{!1132}
!1132 = !DISubrange(count: 7)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !387, file: !388, line: 444, baseType: !569, size: 32, offset: 14720)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !387, file: !388, line: 445, baseType: !569, size: 32, offset: 14752)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !387, file: !388, line: 446, baseType: !374, size: 32, offset: 14784)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !387, file: !388, line: 447, baseType: !492, size: 64, offset: 14848)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !387, file: !388, line: 448, baseType: !492, size: 64, offset: 14912)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !387, file: !388, line: 449, baseType: !675, size: 640, offset: 14976)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !387, file: !388, line: 450, baseType: !611, size: 32, offset: 15616)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !387, file: !388, line: 451, baseType: !1141, size: 2880, offset: 15680)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !388, line: 318, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !388, line: 319, size: 2880, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150, !1163, !1164, !1169, !1174, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1189, !1190, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1222, !1223, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1252, !1253}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1142, file: !388, line: 320, baseType: !374, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1142, file: !388, line: 321, baseType: !374, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1142, file: !388, line: 322, baseType: !374, size: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1142, file: !388, line: 323, baseType: !374, size: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1142, file: !388, line: 324, baseType: !374, size: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1142, file: !388, line: 325, baseType: !374, size: 32, offset: 160)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1142, file: !388, line: 326, baseType: !1151, size: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !388, line: 293, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !388, line: 295, size: 448, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !388, line: 296, baseType: !1151, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1153, file: !388, line: 297, baseType: !516, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1153, file: !388, line: 297, baseType: !516, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1153, file: !388, line: 298, baseType: !499, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1153, file: !388, line: 298, baseType: !499, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1153, file: !388, line: 299, baseType: !374, size: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1153, file: !388, line: 300, baseType: !374, size: 32, offset: 352)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1153, file: !388, line: 301, baseType: !374, size: 32, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1142, file: !388, line: 326, baseType: !1151, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1142, file: !388, line: 328, baseType: !1165, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!406, !385, !1168, !499}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1142, file: !388, line: 329, baseType: !1170, size: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!406, !1168, !1173, !501, !501, !519, !499}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1142, file: !388, line: 330, baseType: !1175, size: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!406, !1168}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1142, file: !388, line: 331, baseType: !1175, size: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1142, file: !388, line: 334, baseType: !410, size: 64, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1142, file: !388, line: 335, baseType: !470, size: 32, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1142, file: !388, line: 335, baseType: !470, size: 32, offset: 672)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1142, file: !388, line: 336, baseType: !470, size: 32, offset: 704)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1142, file: !388, line: 336, baseType: !470, size: 32, offset: 736)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1142, file: !388, line: 337, baseType: !1185, size: 64, offset: 768)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !411, line: 339, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !411, line: 339, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1142, file: !388, line: 338, baseType: !1185, size: 64, offset: 832)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1142, file: !388, line: 339, baseType: !1191, size: 64, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !411, line: 341, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !411, line: 351, size: 192, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1193, file: !411, line: 354, baseType: !72, size: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1193, file: !411, line: 355, baseType: !72, size: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1193, file: !411, line: 356, baseType: !72, size: 32, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1193, file: !411, line: 361, baseType: !72, size: 32, offset: 96)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1193, file: !411, line: 362, baseType: !565, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1142, file: !388, line: 340, baseType: !374, size: 32, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1142, file: !388, line: 340, baseType: !374, size: 32, offset: 992)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1142, file: !388, line: 341, baseType: !516, size: 64, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1142, file: !388, line: 342, baseType: !499, size: 64, offset: 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1142, file: !388, line: 343, baseType: !519, size: 64, offset: 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1142, file: !388, line: 344, baseType: !501, size: 64, offset: 1216)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1142, file: !388, line: 345, baseType: !374, size: 32, offset: 1280)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1142, file: !388, line: 346, baseType: !1173, size: 64, offset: 1344)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1142, file: !388, line: 347, baseType: !569, size: 32, offset: 1408)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1142, file: !388, line: 348, baseType: !374, size: 32, offset: 1440)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1142, file: !388, line: 351, baseType: !569, size: 32, offset: 1472)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1142, file: !388, line: 352, baseType: !569, size: 32, offset: 1504)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1142, file: !388, line: 353, baseType: !470, size: 32, offset: 1536)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1142, file: !388, line: 354, baseType: !470, size: 32, offset: 1568)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1142, file: !388, line: 355, baseType: !1173, size: 64, offset: 1600)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1142, file: !388, line: 356, baseType: !1173, size: 64, offset: 1664)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1142, file: !388, line: 357, baseType: !1217, size: 64, offset: 1728)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !388, line: 310, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 308, size: 32, elements: !1220)
!1220 = !{!1221}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1219, file: !388, line: 309, baseType: !374, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1142, file: !388, line: 357, baseType: !1217, size: 64, offset: 1792)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1142, file: !388, line: 358, baseType: !1224, size: 64, offset: 1856)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !388, line: 316, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 312, size: 128, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1226, file: !388, line: 313, baseType: !490, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1226, file: !388, line: 314, baseType: !374, size: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1226, file: !388, line: 315, baseType: !433, size: 8, offset: 96)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1142, file: !388, line: 359, baseType: !1224, size: 64, offset: 1920)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1142, file: !388, line: 360, baseType: !1224, size: 64, offset: 1984)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1142, file: !388, line: 361, baseType: !374, size: 32, offset: 2048)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1142, file: !388, line: 362, baseType: !470, size: 32, offset: 2080)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1142, file: !388, line: 363, baseType: !374, size: 32, offset: 2112)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1142, file: !388, line: 364, baseType: !1173, size: 64, offset: 2176)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1142, file: !388, line: 365, baseType: !1191, size: 64, offset: 2240)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1142, file: !388, line: 366, baseType: !470, size: 32, offset: 2304)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1142, file: !388, line: 367, baseType: !470, size: 32, offset: 2336)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1142, file: !388, line: 368, baseType: !1185, size: 64, offset: 2368)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1142, file: !388, line: 369, baseType: !1185, size: 64, offset: 2432)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1142, file: !388, line: 370, baseType: !1243, size: 64, offset: 2496)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1142, file: !388, line: 371, baseType: !1243, size: 64, offset: 2560)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1142, file: !388, line: 372, baseType: !1243, size: 64, offset: 2624)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1142, file: !388, line: 373, baseType: !1249, size: 64, offset: 2688)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !411, line: 331, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !411, line: 331, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1142, file: !388, line: 374, baseType: !565, size: 64, offset: 2752)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1142, file: !388, line: 375, baseType: !1254, size: 64, offset: 2816)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !387, file: !388, line: 451, baseType: !1141, size: 2880, offset: 18560)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !387, file: !388, line: 452, baseType: !1257, size: 64, offset: 21440)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !388, line: 681, size: 4864, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1267, !1271}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1259, file: !388, line: 682, baseType: !391, size: 4480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1259, file: !388, line: 682, baseType: !819, size: 32, offset: 4480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1259, file: !388, line: 683, baseType: !569, size: 32, offset: 4512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1259, file: !388, line: 684, baseType: !374, size: 32, offset: 4544)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1259, file: !388, line: 685, baseType: !971, size: 64, offset: 4608)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1259, file: !388, line: 686, baseType: !516, size: 64, offset: 4672)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1259, file: !388, line: 687, baseType: !1268, size: 64, offset: 4736)
