; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/event/tsevent.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/event/tsevent.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._n_TSEvent = type { double*, double*, double, double, double, double*, i32*, double, double, double, double, i32*, i32 (%struct._p_TS*, double, %struct._p_Vec*, double*, i8*)*, i32 (%struct._p_TS*, i32, i32*, double, %struct._p_Vec*, i32, i8*)*, i8*, i32*, i32*, i32, i32, i32*, double*, i32, i32, %struct._p_PetscViewer*, %struct.anon.5, i32, i32 }
%struct._p_PetscViewer = type opaque
%struct.anon.5 = type { i32, double*, i32*, i32*, i32** }

!57 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 103, baseType: !38, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!62 = !DIEnumerator(name: "TS_CONVERGED_ITERATING", value: 0)
!63 = !DIEnumerator(name: "TS_CONVERGED_TIME", value: 1)
!64 = !DIEnumerator(name: "TS_CONVERGED_ITS", value: 2)
!65 = !DIEnumerator(name: "TS_CONVERGED_USER", value: 3)
!66 = !DIEnumerator(name: "TS_CONVERGED_EVENT", value: 4)
!67 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FATOL", value: 5)
!68 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FRTOL", value: 6)
!69 = !DIEnumerator(name: "TS_DIVERGED_NONLINEAR_SOLVE", value: -1)
!70 = !DIEnumerator(name: "TS_DIVERGED_STEP_REJECTED", value: -2)
!71 = !DIEnumerator(name: "TSFORWARD_DIVERGED_LINEAR_SOLVE", value: -3)
!72 = !DIEnumerator(name: "TSADJOINT_DIVERGED_LINEAR_SOLVE", value: -4)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 217, baseType: !5, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 408, baseType: !5, size: 32, elements: !81)
!80 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/tsimpl.h", directory: "/home/users/ndemeye/xSDK")
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "TSEVENT_NONE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "TSEVENT_LOCATED_INTERVAL", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "TSEVENT_PROCESSING", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "TSEVENT_ZERO", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "TSEVENT_RESET_NEXTSTEP", value: 4, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 663, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!95 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!113 = !{!114, !117, !121, !122, !288, !194, !322, !325, !204, !38, !180, !328, !5}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !118, line: 330, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !118, line: 330, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !125, line: 73, size: 4480, elements: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!126 = !{!127, !129, !175, !176, !178, !181, !182, !183, !184, !192, !193, !195, !199, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !218, !220, !221, !223, !225, !226, !227, !228, !229, !232, !234, !235, !236, !237, !238, !241, !243, !244, !245, !255, !257, !258, !262, !263, !312, !317, !319, !320, !321}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !124, file: !125, line: 74, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !38)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !124, file: !125, line: 75, baseType: !130, size: 448, offset: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 448, elements: !173)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !125, line: 53, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 45, size: 448, elements: !133)
!133 = !{!134, !140, !148, !153, !157, !161, !168}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !132, file: !125, line: 46, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !122, !139}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !38)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !132, file: !125, line: 47, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!138, !122, !144}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !145, line: 16, baseType: !146)
!145 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !145, line: 16, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !132, file: !125, line: 48, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!138, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !132, file: !125, line: 49, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!138, !122, !114, !122}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !132, file: !125, line: 50, baseType: !158, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!138, !122, !114, !152}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !132, file: !125, line: 51, baseType: !162, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!138, !122, !114, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !132, file: !125, line: 52, baseType: !169, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!138, !122, !114, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!173 = !{!174}
!174 = !DISubrange(count: 1)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !124, file: !125, line: 76, baseType: !117, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !125, line: 77, baseType: !177, size: 32, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !38)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !124, file: !125, line: 78, baseType: !179, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !180)
!180 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !124, file: !125, line: 78, baseType: !179, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !124, file: !125, line: 78, baseType: !179, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !124, file: !125, line: 78, baseType: !179, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !124, file: !125, line: 79, baseType: !185, size: 64, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !188, line: 27, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !190, line: 43, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!191 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !124, file: !125, line: 80, baseType: !177, size: 32, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !124, file: !125, line: 81, baseType: !194, size: 32, offset: 992)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !38)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !124, file: !125, line: 82, baseType: !196, size: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !124, file: !125, line: 83, baseType: !200, size: 64, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !124, file: !125, line: 84, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !124, file: !125, line: 85, baseType: !204, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !124, file: !125, line: 86, baseType: !204, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !124, file: !125, line: 87, baseType: !204, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !124, file: !125, line: 88, baseType: !122, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !124, file: !125, line: 89, baseType: !185, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !125, line: 90, baseType: !204, size: 64, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !124, file: !125, line: 91, baseType: !204, size: 64, offset: 1600)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !124, file: !125, line: 92, baseType: !177, size: 32, offset: 1664)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !124, file: !125, line: 93, baseType: !121, size: 64, offset: 1728)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !124, file: !125, line: 94, baseType: !215, size: 64, offset: 1792)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !186)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !124, file: !125, line: 95, baseType: !177, size: 32, offset: 1856)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !124, file: !125, line: 95, baseType: !177, size: 32, offset: 1888)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !124, file: !125, line: 96, baseType: !219, size: 64, offset: 1920)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !124, file: !125, line: 96, baseType: !219, size: 64, offset: 1984)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !124, file: !125, line: 97, baseType: !222, size: 64, offset: 2048)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !124, file: !125, line: 97, baseType: !224, size: 64, offset: 2112)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !124, file: !125, line: 98, baseType: !177, size: 32, offset: 2176)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !124, file: !125, line: 98, baseType: !177, size: 32, offset: 2208)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !124, file: !125, line: 99, baseType: !219, size: 64, offset: 2240)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !124, file: !125, line: 99, baseType: !219, size: 64, offset: 2304)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !124, file: !125, line: 100, baseType: !230, size: 64, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !180)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !124, file: !125, line: 100, baseType: !233, size: 64, offset: 2432)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !124, file: !125, line: 101, baseType: !177, size: 32, offset: 2496)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !124, file: !125, line: 101, baseType: !177, size: 32, offset: 2528)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !124, file: !125, line: 102, baseType: !219, size: 64, offset: 2560)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !124, file: !125, line: 102, baseType: !219, size: 64, offset: 2624)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !124, file: !125, line: 103, baseType: !239, size: 64, offset: 2688)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !231)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !124, file: !125, line: 103, baseType: !242, size: 64, offset: 2752)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !124, file: !125, line: 104, baseType: !172, size: 64, offset: 2816)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !124, file: !125, line: 105, baseType: !177, size: 32, offset: 2880)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !124, file: !125, line: 106, baseType: !246, size: 128, offset: 2944)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, elements: !253)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !125, line: 64, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 61, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !249, file: !125, line: 62, baseType: !165, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !249, file: !125, line: 63, baseType: !121, size: 64, offset: 64)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !124, file: !125, line: 107, baseType: !256, size: 64, offset: 3072)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 64, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !124, file: !125, line: 108, baseType: !121, size: 64, offset: 3136)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !124, file: !125, line: 109, baseType: !259, size: 64, offset: 3200)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!138, !121}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !124, file: !125, line: 111, baseType: !177, size: 32, offset: 3264)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !124, file: !125, line: 112, baseType: !264, size: 320, offset: 3328)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 320, elements: !310)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!138, !268, !122, !121}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !271)
!271 = !{!272, !273, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !10, line: 100, baseType: !177, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !10, line: 101, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !285, !286, !287, !291, !293, !295, !296, !297}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !276, file: !10, line: 84, baseType: !204, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !276, file: !10, line: 85, baseType: !204, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !10, line: 86, baseType: !121, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !276, file: !10, line: 87, baseType: !196, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !276, file: !10, line: 88, baseType: !283, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !276, file: !10, line: 89, baseType: !116, size: 8, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !276, file: !10, line: 90, baseType: !204, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !276, file: !10, line: 91, baseType: !288, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !289, line: 46, baseType: !290)
!289 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!290 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !276, file: !10, line: 92, baseType: !292, size: 32, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !10, line: 93, baseType: !294, size: 32, offset: 544)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !10, line: 94, baseType: !274, size: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !276, file: !10, line: 95, baseType: !204, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !276, file: !10, line: 96, baseType: !121, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !270, file: !10, line: 102, baseType: !204, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !270, file: !10, line: 102, baseType: !204, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !270, file: !10, line: 103, baseType: !204, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !270, file: !10, line: 104, baseType: !117, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !270, file: !10, line: 105, baseType: !292, size: 32, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !270, file: !10, line: 105, baseType: !292, size: 32, offset: 416)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !270, file: !10, line: 105, baseType: !292, size: 32, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !270, file: !10, line: 106, baseType: !122, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !270, file: !10, line: 107, baseType: !307, size: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!310 = !{!311}
!311 = !DISubrange(count: 5)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !124, file: !125, line: 113, baseType: !313, size: 320, offset: 3648)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 320, elements: !310)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!138, !122, !121}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !124, file: !125, line: 114, baseType: !318, size: 320, offset: 3968)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 320, elements: !310)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !124, file: !125, line: 115, baseType: !292, size: 32, offset: 4288)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !124, file: !125, line: 120, baseType: !307, size: 64, offset: 4352)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !124, file: !125, line: 121, baseType: !292, size: 32, offset: 4416)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !118, line: 331, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !118, line: 331, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !118, line: 338, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !118, line: 338, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !80, line: 408, baseType: !79)
!329 = !{i32 7, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 7, !"PIC Level", i32 2}
!333 = !{i32 7, !"uwtable", i32 1}
!334 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!335 = distinct !DISubprogram(name: "TSEventInitialize", scope: !336, file: !336, line: 6, type: !337, scopeLine: 7, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !840)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/event/tsevent.c", directory: "/home/users/ndemeye/xSDK")
!337 = !DISubroutineType(types: !338)
!338 = !{!138, !339, !360, !231, !378}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !80, line: 71, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !80, line: 410, size: 1792, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !356, !816, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !838, !839}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !341, file: !80, line: 411, baseType: !239, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !341, file: !80, line: 412, baseType: !239, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !341, file: !80, line: 413, baseType: !231, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !341, file: !80, line: 414, baseType: !231, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !341, file: !80, line: 415, baseType: !231, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !341, file: !80, line: 416, baseType: !239, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !341, file: !80, line: 417, baseType: !222, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !341, file: !80, line: 418, baseType: !231, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !341, file: !80, line: 419, baseType: !231, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !341, file: !80, line: 420, baseType: !231, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !341, file: !80, line: 421, baseType: !231, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !341, file: !80, line: 422, baseType: !355, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !341, file: !80, line: 423, baseType: !357, size: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!138, !360, !231, !378, !239, !121}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !33, line: 17, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !80, line: 144, size: 17408, elements: !363)
!363 = !{!364, !366, !465, !467, !469, !474, !475, !476, !539, !541, !542, !549, !555, !557, !558, !563, !564, !565, !566, !567, !568, !572, !576, !577, !578, !582, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !692, !696, !700, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !752, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !782, !783, !784, !785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !814, !815}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !362, file: !80, line: 145, baseType: !365, size: 4480)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !125, line: 122, baseType: !124)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !362, file: !80, line: 145, baseType: !367, size: 2048, offset: 4480)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 2048, elements: !173)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !80, line: 33, size: 2048, elements: !369)
!369 = !{!370, !381, !388, !392, !393, !394, !398, !403, !407, !411, !412, !416, !417, !421, !422, !423, !429, !430, !431, !432, !433, !434, !435, !436, !437, !443, !447, !451, !455, !459, !460, !461}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !368, file: !80, line: 34, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!138, !374, !378, !378, !360}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !375, line: 18, baseType: !376)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !375, line: 18, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !25, line: 21, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !368, file: !80, line: 35, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!138, !374, !378, !385, !385, !360}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !54, line: 16, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !54, line: 16, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !368, file: !80, line: 36, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!138, !360}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !368, file: !80, line: 37, baseType: !389, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !368, file: !80, line: 38, baseType: !389, size: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !368, file: !80, line: 39, baseType: !395, size: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!138, !360, !231, !378}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !368, file: !80, line: 40, baseType: !399, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!138, !360, !402, !222, !230}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !368, file: !80, line: 41, baseType: !404, size: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!138, !360, !177, !378, !355}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !368, file: !80, line: 42, baseType: !408, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!138, !268, !360}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !368, file: !80, line: 43, baseType: !389, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !368, file: !80, line: 44, baseType: !413, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!138, !360, !144}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !368, file: !80, line: 45, baseType: !389, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !368, file: !80, line: 46, baseType: !418, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!138, !360, !231, !231, !230, !230}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !368, file: !80, line: 47, baseType: !413, size: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !368, file: !80, line: 48, baseType: !389, size: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !368, file: !80, line: 49, baseType: !424, size: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!138, !360, !222, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !368, file: !80, line: 50, baseType: !389, size: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !368, file: !80, line: 51, baseType: !389, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !368, file: !80, line: 52, baseType: !389, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !368, file: !80, line: 53, baseType: !389, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !368, file: !80, line: 54, baseType: !389, size: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !368, file: !80, line: 55, baseType: !389, size: 64, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !368, file: !80, line: 56, baseType: !389, size: 64, offset: 1408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !368, file: !80, line: 57, baseType: !389, size: 64, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !368, file: !80, line: 58, baseType: !438, size: 64, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!138, !360, !222, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !368, file: !80, line: 59, baseType: !444, size: 64, offset: 1600)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!138, !360, !222, !428}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !368, file: !80, line: 60, baseType: !448, size: 64, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!138, !360, !428}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !368, file: !80, line: 61, baseType: !452, size: 64, offset: 1728)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!138, !360, !177, !428}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !368, file: !80, line: 62, baseType: !456, size: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!138, !360, !378}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !368, file: !80, line: 63, baseType: !389, size: 64, offset: 1856)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !368, file: !80, line: 64, baseType: !456, size: 64, offset: 1920)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !368, file: !80, line: 65, baseType: !462, size: 64, offset: 1984)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!138, !360, !378, !378}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !362, file: !80, line: 146, baseType: !466, size: 32, offset: 6528)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !33, line: 57, baseType: !32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !362, file: !80, line: 147, baseType: !468, size: 32, offset: 6560)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !33, line: 88, baseType: !37)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !362, file: !80, line: 149, baseType: !470, size: 64, offset: 6592)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !471, line: 14, baseType: !472)
!471 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !471, line: 14, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !362, file: !80, line: 150, baseType: !378, size: 64, offset: 6656)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !362, file: !80, line: 151, baseType: !378, size: 64, offset: 6720)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !362, file: !80, line: 152, baseType: !477, size: 64, offset: 6784)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !33, line: 686, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !80, line: 319, size: 10112, elements: !480)
!480 = !{!481, !482, !504, !505, !509, !524, !525, !526, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !479, file: !80, line: 320, baseType: !365, size: 4480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !479, file: !80, line: 320, baseType: !483, size: 384, offset: 4480)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 384, elements: !173)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !80, line: 310, size: 384, elements: !485)
!485 = !{!486, !490, !494, !495, !499, !503}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !484, file: !80, line: 311, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!138, !477, !360, !231, !222, !230, !355, !230, !230, !230}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !484, file: !80, line: 312, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!138, !477}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !484, file: !80, line: 313, baseType: !491, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !484, file: !80, line: 314, baseType: !496, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!138, !477, !144}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !484, file: !80, line: 315, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!138, !268, !477}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !484, file: !80, line: 316, baseType: !496, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !80, line: 321, baseType: !121, size: 64, offset: 4864)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !479, file: !80, line: 322, baseType: !506, size: 64, offset: 4928)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!138, !477, !360, !231, !378, !355}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !479, file: !80, line: 331, baseType: !510, size: 4160, offset: 4992)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !80, line: 323, size: 4160, elements: !511)
!511 = !{!512, !513, !514, !518, !520, !521, !523}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !510, file: !80, line: 324, baseType: !177, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !510, file: !80, line: 325, baseType: !292, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !510, file: !80, line: 326, baseType: !515, size: 1024, offset: 64)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !510, file: !80, line: 327, baseType: !519, size: 512, offset: 1088)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 512, elements: !516)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !510, file: !80, line: 328, baseType: !519, size: 512, offset: 1600)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !510, file: !80, line: 329, baseType: !522, size: 1024, offset: 2112)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 1024, elements: !516)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !510, file: !80, line: 330, baseType: !522, size: 1024, offset: 3136)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !479, file: !80, line: 332, baseType: !292, size: 32, offset: 9152)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !479, file: !80, line: 333, baseType: !231, size: 64, offset: 9216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !479, file: !80, line: 334, baseType: !231, size: 64, offset: 9280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !479, file: !80, line: 335, baseType: !528, size: 128, offset: 9344)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 128, elements: !253)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !479, file: !80, line: 336, baseType: !231, size: 64, offset: 9472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !479, file: !80, line: 336, baseType: !231, size: 64, offset: 9536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !479, file: !80, line: 337, baseType: !231, size: 64, offset: 9600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !479, file: !80, line: 338, baseType: !292, size: 32, offset: 9664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !479, file: !80, line: 339, baseType: !231, size: 64, offset: 9728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !479, file: !80, line: 340, baseType: !528, size: 128, offset: 9792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !479, file: !80, line: 341, baseType: !402, size: 32, offset: 9920)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !479, file: !80, line: 342, baseType: !144, size: 64, offset: 9984)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !479, file: !80, line: 343, baseType: !177, size: 32, offset: 10048)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !479, file: !80, line: 344, baseType: !177, size: 32, offset: 10080)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !362, file: !80, line: 153, baseType: !540, size: 64, offset: 6848)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !33, line: 695, baseType: !114)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !362, file: !80, line: 154, baseType: !339, size: 64, offset: 6912)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !362, file: !80, line: 157, baseType: !543, size: 640, offset: 6976)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 640, elements: !547)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!138, !360, !177, !231, !378, !121}
!547 = !{!548}
!548 = !DISubrange(count: 10)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !362, file: !80, line: 158, baseType: !550, size: 640, offset: 7616)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 640, elements: !547)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!138, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !362, file: !80, line: 159, baseType: !556, size: 640, offset: 8256)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 640, elements: !547)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !362, file: !80, line: 160, baseType: !177, size: 32, offset: 8896)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !362, file: !80, line: 161, baseType: !559, size: 640, offset: 8960)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 640, elements: !547)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!138, !360, !177, !231, !378, !177, !428, !428, !121}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !362, file: !80, line: 162, baseType: !550, size: 640, offset: 9600)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !362, file: !80, line: 163, baseType: !556, size: 640, offset: 10240)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !362, file: !80, line: 164, baseType: !177, size: 32, offset: 10880)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !362, file: !80, line: 165, baseType: !177, size: 32, offset: 10912)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !362, file: !80, line: 167, baseType: !389, size: 64, offset: 10944)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !362, file: !80, line: 168, baseType: !569, size: 64, offset: 11008)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!138, !360, !231}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !362, file: !80, line: 169, baseType: !573, size: 64, offset: 11072)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!138, !360, !231, !177, !428}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !362, file: !80, line: 170, baseType: !389, size: 64, offset: 11136)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !362, file: !80, line: 171, baseType: !389, size: 64, offset: 11200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !362, file: !80, line: 172, baseType: !579, size: 64, offset: 11264)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!138, !360, !231, !378, !355}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !362, file: !80, line: 175, baseType: !583, size: 64, offset: 11328)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !33, line: 293, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !80, line: 89, size: 7040, elements: !586)
!586 = !{!587, !588, !617, !621, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !658, !659, !660, !661, !662, !666, !667, !668}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !585, file: !80, line: 90, baseType: !365, size: 4480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !585, file: !80, line: 90, baseType: !589, size: 448, offset: 4480)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 448, elements: !173)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !80, line: 75, size: 448, elements: !591)
!591 = !{!592, !596, !600, !601, !605, !609, !613}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !590, file: !80, line: 76, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!138, !583, !144}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !590, file: !80, line: 77, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!138, !583}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !590, file: !80, line: 78, baseType: !597, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !590, file: !80, line: 79, baseType: !602, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!138, !583, !360, !177, !231, !378}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !590, file: !80, line: 80, baseType: !606, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!138, !583, !360, !177, !230}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !590, file: !80, line: 81, baseType: !610, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!138, !268, !583}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !590, file: !80, line: 82, baseType: !614, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!138, !583, !360}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !585, file: !80, line: 91, baseType: !618, size: 64, offset: 4928)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !80, line: 87, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !80, line: 87, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !585, file: !80, line: 116, baseType: !622, size: 1024, offset: 4992)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !585, file: !80, line: 93, size: 1024, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !639}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !622, file: !80, line: 94, baseType: !177, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !622, file: !80, line: 95, baseType: !428, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !622, file: !80, line: 96, baseType: !239, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !622, file: !80, line: 97, baseType: !230, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !622, file: !80, line: 98, baseType: !428, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !622, file: !80, line: 99, baseType: !355, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !622, file: !80, line: 100, baseType: !230, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !622, file: !80, line: 103, baseType: !292, size: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !622, file: !80, line: 109, baseType: !633, size: 256, offset: 512)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !80, line: 104, size: 256, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !633, file: !80, line: 105, baseType: !185, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !633, file: !80, line: 106, baseType: !215, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !633, file: !80, line: 107, baseType: !231, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !633, file: !80, line: 108, baseType: !177, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !622, file: !80, line: 115, baseType: !640, size: 256, offset: 768)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !80, line: 110, size: 256, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !640, file: !80, line: 111, baseType: !185, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !640, file: !80, line: 112, baseType: !215, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !640, file: !80, line: 113, baseType: !231, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !640, file: !80, line: 114, baseType: !177, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !585, file: !80, line: 117, baseType: !378, size: 64, offset: 6016)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !585, file: !80, line: 117, baseType: !378, size: 64, offset: 6080)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !585, file: !80, line: 118, baseType: !292, size: 32, offset: 6144)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !585, file: !80, line: 119, baseType: !292, size: 32, offset: 6176)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !585, file: !80, line: 120, baseType: !292, size: 32, offset: 6208)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !585, file: !80, line: 121, baseType: !144, size: 64, offset: 6272)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !585, file: !80, line: 122, baseType: !177, size: 32, offset: 6336)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !585, file: !80, line: 123, baseType: !177, size: 32, offset: 6368)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !585, file: !80, line: 124, baseType: !177, size: 32, offset: 6400)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !585, file: !80, line: 124, baseType: !177, size: 32, offset: 6432)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !585, file: !80, line: 125, baseType: !657, size: 64, offset: 6464)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !585, file: !80, line: 126, baseType: !292, size: 32, offset: 6528)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !585, file: !80, line: 127, baseType: !204, size: 64, offset: 6592)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !585, file: !80, line: 127, baseType: !204, size: 64, offset: 6656)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !585, file: !80, line: 128, baseType: !204, size: 64, offset: 6720)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !585, file: !80, line: 129, baseType: !663, size: 64, offset: 6784)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!138, !121, !378, !428}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !585, file: !80, line: 130, baseType: !259, size: 64, offset: 6848)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !585, file: !80, line: 131, baseType: !121, size: 64, offset: 6912)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !80, line: 132, baseType: !121, size: 64, offset: 6976)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !362, file: !80, line: 176, baseType: !428, size: 64, offset: 11392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !362, file: !80, line: 177, baseType: !428, size: 64, offset: 11456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !362, file: !80, line: 178, baseType: !177, size: 32, offset: 11520)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !362, file: !80, line: 179, baseType: !378, size: 64, offset: 11584)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !362, file: !80, line: 180, baseType: !177, size: 32, offset: 11648)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !362, file: !80, line: 181, baseType: !177, size: 32, offset: 11680)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !362, file: !80, line: 182, baseType: !177, size: 32, offset: 11712)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !362, file: !80, line: 183, baseType: !292, size: 32, offset: 11744)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !362, file: !80, line: 184, baseType: !292, size: 32, offset: 11776)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !362, file: !80, line: 185, baseType: !378, size: 64, offset: 11840)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !362, file: !80, line: 186, baseType: !385, size: 64, offset: 11904)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !362, file: !80, line: 186, baseType: !385, size: 64, offset: 11968)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !362, file: !80, line: 187, baseType: !121, size: 64, offset: 12032)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !362, file: !80, line: 187, baseType: !121, size: 64, offset: 12096)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !362, file: !80, line: 188, baseType: !121, size: 64, offset: 12160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !362, file: !80, line: 189, baseType: !428, size: 64, offset: 12224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !362, file: !80, line: 190, baseType: !428, size: 64, offset: 12288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !362, file: !80, line: 191, baseType: !378, size: 64, offset: 12352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !362, file: !80, line: 191, baseType: !378, size: 64, offset: 12416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !362, file: !80, line: 194, baseType: !689, size: 64, offset: 12480)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!138, !360, !231, !378, !385, !121}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !362, file: !80, line: 195, baseType: !693, size: 64, offset: 12544)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!138, !360, !231, !378, !378, !231, !385, !121}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !362, file: !80, line: 196, baseType: !697, size: 64, offset: 12608)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!138, !360, !231, !378, !378, !121}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !362, file: !80, line: 197, baseType: !701, size: 64, offset: 12672)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!138, !360, !231, !378, !428, !121}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !362, file: !80, line: 198, baseType: !701, size: 64, offset: 12736)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !362, file: !80, line: 201, baseType: !428, size: 64, offset: 12800)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !362, file: !80, line: 202, baseType: !428, size: 64, offset: 12864)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !362, file: !80, line: 203, baseType: !378, size: 64, offset: 12928)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !362, file: !80, line: 204, baseType: !428, size: 64, offset: 12992)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !362, file: !80, line: 204, baseType: !428, size: 64, offset: 13056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !362, file: !80, line: 205, baseType: !428, size: 64, offset: 13120)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !362, file: !80, line: 205, baseType: !428, size: 64, offset: 13184)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !362, file: !80, line: 206, baseType: !428, size: 64, offset: 13248)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !362, file: !80, line: 206, baseType: !428, size: 64, offset: 13312)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !362, file: !80, line: 207, baseType: !428, size: 64, offset: 13376)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !362, file: !80, line: 207, baseType: !428, size: 64, offset: 13440)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !362, file: !80, line: 208, baseType: !121, size: 64, offset: 13504)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !362, file: !80, line: 208, baseType: !121, size: 64, offset: 13568)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !362, file: !80, line: 209, baseType: !719, size: 64, offset: 13632)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!138, !360, !231, !378, !428, !378, !428, !121}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !362, file: !80, line: 210, baseType: !719, size: 64, offset: 13696)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !362, file: !80, line: 211, baseType: !719, size: 64, offset: 13760)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !362, file: !80, line: 212, baseType: !719, size: 64, offset: 13824)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !362, file: !80, line: 213, baseType: !719, size: 64, offset: 13888)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !362, file: !80, line: 214, baseType: !719, size: 64, offset: 13952)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !362, file: !80, line: 215, baseType: !719, size: 64, offset: 14016)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !362, file: !80, line: 216, baseType: !719, size: 64, offset: 14080)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !362, file: !80, line: 219, baseType: !385, size: 64, offset: 14144)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !362, file: !80, line: 220, baseType: !378, size: 64, offset: 14208)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !362, file: !80, line: 221, baseType: !428, size: 64, offset: 14272)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !362, file: !80, line: 222, baseType: !177, size: 32, offset: 14336)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !362, file: !80, line: 223, baseType: !177, size: 32, offset: 14368)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !362, file: !80, line: 224, baseType: !121, size: 64, offset: 14400)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !362, file: !80, line: 225, baseType: !177, size: 32, offset: 14464)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !362, file: !80, line: 226, baseType: !292, size: 32, offset: 14496)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !362, file: !80, line: 227, baseType: !701, size: 64, offset: 14528)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !362, file: !80, line: 231, baseType: !385, size: 64, offset: 14592)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !362, file: !80, line: 232, baseType: !385, size: 64, offset: 14656)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !362, file: !80, line: 233, baseType: !378, size: 64, offset: 14720)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !362, file: !80, line: 247, baseType: !742, size: 384, offset: 14784)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !80, line: 238, size: 384, elements: !743)
!743 = !{!744, !745, !746, !747, !749, !750, !751}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !742, file: !80, line: 239, baseType: !231, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !742, file: !80, line: 240, baseType: !185, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !742, file: !80, line: 241, baseType: !215, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !742, file: !80, line: 242, baseType: !748, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !54, line: 285, baseType: !53)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !742, file: !80, line: 245, baseType: !292, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !742, file: !80, line: 246, baseType: !231, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !742, file: !80, line: 246, baseType: !231, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !362, file: !80, line: 251, baseType: !753, size: 64, offset: 15168)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !80, line: 249, size: 64, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !753, file: !80, line: 250, baseType: !231, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !362, file: !80, line: 253, baseType: !748, size: 32, offset: 15232)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !362, file: !80, line: 255, baseType: !374, size: 64, offset: 15296)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !362, file: !80, line: 256, baseType: !292, size: 32, offset: 15360)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !362, file: !80, line: 258, baseType: !177, size: 32, offset: 15392)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !362, file: !80, line: 259, baseType: !177, size: 32, offset: 15424)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !362, file: !80, line: 260, baseType: !177, size: 32, offset: 15456)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !362, file: !80, line: 261, baseType: !177, size: 32, offset: 15488)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !362, file: !80, line: 264, baseType: !177, size: 32, offset: 15520)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !362, file: !80, line: 264, baseType: !177, size: 32, offset: 15552)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !362, file: !80, line: 264, baseType: !177, size: 32, offset: 15584)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !362, file: !80, line: 264, baseType: !177, size: 32, offset: 15616)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !362, file: !80, line: 267, baseType: !177, size: 32, offset: 15648)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !80, line: 268, baseType: !121, size: 64, offset: 15680)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !362, file: !80, line: 269, baseType: !121, size: 64, offset: 15744)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !362, file: !80, line: 272, baseType: !177, size: 32, offset: 15808)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !362, file: !80, line: 273, baseType: !231, size: 64, offset: 15872)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !362, file: !80, line: 277, baseType: !292, size: 32, offset: 15936)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !362, file: !80, line: 278, baseType: !292, size: 32, offset: 15968)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !362, file: !80, line: 279, baseType: !177, size: 32, offset: 16000)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !362, file: !80, line: 280, baseType: !231, size: 64, offset: 16064)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !362, file: !80, line: 281, baseType: !231, size: 64, offset: 16128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !362, file: !80, line: 282, baseType: !231, size: 64, offset: 16192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !362, file: !80, line: 283, baseType: !231, size: 64, offset: 16256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !362, file: !80, line: 284, baseType: !231, size: 64, offset: 16320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !362, file: !80, line: 286, baseType: !781, size: 32, offset: 16384)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !33, line: 115, baseType: !60)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !362, file: !80, line: 287, baseType: !292, size: 32, offset: 16416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !362, file: !80, line: 288, baseType: !177, size: 32, offset: 16448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !362, file: !80, line: 288, baseType: !177, size: 32, offset: 16480)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !362, file: !80, line: 289, baseType: !786, size: 32, offset: 16512)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !33, line: 217, baseType: !73)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !362, file: !80, line: 291, baseType: !231, size: 64, offset: 16576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !362, file: !80, line: 291, baseType: !231, size: 64, offset: 16640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !362, file: !80, line: 292, baseType: !378, size: 64, offset: 16704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !362, file: !80, line: 292, baseType: !378, size: 64, offset: 16768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !362, file: !80, line: 293, baseType: !231, size: 64, offset: 16832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !362, file: !80, line: 293, baseType: !231, size: 64, offset: 16896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !362, file: !80, line: 295, baseType: !292, size: 32, offset: 16960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !362, file: !80, line: 296, baseType: !292, size: 32, offset: 16992)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !362, file: !80, line: 298, baseType: !177, size: 32, offset: 17024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !362, file: !80, line: 299, baseType: !428, size: 64, offset: 17088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !362, file: !80, line: 302, baseType: !177, size: 32, offset: 17152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !362, file: !80, line: 303, baseType: !799, size: 64, offset: 17216)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !80, line: 135, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !80, line: 136, size: 320, elements: !802)
!802 = !{!803, !804, !805, !810, !811}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !801, file: !80, line: 137, baseType: !360, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !801, file: !80, line: 138, baseType: !204, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !801, file: !80, line: 139, baseType: !806, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !807, line: 11, baseType: !808)
!807 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !807, line: 11, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !80, line: 140, baseType: !799, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !801, file: !80, line: 141, baseType: !812, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !813, line: 80, baseType: !38)
!813 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!814 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !362, file: !80, line: 304, baseType: !292, size: 32, offset: 17280)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !362, file: !80, line: 307, baseType: !360, size: 64, offset: 17344)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !341, file: !80, line: 424, baseType: !817, size: 64, offset: 832)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!138, !360, !177, !222, !231, !378, !292, !121}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !341, file: !80, line: 425, baseType: !121, size: 64, offset: 896)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !341, file: !80, line: 426, baseType: !222, size: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !341, file: !80, line: 427, baseType: !355, size: 64, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !341, file: !80, line: 428, baseType: !177, size: 32, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !341, file: !80, line: 429, baseType: !177, size: 32, offset: 1120)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !341, file: !80, line: 430, baseType: !222, size: 64, offset: 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !341, file: !80, line: 431, baseType: !230, size: 64, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !341, file: !80, line: 432, baseType: !328, size: 32, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !341, file: !80, line: 433, baseType: !177, size: 32, offset: 1312)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !341, file: !80, line: 434, baseType: !144, size: 64, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !341, file: !80, line: 442, baseType: !831, size: 320, offset: 1408)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !80, line: 436, size: 320, elements: !832)
!832 = !{!833, !834, !835, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !831, file: !80, line: 437, baseType: !177, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !831, file: !80, line: 438, baseType: !230, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !831, file: !80, line: 439, baseType: !222, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !831, file: !80, line: 440, baseType: !222, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !831, file: !80, line: 441, baseType: !224, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !341, file: !80, line: 443, baseType: !177, size: 32, offset: 1728)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !341, file: !80, line: 444, baseType: !177, size: 32, offset: 1760)
!840 = !{!841, !842, !843, !844, !845, !846}
!841 = !DILocalVariable(name: "event", arg: 1, scope: !335, file: !336, line: 6, type: !339)
!842 = !DILocalVariable(name: "ts", arg: 2, scope: !335, file: !336, line: 6, type: !360)
!843 = !DILocalVariable(name: "t", arg: 3, scope: !335, file: !336, line: 6, type: !231)
!844 = !DILocalVariable(name: "U", arg: 4, scope: !335, file: !336, line: 6, type: !378)
!845 = !DILocalVariable(name: "ierr", scope: !335, file: !336, line: 8, type: !138)
!846 = !DILocalVariable(name: "ierr__", scope: !847, file: !336, line: 17, type: !138)
!847 = distinct !DILexicalBlock(scope: !335, file: !336, line: 17, column: 71)
!848 = !DILocation(line: 0, scope: !335)
!849 = !DILocation(line: 10, column: 3, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !336, line: 10, column: 3)
!851 = distinct !DILexicalBlock(scope: !852, file: !336, line: 10, column: 3)
!852 = distinct !DILexicalBlock(scope: !335, file: !336, line: 10, column: 3)
!853 = !{!854, !854, i64 0}
!854 = !{!"any pointer", !855, i64 0}
!855 = !{!"omnipotent char", !856, i64 0}
!856 = !{!"Simple C/C++ TBAA"}
!857 = !DILocation(line: 10, column: 3, scope: !851)
!858 = !DILocation(line: 10, column: 3, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !336, line: 10, column: 3)
!860 = distinct !DILexicalBlock(scope: !850, file: !336, line: 10, column: 3)
!861 = !{!862, !863, i64 1536}
!862 = !{!"", !855, i64 0, !855, i64 512, !855, i64 1024, !855, i64 1280, !863, i64 1536, !863, i64 1540, !855, i64 1544}
!863 = !{!"int", !855, i64 0}
!864 = !DILocation(line: 10, column: 3, scope: !860)
!865 = !DILocation(line: 10, column: 3, scope: !866)
!866 = distinct !DILexicalBlock(scope: !859, file: !336, line: 10, column: 3)
!867 = !{!863, !863, i64 0}
!868 = !{!862, !863, i64 1540}
!869 = !DILocation(line: 11, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !335, file: !336, line: 11, column: 7)
!871 = !DILocation(line: 11, column: 7, scope: !335)
!872 = !DILocation(line: 11, column: 15, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !336, line: 11, column: 15)
!874 = distinct !DILexicalBlock(scope: !875, file: !336, line: 11, column: 15)
!875 = distinct !DILexicalBlock(scope: !876, file: !336, line: 11, column: 15)
!876 = distinct !DILexicalBlock(scope: !877, file: !336, line: 11, column: 15)
!877 = distinct !DILexicalBlock(scope: !870, file: !336, line: 11, column: 15)
!878 = !DILocation(line: 11, column: 15, scope: !874)
!879 = !DILocation(line: 11, column: 15, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !336, line: 11, column: 15)
!881 = distinct !DILexicalBlock(scope: !873, file: !336, line: 11, column: 15)
!882 = !{!862, !855, i64 1544}
!883 = !DILocation(line: 11, column: 15, scope: !881)
!884 = !DILocation(line: 11, column: 15, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !336, line: 11, column: 15)
!886 = !DILocation(line: 11, column: 15, scope: !887)
!887 = distinct !DILexicalBlock(scope: !873, file: !336, line: 11, column: 15)
!888 = !DILocation(line: 11, column: 15, scope: !889)
!889 = distinct !DILexicalBlock(scope: !887, file: !336, line: 11, column: 15)
!890 = !DILocation(line: 11, column: 15, scope: !891)
!891 = distinct !DILexicalBlock(scope: !892, file: !336, line: 11, column: 15)
!892 = distinct !DILexicalBlock(scope: !889, file: !336, line: 11, column: 15)
!893 = !DILocation(line: 11, column: 15, scope: !892)
!894 = !DILocation(line: 11, column: 15, scope: !895)
!895 = distinct !DILexicalBlock(scope: !891, file: !336, line: 11, column: 15)
!896 = !DILocation(line: 12, column: 3, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !336, line: 12, column: 3)
!898 = distinct !DILexicalBlock(scope: !335, file: !336, line: 12, column: 3)
!899 = !DILocation(line: 12, column: 3, scope: !898)
