; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexnatural.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexnatural.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 213, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39}
!31 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 35, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!79 = !{!80, !99, !180, !120, !255, !170, !87, !289, !206, !292}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !83, line: 73, size: 4480, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !88, !141, !142, !144, !147, !148, !149, !150, !158, !159, !161, !165, !169, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !183, !184, !185, !187, !188, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !204, !205, !208, !210, !211, !212, !222, !224, !225, !229, !230, !279, !284, !286, !287, !288}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !82, file: !83, line: 74, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !87)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !82, file: !83, line: 75, baseType: !89, size: 448, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 448, elements: !139)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !83, line: 53, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 45, size: 448, elements: !92)
!92 = !{!93, !103, !111, !116, !123, !127, !134}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !91, file: !83, line: 46, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !80, !98}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !87)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !100, line: 330, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !100, line: 330, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !91, file: !83, line: 47, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!97, !80, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !108, line: 16, baseType: !109)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !108, line: 16, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !91, file: !83, line: 48, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!97, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !91, file: !83, line: 49, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!97, !80, !120, !80}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !91, file: !83, line: 50, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!97, !80, !120, !115}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !91, file: !83, line: 51, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!97, !80, !120, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !91, file: !83, line: 52, baseType: !135, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!97, !80, !120, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!139 = !{!140}
!140 = !DISubrange(count: 1)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !82, file: !83, line: 76, baseType: !99, size: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !83, line: 77, baseType: !143, size: 32, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !87)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !82, file: !83, line: 78, baseType: !145, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !146)
!146 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !82, file: !83, line: 78, baseType: !145, size: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !82, file: !83, line: 78, baseType: !145, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !82, file: !83, line: 78, baseType: !145, size: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !82, file: !83, line: 79, baseType: !151, size: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !154, line: 27, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !156, line: 43, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!157 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !82, file: !83, line: 80, baseType: !143, size: 32, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !82, file: !83, line: 81, baseType: !160, size: 32, offset: 992)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !87)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !82, file: !83, line: 82, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !82, file: !83, line: 83, baseType: !166, size: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !82, file: !83, line: 84, baseType: !170, size: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !82, file: !83, line: 85, baseType: !170, size: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !82, file: !83, line: 86, baseType: !170, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !82, file: !83, line: 87, baseType: !170, size: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !82, file: !83, line: 88, baseType: !80, size: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !82, file: !83, line: 89, baseType: !151, size: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 90, baseType: !170, size: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !82, file: !83, line: 91, baseType: !170, size: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !82, file: !83, line: 92, baseType: !143, size: 32, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !82, file: !83, line: 93, baseType: !180, size: 64, offset: 1728)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !82, file: !83, line: 94, baseType: !182, size: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !82, file: !83, line: 95, baseType: !143, size: 32, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !82, file: !83, line: 95, baseType: !143, size: 32, offset: 1888)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !82, file: !83, line: 96, baseType: !186, size: 64, offset: 1920)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !82, file: !83, line: 96, baseType: !186, size: 64, offset: 1984)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !82, file: !83, line: 97, baseType: !189, size: 64, offset: 2048)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !82, file: !83, line: 97, baseType: !191, size: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !82, file: !83, line: 98, baseType: !143, size: 32, offset: 2176)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !82, file: !83, line: 98, baseType: !143, size: 32, offset: 2208)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !82, file: !83, line: 99, baseType: !186, size: 64, offset: 2240)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !82, file: !83, line: 99, baseType: !186, size: 64, offset: 2304)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !82, file: !83, line: 100, baseType: !197, size: 64, offset: 2368)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !146)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !82, file: !83, line: 100, baseType: !200, size: 64, offset: 2432)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !82, file: !83, line: 101, baseType: !143, size: 32, offset: 2496)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !82, file: !83, line: 101, baseType: !143, size: 32, offset: 2528)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !82, file: !83, line: 102, baseType: !186, size: 64, offset: 2560)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !82, file: !83, line: 102, baseType: !186, size: 64, offset: 2624)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !82, file: !83, line: 103, baseType: !206, size: 64, offset: 2688)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !198)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !82, file: !83, line: 103, baseType: !209, size: 64, offset: 2752)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !82, file: !83, line: 104, baseType: !138, size: 64, offset: 2816)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !82, file: !83, line: 105, baseType: !143, size: 32, offset: 2880)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !82, file: !83, line: 106, baseType: !213, size: 128, offset: 2944)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !220)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !83, line: 64, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 61, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !216, file: !83, line: 62, baseType: !131, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !216, file: !83, line: 63, baseType: !180, size: 64, offset: 64)
!220 = !{!221}
!221 = !DISubrange(count: 2)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !82, file: !83, line: 107, baseType: !223, size: 64, offset: 3072)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !220)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !82, file: !83, line: 108, baseType: !180, size: 64, offset: 3136)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !82, file: !83, line: 109, baseType: !226, size: 64, offset: 3200)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!97, !180}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !82, file: !83, line: 111, baseType: !143, size: 32, offset: 3264)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !82, file: !83, line: 112, baseType: !231, size: 320, offset: 3328)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 320, elements: !277)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!97, !235, !80, !180}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !238)
!238 = !{!239, !240, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !237, file: !10, line: 100, baseType: !143, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !10, line: 101, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !252, !253, !254, !258, !260, !262, !263, !264}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !243, file: !10, line: 84, baseType: !170, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !243, file: !10, line: 85, baseType: !170, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !10, line: 86, baseType: !180, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !243, file: !10, line: 87, baseType: !162, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !243, file: !10, line: 88, baseType: !250, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !243, file: !10, line: 89, baseType: !122, size: 8, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !243, file: !10, line: 90, baseType: !170, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !243, file: !10, line: 91, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 46, baseType: !257)
!256 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!257 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !243, file: !10, line: 92, baseType: !259, size: 32, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !10, line: 93, baseType: !261, size: 32, offset: 544)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !10, line: 94, baseType: !241, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !243, file: !10, line: 95, baseType: !170, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !243, file: !10, line: 96, baseType: !180, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !237, file: !10, line: 102, baseType: !170, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !237, file: !10, line: 102, baseType: !170, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !237, file: !10, line: 103, baseType: !170, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !237, file: !10, line: 104, baseType: !99, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !237, file: !10, line: 105, baseType: !259, size: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !237, file: !10, line: 105, baseType: !259, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !237, file: !10, line: 105, baseType: !259, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !237, file: !10, line: 106, baseType: !80, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !237, file: !10, line: 107, baseType: !274, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!277 = !{!278}
!278 = !DISubrange(count: 5)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !82, file: !83, line: 113, baseType: !280, size: 320, offset: 3648)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!97, !80, !180}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !82, file: !83, line: 114, baseType: !285, size: 320, offset: 3968)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 320, elements: !277)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !82, file: !83, line: 115, baseType: !259, size: 32, offset: 4288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !82, file: !83, line: 120, baseType: !274, size: 64, offset: 4352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !82, file: !83, line: 121, baseType: !259, size: 32, offset: 4416)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !100, line: 331, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !100, line: 331, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !100, line: 338, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !100, line: 338, flags: DIFlagFwdDecl)
!295 = !{i32 7, !"Dwarf Version", i32 4}
!296 = !{i32 2, !"Debug Info Version", i32 3}
!297 = !{i32 1, !"wchar_size", i32 4}
!298 = !{i32 7, !"PIC Level", i32 2}
!299 = !{i32 7, !"uwtable", i32 1}
!300 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!301 = distinct !DISubprogram(name: "DMPlexSetMigrationSF", scope: !302, file: !302, line: 16, type: !303, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1053)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexnatural.c", directory: "/home/users/ndemeye/xSDK")
!303 = !DISubroutineType(types: !304)
!304 = !{!97, !305, !464}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !308)
!308 = !{!309, !311, !548, !552, !553, !554, !555, !565, !566, !574, !575, !583, !584, !585, !586, !590, !591, !595, !597, !599, !600, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !628, !640, !652, !664, !673, !674, !697, !698, !699, !700, !701, !702, !704, !795, !796, !816, !817, !818, !819, !820, !821, !825, !826, !830, !831, !832, !833, !834, !835, !836, !837, !838, !841, !853, !854, !855, !864, !952, !953, !1041, !1042, !1043, !1044, !1046, !1048, !1049, !1050, !1051, !1052}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !307, file: !47, line: 203, baseType: !310, size: 4480)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !83, line: 122, baseType: !82)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !307, file: !47, line: 203, baseType: !312, size: 3456, offset: 4480)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 3456, elements: !139)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !314)
!314 = !{!315, !319, !320, !325, !329, !333, !334, !335, !344, !345, !346, !358, !359, !367, !376, !385, !389, !393, !394, !399, !400, !404, !405, !409, !410, !418, !422, !427, !428, !429, !430, !431, !432, !433, !437, !443, !447, !452, !456, !467, !471, !476, !483, !487, !488, !494, !505, !509, !519, !523, !531, !535, !543, !544}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !313, file: !47, line: 31, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!97, !305, !107}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !313, file: !47, line: 32, baseType: !316, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !313, file: !47, line: 33, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!97, !305, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !313, file: !47, line: 34, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!97, !235, !305}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !313, file: !47, line: 35, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!97, !305}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !313, file: !47, line: 36, baseType: !330, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !313, file: !47, line: 37, baseType: !330, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !313, file: !47, line: 38, baseType: !336, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!97, !305, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !341, line: 21, baseType: !342)
!341 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !341, line: 21, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !313, file: !47, line: 39, baseType: !336, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !313, file: !47, line: 40, baseType: !330, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !313, file: !47, line: 41, baseType: !347, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!97, !305, !189, !350, !352}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !355, line: 11, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !355, line: 11, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !313, file: !47, line: 42, baseType: !321, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !313, file: !47, line: 43, baseType: !360, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!97, !305, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !313, file: !47, line: 45, baseType: !368, size: 64, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!97, !305, !371, !372}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !355, line: 51, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !355, line: 51, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !313, file: !47, line: 46, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!97, !305, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !382, line: 16, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !313, file: !47, line: 47, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!97, !305, !305, !380, !339}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !313, file: !47, line: 48, baseType: !390, size: 64, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!97, !305, !305, !380}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !313, file: !47, line: 49, baseType: !390, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !313, file: !47, line: 50, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!97, !305, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !313, file: !47, line: 51, baseType: !390, size: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !313, file: !47, line: 53, baseType: !401, size: 64, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!97, !305, !99, !324}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !313, file: !47, line: 54, baseType: !401, size: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !313, file: !47, line: 55, baseType: !406, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!97, !305, !143, !324}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !313, file: !47, line: 56, baseType: !406, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !313, file: !47, line: 57, baseType: !411, size: 64, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!97, !305, !414, !324}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !415, line: 12, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !415, line: 12, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !313, file: !47, line: 58, baseType: !419, size: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!97, !305, !340, !414, !324}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !313, file: !47, line: 60, baseType: !423, size: 64, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!97, !305, !340, !426, !340}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !313, file: !47, line: 61, baseType: !423, size: 64, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !313, file: !47, line: 62, baseType: !423, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !313, file: !47, line: 63, baseType: !423, size: 64, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !313, file: !47, line: 64, baseType: !423, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !313, file: !47, line: 65, baseType: !423, size: 64, offset: 1984)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !313, file: !47, line: 67, baseType: !330, size: 64, offset: 2048)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !313, file: !47, line: 69, baseType: !434, size: 64, offset: 2112)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!97, !305, !340, !340}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !313, file: !47, line: 71, baseType: !438, size: 64, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!97, !305, !143, !441, !353, !324}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !313, file: !47, line: 72, baseType: !444, size: 64, offset: 2240)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!97, !324, !143, !352, !324}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !313, file: !47, line: 73, baseType: !448, size: 64, offset: 2304)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!97, !305, !189, !350, !352, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !313, file: !47, line: 74, baseType: !453, size: 64, offset: 2368)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!97, !305, !189, !350, !352, !352, !451}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !313, file: !47, line: 75, baseType: !457, size: 64, offset: 2432)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!97, !305, !143, !324, !460, !460, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !463, line: 59, baseType: !464)
!463 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !463, line: 15, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !463, line: 15, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !313, file: !47, line: 77, baseType: !468, size: 64, offset: 2496)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!97, !305, !143, !189, !189}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !313, file: !47, line: 78, baseType: !472, size: 64, offset: 2560)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!97, !305, !340, !475, !464}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !313, file: !47, line: 79, baseType: !477, size: 64, offset: 2624)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!97, !305, !189, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !313, file: !47, line: 80, baseType: !484, size: 64, offset: 2688)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!97, !305, !197, !197}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !313, file: !47, line: 81, baseType: !484, size: 64, offset: 2752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !313, file: !47, line: 82, baseType: !489, size: 64, offset: 2816)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!97, !305, !340, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !313, file: !47, line: 84, baseType: !495, size: 64, offset: 2880)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!97, !305, !198, !498, !504, !426, !340}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!97, !143, !198, !502, !143, !206, !180}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !313, file: !47, line: 85, baseType: !506, size: 64, offset: 2944)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!97, !305, !198, !414, !143, !441, !143, !441, !498, !504, !426, !340}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !313, file: !47, line: 86, baseType: !510, size: 64, offset: 3008)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!97, !305, !198, !340, !513, !426, !340}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !143, !143, !143, !441, !441, !517, !517, !517, !441, !441, !517, !517, !517, !198, !502, !143, !517, !206}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !313, file: !47, line: 87, baseType: !520, size: 64, offset: 3072)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!97, !305, !198, !414, !143, !441, !143, !441, !340, !513, !426, !340}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !313, file: !47, line: 88, baseType: !524, size: 64, offset: 3136)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!97, !305, !198, !414, !143, !441, !143, !441, !340, !527, !426, !340}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !143, !143, !143, !441, !441, !517, !517, !517, !441, !441, !517, !517, !517, !198, !502, !502, !143, !517, !206}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !313, file: !47, line: 89, baseType: !532, size: 64, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!97, !305, !198, !498, !504, !340, !197}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !313, file: !47, line: 90, baseType: !536, size: 64, offset: 3264)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!97, !305, !198, !539, !504, !340, !502, !197}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!97, !143, !198, !502, !502, !143, !206, !180}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !313, file: !47, line: 91, baseType: !532, size: 64, offset: 3328)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !313, file: !47, line: 93, baseType: !545, size: 64, offset: 3392)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!97, !305, !305, !398, !398}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !307, file: !47, line: 204, baseType: !549, size: 6400, offset: 7936)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 6400, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 100)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !307, file: !47, line: 204, baseType: !549, size: 6400, offset: 14336)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !307, file: !47, line: 205, baseType: !549, size: 6400, offset: 20736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !307, file: !47, line: 205, baseType: !549, size: 6400, offset: 27136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !307, file: !47, line: 206, baseType: !556, size: 64, offset: 33536)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !559)
!559 = !{!560, !561, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !558, file: !47, line: 143, baseType: !340, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !47, line: 144, baseType: !170, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !558, file: !47, line: 145, baseType: !563, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !47, line: 146, baseType: !556, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !307, file: !47, line: 207, baseType: !556, size: 64, offset: 33600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !307, file: !47, line: 208, baseType: !567, size: 64, offset: 33664)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !569, file: !47, line: 151, baseType: !255, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !569, file: !47, line: 152, baseType: !180, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !47, line: 153, baseType: !567, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !307, file: !47, line: 208, baseType: !567, size: 64, offset: 33728)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !307, file: !47, line: 209, baseType: !576, size: 64, offset: 33792)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !578, file: !47, line: 159, baseType: !414, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !578, file: !47, line: 160, baseType: !259, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !47, line: 161, baseType: !577, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !307, file: !47, line: 210, baseType: !414, size: 64, offset: 33856)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !307, file: !47, line: 211, baseType: !414, size: 64, offset: 33920)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !307, file: !47, line: 212, baseType: !180, size: 64, offset: 33984)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !307, file: !47, line: 213, baseType: !587, size: 64, offset: 34048)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!97, !504}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !307, file: !47, line: 214, baseType: !371, size: 32, offset: 34112)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !307, file: !47, line: 215, baseType: !592, size: 64, offset: 34176)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !382, line: 1378, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !382, line: 1378, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !307, file: !47, line: 216, baseType: !596, size: 64, offset: 34240)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !341, line: 83, baseType: !120)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !307, file: !47, line: 217, baseType: !598, size: 64, offset: 34304)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !382, line: 25, baseType: !120)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !307, file: !47, line: 218, baseType: !143, size: 32, offset: 34368)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !307, file: !47, line: 219, baseType: !601, size: 64, offset: 34432)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !355, line: 30, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !355, line: 30, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !307, file: !47, line: 220, baseType: !259, size: 32, offset: 34496)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !307, file: !47, line: 221, baseType: !259, size: 32, offset: 34528)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !307, file: !47, line: 222, baseType: !143, size: 32, offset: 34560)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !307, file: !47, line: 222, baseType: !143, size: 32, offset: 34592)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !307, file: !47, line: 223, baseType: !259, size: 32, offset: 34624)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !307, file: !47, line: 224, baseType: !259, size: 32, offset: 34656)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !47, line: 225, baseType: !180, size: 64, offset: 34688)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !307, file: !47, line: 227, baseType: !305, size: 64, offset: 34752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !307, file: !47, line: 228, baseType: !305, size: 64, offset: 34816)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !307, file: !47, line: 229, baseType: !614, size: 64, offset: 34880)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !617)
!617 = !{!618, !622, !626, !627}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !616, file: !47, line: 102, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!97, !305, !305, !180}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !616, file: !47, line: 103, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!97, !305, !381, !340, !381, !305, !180}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !616, file: !47, line: 104, baseType: !180, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !47, line: 105, baseType: !614, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !307, file: !47, line: 230, baseType: !629, size: 64, offset: 34944)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !632)
!632 = !{!633, !634, !638, !639}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !631, file: !47, line: 110, baseType: !619, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !631, file: !47, line: 111, baseType: !635, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!97, !305, !381, !305, !180}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !631, file: !47, line: 112, baseType: !180, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !631, file: !47, line: 113, baseType: !629, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !307, file: !47, line: 231, baseType: !641, size: 64, offset: 35008)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !644)
!644 = !{!645, !646, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !643, file: !47, line: 118, baseType: !619, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !643, file: !47, line: 119, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!97, !305, !462, !462, !305, !180}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !643, file: !47, line: 120, baseType: !180, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !47, line: 121, baseType: !641, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !307, file: !47, line: 232, baseType: !653, size: 64, offset: 35072)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !656)
!656 = !{!657, !661, !662, !663}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !655, file: !47, line: 126, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!97, !305, !340, !426, !340, !180}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !655, file: !47, line: 127, baseType: !658, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !655, file: !47, line: 128, baseType: !180, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !47, line: 129, baseType: !653, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !307, file: !47, line: 233, baseType: !665, size: 64, offset: 35136)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !668)
!668 = !{!669, !670, !671, !672}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !667, file: !47, line: 134, baseType: !658, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !667, file: !47, line: 135, baseType: !658, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !667, file: !47, line: 136, baseType: !180, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !47, line: 137, baseType: !665, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !307, file: !47, line: 235, baseType: !143, size: 32, offset: 35200)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !307, file: !47, line: 237, baseType: !675, size: 64, offset: 35264)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !679)
!679 = !{!680, !684, !685, !686, !687, !689, !696}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !678, file: !47, line: 27, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !682, line: 166, baseType: !683)
!682 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !682, line: 139, baseType: !5)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !678, file: !47, line: 27, baseType: !681, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !678, file: !47, line: 27, baseType: !681, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !678, file: !47, line: 27, baseType: !681, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !47, line: 27, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !678, file: !47, line: 27, baseType: !690, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !692, file: !47, line: 19, baseType: !414, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !692, file: !47, line: 20, baseType: !143, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !678, file: !47, line: 27, baseType: !339, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !307, file: !47, line: 239, baseType: !464, size: 64, offset: 35328)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !307, file: !47, line: 240, baseType: !464, size: 64, offset: 35392)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !307, file: !47, line: 241, baseType: !464, size: 64, offset: 35456)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !307, file: !47, line: 242, baseType: !464, size: 64, offset: 35520)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !307, file: !47, line: 243, baseType: !259, size: 32, offset: 35584)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !307, file: !47, line: 245, baseType: !703, size: 64, offset: 35616)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 64, elements: !220)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !307, file: !47, line: 246, baseType: !705, size: 64, offset: 35712)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !706, line: 18, baseType: !707)
!706 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !709, line: 29, size: 5760, elements: !710)
!709 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!710 = !{!711, !712, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !730, !731, !732, !733, !758, !759, !760}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !708, file: !709, line: 30, baseType: !310, size: 4480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !708, file: !709, line: 30, baseType: !713, size: 32, offset: 4480)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32, elements: !139)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !708, file: !709, line: 31, baseType: !143, size: 32, offset: 4512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !708, file: !709, line: 31, baseType: !143, size: 32, offset: 4544)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !708, file: !709, line: 32, baseType: !354, size: 64, offset: 4608)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !708, file: !709, line: 33, baseType: !259, size: 32, offset: 4672)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !708, file: !709, line: 34, baseType: !259, size: 32, offset: 4704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !708, file: !709, line: 35, baseType: !189, size: 64, offset: 4736)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !708, file: !709, line: 36, baseType: !189, size: 64, offset: 4800)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !708, file: !709, line: 37, baseType: !143, size: 32, offset: 4864)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !708, file: !709, line: 38, baseType: !705, size: 64, offset: 4928)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !708, file: !709, line: 39, baseType: !189, size: 64, offset: 4992)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !708, file: !709, line: 40, baseType: !259, size: 32, offset: 5056)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !708, file: !709, line: 42, baseType: !143, size: 32, offset: 5088)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !708, file: !709, line: 43, baseType: !351, size: 64, offset: 5120)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !708, file: !709, line: 44, baseType: !189, size: 64, offset: 5184)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !708, file: !709, line: 45, baseType: !729, size: 64, offset: 5248)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !708, file: !709, line: 46, baseType: !259, size: 32, offset: 5312)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !708, file: !709, line: 47, baseType: !350, size: 64, offset: 5376)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !708, file: !709, line: 49, baseType: !80, size: 64, offset: 5440)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !708, file: !709, line: 50, baseType: !734, size: 64, offset: 5504)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !709, line: 27, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !709, line: 27, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !709, line: 27, size: 320, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !751}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !737, file: !709, line: 27, baseType: !681, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !709, line: 27, baseType: !681, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !737, file: !709, line: 27, baseType: !681, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !737, file: !709, line: 27, baseType: !681, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !737, file: !709, line: 27, baseType: !688, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !737, file: !709, line: 27, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !709, line: 10, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !709, line: 8, size: 64, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !747, file: !709, line: 9, baseType: !143, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !747, file: !709, line: 9, baseType: !143, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !737, file: !709, line: 27, baseType: !752, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !709, line: 14, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !709, line: 12, size: 128, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !754, file: !709, line: 13, baseType: !189, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !754, file: !709, line: 13, baseType: !189, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !708, file: !709, line: 51, baseType: !705, size: 64, offset: 5568)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !708, file: !709, line: 52, baseType: !354, size: 64, offset: 5632)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !708, file: !709, line: 53, baseType: !761, size: 64, offset: 5696)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !706, line: 33, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !709, line: 72, size: 4864, elements: !764)
!764 = !{!765, !766, !784, !785, !794}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !763, file: !709, line: 73, baseType: !310, size: 4480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !763, file: !709, line: 73, baseType: !767, size: 192, offset: 4480)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 192, elements: !139)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !709, line: 56, size: 192, elements: !769)
!769 = !{!770, !776, !780}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !768, file: !709, line: 57, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!97, !761, !705, !143, !441, !774, !775}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !768, file: !709, line: 58, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!97, !761}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !768, file: !709, line: 59, baseType: !781, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!97, !761, !107}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !709, line: 74, baseType: !180, size: 64, offset: 4672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !763, file: !709, line: 75, baseType: !786, size: 64, offset: 4736)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !709, line: 62, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !709, line: 64, size: 256, elements: !789)
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !709, line: 66, baseType: !786, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !788, file: !709, line: 67, baseType: !774, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !788, file: !709, line: 68, baseType: !775, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !788, file: !709, line: 69, baseType: !143, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !763, file: !709, line: 76, baseType: !786, size: 64, offset: 4800)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !307, file: !47, line: 247, baseType: !705, size: 64, offset: 35776)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !307, file: !47, line: 248, baseType: !797, size: 64, offset: 35840)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !355, line: 60, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !799, file: !25, line: 241, baseType: !99, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !799, file: !25, line: 242, baseType: !160, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !799, file: !25, line: 243, baseType: !143, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !799, file: !25, line: 243, baseType: !143, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !799, file: !25, line: 244, baseType: !143, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !799, file: !25, line: 244, baseType: !143, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !799, file: !25, line: 245, baseType: !189, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !799, file: !25, line: 246, baseType: !259, size: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !799, file: !25, line: 247, baseType: !143, size: 32, offset: 352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !799, file: !25, line: 251, baseType: !143, size: 32, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !799, file: !25, line: 252, baseType: !601, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !799, file: !25, line: 253, baseType: !259, size: 32, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !799, file: !25, line: 254, baseType: !143, size: 32, offset: 544)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !799, file: !25, line: 254, baseType: !143, size: 32, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !799, file: !25, line: 255, baseType: !143, size: 32, offset: 608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !307, file: !47, line: 250, baseType: !705, size: 64, offset: 35904)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !307, file: !47, line: 251, baseType: !381, size: 64, offset: 35968)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !307, file: !47, line: 253, baseType: !305, size: 64, offset: 36032)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !307, file: !47, line: 254, baseType: !340, size: 64, offset: 36096)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !307, file: !47, line: 255, baseType: !180, size: 64, offset: 36160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !307, file: !47, line: 256, baseType: !822, size: 64, offset: 36224)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!97, !305, !180}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !307, file: !47, line: 257, baseType: !822, size: 64, offset: 36288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !307, file: !47, line: 258, baseType: !827, size: 64, offset: 36352)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!97, !305, !502, !259, !775, !180}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !307, file: !47, line: 260, baseType: !143, size: 32, offset: 36416)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !307, file: !47, line: 261, baseType: !305, size: 64, offset: 36480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !307, file: !47, line: 262, baseType: !340, size: 64, offset: 36544)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !307, file: !47, line: 263, baseType: !340, size: 64, offset: 36608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !307, file: !47, line: 264, baseType: !259, size: 32, offset: 36672)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !307, file: !47, line: 265, baseType: !364, size: 64, offset: 36736)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !307, file: !47, line: 266, baseType: !197, size: 64, offset: 36800)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !307, file: !47, line: 266, baseType: !197, size: 64, offset: 36864)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !307, file: !47, line: 267, baseType: !839, size: 64, offset: 36928)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !307, file: !47, line: 269, baseType: !842, size: 640, offset: 36992)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 640, elements: !851)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!97, !305, !143, !143, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !382, line: 1723, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !382, line: 1723, flags: DIFlagFwdDecl)
!851 = !{!852}
!852 = !DISubrange(count: 10)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !307, file: !47, line: 270, baseType: !842, size: 640, offset: 37632)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !307, file: !47, line: 272, baseType: !143, size: 32, offset: 38272)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !307, file: !47, line: 273, baseType: !856, size: 64, offset: 38336)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !858, file: !47, line: 174, baseType: !80, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !858, file: !47, line: 175, baseType: !414, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !858, file: !47, line: 176, baseType: !703, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !858, file: !47, line: 177, baseType: !259, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !307, file: !47, line: 274, baseType: !865, size: 64, offset: 38400)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !868)
!868 = !{!869, !950, !951}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !867, file: !47, line: 168, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !871, line: 11, baseType: !872)
!871 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !871, line: 13, size: 832, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !941, !943, !944, !945, !946, !947, !948, !949}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !871, line: 14, baseType: !120, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !873, file: !871, line: 15, baseType: !414, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !873, file: !871, line: 16, baseType: !120, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !873, file: !871, line: 17, baseType: !143, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !873, file: !871, line: 18, baseType: !189, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !873, file: !871, line: 19, baseType: !881, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !882, line: 22, baseType: !883)
!882 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !871, line: 81, size: 4992, elements: !885)
!885 = !{!886, !887, !901, !902, !903, !912}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !884, file: !871, line: 82, baseType: !310, size: 4480)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !884, file: !871, line: 82, baseType: !888, size: 256, offset: 4480)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 256, elements: !139)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !871, line: 74, size: 256, elements: !890)
!890 = !{!891, !895, !896, !900}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !889, file: !871, line: 75, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!97, !881}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !889, file: !871, line: 76, baseType: !892, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !889, file: !871, line: 77, baseType: !897, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!97, !881, !107}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !889, file: !871, line: 78, baseType: !892, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !884, file: !871, line: 83, baseType: !180, size: 64, offset: 4736)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !884, file: !871, line: 85, baseType: !143, size: 32, offset: 4800)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !884, file: !871, line: 86, baseType: !904, size: 64, offset: 4864)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !871, line: 41, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 36, size: 256, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !906, file: !871, line: 37, baseType: !255, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !906, file: !871, line: 38, baseType: !255, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !906, file: !871, line: 39, baseType: !255, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !906, file: !871, line: 40, baseType: !170, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !884, file: !871, line: 87, baseType: !913, size: 64, offset: 4928)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !871, line: 54, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !871, line: 54, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !871, line: 54, size: 320, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !933}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !917, file: !871, line: 54, baseType: !681, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !917, file: !871, line: 54, baseType: !681, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !917, file: !871, line: 54, baseType: !681, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !917, file: !871, line: 54, baseType: !681, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !917, file: !871, line: 54, baseType: !688, size: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !917, file: !871, line: 54, baseType: !925, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !882, line: 41, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !882, line: 35, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !927, file: !882, line: 37, baseType: !414, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !927, file: !882, line: 38, baseType: !143, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !927, file: !882, line: 39, baseType: !143, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !927, file: !882, line: 40, baseType: !143, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !917, file: !871, line: 54, baseType: !934, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !871, line: 34, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 30, size: 96, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !936, file: !871, line: 31, baseType: !143, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !936, file: !871, line: 32, baseType: !143, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !936, file: !871, line: 33, baseType: !143, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !873, file: !871, line: 20, baseType: !942, size: 32, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !873, file: !871, line: 21, baseType: !143, size: 32, offset: 416)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !873, file: !871, line: 22, baseType: !143, size: 32, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !873, file: !871, line: 23, baseType: !189, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !873, file: !871, line: 24, baseType: !131, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !873, file: !871, line: 25, baseType: !131, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !873, file: !871, line: 26, baseType: !180, size: 64, offset: 704)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !873, file: !871, line: 27, baseType: !870, size: 64, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !867, file: !47, line: 169, baseType: !414, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !47, line: 170, baseType: !865, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !307, file: !47, line: 275, baseType: !143, size: 32, offset: 38464)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !307, file: !47, line: 276, baseType: !954, size: 64, offset: 38528)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !957)
!957 = !{!958, !1039, !1040}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !956, file: !47, line: 181, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !882, line: 13, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !871, line: 98, size: 7232, elements: !962)
!962 = !{!963, !964, !978, !979, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !995, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !961, file: !871, line: 99, baseType: !310, size: 4480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !961, file: !871, line: 99, baseType: !965, size: 256, offset: 4480)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 256, elements: !139)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !871, line: 91, size: 256, elements: !967)
!967 = !{!968, !972, !973, !977}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !966, file: !871, line: 92, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!97, !959}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !966, file: !871, line: 93, baseType: !969, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !966, file: !871, line: 94, baseType: !974, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!97, !959, !107}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !966, file: !871, line: 95, baseType: !969, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !961, file: !871, line: 100, baseType: !180, size: 64, offset: 4736)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !961, file: !871, line: 101, baseType: !980, size: 64, offset: 4800)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !961, file: !871, line: 102, baseType: !259, size: 32, offset: 4864)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !961, file: !871, line: 103, baseType: !259, size: 32, offset: 4896)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !961, file: !871, line: 104, baseType: !143, size: 32, offset: 4928)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !961, file: !871, line: 105, baseType: !143, size: 32, offset: 4960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !961, file: !871, line: 106, baseType: !115, size: 64, offset: 4992)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !961, file: !871, line: 108, baseType: !870, size: 64, offset: 5056)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !961, file: !871, line: 109, baseType: !259, size: 32, offset: 5120)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !961, file: !871, line: 110, baseType: !398, size: 64, offset: 5184)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !961, file: !871, line: 111, baseType: !189, size: 64, offset: 5248)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !961, file: !871, line: 112, baseType: !881, size: 64, offset: 5312)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !961, file: !871, line: 113, baseType: !992, size: 64, offset: 5376)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !994, line: 563, baseType: !514)
!994 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!995 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !961, file: !871, line: 114, baseType: !996, size: 64, offset: 5440)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !994, line: 580, baseType: !499)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !961, file: !871, line: 115, baseType: !504, size: 64, offset: 5504)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !961, file: !871, line: 116, baseType: !996, size: 64, offset: 5568)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !961, file: !871, line: 117, baseType: !504, size: 64, offset: 5632)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !961, file: !871, line: 118, baseType: !143, size: 32, offset: 5696)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !961, file: !871, line: 119, baseType: !206, size: 64, offset: 5760)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !961, file: !871, line: 120, baseType: !504, size: 64, offset: 5824)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !961, file: !871, line: 122, baseType: !143, size: 32, offset: 5888)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !961, file: !871, line: 123, baseType: !143, size: 32, offset: 5920)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !961, file: !871, line: 124, baseType: !189, size: 64, offset: 5952)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !961, file: !871, line: 125, baseType: !189, size: 64, offset: 6016)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !961, file: !871, line: 126, baseType: !189, size: 64, offset: 6080)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !961, file: !871, line: 127, baseType: !189, size: 64, offset: 6144)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !961, file: !871, line: 128, baseType: !1011, size: 64, offset: 6208)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1013, line: 481, baseType: !1014)
!1013 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
