; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/block/block.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/block/block.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._ISOps = type { i32 (%struct._p_IS*, i32**)*, i32 (%struct._p_IS*, i32**)*, i32 (%struct._p_IS*, i32, %struct._p_IS**)*, i32 (%struct._p_IS*)*, i32 (%struct._p_IS*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, %struct._p_IS**)*, i32 (%struct._p_IS*)*, i32 (%struct._p_IS*, %struct._p_PetscViewer*)*, i32 (%struct._p_IS*, %struct._p_PetscViewer*)*, i32 (%struct._p_IS*, %struct._p_IS*)*, i32 (%struct._p_IS*)*, i32 (%struct._p_IS*, %struct.ompi_communicator_t*, i32, %struct._p_IS**)*, i32 (%struct._p_IS*, i32)*, i32 (%struct._p_IS*, i32, i32, i32*, i32*)*, i32 (%struct._p_IS*, i32, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)*, i32 (%struct._p_IS*, i32*)* }

!75 = !DIEnumerator(name: "IS_INTERVAL", value: 3)
!76 = !DIEnumerator(name: "IS_IDENTITY", value: 4)
!77 = !DIEnumerator(name: "IS_INFO_MAX", value: 5)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 64, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "IS_LOCAL", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "IS_GLOBAL", value: 1, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 119, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!85 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!127 = !{!128, !132, !133, !336, !168, !302, !337, !218, !339, !347, !69, !236}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !129, line: 330, baseType: !130)
!129 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !129, line: 330, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !136, line: 73, size: 4480, elements: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!137 = !{!138, !140, !189, !190, !192, !195, !196, !197, !198, !206, !207, !209, !213, !217, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !230, !231, !232, !234, !235, !237, !239, !240, !241, !242, !243, !246, !248, !249, !250, !251, !252, !255, !257, !258, !259, !269, !271, !272, !276, !277, !326, !331, !333, !334, !335}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !135, file: !136, line: 74, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !69)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !135, file: !136, line: 75, baseType: !141, size: 448, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 448, elements: !187)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !136, line: 53, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 45, size: 448, elements: !144)
!144 = !{!145, !151, !159, !164, !171, !175, !182}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !143, file: !136, line: 46, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !133, !150}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !69)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !143, file: !136, line: 47, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!149, !133, !155}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !156, line: 16, baseType: !157)
!156 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !156, line: 16, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !143, file: !136, line: 48, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!149, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !143, file: !136, line: 49, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!149, !133, !168, !133}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !143, file: !136, line: 50, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!149, !133, !168, !163}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !143, file: !136, line: 51, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!149, !133, !168, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !143, file: !136, line: 52, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!149, !133, !168, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !135, file: !136, line: 76, baseType: !128, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !136, line: 77, baseType: !191, size: 32, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !69)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !135, file: !136, line: 78, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !194)
!194 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !135, file: !136, line: 78, baseType: !193, size: 64, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !135, file: !136, line: 78, baseType: !193, size: 64, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !135, file: !136, line: 78, baseType: !193, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !136, line: 79, baseType: !199, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !202, line: 27, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !204, line: 43, baseType: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!205 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !135, file: !136, line: 80, baseType: !191, size: 32, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !135, file: !136, line: 81, baseType: !208, size: 32, offset: 992)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !69)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !135, file: !136, line: 82, baseType: !210, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !135, file: !136, line: 83, baseType: !214, size: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !135, file: !136, line: 84, baseType: !218, size: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !135, file: !136, line: 85, baseType: !218, size: 64, offset: 1216)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !135, file: !136, line: 86, baseType: !218, size: 64, offset: 1280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !135, file: !136, line: 87, baseType: !218, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !136, line: 88, baseType: !133, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !135, file: !136, line: 89, baseType: !199, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 90, baseType: !218, size: 64, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !135, file: !136, line: 91, baseType: !218, size: 64, offset: 1600)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !135, file: !136, line: 92, baseType: !191, size: 32, offset: 1664)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !135, file: !136, line: 93, baseType: !132, size: 64, offset: 1728)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !135, file: !136, line: 94, baseType: !229, size: 64, offset: 1792)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !200)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !135, file: !136, line: 95, baseType: !191, size: 32, offset: 1856)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !135, file: !136, line: 95, baseType: !191, size: 32, offset: 1888)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !135, file: !136, line: 96, baseType: !233, size: 64, offset: 1920)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !135, file: !136, line: 96, baseType: !233, size: 64, offset: 1984)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !135, file: !136, line: 97, baseType: !236, size: 64, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !135, file: !136, line: 97, baseType: !238, size: 64, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !135, file: !136, line: 98, baseType: !191, size: 32, offset: 2176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !135, file: !136, line: 98, baseType: !191, size: 32, offset: 2208)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !135, file: !136, line: 99, baseType: !233, size: 64, offset: 2240)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !135, file: !136, line: 99, baseType: !233, size: 64, offset: 2304)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !135, file: !136, line: 100, baseType: !244, size: 64, offset: 2368)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !194)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !135, file: !136, line: 100, baseType: !247, size: 64, offset: 2432)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !135, file: !136, line: 101, baseType: !191, size: 32, offset: 2496)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !135, file: !136, line: 101, baseType: !191, size: 32, offset: 2528)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !135, file: !136, line: 102, baseType: !233, size: 64, offset: 2560)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !135, file: !136, line: 102, baseType: !233, size: 64, offset: 2624)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !135, file: !136, line: 103, baseType: !253, size: 64, offset: 2688)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !245)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !135, file: !136, line: 103, baseType: !256, size: 64, offset: 2752)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !135, file: !136, line: 104, baseType: !186, size: 64, offset: 2816)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !135, file: !136, line: 105, baseType: !191, size: 32, offset: 2880)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !135, file: !136, line: 106, baseType: !260, size: 128, offset: 2944)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, elements: !267)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !136, line: 64, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 61, size: 128, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !263, file: !136, line: 62, baseType: !179, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !263, file: !136, line: 63, baseType: !132, size: 64, offset: 64)
!267 = !{!268}
!268 = !DISubrange(count: 2)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !135, file: !136, line: 107, baseType: !270, size: 64, offset: 3072)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, elements: !267)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !135, file: !136, line: 108, baseType: !132, size: 64, offset: 3136)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !135, file: !136, line: 109, baseType: !273, size: 64, offset: 3200)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!149, !132}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !135, file: !136, line: 111, baseType: !191, size: 32, offset: 3264)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !135, file: !136, line: 112, baseType: !278, size: 320, offset: 3328)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 320, elements: !324)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!149, !282, !133, !132}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !285)
!285 = !{!286, !287, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !284, file: !12, line: 100, baseType: !191, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !12, line: 101, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !299, !300, !301, !305, !307, !309, !310, !311}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !290, file: !12, line: 84, baseType: !218, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !290, file: !12, line: 85, baseType: !218, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !12, line: 86, baseType: !132, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !290, file: !12, line: 87, baseType: !210, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !290, file: !12, line: 88, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !290, file: !12, line: 89, baseType: !170, size: 8, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !290, file: !12, line: 90, baseType: !218, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !290, file: !12, line: 91, baseType: !302, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !303, line: 46, baseType: !304)
!303 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!304 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !290, file: !12, line: 92, baseType: !306, size: 32, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !12, line: 93, baseType: !308, size: 32, offset: 544)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !12, line: 94, baseType: !288, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !290, file: !12, line: 95, baseType: !218, size: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !290, file: !12, line: 96, baseType: !132, size: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !284, file: !12, line: 102, baseType: !218, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !284, file: !12, line: 102, baseType: !218, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !284, file: !12, line: 103, baseType: !218, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !284, file: !12, line: 104, baseType: !128, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !284, file: !12, line: 105, baseType: !306, size: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !284, file: !12, line: 105, baseType: !306, size: 32, offset: 416)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !284, file: !12, line: 105, baseType: !306, size: 32, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !284, file: !12, line: 106, baseType: !133, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !284, file: !12, line: 107, baseType: !321, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!324 = !{!325}
!325 = !DISubrange(count: 5)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !135, file: !136, line: 113, baseType: !327, size: 320, offset: 3648)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 320, elements: !324)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!149, !133, !132}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !135, file: !136, line: 114, baseType: !332, size: 320, offset: 3968)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 320, elements: !324)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !135, file: !136, line: 115, baseType: !306, size: 32, offset: 4288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !136, line: 120, baseType: !321, size: 64, offset: 4352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !135, file: !136, line: 121, baseType: !306, size: 32, offset: 4416)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !338, line: 1451, baseType: !179)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS_Block", file: !341, line: 13, baseType: !342)
!341 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/block/block.c", directory: "/home/users/ndemeye/xSDK")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 9, size: 128, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !342, file: !341, line: 10, baseType: !306, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !342, file: !341, line: 11, baseType: !306, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !342, file: !341, line: 12, baseType: !236, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!348 = !{!0}
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !37, line: 21, size: 1536, elements: !350)
!350 = !{!351, !434, !435, !440, !444, !445, !450, !454, !455, !459, !460, !464, !465, !470, !474, !478, !482, !483, !484, !485, !486, !487, !488, !489}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !349, file: !37, line: 22, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!149, !355, !433}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !356, line: 11, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !37, line: 50, size: 7104, elements: !359)
!359 = !{!360, !362, !364, !420, !421, !422, !423, !424, !425, !426, !427, !430}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !358, file: !37, line: 51, baseType: !361, size: 4480)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !136, line: 122, baseType: !135)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !358, file: !37, line: 51, baseType: !363, size: 1536, offset: 4480)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1536, elements: !187)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !358, file: !37, line: 52, baseType: !365, size: 64, offset: 6016)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !356, line: 60, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !32, line: 240, size: 640, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !416, !417, !418, !419}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !367, file: !32, line: 241, baseType: !128, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !367, file: !32, line: 242, baseType: !208, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !367, file: !32, line: 243, baseType: !191, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !367, file: !32, line: 243, baseType: !191, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !367, file: !32, line: 244, baseType: !191, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !367, file: !32, line: 244, baseType: !191, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !367, file: !32, line: 245, baseType: !236, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !367, file: !32, line: 246, baseType: !306, size: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !367, file: !32, line: 247, baseType: !191, size: 32, offset: 352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !367, file: !32, line: 251, baseType: !191, size: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !367, file: !32, line: 252, baseType: !380, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !356, line: 30, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !37, line: 73, size: 5440, elements: !383)
!383 = !{!384, !385, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !382, file: !37, line: 74, baseType: !361, size: 4480)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !382, file: !37, line: 74, baseType: !386, size: 256, offset: 4480)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 256, elements: !187)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !37, line: 66, size: 256, elements: !388)
!388 = !{!389, !393, !400, !401}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !387, file: !37, line: 67, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!149, !380}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !387, file: !37, line: 68, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!149, !380, !397, !191, !398, !236, !236}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !32, line: 149, baseType: !31)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !387, file: !37, line: 69, baseType: !394, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !387, file: !37, line: 70, baseType: !390, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !382, file: !37, line: 75, baseType: !191, size: 32, offset: 4736)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !382, file: !37, line: 76, baseType: !191, size: 32, offset: 4768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !382, file: !37, line: 77, baseType: !236, size: 64, offset: 4800)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !382, file: !37, line: 78, baseType: !191, size: 32, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !382, file: !37, line: 79, baseType: !191, size: 32, offset: 4896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !382, file: !37, line: 80, baseType: !306, size: 32, offset: 4928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !382, file: !37, line: 81, baseType: !306, size: 32, offset: 4960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !382, file: !37, line: 82, baseType: !191, size: 32, offset: 4992)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !382, file: !37, line: 83, baseType: !236, size: 64, offset: 5056)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !382, file: !37, line: 84, baseType: !236, size: 64, offset: 5120)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !382, file: !37, line: 85, baseType: !238, size: 64, offset: 5184)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !382, file: !37, line: 86, baseType: !236, size: 64, offset: 5248)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !382, file: !37, line: 87, baseType: !238, size: 64, offset: 5312)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !37, line: 88, baseType: !132, size: 64, offset: 5376)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !367, file: !32, line: 253, baseType: !306, size: 32, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !367, file: !32, line: 254, baseType: !191, size: 32, offset: 544)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !367, file: !32, line: 254, baseType: !191, size: 32, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !367, file: !32, line: 255, baseType: !191, size: 32, offset: 608)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !358, file: !37, line: 53, baseType: !191, size: 32, offset: 6080)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !358, file: !37, line: 53, baseType: !191, size: 32, offset: 6112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !37, line: 54, baseType: !132, size: 64, offset: 6144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !358, file: !37, line: 55, baseType: !236, size: 64, offset: 6208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !358, file: !37, line: 55, baseType: !236, size: 64, offset: 6272)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !358, file: !37, line: 56, baseType: !191, size: 32, offset: 6336)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !358, file: !37, line: 57, baseType: !355, size: 64, offset: 6400)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !358, file: !37, line: 58, baseType: !428, size: 320, offset: 6464)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 320, elements: !429)
!429 = !{!268, !325}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !358, file: !37, line: 59, baseType: !431, size: 320, offset: 6784)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 320, elements: !429)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !37, line: 48, baseType: !36)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !349, file: !37, line: 23, baseType: !352, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !349, file: !37, line: 24, baseType: !436, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!149, !355, !191, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !349, file: !37, line: 25, baseType: !441, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!149, !355}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !349, file: !37, line: 26, baseType: !441, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !349, file: !37, line: 27, baseType: !446, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!149, !355, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !349, file: !37, line: 28, baseType: !451, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!149, !355, !439}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !349, file: !37, line: 29, baseType: !441, size: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !37, line: 30, baseType: !456, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!149, !355, !155}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !349, file: !37, line: 31, baseType: !456, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !349, file: !37, line: 32, baseType: !461, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!149, !355, !355}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !349, file: !37, line: 33, baseType: !441, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !349, file: !37, line: 34, baseType: !466, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!149, !355, !128, !469, !439}
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !26)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !349, file: !37, line: 35, baseType: !471, size: 64, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!149, !355, !191}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !349, file: !37, line: 36, baseType: !475, size: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!149, !355, !191, !191, !236, !449}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !349, file: !37, line: 37, baseType: !479, size: 64, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!149, !355, !191, !236}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !349, file: !37, line: 38, baseType: !446, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !349, file: !37, line: 39, baseType: !446, size: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !349, file: !37, line: 40, baseType: !446, size: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !349, file: !37, line: 41, baseType: !446, size: 64, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !349, file: !37, line: 42, baseType: !446, size: 64, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !349, file: !37, line: 43, baseType: !446, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !349, file: !37, line: 44, baseType: !446, size: 64, offset: 1408)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !349, file: !37, line: 45, baseType: !446, size: 64, offset: 1472)
!490 = !{i32 7, !"Dwarf Version", i32 4}
!491 = !{i32 2, !"Debug Info Version", i32 3}
!492 = !{i32 1, !"wchar_size", i32 4}
!493 = !{i32 7, !"PIC Level", i32 2}
!494 = !{i32 7, !"uwtable", i32 1}
!495 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!496 = distinct !DISubprogram(name: "ISBlockSetIndices", scope: !341, file: !341, line: 450, type: !497, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!149, !355, !191, !191, !398, !469}
!499 = !{!500, !501, !502, !503, !504, !505, !506, !508, !511, !512, !514, !518}
!500 = !DILocalVariable(name: "is", arg: 1, scope: !496, file: !341, line: 450, type: !355)
!501 = !DILocalVariable(name: "bs", arg: 2, scope: !496, file: !341, line: 450, type: !191)
!502 = !DILocalVariable(name: "n", arg: 3, scope: !496, file: !341, line: 450, type: !191)
!503 = !DILocalVariable(name: "idx", arg: 4, scope: !496, file: !341, line: 450, type: !398)
!504 = !DILocalVariable(name: "mode", arg: 5, scope: !496, file: !341, line: 450, type: !469)
!505 = !DILocalVariable(name: "ierr", scope: !496, file: !341, line: 452, type: !149)
!506 = !DILocalVariable(name: "ierr__", scope: !507, file: !341, line: 455, type: !149)
!507 = distinct !DILexicalBlock(scope: !496, file: !341, line: 455, column: 43)
!508 = !DILocalVariable(name: "_7_f", scope: !509, file: !341, line: 456, type: !510)
!509 = distinct !DILexicalBlock(scope: !496, file: !341, line: 456, column: 10)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!511 = !DILocalVariable(name: "_7_ierr", scope: !509, file: !341, line: 456, type: !149)
!512 = !DILocalVariable(name: "ierr__", scope: !513, file: !341, line: 456, type: !149)
!513 = distinct !DILexicalBlock(scope: !509, file: !341, line: 456, column: 10)
!514 = !DILocalVariable(name: "ierr__", scope: !515, file: !341, line: 456, type: !149)
!515 = distinct !DILexicalBlock(scope: !516, file: !341, line: 456, column: 10)
!516 = distinct !DILexicalBlock(scope: !517, file: !341, line: 456, column: 10)
!517 = distinct !DILexicalBlock(scope: !509, file: !341, line: 456, column: 10)
!518 = !DILocalVariable(name: "ierr__", scope: !519, file: !341, line: 456, type: !149)
!519 = distinct !DILexicalBlock(scope: !496, file: !341, line: 456, column: 124)
!520 = !DILocation(line: 0, scope: !496)
!521 = !DILocation(line: 454, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !341, line: 454, column: 3)
!523 = distinct !DILexicalBlock(scope: !524, file: !341, line: 454, column: 3)
!524 = distinct !DILexicalBlock(scope: !496, file: !341, line: 454, column: 3)
!525 = !{!526, !526, i64 0}
!526 = !{!"any pointer", !527, i64 0}
!527 = !{!"omnipotent char", !528, i64 0}
!528 = !{!"Simple C/C++ TBAA"}
!529 = !DILocation(line: 454, column: 3, scope: !523)
!530 = !DILocation(line: 454, column: 3, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !341, line: 454, column: 3)
!532 = distinct !DILexicalBlock(scope: !522, file: !341, line: 454, column: 3)
!533 = !{!534, !535, i64 1536}
!534 = !{!"", !527, i64 0, !527, i64 512, !527, i64 1024, !527, i64 1280, !535, i64 1536, !535, i64 1540, !527, i64 1544}
!535 = !{!"int", !527, i64 0}
!536 = !DILocation(line: 454, column: 3, scope: !532)
!537 = !DILocation(line: 454, column: 3, scope: !538)
!538 = distinct !DILexicalBlock(scope: !531, file: !341, line: 454, column: 3)
!539 = !{!535, !535, i64 0}
!540 = !{!534, !535, i64 1540}
!541 = !DILocation(line: 455, column: 10, scope: !496)
!542 = !DILocation(line: 0, scope: !507)
!543 = !DILocation(line: 455, column: 43, scope: !544)
!544 = distinct !DILexicalBlock(scope: !507, file: !341, line: 455, column: 43)
