; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/bcgs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/bcgs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque

!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!131 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!132 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!133 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!134 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!135 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!136 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!137 = !{!138, !142, !143, !146, !155, !210, !355, !358, !237, !26, !361, !321}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !139, line: 330, baseType: !140)
!139 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !139, line: 330, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_BCGS", file: !148, line: 13, baseType: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/bcgs/bcgsimpl.h", directory: "/home/users/ndemeye/xSDK")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 11, size: 64, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !149, file: !148, line: 12, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !158, line: 73, size: 4480, elements: !159)
!158 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!159 = !{!160, !162, !208, !209, !211, !214, !215, !216, !217, !225, !226, !228, !232, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !249, !250, !251, !253, !254, !256, !258, !259, !260, !261, !262, !265, !267, !268, !269, !270, !271, !274, !276, !277, !278, !288, !290, !291, !295, !296, !345, !350, !352, !353, !354}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !157, file: !158, line: 74, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !157, file: !158, line: 75, baseType: !163, size: 448, offset: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 448, elements: !206)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !158, line: 53, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 45, size: 448, elements: !166)
!166 = !{!167, !173, !181, !186, !190, !194, !201}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !165, file: !158, line: 46, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !155, !172}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !165, file: !158, line: 47, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!171, !155, !177}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !178, line: 16, baseType: !179)
!178 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !178, line: 16, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !165, file: !158, line: 48, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!171, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !165, file: !158, line: 49, baseType: !187, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!171, !155, !143, !155}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !165, file: !158, line: 50, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!171, !155, !143, !185}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !165, file: !158, line: 51, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!171, !155, !143, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !165, file: !158, line: 52, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!171, !155, !143, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!206 = !{!207}
!207 = !DISubrange(count: 1)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !157, file: !158, line: 76, baseType: !138, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !158, line: 77, baseType: !210, size: 32, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !157, file: !158, line: 78, baseType: !212, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !213)
!213 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !157, file: !158, line: 78, baseType: !212, size: 64, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !157, file: !158, line: 78, baseType: !212, size: 64, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !157, file: !158, line: 78, baseType: !212, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !158, line: 79, baseType: !218, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !221, line: 27, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !223, line: 43, baseType: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!224 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !157, file: !158, line: 80, baseType: !210, size: 32, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !157, file: !158, line: 81, baseType: !227, size: 32, offset: 992)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !157, file: !158, line: 82, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !157, file: !158, line: 83, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !157, file: !158, line: 84, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !157, file: !158, line: 85, baseType: !237, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !157, file: !158, line: 86, baseType: !237, size: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !157, file: !158, line: 87, baseType: !237, size: 64, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !157, file: !158, line: 88, baseType: !155, size: 64, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !157, file: !158, line: 89, baseType: !218, size: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 90, baseType: !237, size: 64, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !157, file: !158, line: 91, baseType: !237, size: 64, offset: 1600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !157, file: !158, line: 92, baseType: !210, size: 32, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !157, file: !158, line: 93, baseType: !142, size: 64, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !157, file: !158, line: 94, baseType: !248, size: 64, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !219)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !157, file: !158, line: 95, baseType: !210, size: 32, offset: 1856)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !157, file: !158, line: 95, baseType: !210, size: 32, offset: 1888)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !157, file: !158, line: 96, baseType: !252, size: 64, offset: 1920)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !157, file: !158, line: 96, baseType: !252, size: 64, offset: 1984)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !157, file: !158, line: 97, baseType: !255, size: 64, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !157, file: !158, line: 97, baseType: !257, size: 64, offset: 2112)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !157, file: !158, line: 98, baseType: !210, size: 32, offset: 2176)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !157, file: !158, line: 98, baseType: !210, size: 32, offset: 2208)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !157, file: !158, line: 99, baseType: !252, size: 64, offset: 2240)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !157, file: !158, line: 99, baseType: !252, size: 64, offset: 2304)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !157, file: !158, line: 100, baseType: !263, size: 64, offset: 2368)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !213)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !157, file: !158, line: 100, baseType: !266, size: 64, offset: 2432)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !157, file: !158, line: 101, baseType: !210, size: 32, offset: 2496)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !157, file: !158, line: 101, baseType: !210, size: 32, offset: 2528)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !157, file: !158, line: 102, baseType: !252, size: 64, offset: 2560)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !157, file: !158, line: 102, baseType: !252, size: 64, offset: 2624)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !157, file: !158, line: 103, baseType: !272, size: 64, offset: 2688)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !157, file: !158, line: 103, baseType: !275, size: 64, offset: 2752)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !157, file: !158, line: 104, baseType: !205, size: 64, offset: 2816)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !157, file: !158, line: 105, baseType: !210, size: 32, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !157, file: !158, line: 106, baseType: !279, size: 128, offset: 2944)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, elements: !286)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !158, line: 64, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 61, size: 128, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !282, file: !158, line: 62, baseType: !198, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !282, file: !158, line: 63, baseType: !142, size: 64, offset: 64)
!286 = !{!287}
!287 = !DISubrange(count: 2)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !157, file: !158, line: 107, baseType: !289, size: 64, offset: 3072)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 64, elements: !286)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !157, file: !158, line: 108, baseType: !142, size: 64, offset: 3136)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !157, file: !158, line: 109, baseType: !292, size: 64, offset: 3200)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!171, !142}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !157, file: !158, line: 111, baseType: !210, size: 32, offset: 3264)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !157, file: !158, line: 112, baseType: !297, size: 320, offset: 3328)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 320, elements: !343)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!171, !301, !155, !142}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !304)
!304 = !{!305, !306, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !303, file: !10, line: 100, baseType: !210, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !10, line: 101, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !318, !319, !320, !324, !326, !328, !329, !330}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !309, file: !10, line: 84, baseType: !237, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !309, file: !10, line: 85, baseType: !237, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !10, line: 86, baseType: !142, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !309, file: !10, line: 87, baseType: !229, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !309, file: !10, line: 88, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !309, file: !10, line: 89, baseType: !145, size: 8, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !309, file: !10, line: 90, baseType: !237, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !309, file: !10, line: 91, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 46, baseType: !323)
!322 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!323 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !10, line: 92, baseType: !325, size: 32, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !10, line: 93, baseType: !327, size: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !10, line: 94, baseType: !307, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !309, file: !10, line: 95, baseType: !237, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !309, file: !10, line: 96, baseType: !142, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !303, file: !10, line: 102, baseType: !237, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !303, file: !10, line: 102, baseType: !237, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !303, file: !10, line: 103, baseType: !237, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !303, file: !10, line: 104, baseType: !138, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !303, file: !10, line: 105, baseType: !325, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !303, file: !10, line: 105, baseType: !325, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !303, file: !10, line: 105, baseType: !325, size: 32, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !303, file: !10, line: 106, baseType: !155, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !303, file: !10, line: 107, baseType: !340, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!343 = !{!344}
!344 = !DISubrange(count: 5)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !157, file: !158, line: 113, baseType: !346, size: 320, offset: 3648)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 320, elements: !343)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!171, !155, !142}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !157, file: !158, line: 114, baseType: !351, size: 320, offset: 3968)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 320, elements: !343)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !157, file: !158, line: 115, baseType: !325, size: 32, offset: 4288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !157, file: !158, line: 120, baseType: !340, size: 64, offset: 4352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !157, file: !158, line: 121, baseType: !325, size: 32, offset: 4416)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !139, line: 331, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !139, line: 331, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !139, line: 338, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !139, line: 338, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !128)
!362 = !{i32 7, !"Dwarf Version", i32 4}
!363 = !{i32 2, !"Debug Info Version", i32 3}
!364 = !{i32 1, !"wchar_size", i32 4}
!365 = !{i32 7, !"PIC Level", i32 2}
!366 = !{i32 7, !"uwtable", i32 1}
!367 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!368 = distinct !DISubprogram(name: "KSPSetFromOptions_BCGS", scope: !369, file: !369, line: 4, type: !370, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !611)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/bcgs.c", directory: "/home/users/ndemeye/xSDK")
!370 = !DISubroutineType(types: !371)
!371 = !{!171, !301, !372}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !375)
!375 = !{!376, !378, !426, !431, !432, !433, !434, !464, !465, !466, !467, !468, !470, !475, !476, !477, !478, !479, !480, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !504, !510, !511, !512, !513, !518, !519, !520, !521, !526, !527, !528, !529, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !583, !584, !585, !592, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !608, !609, !610}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !374, file: !102, line: 76, baseType: !377, size: 4480)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !158, line: 122, baseType: !157)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !374, file: !102, line: 76, baseType: !379, size: 896, offset: 4480)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 896, elements: !206)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !381)
!381 = !{!382, !387, !391, !395, !403, !404, !406, !407, !411, !415, !419, !420, !424, !425}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !380, file: !102, line: 19, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!171, !372, !152, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !380, file: !102, line: 22, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!171, !372, !152, !152, !386}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !380, file: !102, line: 25, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!171, !372}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !380, file: !102, line: 26, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!171, !372, !399, !399}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !400, line: 16, baseType: !401)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !400, line: 16, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !380, file: !102, line: 27, baseType: !392, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !380, file: !102, line: 28, baseType: !405, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !380, file: !102, line: 29, baseType: !392, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !380, file: !102, line: 30, baseType: !408, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!171, !372, !263, !263}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !380, file: !102, line: 31, baseType: !412, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!171, !372, !210, !263, !263, !255}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !380, file: !102, line: 32, baseType: !416, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!171, !372, !325, !325, !255, !386, !263, !263}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !380, file: !102, line: 33, baseType: !392, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !102, line: 34, baseType: !421, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!171, !372, !177}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !380, file: !102, line: 35, baseType: !392, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !380, file: !102, line: 36, baseType: !421, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !374, file: !102, line: 77, baseType: !427, size: 64, offset: 5376)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !428, line: 14, baseType: !429)
!428 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !428, line: 14, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !374, file: !102, line: 78, baseType: !325, size: 32, offset: 5440)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !374, file: !102, line: 79, baseType: !325, size: 32, offset: 5472)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !374, file: !102, line: 81, baseType: !210, size: 32, offset: 5504)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !374, file: !102, line: 82, baseType: !435, size: 64, offset: 5568)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !438)
!438 = !{!439, !440, !460, !461, !462, !463}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !437, file: !102, line: 55, baseType: !377, size: 4480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !437, file: !102, line: 55, baseType: !441, size: 448, offset: 4480)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 448, elements: !206)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !443)
!443 = !{!444, !448, !449, !453, !454, !455, !459}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !442, file: !102, line: 42, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!171, !435, !152, !152}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !442, file: !102, line: 43, baseType: !445, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !442, file: !102, line: 44, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!171, !435}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !442, file: !102, line: 45, baseType: !450, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !442, file: !102, line: 46, baseType: !450, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !442, file: !102, line: 47, baseType: !456, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!171, !435, !177}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !442, file: !102, line: 48, baseType: !450, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !437, file: !102, line: 56, baseType: !372, size: 64, offset: 4928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !437, file: !102, line: 57, baseType: !399, size: 64, offset: 4992)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !437, file: !102, line: 58, baseType: !248, size: 64, offset: 5056)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !102, line: 59, baseType: !142, size: 64, offset: 5120)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !374, file: !102, line: 83, baseType: !325, size: 32, offset: 5632)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !374, file: !102, line: 84, baseType: !325, size: 32, offset: 5664)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !374, file: !102, line: 85, baseType: !325, size: 32, offset: 5696)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !374, file: !102, line: 86, baseType: !325, size: 32, offset: 5728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !374, file: !102, line: 87, baseType: !469, size: 32, offset: 5760)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !374, file: !102, line: 88, baseType: !471, size: 384, offset: 5792)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 384, elements: !472)
!472 = !{!473, !474}
!473 = !DISubrange(count: 4)
!474 = !DISubrange(count: 3)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !374, file: !102, line: 89, baseType: !264, size: 64, offset: 6208)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !374, file: !102, line: 90, baseType: !264, size: 64, offset: 6272)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !374, file: !102, line: 91, baseType: !264, size: 64, offset: 6336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !374, file: !102, line: 92, baseType: !264, size: 64, offset: 6400)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !374, file: !102, line: 93, baseType: !264, size: 64, offset: 6464)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !374, file: !102, line: 94, baseType: !264, size: 64, offset: 6528)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !374, file: !102, line: 95, baseType: !482, size: 32, offset: 6592)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !374, file: !102, line: 96, baseType: !325, size: 32, offset: 6624)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !374, file: !102, line: 98, baseType: !152, size: 64, offset: 6656)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !374, file: !102, line: 98, baseType: !152, size: 64, offset: 6720)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !374, file: !102, line: 102, baseType: !263, size: 64, offset: 6784)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !374, file: !102, line: 103, baseType: !263, size: 64, offset: 6848)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !374, file: !102, line: 104, baseType: !210, size: 32, offset: 6912)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !374, file: !102, line: 105, baseType: !210, size: 32, offset: 6944)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !374, file: !102, line: 106, baseType: !325, size: 32, offset: 6976)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !374, file: !102, line: 107, baseType: !263, size: 64, offset: 7040)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !374, file: !102, line: 108, baseType: !263, size: 64, offset: 7104)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !374, file: !102, line: 109, baseType: !210, size: 32, offset: 7168)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !374, file: !102, line: 110, baseType: !210, size: 32, offset: 7200)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !374, file: !102, line: 111, baseType: !325, size: 32, offset: 7232)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !374, file: !102, line: 113, baseType: !210, size: 32, offset: 7264)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !374, file: !102, line: 114, baseType: !325, size: 32, offset: 7296)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !374, file: !102, line: 117, baseType: !210, size: 32, offset: 7328)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !374, file: !102, line: 120, baseType: !500, size: 320, offset: 7360)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !343)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!171, !372, !210, !264, !142}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !374, file: !102, line: 121, baseType: !505, size: 320, offset: 7680)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !343)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!171, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !374, file: !102, line: 122, baseType: !351, size: 320, offset: 8000)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !374, file: !102, line: 123, baseType: !210, size: 32, offset: 8320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !374, file: !102, line: 124, baseType: !325, size: 32, offset: 8352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !374, file: !102, line: 126, baseType: !514, size: 320, offset: 8384)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 320, elements: !343)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!171, !372, !142}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !374, file: !102, line: 127, baseType: !505, size: 320, offset: 8704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !374, file: !102, line: 128, baseType: !351, size: 320, offset: 9024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !374, file: !102, line: 129, baseType: !210, size: 32, offset: 9344)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !374, file: !102, line: 131, baseType: !522, size: 64, offset: 9408)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!171, !372, !210, !264, !525, !142}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !374, file: !102, line: 132, baseType: !292, size: 64, offset: 9472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !374, file: !102, line: 133, baseType: !142, size: 64, offset: 9536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !374, file: !102, line: 135, baseType: !142, size: 64, offset: 9600)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !374, file: !102, line: 137, baseType: !530, size: 64, offset: 9664)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !102, line: 139, baseType: !142, size: 64, offset: 9728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9824)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9888)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9952)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 9984)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10016)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10048)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10080)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10112)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10176)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !374, file: !102, line: 142, baseType: !325, size: 32, offset: 10208)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10368)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10432)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10496)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10560)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10624)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10688)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10752)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10816)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10880)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 10944)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 11008)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !374, file: !102, line: 143, baseType: !177, size: 64, offset: 11072)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11136)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11168)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11232)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11264)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11296)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11328)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11360)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11392)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11424)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11456)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11488)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11520)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !374, file: !102, line: 144, baseType: !563, size: 32, offset: 11552)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !374, file: !102, line: 147, baseType: !210, size: 32, offset: 11584)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !374, file: !102, line: 148, baseType: !386, size: 64, offset: 11648)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !374, file: !102, line: 150, baseType: !580, size: 32, offset: 11712)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !374, file: !102, line: 151, baseType: !325, size: 32, offset: 11744)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !374, file: !102, line: 153, baseType: !210, size: 32, offset: 11776)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !374, file: !102, line: 154, baseType: !210, size: 32, offset: 11808)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !374, file: !102, line: 156, baseType: !325, size: 32, offset: 11840)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !374, file: !102, line: 161, baseType: !586, size: 192, offset: 11904)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !102, line: 157, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !586, file: !102, line: 158, baseType: !399, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !586, file: !102, line: 158, baseType: !399, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !586, file: !102, line: 159, baseType: !325, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !586, file: !102, line: 160, baseType: !325, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !374, file: !102, line: 163, baseType: !593, size: 32, offset: 12096)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !374, file: !102, line: 165, baseType: !469, size: 32, offset: 12128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !374, file: !102, line: 166, baseType: !593, size: 32, offset: 12160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !374, file: !102, line: 171, baseType: !325, size: 32, offset: 12192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !374, file: !102, line: 172, baseType: !325, size: 32, offset: 12224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !374, file: !102, line: 173, baseType: !325, size: 32, offset: 12256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !374, file: !102, line: 174, baseType: !152, size: 64, offset: 12288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !374, file: !102, line: 175, baseType: !152, size: 64, offset: 12352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !374, file: !102, line: 177, baseType: !210, size: 32, offset: 12416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !374, file: !102, line: 178, baseType: !325, size: 32, offset: 12448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !374, file: !102, line: 180, baseType: !177, size: 64, offset: 12480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !374, file: !102, line: 182, baseType: !605, size: 64, offset: 12544)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!171, !372, !152, !152, !142}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !374, file: !102, line: 183, baseType: !605, size: 64, offset: 12608)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !374, file: !102, line: 184, baseType: !142, size: 64, offset: 12672)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !374, file: !102, line: 184, baseType: !142, size: 64, offset: 12736)
!611 = !{!612, !613, !614, !615, !617}
!612 = !DILocalVariable(name: "PetscOptionsObject", arg: 1, scope: !368, file: !369, line: 4, type: !301)
!613 = !DILocalVariable(name: "ksp", arg: 2, scope: !368, file: !369, line: 4, type: !372)
!614 = !DILocalVariable(name: "ierr", scope: !368, file: !369, line: 6, type: !171)
!615 = !DILocalVariable(name: "ierr__", scope: !616, file: !369, line: 9, type: !171)
!616 = distinct !DILexicalBlock(scope: !368, file: !369, line: 9, column: 66)
!617 = !DILocalVariable(name: "ierr__", scope: !618, file: !369, line: 10, type: !171)
!618 = distinct !DILexicalBlock(scope: !368, file: !369, line: 10, column: 29)
!619 = !DILocation(line: 0, scope: !368)
!620 = !DILocation(line: 8, column: 3, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !369, line: 8, column: 3)
!622 = distinct !DILexicalBlock(scope: !623, file: !369, line: 8, column: 3)
!623 = distinct !DILexicalBlock(scope: !368, file: !369, line: 8, column: 3)
!624 = !{!625, !625, i64 0}
!625 = !{!"any pointer", !626, i64 0}
!626 = !{!"omnipotent char", !627, i64 0}
!627 = !{!"Simple C/C++ TBAA"}
!628 = !DILocation(line: 8, column: 3, scope: !622)
!629 = !DILocation(line: 8, column: 3, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !369, line: 8, column: 3)
!631 = distinct !DILexicalBlock(scope: !621, file: !369, line: 8, column: 3)
!632 = !{!633, !634, i64 1536}
!633 = !{!"", !626, i64 0, !626, i64 512, !626, i64 1024, !626, i64 1280, !634, i64 1536, !634, i64 1540, !626, i64 1544}
!634 = !{!"int", !626, i64 0}
!635 = !DILocation(line: 8, column: 3, scope: !631)
!636 = !DILocation(line: 8, column: 3, scope: !637)
!637 = distinct !DILexicalBlock(scope: !630, file: !369, line: 8, column: 3)
!638 = !{!634, !634, i64 0}
!639 = !{!633, !634, i64 1540}
!640 = !DILocation(line: 9, column: 10, scope: !368)
!641 = !DILocation(line: 0, scope: !616)
!642 = !DILocation(line: 9, column: 66, scope: !643)
!643 = distinct !DILexicalBlock(scope: !616, file: !369, line: 9, column: 66)
!644 = !DILocation(line: 9, column: 66, scope: !616)
!645 = !{!"branch_weights", i32 2000, i32 1}
!646 = !DILocation(line: 10, column: 10, scope: !647)
!647 = distinct !DILexicalBlock(scope: !648, file: !369, line: 10, column: 10)
!648 = distinct !DILexicalBlock(scope: !368, file: !369, line: 10, column: 10)
!649 = !{!650, !634, i64 0}
!650 = !{!"_p_PetscOptionItems", !634, i64 0, !625, i64 8, !625, i64 16, !625, i64 24, !625, i64 32, !625, i64 40, !626, i64 48, !626, i64 52, !626, i64 56, !625, i64 64, !625, i64 72}
!651 = !DILocation(line: 10, column: 10, scope: !648)
!652 = !DILocation(line: 10, column: 10, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !369, line: 10, column: 10)
!654 = distinct !DILexicalBlock(scope: !647, file: !369, line: 10, column: 10)
!655 = !DILocation(line: 10, column: 10, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !369, line: 10, column: 10)
!657 = distinct !DILexicalBlock(scope: !658, file: !369, line: 10, column: 10)
!658 = distinct !DILexicalBlock(scope: !653, file: !369, line: 10, column: 10)
!659 = !DILocation(line: 10, column: 10, scope: !657)
!660 = !DILocation(line: 10, column: 10, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !369, line: 10, column: 10)
!662 = distinct !DILexicalBlock(scope: !656, file: !369, line: 10, column: 10)
!663 = !{!633, !626, i64 1544}
!664 = !DILocation(line: 10, column: 10, scope: !662)
!665 = !DILocation(line: 10, column: 10, scope: !666)
!666 = distinct !DILexicalBlock(scope: !661, file: !369, line: 10, column: 10)
!667 = !DILocation(line: 10, column: 10, scope: !668)
!668 = distinct !DILexicalBlock(scope: !656, file: !369, line: 10, column: 10)
!669 = !DILocation(line: 10, column: 10, scope: !670)
!670 = distinct !DILexicalBlock(scope: !668, file: !369, line: 10, column: 10)
