; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/nleqerr/linesearchnleqerr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/nleqerr/linesearchnleqerr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!53 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 285, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 406, baseType: !28, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!64 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!65 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!67 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!68 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 493, baseType: !28, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!72 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!73 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 616, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 663, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 517, baseType: !28, size: 32, elements: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!91 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!92 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!93 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!94 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!95 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!96 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!97 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!98 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!99 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!100 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!101 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!102 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!103 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!104 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!105 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!106 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!107 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!108 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!109 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!110 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!111 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 155, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!120 = !{!121, !139, !220, !329, !186, !160, !295, !210}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !124, line: 73, size: 4480, elements: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!125 = !{!126, !128, !181, !182, !184, !187, !188, !189, !190, !198, !199, !201, !205, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !221, !223, !224, !225, !227, !228, !230, !232, !233, !234, !235, !236, !239, !241, !242, !243, !244, !245, !248, !250, !251, !252, !262, !264, !265, !269, !270, !319, !324, !326, !327, !328}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !123, file: !124, line: 74, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !123, file: !124, line: 75, baseType: !129, size: 448, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 448, elements: !179)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !124, line: 53, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 45, size: 448, elements: !132)
!132 = !{!133, !143, !151, !156, !163, !167, !174}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !131, file: !124, line: 46, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !121, !138}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !140, line: 330, baseType: !141)
!140 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !140, line: 330, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !131, file: !124, line: 47, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!137, !121, !147}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !148, line: 16, baseType: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !148, line: 16, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !131, file: !124, line: 48, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!137, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !131, file: !124, line: 49, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!137, !121, !160, !121}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !131, file: !124, line: 50, baseType: !164, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!137, !121, !160, !155}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !131, file: !124, line: 51, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!137, !121, !160, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !131, file: !124, line: 52, baseType: !175, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!137, !121, !160, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !123, file: !124, line: 76, baseType: !139, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !124, line: 77, baseType: !183, size: 32, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !123, file: !124, line: 78, baseType: !185, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !186)
!186 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !123, file: !124, line: 78, baseType: !185, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !123, file: !124, line: 78, baseType: !185, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !123, file: !124, line: 78, baseType: !185, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !124, line: 79, baseType: !191, size: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !194, line: 27, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !196, line: 43, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!197 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !123, file: !124, line: 80, baseType: !183, size: 32, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !123, file: !124, line: 81, baseType: !200, size: 32, offset: 992)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !123, file: !124, line: 82, baseType: !202, size: 64, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !123, file: !124, line: 83, baseType: !206, size: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !123, file: !124, line: 84, baseType: !210, size: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !123, file: !124, line: 85, baseType: !210, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !123, file: !124, line: 86, baseType: !210, size: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !123, file: !124, line: 87, baseType: !210, size: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !123, file: !124, line: 88, baseType: !121, size: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !123, file: !124, line: 89, baseType: !191, size: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 90, baseType: !210, size: 64, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !123, file: !124, line: 91, baseType: !210, size: 64, offset: 1600)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !123, file: !124, line: 92, baseType: !183, size: 32, offset: 1664)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !123, file: !124, line: 93, baseType: !220, size: 64, offset: 1728)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !123, file: !124, line: 94, baseType: !222, size: 64, offset: 1792)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !123, file: !124, line: 95, baseType: !183, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !123, file: !124, line: 95, baseType: !183, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !123, file: !124, line: 96, baseType: !226, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !123, file: !124, line: 96, baseType: !226, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !123, file: !124, line: 97, baseType: !229, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !123, file: !124, line: 97, baseType: !231, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !123, file: !124, line: 98, baseType: !183, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !123, file: !124, line: 98, baseType: !183, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !123, file: !124, line: 99, baseType: !226, size: 64, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !123, file: !124, line: 99, baseType: !226, size: 64, offset: 2304)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !123, file: !124, line: 100, baseType: !237, size: 64, offset: 2368)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !186)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !123, file: !124, line: 100, baseType: !240, size: 64, offset: 2432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !123, file: !124, line: 101, baseType: !183, size: 32, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !123, file: !124, line: 101, baseType: !183, size: 32, offset: 2528)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !123, file: !124, line: 102, baseType: !226, size: 64, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !123, file: !124, line: 102, baseType: !226, size: 64, offset: 2624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !123, file: !124, line: 103, baseType: !246, size: 64, offset: 2688)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !123, file: !124, line: 103, baseType: !249, size: 64, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !123, file: !124, line: 104, baseType: !178, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !123, file: !124, line: 105, baseType: !183, size: 32, offset: 2880)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !123, file: !124, line: 106, baseType: !253, size: 128, offset: 2944)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !260)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !124, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 61, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !124, line: 62, baseType: !171, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !256, file: !124, line: 63, baseType: !220, size: 64, offset: 64)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !123, file: !124, line: 107, baseType: !263, size: 64, offset: 3072)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !123, file: !124, line: 108, baseType: !220, size: 64, offset: 3136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !123, file: !124, line: 109, baseType: !266, size: 64, offset: 3200)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!137, !220}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !123, file: !124, line: 111, baseType: !183, size: 32, offset: 3264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !123, file: !124, line: 112, baseType: !271, size: 320, offset: 3328)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !317)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!137, !275, !121, !220}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !278)
!278 = !{!279, !280, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !12, line: 100, baseType: !183, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !12, line: 101, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !298, !300, !302, !303, !304}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !12, line: 84, baseType: !210, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !283, file: !12, line: 85, baseType: !210, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !12, line: 86, baseType: !220, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !283, file: !12, line: 87, baseType: !202, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !12, line: 88, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !283, file: !12, line: 89, baseType: !162, size: 8, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !283, file: !12, line: 90, baseType: !210, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !283, file: !12, line: 91, baseType: !295, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 46, baseType: !297)
!296 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !12, line: 92, baseType: !299, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !12, line: 93, baseType: !301, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !12, line: 94, baseType: !281, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !283, file: !12, line: 95, baseType: !210, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !283, file: !12, line: 96, baseType: !220, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !12, line: 102, baseType: !210, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !277, file: !12, line: 102, baseType: !210, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !277, file: !12, line: 103, baseType: !210, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !12, line: 104, baseType: !139, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !277, file: !12, line: 105, baseType: !299, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !277, file: !12, line: 106, baseType: !121, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !12, line: 107, baseType: !314, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !123, file: !124, line: 113, baseType: !320, size: 320, offset: 3648)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!137, !121, !220}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !123, file: !124, line: 114, baseType: !325, size: 320, offset: 3968)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 320, elements: !317)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !123, file: !124, line: 115, baseType: !299, size: 32, offset: 4288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !123, file: !124, line: 120, baseType: !314, size: 64, offset: 4352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !123, file: !124, line: 121, baseType: !299, size: 32, offset: 4416)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch_NLEQERR", file: !331, line: 9, baseType: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/nleqerr/linesearchnleqerr.c", directory: "/home/users/ndemeye/xSDK")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 4, size: 256, elements: !333)
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "norm_delta_x_prev", scope: !332, file: !331, line: 5, baseType: !238, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "norm_bar_delta_x_prev", scope: !332, file: !331, line: 6, baseType: !238, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mu_curr", scope: !332, file: !331, line: 7, baseType: !238, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lambda_prev", scope: !332, file: !331, line: 8, baseType: !238, size: 64, offset: 192)
!338 = !{!0, !339}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "NLEQERR_cited", scope: !2, file: !331, line: 11, type: !299, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2152, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 269)
!344 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!345 = !{i32 7, !"Dwarf Version", i32 4}
!346 = !{i32 2, !"Debug Info Version", i32 3}
!347 = !{i32 1, !"wchar_size", i32 4}
!348 = !{i32 7, !"PIC Level", i32 2}
!349 = !{i32 7, !"uwtable", i32 1}
!350 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!351 = distinct !DISubprogram(name: "SNESLineSearchView_NLEQERR", scope: !331, file: !331, line: 265, type: !352, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !621)
!352 = !DISubroutineType(types: !353)
!353 = !{!137, !354, !147}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !357, line: 29, size: 8000, elements: !358)
!357 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!358 = !{!359, !361, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !618, !619, !620}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !356, file: !357, line: 30, baseType: !360, size: 4480)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !124, line: 122, baseType: !123)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !356, file: !357, line: 30, baseType: !362, size: 704, offset: 4480)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 704, elements: !179)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !357, line: 13, size: 704, elements: !364)
!364 = !{!365, !367, !372, !380, !566, !571, !575, !579, !580, !581, !582}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !363, file: !357, line: 14, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !363, file: !357, line: 15, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !27, line: 554, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!137, !354}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !363, file: !357, line: 16, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!137, !354, !376, !376, !379, !220}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !113, line: 21, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !113, line: 21, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !363, file: !357, line: 17, baseType: !381, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !27, line: 552, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!137, !385, !376}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !388, line: 38, size: 11648, elements: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!389 = !{!390, !391, !454, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !476, !477, !478, !480, !481, !482, !483, !484, !489, !491, !492, !493, !494, !495, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !531, !533, !534, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !387, file: !388, line: 39, baseType: !360, size: 4480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !387, file: !388, line: 39, baseType: !392, size: 1088, offset: 4480)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1088, elements: !179)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !388, line: 12, size: 1088, elements: !394)
!394 = !{!395, !399, !403, !407, !413, !414, !418, !419, !423, !427, !428, !429, !434, !438, !442, !446, !453}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !393, file: !388, line: 13, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!137, !385, !376, !220}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !393, file: !388, line: 14, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!137, !376, !376, !220}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !393, file: !388, line: 15, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!137, !385, !183}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !393, file: !388, line: 16, baseType: !408, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!137, !385, !183, !238, !238, !238, !411, !220}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !393, file: !388, line: 17, baseType: !266, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !393, file: !388, line: 18, baseType: !415, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!137, !385}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !393, file: !388, line: 19, baseType: !415, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !393, file: !388, line: 20, baseType: !420, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!137, !385, !147}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !393, file: !388, line: 21, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!137, !275, !385}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !393, file: !388, line: 22, baseType: !415, size: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !393, file: !388, line: 23, baseType: !415, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !393, file: !388, line: 24, baseType: !430, size: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!137, !385, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !393, file: !388, line: 25, baseType: !435, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!137, !433}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !393, file: !388, line: 26, baseType: !439, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!137, !385, !376, !376}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !393, file: !388, line: 27, baseType: !443, size: 64, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!137, !385, !376, !376, !220}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !393, file: !388, line: 28, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!137, !385, !376, !450, !450, !220}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !393, file: !388, line: 29, baseType: !420, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !387, file: !388, line: 40, baseType: !455, size: 64, offset: 5568)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !456, line: 14, baseType: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !456, line: 14, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !387, file: !388, line: 41, baseType: !299, size: 32, offset: 5632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !387, file: !388, line: 42, baseType: !385, size: 64, offset: 5696)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !387, file: !388, line: 43, baseType: !462, size: 32, offset: 5760)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !387, file: !388, line: 44, baseType: !299, size: 32, offset: 5792)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !387, file: !388, line: 47, baseType: !220, size: 64, offset: 5824)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !387, file: !388, line: 49, baseType: !376, size: 64, offset: 5888)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !387, file: !388, line: 50, baseType: !376, size: 64, offset: 5952)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !387, file: !388, line: 52, baseType: !376, size: 64, offset: 6016)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !387, file: !388, line: 54, baseType: !450, size: 64, offset: 6080)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !387, file: !388, line: 55, baseType: !450, size: 64, offset: 6144)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !387, file: !388, line: 56, baseType: !450, size: 64, offset: 6208)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !387, file: !388, line: 57, baseType: !220, size: 64, offset: 6272)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !387, file: !388, line: 58, baseType: !473, size: 64, offset: 6336)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !89, line: 22, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !89, line: 22, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !387, file: !388, line: 59, baseType: !354, size: 64, offset: 6400)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !387, file: !388, line: 60, baseType: !299, size: 32, offset: 6464)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !387, file: !388, line: 61, baseType: !479, size: 32, offset: 6496)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !387, file: !388, line: 63, baseType: !376, size: 64, offset: 6528)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !387, file: !388, line: 65, baseType: !376, size: 64, offset: 6592)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !387, file: !388, line: 66, baseType: !220, size: 64, offset: 6656)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !387, file: !388, line: 68, baseType: !238, size: 64, offset: 6720)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !387, file: !388, line: 74, baseType: !485, size: 320, offset: 6784)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !317)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!137, !385, !183, !238, !220}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !387, file: !388, line: 75, baseType: !490, size: 320, offset: 7104)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 320, elements: !317)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !387, file: !388, line: 76, baseType: !325, size: 320, offset: 7424)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !387, file: !388, line: 77, baseType: !183, size: 32, offset: 7744)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !387, file: !388, line: 78, baseType: !220, size: 64, offset: 7808)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !387, file: !388, line: 79, baseType: !412, size: 32, offset: 7872)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !387, file: !388, line: 80, baseType: !496, size: 320, offset: 7936)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 320, elements: !317)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!137, !385, !220}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !387, file: !388, line: 81, baseType: !490, size: 320, offset: 8256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !387, file: !388, line: 82, baseType: !325, size: 320, offset: 8576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !387, file: !388, line: 83, baseType: !183, size: 32, offset: 8896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !387, file: !388, line: 84, baseType: !299, size: 32, offset: 8928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !387, file: !388, line: 88, baseType: !299, size: 32, offset: 8960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !388, line: 89, baseType: !220, size: 64, offset: 9024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !387, file: !388, line: 93, baseType: !183, size: 32, offset: 9088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !387, file: !388, line: 94, baseType: !183, size: 32, offset: 9120)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !387, file: !388, line: 95, baseType: !183, size: 32, offset: 9152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !387, file: !388, line: 96, baseType: !183, size: 32, offset: 9184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !387, file: !388, line: 97, baseType: !183, size: 32, offset: 9216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !387, file: !388, line: 98, baseType: !238, size: 64, offset: 9280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !387, file: !388, line: 99, baseType: !238, size: 64, offset: 9344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !387, file: !388, line: 100, baseType: !238, size: 64, offset: 9408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !387, file: !388, line: 101, baseType: !238, size: 64, offset: 9472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !387, file: !388, line: 102, baseType: !238, size: 64, offset: 9536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !387, file: !388, line: 103, baseType: !238, size: 64, offset: 9600)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !387, file: !388, line: 104, baseType: !238, size: 64, offset: 9664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !387, file: !388, line: 105, baseType: !238, size: 64, offset: 9728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !387, file: !388, line: 106, baseType: !299, size: 32, offset: 9792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !387, file: !388, line: 107, baseType: !183, size: 32, offset: 9824)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !387, file: !388, line: 108, baseType: !183, size: 32, offset: 9856)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !387, file: !388, line: 109, baseType: !183, size: 32, offset: 9888)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !387, file: !388, line: 110, baseType: !299, size: 32, offset: 9920)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !387, file: !388, line: 111, baseType: !183, size: 32, offset: 9952)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !387, file: !388, line: 112, baseType: !299, size: 32, offset: 9984)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !387, file: !388, line: 113, baseType: !183, size: 32, offset: 10016)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !387, file: !388, line: 115, baseType: !299, size: 32, offset: 10048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !387, file: !388, line: 117, baseType: !299, size: 32, offset: 10080)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !387, file: !388, line: 119, baseType: !530, size: 32, offset: 10112)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !387, file: !388, line: 120, baseType: !532, size: 32, offset: 10144)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !387, file: !388, line: 124, baseType: !183, size: 32, offset: 10176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !387, file: !388, line: 125, baseType: !535, size: 64, offset: 10240)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !387, file: !388, line: 129, baseType: !183, size: 32, offset: 10304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !387, file: !388, line: 130, baseType: !237, size: 64, offset: 10368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !387, file: !388, line: 132, baseType: !229, size: 64, offset: 10432)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !387, file: !388, line: 133, baseType: !183, size: 32, offset: 10496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !387, file: !388, line: 134, baseType: !183, size: 32, offset: 10528)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !387, file: !388, line: 135, baseType: !299, size: 32, offset: 10560)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !387, file: !388, line: 136, baseType: !299, size: 32, offset: 10592)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !387, file: !388, line: 137, baseType: !299, size: 32, offset: 10624)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !387, file: !388, line: 140, baseType: !183, size: 32, offset: 10656)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !387, file: !388, line: 141, baseType: !183, size: 32, offset: 10688)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !387, file: !388, line: 143, baseType: !183, size: 32, offset: 10720)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !387, file: !388, line: 144, baseType: !183, size: 32, offset: 10752)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !387, file: !388, line: 146, baseType: !299, size: 32, offset: 10784)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !387, file: !388, line: 147, baseType: !299, size: 32, offset: 10816)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !387, file: !388, line: 148, baseType: !299, size: 32, offset: 10848)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !387, file: !388, line: 150, baseType: !299, size: 32, offset: 10880)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !387, file: !388, line: 151, baseType: !220, size: 64, offset: 10944)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !387, file: !388, line: 154, baseType: !238, size: 64, offset: 11008)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !387, file: !388, line: 155, baseType: !238, size: 64, offset: 11072)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !387, file: !388, line: 157, baseType: !535, size: 64, offset: 11136)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !387, file: !388, line: 158, baseType: !183, size: 32, offset: 11200)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !387, file: !388, line: 160, baseType: !299, size: 32, offset: 11232)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !387, file: !388, line: 161, baseType: !299, size: 32, offset: 11264)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !387, file: !388, line: 162, baseType: !183, size: 32, offset: 11296)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !387, file: !388, line: 164, baseType: !238, size: 64, offset: 11328)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !387, file: !388, line: 165, baseType: !376, size: 64, offset: 11392)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !387, file: !388, line: 165, baseType: !376, size: 64, offset: 11456)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !387, file: !388, line: 166, baseType: !183, size: 32, offset: 11520)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !387, file: !388, line: 167, baseType: !299, size: 32, offset: 11552)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !387, file: !388, line: 169, baseType: !299, size: 32, offset: 11584)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !363, file: !357, line: 18, baseType: !567, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !27, line: 553, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!137, !385, !376, !376, !237}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !363, file: !357, line: 19, baseType: !572, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!137, !354, !376, !376, !376, !379, !379, !220}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !363, file: !357, line: 20, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!137, !275, !354}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !363, file: !357, line: 21, baseType: !369, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !363, file: !357, line: 22, baseType: !369, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !363, file: !357, line: 23, baseType: !369, size: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !363, file: !357, line: 24, baseType: !439, size: 64, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !356, file: !357, line: 32, baseType: !385, size: 64, offset: 5184)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !356, file: !357, line: 34, baseType: !220, size: 64, offset: 5248)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !356, file: !357, line: 36, baseType: !299, size: 32, offset: 5312)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !356, file: !357, line: 38, baseType: !376, size: 64, offset: 5376)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !356, file: !357, line: 39, baseType: !376, size: 64, offset: 5440)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !356, file: !357, line: 40, baseType: !376, size: 64, offset: 5504)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !356, file: !357, line: 41, baseType: !376, size: 64, offset: 5568)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !356, file: !357, line: 42, baseType: !376, size: 64, offset: 5632)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !356, file: !357, line: 44, baseType: !183, size: 32, offset: 5696)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !356, file: !357, line: 45, baseType: !535, size: 64, offset: 5760)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !356, file: !357, line: 47, baseType: !238, size: 64, offset: 5824)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !356, file: !357, line: 49, baseType: !299, size: 32, offset: 5888)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !356, file: !357, line: 50, baseType: !238, size: 64, offset: 5952)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !356, file: !357, line: 51, baseType: !238, size: 64, offset: 6016)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !356, file: !357, line: 52, baseType: !238, size: 64, offset: 6080)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !356, file: !357, line: 53, baseType: !599, size: 32, offset: 6144)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !27, line: 621, baseType: !74)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !356, file: !357, line: 54, baseType: !299, size: 32, offset: 6176)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !356, file: !357, line: 56, baseType: !238, size: 64, offset: 6208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !356, file: !357, line: 57, baseType: !238, size: 64, offset: 6272)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !356, file: !357, line: 58, baseType: !238, size: 64, offset: 6336)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !356, file: !357, line: 59, baseType: !183, size: 32, offset: 6400)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !356, file: !357, line: 60, baseType: !238, size: 64, offset: 6464)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !356, file: !357, line: 61, baseType: !238, size: 64, offset: 6528)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !356, file: !357, line: 62, baseType: !238, size: 64, offset: 6592)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !356, file: !357, line: 63, baseType: !183, size: 32, offset: 6656)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !356, file: !357, line: 65, baseType: !238, size: 64, offset: 6720)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !356, file: !357, line: 67, baseType: !220, size: 64, offset: 6784)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !356, file: !357, line: 68, baseType: !220, size: 64, offset: 6848)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !356, file: !357, line: 70, baseType: !147, size: 64, offset: 6912)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !356, file: !357, line: 71, baseType: !614, size: 320, offset: 6976)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 320, elements: !317)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!137, !354, !220}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !356, file: !357, line: 72, baseType: !490, size: 320, offset: 7296)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !356, file: !357, line: 73, baseType: !325, size: 320, offset: 7616)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !356, file: !357, line: 74, baseType: !183, size: 32, offset: 7936)
!621 = !{!622, !623, !624, !625, !626, !627, !629, !633}
!622 = !DILocalVariable(name: "linesearch", arg: 1, scope: !351, file: !331, line: 265, type: !354)
!623 = !DILocalVariable(name: "viewer", arg: 2, scope: !351, file: !331, line: 265, type: !147)
!624 = !DILocalVariable(name: "ierr", scope: !351, file: !331, line: 267, type: !137)
!625 = !DILocalVariable(name: "iascii", scope: !351, file: !331, line: 268, type: !299)
!626 = !DILocalVariable(name: "nleqerr", scope: !351, file: !331, line: 269, type: !329)
!627 = !DILocalVariable(name: "ierr__", scope: !628, file: !331, line: 272, type: !137)
!628 = distinct !DILexicalBlock(scope: !351, file: !331, line: 272, column: 79)
!629 = !DILocalVariable(name: "ierr__", scope: !630, file: !331, line: 275, type: !137)
!630 = distinct !DILexicalBlock(scope: !631, file: !331, line: 275, column: 85)
!631 = distinct !DILexicalBlock(scope: !632, file: !331, line: 274, column: 15)
!632 = distinct !DILexicalBlock(scope: !351, file: !331, line: 274, column: 7)
!633 = !DILocalVariable(name: "ierr__", scope: !634, file: !331, line: 276, type: !137)
!634 = distinct !DILexicalBlock(scope: !631, file: !331, line: 276, column: 118)
!635 = !DILocation(line: 0, scope: !351)
!636 = !DILocation(line: 268, column: 3, scope: !351)
!637 = !DILocation(line: 271, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !331, line: 271, column: 3)
!639 = distinct !DILexicalBlock(scope: !640, file: !331, line: 271, column: 3)
!640 = distinct !DILexicalBlock(scope: !351, file: !331, line: 271, column: 3)
!641 = !{!642, !642, i64 0}
!642 = !{!"any pointer", !643, i64 0}
!643 = !{!"omnipotent char", !644, i64 0}
!644 = !{!"Simple C/C++ TBAA"}
!645 = !DILocation(line: 271, column: 3, scope: !639)
!646 = !DILocation(line: 271, column: 3, scope: !647)
!647 = distinct !DILexicalBlock(scope: !648, file: !331, line: 271, column: 3)
!648 = distinct !DILexicalBlock(scope: !638, file: !331, line: 271, column: 3)
!649 = !{!650, !651, i64 1536}
!650 = !{!"", !643, i64 0, !643, i64 512, !643, i64 1024, !643, i64 1280, !651, i64 1536, !651, i64 1540, !643, i64 1544}
!651 = !{!"int", !643, i64 0}
!652 = !DILocation(line: 271, column: 3, scope: !648)
!653 = !DILocation(line: 271, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !647, file: !331, line: 271, column: 3)
!655 = !{!651, !651, i64 0}
!656 = !{!650, !651, i64 1540}
!657 = !DILocation(line: 272, column: 33, scope: !351)
!658 = !DILocation(line: 272, column: 10, scope: !351)
!659 = !DILocation(line: 0, scope: !628)
!660 = !DILocation(line: 272, column: 79, scope: !661)
!661 = distinct !DILexicalBlock(scope: !628, file: !331, line: 272, column: 79)
!662 = !DILocation(line: 272, column: 79, scope: !628)
!663 = !{!"branch_weights", i32 2000, i32 1}
!664 = !DILocation(line: 273, column: 52, scope: !351)
!665 = !{!666, !642, i64 656}
!666 = !{!"_p_LineSearch", !667, i64 0, !643, i64 560, !642, i64 648, !642, i64 656, !643, i64 664, !642, i64 672, !642, i64 680, !642, i64 688, !642, i64 696, !642, i64 704, !651, i64 712, !642, i64 720, !668, i64 728, !643, i64 736, !668, i64 744, !668, i64 752, !668, i64 760, !643, i64 768, !643, i64 772, !668, i64 776, !668, i64 784, !668, i64 792, !651, i64 800, !668, i64 808, !668, i64 816, !668, i64 824, !651, i64 832, !668, i64 840, !642, i64 848, !642, i64 856, !642, i64 864, !643, i64 872, !643, i64 912, !643, i64 952, !651, i64 992}
