; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcgraph.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcgraph.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_request_t = type opaque
%struct._PCBDDCGraph = type { i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i8*, i32*, i32**, i32*, i32*, i32*, i32, i32, i32, i32, %struct._p_IS*, %struct._p_IS*, i32, i32, i32, i32*, i32*, i32, i32, i32*, i32**, i32*, i32*, i32*, i32**, i32, i32*, i32*, i32, i32, i32*, i32, i32, i32, i32, double* }
%struct._p_ISLocalToGlobalMapping = type opaque
%struct._p_IS = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcgraph.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !30, !35, !55}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 663, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!37 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 624, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!62 = !{!63, !82, !162, !237, !102, !241, !152, !70, !142, !271, !274, !277, !127, !280, !289, !104, !5}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !66, line: 73, size: 4480, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !71, !123, !124, !126, !129, !130, !131, !132, !140, !141, !143, !147, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !163, !165, !166, !167, !169, !170, !172, !174, !175, !176, !177, !178, !181, !183, !184, !185, !186, !187, !190, !192, !193, !194, !204, !206, !207, !211, !212, !261, !266, !268, !269, !270}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !65, file: !66, line: 74, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !70)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !65, file: !66, line: 75, baseType: !72, size: 448, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 448, elements: !121)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !66, line: 53, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 45, size: 448, elements: !75)
!75 = !{!76, !85, !93, !98, !105, !109, !116}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !74, file: !66, line: 46, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !63, !81}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !70)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !56, line: 330, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !56, line: 330, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !74, file: !66, line: 47, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!80, !63, !89}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !90, line: 16, baseType: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !90, line: 16, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !74, file: !66, line: 48, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!80, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !74, file: !66, line: 49, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!80, !63, !102, !63}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !74, file: !66, line: 50, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!80, !63, !102, !97}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !74, file: !66, line: 51, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!80, !63, !102, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !74, file: !66, line: 52, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!80, !63, !102, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !65, file: !66, line: 76, baseType: !82, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !66, line: 77, baseType: !125, size: 32, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !70)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !65, file: !66, line: 78, baseType: !127, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !128)
!128 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !65, file: !66, line: 78, baseType: !127, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !65, file: !66, line: 78, baseType: !127, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !65, file: !66, line: 78, baseType: !127, size: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !66, line: 79, baseType: !133, size: 64, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !136, line: 27, baseType: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !138, line: 43, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!139 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !65, file: !66, line: 80, baseType: !125, size: 32, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !65, file: !66, line: 81, baseType: !142, size: 32, offset: 992)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !70)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !65, file: !66, line: 82, baseType: !144, size: 64, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !65, file: !66, line: 83, baseType: !148, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !65, file: !66, line: 84, baseType: !152, size: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !65, file: !66, line: 85, baseType: !152, size: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !65, file: !66, line: 86, baseType: !152, size: 64, offset: 1280)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !65, file: !66, line: 87, baseType: !152, size: 64, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !65, file: !66, line: 88, baseType: !63, size: 64, offset: 1408)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !65, file: !66, line: 89, baseType: !133, size: 64, offset: 1472)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 90, baseType: !152, size: 64, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !65, file: !66, line: 91, baseType: !152, size: 64, offset: 1600)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !65, file: !66, line: 92, baseType: !125, size: 32, offset: 1664)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !65, file: !66, line: 93, baseType: !162, size: 64, offset: 1728)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !65, file: !66, line: 94, baseType: !164, size: 64, offset: 1792)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !134)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !65, file: !66, line: 95, baseType: !125, size: 32, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !65, file: !66, line: 95, baseType: !125, size: 32, offset: 1888)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !65, file: !66, line: 96, baseType: !168, size: 64, offset: 1920)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !65, file: !66, line: 96, baseType: !168, size: 64, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !65, file: !66, line: 97, baseType: !171, size: 64, offset: 2048)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !65, file: !66, line: 97, baseType: !173, size: 64, offset: 2112)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !65, file: !66, line: 98, baseType: !125, size: 32, offset: 2176)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !65, file: !66, line: 98, baseType: !125, size: 32, offset: 2208)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !65, file: !66, line: 99, baseType: !168, size: 64, offset: 2240)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !65, file: !66, line: 99, baseType: !168, size: 64, offset: 2304)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !65, file: !66, line: 100, baseType: !179, size: 64, offset: 2368)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !65, file: !66, line: 100, baseType: !182, size: 64, offset: 2432)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !65, file: !66, line: 101, baseType: !125, size: 32, offset: 2496)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !65, file: !66, line: 101, baseType: !125, size: 32, offset: 2528)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !65, file: !66, line: 102, baseType: !168, size: 64, offset: 2560)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !65, file: !66, line: 102, baseType: !168, size: 64, offset: 2624)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !65, file: !66, line: 103, baseType: !188, size: 64, offset: 2688)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !180)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !65, file: !66, line: 103, baseType: !191, size: 64, offset: 2752)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !65, file: !66, line: 104, baseType: !120, size: 64, offset: 2816)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !65, file: !66, line: 105, baseType: !125, size: 32, offset: 2880)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !65, file: !66, line: 106, baseType: !195, size: 128, offset: 2944)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 128, elements: !202)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !66, line: 64, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 61, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !198, file: !66, line: 62, baseType: !113, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !198, file: !66, line: 63, baseType: !162, size: 64, offset: 64)
!202 = !{!203}
!203 = !DISubrange(count: 2)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !65, file: !66, line: 107, baseType: !205, size: 64, offset: 3072)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !202)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !65, file: !66, line: 108, baseType: !162, size: 64, offset: 3136)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !65, file: !66, line: 109, baseType: !208, size: 64, offset: 3200)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!80, !162}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !65, file: !66, line: 111, baseType: !125, size: 32, offset: 3264)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !65, file: !66, line: 112, baseType: !213, size: 320, offset: 3328)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 320, elements: !259)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!80, !217, !63, !162}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !220)
!220 = !{!221, !222, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !219, file: !10, line: 100, baseType: !125, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !10, line: 101, baseType: !223, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !234, !235, !236, !240, !242, !244, !245, !246}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !225, file: !10, line: 84, baseType: !152, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !225, file: !10, line: 85, baseType: !152, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !10, line: 86, baseType: !162, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !225, file: !10, line: 87, baseType: !144, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !225, file: !10, line: 88, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !225, file: !10, line: 89, baseType: !104, size: 8, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !225, file: !10, line: 90, baseType: !152, size: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !225, file: !10, line: 91, baseType: !237, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !238, line: 46, baseType: !239)
!238 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!239 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !225, file: !10, line: 92, baseType: !241, size: 32, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !10, line: 93, baseType: !243, size: 32, offset: 544)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !10, line: 94, baseType: !223, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !225, file: !10, line: 95, baseType: !152, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !225, file: !10, line: 96, baseType: !162, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !219, file: !10, line: 102, baseType: !152, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !219, file: !10, line: 102, baseType: !152, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !219, file: !10, line: 103, baseType: !152, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !219, file: !10, line: 104, baseType: !82, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !219, file: !10, line: 105, baseType: !241, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !219, file: !10, line: 105, baseType: !241, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !219, file: !10, line: 105, baseType: !241, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !219, file: !10, line: 106, baseType: !63, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !219, file: !10, line: 107, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!259 = !{!260}
!260 = !DISubrange(count: 5)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !65, file: !66, line: 113, baseType: !262, size: 320, offset: 3648)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !259)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!80, !63, !162}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !65, file: !66, line: 114, baseType: !267, size: 320, offset: 3968)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 320, elements: !259)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !65, file: !66, line: 115, baseType: !241, size: 32, offset: 4288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !65, file: !66, line: 120, baseType: !256, size: 64, offset: 4352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !65, file: !66, line: 121, baseType: !241, size: 32, offset: 4416)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !56, line: 331, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !56, line: 331, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !56, line: 338, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !56, line: 338, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !56, line: 339, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !56, line: 339, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !56, line: 341, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !56, line: 351, size: 192, elements: !283)
!283 = !{!284, !285, !286, !287, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !282, file: !56, line: 354, baseType: !70, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !282, file: !56, line: 355, baseType: !70, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !282, file: !56, line: 356, baseType: !70, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !282, file: !56, line: 361, baseType: !70, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !282, file: !56, line: 362, baseType: !237, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!292 = !{i32 7, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{i32 1, !"wchar_size", i32 4}
!295 = !{i32 7, !"PIC Level", i32 2}
!296 = !{i32 7, !"uwtable", i32 1}
!297 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!298 = distinct !DISubprogram(name: "PCBDDCGraphGetDirichletDofsB", scope: !299, file: !299, line: 5, type: !300, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !357)
!299 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcgraph.c", directory: "/home/users/ndemeye/xSDK")
!300 = !DISubroutineType(types: !301)
!301 = !{!80, !302, !356}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCBDDCGraph", file: !303, line: 64, baseType: !304)
!303 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bddc/bddcstructs.h", directory: "/home/users/ndemeye/xSDK")
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCBDDCGraph", file: !303, line: 14, size: 2048, elements: !306)
!306 = !{!307, !308, !313, !314, !315, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !305, file: !303, line: 15, baseType: !241, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "l2gmap", scope: !305, file: !303, line: 17, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !310, line: 30, baseType: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !310, line: 30, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nvtxs", scope: !305, file: !303, line: 18, baseType: !125, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nvtxs_global", scope: !305, file: !303, line: 19, baseType: !125, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "touched", scope: !305, file: !303, line: 20, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBT", file: !317, line: 29, baseType: !152)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscbt.h", directory: "/home/users/ndemeye/xSDK")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !305, file: !303, line: 21, baseType: !171, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours_set", scope: !305, file: !303, line: 22, baseType: !173, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "subset", scope: !305, file: !303, line: 23, baseType: !171, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "which_dof", scope: !305, file: !303, line: 24, baseType: !171, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "special_dof", scope: !305, file: !303, line: 25, baseType: !171, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "custom_minimal_size", scope: !305, file: !303, line: 26, baseType: !125, size: 32, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "twodim", scope: !305, file: !303, line: 27, baseType: !241, size: 32, offset: 608)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "twodimset", scope: !305, file: !303, line: 28, baseType: !241, size: 32, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "has_dirichlet", scope: !305, file: !303, line: 29, baseType: !241, size: 32, offset: 672)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dirdofs", scope: !305, file: !303, line: 30, baseType: !328, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !310, line: 11, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !310, line: 11, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dirdofsB", scope: !305, file: !303, line: 31, baseType: !328, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "commsizelimit", scope: !305, file: !303, line: 32, baseType: !125, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "maxcount", scope: !305, file: !303, line: 33, baseType: !125, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ncc", scope: !305, file: !303, line: 35, baseType: !125, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cptr", scope: !305, file: !303, line: 36, baseType: !171, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !305, file: !303, line: 37, baseType: !171, size: 64, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "queue_sorted", scope: !305, file: !303, line: 38, baseType: !241, size: 32, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "n_subsets", scope: !305, file: !303, line: 40, baseType: !125, size: 32, offset: 1120)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "subset_size", scope: !305, file: !303, line: 41, baseType: !171, size: 64, offset: 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "subset_idxs", scope: !305, file: !303, line: 42, baseType: !173, size: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "subset_ncc", scope: !305, file: !303, line: 43, baseType: !171, size: 64, offset: 1280)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "subset_ref_node", scope: !305, file: !303, line: 44, baseType: !171, size: 64, offset: 1344)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mirrors", scope: !305, file: !303, line: 46, baseType: !171, size: 64, offset: 1408)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mirrors_set", scope: !305, file: !303, line: 47, baseType: !173, size: 64, offset: 1472)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nvtxs_csr", scope: !305, file: !303, line: 49, baseType: !125, size: 32, offset: 1536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "xadj", scope: !305, file: !303, line: 50, baseType: !171, size: 64, offset: 1600)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "adjncy", scope: !305, file: !303, line: 51, baseType: !171, size: 64, offset: 1664)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "freecsr", scope: !305, file: !303, line: 52, baseType: !241, size: 32, offset: 1728)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "n_local_subs", scope: !305, file: !303, line: 55, baseType: !125, size: 32, offset: 1760)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "local_subs", scope: !305, file: !303, line: 56, baseType: !171, size: 64, offset: 1792)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "active_coords", scope: !305, file: !303, line: 58, baseType: !241, size: 32, offset: 1856)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cloc", scope: !305, file: !303, line: 59, baseType: !241, size: 32, offset: 1888)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !305, file: !303, line: 60, baseType: !125, size: 32, offset: 1920)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cnloc", scope: !305, file: !303, line: 60, baseType: !125, size: 32, offset: 1952)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !305, file: !303, line: 61, baseType: !179, size: 64, offset: 1984)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!357 = !{!358, !359, !360, !361, !365, !368, !369, !370, !372, !374}
!358 = !DILocalVariable(name: "graph", arg: 1, scope: !298, file: !299, line: 5, type: !302)
!359 = !DILocalVariable(name: "dirdofs", arg: 2, scope: !298, file: !299, line: 5, type: !356)
!360 = !DILocalVariable(name: "ierr", scope: !298, file: !299, line: 7, type: !80)
!361 = !DILocalVariable(name: "ierr__", scope: !362, file: !299, line: 11, type: !80)
!362 = distinct !DILexicalBlock(scope: !363, file: !299, line: 11, column: 63)
!363 = distinct !DILexicalBlock(scope: !364, file: !299, line: 10, column: 24)
!364 = distinct !DILexicalBlock(scope: !298, file: !299, line: 10, column: 7)
!365 = !DILocalVariable(name: "i", scope: !366, file: !299, line: 13, type: !125)
!366 = distinct !DILexicalBlock(scope: !367, file: !299, line: 12, column: 36)
!367 = distinct !DILexicalBlock(scope: !364, file: !299, line: 12, column: 14)
!368 = !DILocalVariable(name: "size", scope: !366, file: !299, line: 13, type: !125)
!369 = !DILocalVariable(name: "dirdofs_idxs", scope: !366, file: !299, line: 14, type: !171)
!370 = !DILocalVariable(name: "ierr__", scope: !371, file: !299, line: 21, type: !80)
!371 = distinct !DILexicalBlock(scope: !366, file: !299, line: 21, column: 45)
!372 = !DILocalVariable(name: "ierr__", scope: !373, file: !299, line: 26, type: !80)
!373 = distinct !DILexicalBlock(scope: !366, file: !299, line: 26, column: 98)
!374 = !DILocalVariable(name: "ierr__", scope: !375, file: !299, line: 27, type: !80)
!375 = distinct !DILexicalBlock(scope: !366, file: !299, line: 27, column: 63)
!376 = !DILocation(line: 0, scope: !298)
!377 = !DILocation(line: 9, column: 3, scope: !378)
!378 = distinct !DILexicalBlock(scope: !379, file: !299, line: 9, column: 3)
!379 = distinct !DILexicalBlock(scope: !380, file: !299, line: 9, column: 3)
!380 = distinct !DILexicalBlock(scope: !298, file: !299, line: 9, column: 3)
!381 = !{!382, !382, i64 0}
!382 = !{!"any pointer", !383, i64 0}
!383 = !{!"omnipotent char", !384, i64 0}
!384 = !{!"Simple C/C++ TBAA"}
!385 = !DILocation(line: 9, column: 3, scope: !379)
!386 = !DILocation(line: 9, column: 3, scope: !387)
!387 = distinct !DILexicalBlock(scope: !388, file: !299, line: 9, column: 3)
!388 = distinct !DILexicalBlock(scope: !378, file: !299, line: 9, column: 3)
!389 = !{!390, !391, i64 1536}
!390 = !{!"", !383, i64 0, !383, i64 512, !383, i64 1024, !383, i64 1280, !391, i64 1536, !391, i64 1540, !383, i64 1544}
!391 = !{!"int", !383, i64 0}
!392 = !DILocation(line: 9, column: 3, scope: !388)
!393 = !DILocation(line: 9, column: 3, scope: !394)
!394 = distinct !DILexicalBlock(scope: !387, file: !299, line: 9, column: 3)
!395 = !{!391, !391, i64 0}
!396 = !{!390, !391, i64 1540}
!397 = !DILocation(line: 10, column: 14, scope: !364)
!398 = !{!399, !382, i64 96}
!399 = !{!"_PCBDDCGraph", !383, i64 0, !382, i64 8, !391, i64 16, !391, i64 20, !382, i64 24, !382, i64 32, !382, i64 40, !382, i64 48, !382, i64 56, !382, i64 64, !391, i64 72, !383, i64 76, !383, i64 80, !383, i64 84, !382, i64 88, !382, i64 96, !391, i64 104, !391, i64 108, !391, i64 112, !382, i64 120, !382, i64 128, !383, i64 136, !391, i64 140, !382, i64 144, !382, i64 152, !382, i64 160, !382, i64 168, !382, i64 176, !382, i64 184, !391, i64 192, !382, i64 200, !382, i64 208, !383, i64 216, !391, i64 220, !382, i64 224, !383, i64 232, !383, i64 236, !391, i64 240, !391, i64 244, !382, i64 248}
!400 = !DILocation(line: 10, column: 7, scope: !364)
!401 = !DILocation(line: 10, column: 7, scope: !298)
!402 = !DILocation(line: 11, column: 33, scope: !363)
!403 = !DILocation(line: 11, column: 12, scope: !363)
!404 = !DILocation(line: 0, scope: !362)
!405 = !DILocation(line: 11, column: 63, scope: !406)
!406 = distinct !DILexicalBlock(scope: !362, file: !299, line: 11, column: 63)
