; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/is/pcis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/is/pcis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!300 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 85, baseType: !72, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!304 = !DIEnumerator(name: "PC_LEFT", value: 0)
!305 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!306 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 395, baseType: !72, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315}
!309 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!310 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!311 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!312 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!313 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!314 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!315 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 663, baseType: !5, size: 32, elements: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!318 = !{!319, !320, !321}
!319 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!324 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !348)
!348 = !{!349, !350, !351, !352, !353}
!349 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!350 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!353 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1189, baseType: !5, size: 32, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!357 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!360 = !{!361, !365, !366, !441, !569, !572, !451, !72, !575, !401, !578, !1399, !535, !586, !539, !576, !478, !5, !403}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !362, line: 330, baseType: !363)
!362 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !362, line: 330, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !369, line: 73, size: 4480, elements: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!370 = !{!371, !373, !422, !423, !425, !428, !429, !430, !431, !439, !440, !442, !446, !450, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !467, !468, !470, !472, !473, !474, !475, !476, !479, !481, !482, !483, !484, !485, !488, !490, !491, !492, !502, !504, !505, !509, !510, !559, !564, !566, !567, !568}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !368, file: !369, line: 74, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !368, file: !369, line: 75, baseType: !374, size: 448, offset: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 448, elements: !420)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !369, line: 53, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 45, size: 448, elements: !377)
!377 = !{!378, !384, !392, !397, !404, !408, !415}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !376, file: !369, line: 46, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !366, !383}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !376, file: !369, line: 47, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!382, !366, !388}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !389, line: 16, baseType: !390)
!389 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !389, line: 16, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !376, file: !369, line: 48, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!382, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !376, file: !369, line: 49, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!382, !366, !401, !366}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !376, file: !369, line: 50, baseType: !405, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!382, !366, !401, !396}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !376, file: !369, line: 51, baseType: !409, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!382, !366, !401, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !376, file: !369, line: 52, baseType: !416, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!382, !366, !401, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!420 = !{!421}
!421 = !DISubrange(count: 1)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !368, file: !369, line: 76, baseType: !361, size: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !369, line: 77, baseType: !424, size: 32, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !368, file: !369, line: 78, baseType: !426, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !427)
!427 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !368, file: !369, line: 78, baseType: !426, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !368, file: !369, line: 78, baseType: !426, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !368, file: !369, line: 78, baseType: !426, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !368, file: !369, line: 79, baseType: !432, size: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !435, line: 27, baseType: !436)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !437, line: 43, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!438 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !368, file: !369, line: 80, baseType: !424, size: 32, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !368, file: !369, line: 81, baseType: !441, size: 32, offset: 992)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !368, file: !369, line: 82, baseType: !443, size: 64, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !368, file: !369, line: 83, baseType: !447, size: 64, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !368, file: !369, line: 84, baseType: !451, size: 64, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !368, file: !369, line: 85, baseType: !451, size: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !368, file: !369, line: 86, baseType: !451, size: 64, offset: 1280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !368, file: !369, line: 87, baseType: !451, size: 64, offset: 1344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !368, file: !369, line: 88, baseType: !366, size: 64, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !368, file: !369, line: 89, baseType: !432, size: 64, offset: 1472)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !368, file: !369, line: 90, baseType: !451, size: 64, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !368, file: !369, line: 91, baseType: !451, size: 64, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !368, file: !369, line: 92, baseType: !424, size: 32, offset: 1664)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !368, file: !369, line: 93, baseType: !365, size: 64, offset: 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !368, file: !369, line: 94, baseType: !462, size: 64, offset: 1792)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !433)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !368, file: !369, line: 95, baseType: !424, size: 32, offset: 1856)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !368, file: !369, line: 95, baseType: !424, size: 32, offset: 1888)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !368, file: !369, line: 96, baseType: !466, size: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !368, file: !369, line: 96, baseType: !466, size: 64, offset: 1984)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !368, file: !369, line: 97, baseType: !469, size: 64, offset: 2048)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !368, file: !369, line: 97, baseType: !471, size: 64, offset: 2112)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !368, file: !369, line: 98, baseType: !424, size: 32, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !368, file: !369, line: 98, baseType: !424, size: 32, offset: 2208)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !368, file: !369, line: 99, baseType: !466, size: 64, offset: 2240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !368, file: !369, line: 99, baseType: !466, size: 64, offset: 2304)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !368, file: !369, line: 100, baseType: !477, size: 64, offset: 2368)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !427)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !368, file: !369, line: 100, baseType: !480, size: 64, offset: 2432)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !368, file: !369, line: 101, baseType: !424, size: 32, offset: 2496)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !368, file: !369, line: 101, baseType: !424, size: 32, offset: 2528)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !368, file: !369, line: 102, baseType: !466, size: 64, offset: 2560)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !368, file: !369, line: 102, baseType: !466, size: 64, offset: 2624)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !368, file: !369, line: 103, baseType: !486, size: 64, offset: 2688)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !478)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !368, file: !369, line: 103, baseType: !489, size: 64, offset: 2752)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !368, file: !369, line: 104, baseType: !419, size: 64, offset: 2816)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !368, file: !369, line: 105, baseType: !424, size: 32, offset: 2880)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !368, file: !369, line: 106, baseType: !493, size: 128, offset: 2944)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !500)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !369, line: 64, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 61, size: 128, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !496, file: !369, line: 62, baseType: !412, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !496, file: !369, line: 63, baseType: !365, size: 64, offset: 64)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !368, file: !369, line: 107, baseType: !503, size: 64, offset: 3072)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 64, elements: !500)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !368, file: !369, line: 108, baseType: !365, size: 64, offset: 3136)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !368, file: !369, line: 109, baseType: !506, size: 64, offset: 3200)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!382, !365}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !368, file: !369, line: 111, baseType: !424, size: 32, offset: 3264)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !368, file: !369, line: 112, baseType: !511, size: 320, offset: 3328)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !557)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!382, !515, !366, !365}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !518)
!518 = !{!519, !520, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !517, file: !10, line: 100, baseType: !424, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !10, line: 101, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !532, !533, !534, !538, !540, !542, !543, !544}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !523, file: !10, line: 84, baseType: !451, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !523, file: !10, line: 85, baseType: !451, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !523, file: !10, line: 86, baseType: !365, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !523, file: !10, line: 87, baseType: !443, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !523, file: !10, line: 88, baseType: !530, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !523, file: !10, line: 89, baseType: !403, size: 8, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !523, file: !10, line: 90, baseType: !451, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !523, file: !10, line: 91, baseType: !535, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !536, line: 46, baseType: !537)
!536 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!537 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !523, file: !10, line: 92, baseType: !539, size: 32, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !10, line: 93, baseType: !541, size: 32, offset: 544)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !10, line: 94, baseType: !521, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !523, file: !10, line: 95, baseType: !451, size: 64, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !523, file: !10, line: 96, baseType: !365, size: 64, offset: 704)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !517, file: !10, line: 102, baseType: !451, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !517, file: !10, line: 102, baseType: !451, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !517, file: !10, line: 103, baseType: !451, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !517, file: !10, line: 104, baseType: !361, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !517, file: !10, line: 105, baseType: !539, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !517, file: !10, line: 105, baseType: !539, size: 32, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !517, file: !10, line: 105, baseType: !539, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !517, file: !10, line: 106, baseType: !366, size: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !517, file: !10, line: 107, baseType: !554, size: 64, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!557 = !{!558}
!558 = !DISubrange(count: 5)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !368, file: !369, line: 113, baseType: !560, size: 320, offset: 3648)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 320, elements: !557)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!382, !366, !365}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !368, file: !369, line: 114, baseType: !565, size: 320, offset: 3968)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 320, elements: !557)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !368, file: !369, line: 115, baseType: !539, size: 32, offset: 4288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !368, file: !369, line: 120, baseType: !554, size: 64, offset: 4352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !368, file: !369, line: 121, baseType: !539, size: 32, offset: 4416)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !362, line: 331, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !362, line: 331, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !362, line: 338, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !362, line: 338, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !577, line: 1451, baseType: !412)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !580, line: 78, baseType: !581)
!580 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 13, size: 2432, elements: !582)
!582 = !{!583, !584, !585, !590, !591, !592, !593, !1358, !1359, !1360, !1361, !1362, !1363, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !581, file: !580, line: 24, baseType: !424, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !581, file: !580, line: 25, baseType: !424, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !581, file: !580, line: 26, baseType: !586, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !587, line: 11, baseType: !588)
!587 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !587, line: 11, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !581, file: !580, line: 27, baseType: !586, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !581, file: !580, line: 28, baseType: !586, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !581, file: !580, line: 29, baseType: !586, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !581, file: !580, line: 31, baseType: !594, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !597, line: 436, size: 23424, elements: !598)
!597 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!598 = !{!599, !601, !1104, !1124, !1125, !1126, !1128, !1129, !1130, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1254, !1255, !1271, !1272, !1273, !1274, !1275, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1310, !1330, !1331, !1333, !1334, !1335, !1336, !1337, !1338, !1356, !1357}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !596, file: !597, line: 437, baseType: !600, size: 4480)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !369, line: 122, baseType: !368)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !596, file: !597, line: 437, baseType: !602, size: 9472, offset: 4480)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 9472, elements: !420)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !597, line: 32, size: 9472, elements: !604)
!604 = !{!605, !614, !618, !619, !626, !630, !631, !632, !633, !634, !635, !636, !656, !660, !665, !671, !690, !695, !699, !700, !705, !710, !711, !716, !720, !724, !728, !732, !736, !737, !738, !739, !740, !744, !745, !750, !751, !752, !753, !754, !759, !766, !771, !775, !779, !783, !787, !788, !792, !793, !800, !805, !806, !807, !808, !870, !878, !879, !883, !884, !888, !889, !893, !898, !899, !903, !907, !914, !915, !916, !917, !918, !919, !924, !925, !929, !933, !937, !938, !939, !943, !953, !954, !958, !959, !963, !964, !968, !969, !974, !975, !979, !983, !984, !985, !986, !987, !988, !989, !993, !994, !995, !996, !997, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1034, !1035, !1040, !1044, !1045, !1049, !1050, !1051, !1052, !1078, !1082, !1083, !1084, !1085, !1086, !1090, !1091, !1092, !1093, !1094, !1098, !1102, !1103}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !603, file: !597, line: 34, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!382, !594, !424, !609, !424, !609, !611, !613}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !603, file: !597, line: 35, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!382, !594, !424, !469, !471, !489}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !603, file: !597, line: 36, baseType: !615, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !603, file: !597, line: 37, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!382, !594, !623, !623}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !603, file: !597, line: 38, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!382, !594, !623, !623, !623}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !603, file: !597, line: 40, baseType: !620, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !603, file: !597, line: 41, baseType: !627, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !603, file: !597, line: 42, baseType: !620, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !603, file: !597, line: 43, baseType: !627, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !603, file: !597, line: 44, baseType: !620, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !603, file: !597, line: 46, baseType: !627, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !603, file: !597, line: 47, baseType: !637, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!382, !594, !586, !586, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !643, file: !36, line: 1227, baseType: !478, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !643, file: !36, line: 1228, baseType: !478, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !643, file: !36, line: 1229, baseType: !478, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !643, file: !36, line: 1230, baseType: !478, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !643, file: !36, line: 1231, baseType: !478, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !643, file: !36, line: 1232, baseType: !478, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !643, file: !36, line: 1233, baseType: !478, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !643, file: !36, line: 1234, baseType: !478, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !643, file: !36, line: 1236, baseType: !478, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !643, file: !36, line: 1237, baseType: !478, size: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !643, file: !36, line: 1238, baseType: !478, size: 64, offset: 640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !603, file: !597, line: 48, baseType: !657, size: 64, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!382, !594, !586, !640}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !603, file: !597, line: 49, baseType: !661, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!382, !594, !623, !478, !664, !478, !424, !424, !623}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !603, file: !597, line: 50, baseType: !666, size: 64, offset: 896)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!382, !594, !669, !670}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !603, file: !597, line: 52, baseType: !672, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!382, !594, !675, !676}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !678, file: !36, line: 593, baseType: !426, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !678, file: !36, line: 594, baseType: !426, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !678, file: !36, line: 594, baseType: !426, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !678, file: !36, line: 594, baseType: !426, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !678, file: !36, line: 595, baseType: !426, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !678, file: !36, line: 596, baseType: !426, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !678, file: !36, line: 597, baseType: !426, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !678, file: !36, line: 598, baseType: !426, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !678, file: !36, line: 598, baseType: !426, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !678, file: !36, line: 599, baseType: !426, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !603, file: !597, line: 53, baseType: !691, size: 64, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!382, !594, !594, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !603, file: !597, line: 54, baseType: !696, size: 64, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!382, !594, !623}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !603, file: !597, line: 55, baseType: !620, size: 64, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !603, file: !597, line: 56, baseType: !701, size: 64, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!382, !594, !704, !477}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !603, file: !597, line: 58, baseType: !706, size: 64, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!382, !594, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !603, file: !597, line: 59, baseType: !706, size: 64, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !603, file: !597, line: 60, baseType: !712, size: 64, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!382, !594, !715, !539}
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !603, file: !597, line: 61, baseType: !717, size: 64, offset: 1472)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!382, !594}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !603, file: !597, line: 63, baseType: !721, size: 64, offset: 1536)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!382, !594, !424, !609, !487, !623, !623}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !603, file: !597, line: 64, baseType: !725, size: 64, offset: 1600)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!382, !594, !594, !586, !586, !640}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !603, file: !597, line: 65, baseType: !729, size: 64, offset: 1664)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!382, !594, !594, !640}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !603, file: !597, line: 66, baseType: !733, size: 64, offset: 1728)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!382, !594, !594, !586, !640}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !603, file: !597, line: 67, baseType: !729, size: 64, offset: 1792)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !603, file: !597, line: 69, baseType: !717, size: 64, offset: 1856)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !603, file: !597, line: 70, baseType: !725, size: 64, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !603, file: !597, line: 71, baseType: !733, size: 64, offset: 1984)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !603, file: !597, line: 72, baseType: !741, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!382, !594, !670}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !603, file: !597, line: 73, baseType: !717, size: 64, offset: 2112)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !603, file: !597, line: 75, baseType: !746, size: 64, offset: 2176)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!382, !594, !749, !670}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !603, file: !597, line: 76, baseType: !620, size: 64, offset: 2240)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !603, file: !597, line: 77, baseType: !620, size: 64, offset: 2304)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !603, file: !597, line: 78, baseType: !637, size: 64, offset: 2368)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !603, file: !597, line: 79, baseType: !657, size: 64, offset: 2432)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !603, file: !597, line: 81, baseType: !755, size: 64, offset: 2496)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!382, !594, !487, !594, !758}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !603, file: !597, line: 82, baseType: !760, size: 64, offset: 2560)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!382, !594, !424, !763, !763, !669, !765}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !603, file: !597, line: 83, baseType: !767, size: 64, offset: 2624)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!382, !594, !424, !770, !424}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !603, file: !597, line: 84, baseType: !772, size: 64, offset: 2688)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!382, !594, !424, !609, !424, !609, !486}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !603, file: !597, line: 85, baseType: !776, size: 64, offset: 2752)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!382, !594, !594, !758}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !603, file: !597, line: 87, baseType: !780, size: 64, offset: 2816)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!382, !594, !623, !469}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !603, file: !597, line: 88, baseType: !784, size: 64, offset: 2880)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!382, !594, !487}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !603, file: !597, line: 89, baseType: !784, size: 64, offset: 2944)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !603, file: !597, line: 90, baseType: !789, size: 64, offset: 3008)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!382, !594, !623, !613}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !603, file: !597, line: 91, baseType: !721, size: 64, offset: 3072)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !603, file: !597, line: 93, baseType: !794, size: 64, offset: 3136)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!382, !594, !797}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !603, file: !597, line: 94, baseType: !801, size: 64, offset: 3200)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!382, !594, !424, !539, !539, !469, !804, !804, !694}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !603, file: !597, line: 95, baseType: !801, size: 64, offset: 3264)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !603, file: !597, line: 96, baseType: !801, size: 64, offset: 3328)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !603, file: !597, line: 97, baseType: !801, size: 64, offset: 3392)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !603, file: !597, line: 99, baseType: !809, size: 64, offset: 3456)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!382, !594, !812, !815}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !587, line: 51, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !587, line: 51, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !597, line: 609, size: 6208, elements: !818)
!818 = !{!819, !820, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !839, !846, !847, !848, !849, !850, !851, !852, !853, !857, !858, !859, !860, !861, !863, !864, !865, !866, !867, !868, !869}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !817, file: !597, line: 610, baseType: !600, size: 4480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !817, file: !597, line: 610, baseType: !821, size: 32, offset: 4480)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !420)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !817, file: !597, line: 611, baseType: !424, size: 32, offset: 4512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !817, file: !597, line: 611, baseType: !424, size: 32, offset: 4544)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !817, file: !597, line: 611, baseType: !424, size: 32, offset: 4576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !817, file: !597, line: 612, baseType: !424, size: 32, offset: 4608)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !817, file: !597, line: 613, baseType: !424, size: 32, offset: 4640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !817, file: !597, line: 614, baseType: !469, size: 64, offset: 4672)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !817, file: !597, line: 615, baseType: !471, size: 64, offset: 4736)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !817, file: !597, line: 616, baseType: !770, size: 64, offset: 4800)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !817, file: !597, line: 617, baseType: !469, size: 64, offset: 4864)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !817, file: !597, line: 618, baseType: !832, size: 64, offset: 4928)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !597, line: 602, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 598, size: 128, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !834, file: !597, line: 599, baseType: !424, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !834, file: !597, line: 600, baseType: !424, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !834, file: !597, line: 601, baseType: !486, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !817, file: !597, line: 619, baseType: !840, size: 64, offset: 4992)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !597, line: 607, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 604, size: 128, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !842, file: !597, line: 605, baseType: !424, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !842, file: !597, line: 606, baseType: !486, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !817, file: !597, line: 620, baseType: !486, size: 64, offset: 5056)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !817, file: !597, line: 621, baseType: !478, size: 64, offset: 5120)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !817, file: !597, line: 622, baseType: !478, size: 64, offset: 5184)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !817, file: !597, line: 623, baseType: !623, size: 64, offset: 5248)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !817, file: !597, line: 623, baseType: !623, size: 64, offset: 5312)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !817, file: !597, line: 623, baseType: !623, size: 64, offset: 5376)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !817, file: !597, line: 624, baseType: !539, size: 32, offset: 5440)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !817, file: !597, line: 625, baseType: !854, size: 64, offset: 5504)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!382}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !817, file: !597, line: 626, baseType: !365, size: 64, offset: 5568)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !817, file: !597, line: 627, baseType: !623, size: 64, offset: 5632)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !817, file: !597, line: 628, baseType: !424, size: 32, offset: 5696)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !817, file: !597, line: 629, baseType: !401, size: 64, offset: 5760)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !817, file: !597, line: 630, baseType: !862, size: 32, offset: 5824)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !817, file: !597, line: 631, baseType: !424, size: 32, offset: 5856)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !817, file: !597, line: 631, baseType: !424, size: 32, offset: 5888)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !817, file: !597, line: 632, baseType: !539, size: 32, offset: 5920)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !817, file: !597, line: 633, baseType: !539, size: 32, offset: 5952)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !817, file: !597, line: 634, baseType: !412, size: 64, offset: 6016)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !817, file: !597, line: 634, baseType: !365, size: 64, offset: 6080)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !817, file: !597, line: 635, baseType: !432, size: 64, offset: 6144)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !603, file: !597, line: 100, baseType: !871, size: 64, offset: 3520)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!382, !594, !424, !424, !874, !877}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !876)
!876 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !603, file: !597, line: 101, baseType: !717, size: 64, offset: 3584)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !603, file: !597, line: 102, baseType: !880, size: 64, offset: 3648)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!382, !594, !586, !586, !670}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !603, file: !597, line: 103, baseType: !606, size: 64, offset: 3712)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !603, file: !597, line: 105, baseType: !885, size: 64, offset: 3776)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!382, !594, !586, !586, !669, !670}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !603, file: !597, line: 106, baseType: !717, size: 64, offset: 3840)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !603, file: !597, line: 107, baseType: !890, size: 64, offset: 3904)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!382, !594, !388}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !603, file: !597, line: 108, baseType: !894, size: 64, offset: 3968)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!382, !594, !897, !669, !670}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !401)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !603, file: !597, line: 109, baseType: !854, size: 64, offset: 4032)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !603, file: !597, line: 111, baseType: !900, size: 64, offset: 4096)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!382, !594, !594, !594, !478, !594}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !603, file: !597, line: 112, baseType: !904, size: 64, offset: 4160)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!382, !594, !594, !594, !594}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !603, file: !597, line: 113, baseType: !908, size: 64, offset: 4224)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!382, !594, !911, !911}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !587, line: 30, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !587, line: 30, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !603, file: !597, line: 114, baseType: !606, size: 64, offset: 4288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !603, file: !597, line: 115, baseType: !721, size: 64, offset: 4352)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !603, file: !597, line: 117, baseType: !780, size: 64, offset: 4416)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !603, file: !597, line: 118, baseType: !780, size: 64, offset: 4480)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !603, file: !597, line: 119, baseType: !894, size: 64, offset: 4544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !603, file: !597, line: 120, baseType: !920, size: 64, offset: 4608)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!382, !594, !923, !694}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !603, file: !597, line: 121, baseType: !854, size: 64, offset: 4672)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !603, file: !597, line: 123, baseType: !926, size: 64, offset: 4736)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!382, !594, !424, !365}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !603, file: !597, line: 124, baseType: !930, size: 64, offset: 4800)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!382, !594, !815, !623, !365}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !603, file: !597, line: 125, baseType: !934, size: 64, offset: 4864)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!382, !515, !594}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !603, file: !597, line: 126, baseType: !620, size: 64, offset: 4928)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !603, file: !597, line: 127, baseType: !620, size: 64, offset: 4992)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !603, file: !597, line: 129, baseType: !940, size: 64, offset: 5056)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!382, !594, !770}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !603, file: !597, line: 130, baseType: !944, size: 64, offset: 5120)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!382, !594, !947, !947}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !949, file: !60, line: 653, baseType: !424, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !949, file: !60, line: 653, baseType: !623, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !603, file: !597, line: 131, baseType: !944, size: 64, offset: 5184)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !603, file: !597, line: 132, baseType: !955, size: 64, offset: 5248)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!382, !594, !469, !469, !469}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !603, file: !597, line: 133, baseType: !890, size: 64, offset: 5312)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !603, file: !597, line: 135, baseType: !960, size: 64, offset: 5376)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!382, !594, !478, !694}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !603, file: !597, line: 136, baseType: !960, size: 64, offset: 5440)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !603, file: !597, line: 137, baseType: !965, size: 64, offset: 5504)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!382, !594, !694}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !603, file: !597, line: 138, baseType: !606, size: 64, offset: 5568)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !603, file: !597, line: 139, baseType: !970, size: 64, offset: 5632)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!382, !594, !973, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !603, file: !597, line: 141, baseType: !854, size: 64, offset: 5696)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !603, file: !597, line: 142, baseType: !976, size: 64, offset: 5760)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!382, !594, !594, !478, !594}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !603, file: !597, line: 143, baseType: !980, size: 64, offset: 5824)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!382, !594, !594, !594}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !603, file: !597, line: 144, baseType: !854, size: 64, offset: 5888)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !603, file: !597, line: 145, baseType: !976, size: 64, offset: 5952)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !603, file: !597, line: 147, baseType: !980, size: 64, offset: 6016)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !603, file: !597, line: 148, baseType: !854, size: 64, offset: 6080)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !603, file: !597, line: 149, baseType: !976, size: 64, offset: 6144)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !603, file: !597, line: 150, baseType: !980, size: 64, offset: 6208)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !603, file: !597, line: 151, baseType: !990, size: 64, offset: 6272)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!382, !594, !539}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !603, file: !597, line: 153, baseType: !717, size: 64, offset: 6336)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !603, file: !597, line: 154, baseType: !717, size: 64, offset: 6400)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !603, file: !597, line: 155, baseType: !717, size: 64, offset: 6464)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !603, file: !597, line: 156, baseType: !717, size: 64, offset: 6528)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !603, file: !597, line: 157, baseType: !890, size: 64, offset: 6592)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !603, file: !597, line: 159, baseType: !999, size: 64, offset: 6656)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!382, !594, !424, !611}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !603, file: !597, line: 160, baseType: !717, size: 64, offset: 6720)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !603, file: !597, line: 161, baseType: !717, size: 64, offset: 6784)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !603, file: !597, line: 162, baseType: !717, size: 64, offset: 6848)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !603, file: !597, line: 163, baseType: !717, size: 64, offset: 6912)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !603, file: !597, line: 165, baseType: !980, size: 64, offset: 6976)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !603, file: !597, line: 166, baseType: !980, size: 64, offset: 7040)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !603, file: !597, line: 167, baseType: !780, size: 64, offset: 7104)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !603, file: !597, line: 168, baseType: !1010, size: 64, offset: 7168)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!382, !594, !623, !424}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !603, file: !597, line: 169, baseType: !1014, size: 64, offset: 7232)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!382, !594, !694, !469}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !603, file: !597, line: 171, baseType: !741, size: 64, offset: 7296)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !603, file: !597, line: 172, baseType: !717, size: 64, offset: 7360)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !603, file: !597, line: 173, baseType: !1020, size: 64, offset: 7424)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!382, !594, !469, !804}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !603, file: !597, line: 174, baseType: !880, size: 64, offset: 7488)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !603, file: !597, line: 175, baseType: !880, size: 64, offset: 7552)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !603, file: !597, line: 177, baseType: !620, size: 64, offset: 7616)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !603, file: !597, line: 178, baseType: !666, size: 64, offset: 7680)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !603, file: !597, line: 179, baseType: !620, size: 64, offset: 7744)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !603, file: !597, line: 180, baseType: !627, size: 64, offset: 7808)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !603, file: !597, line: 181, baseType: !1030, size: 64, offset: 7872)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!382, !594, !361, !669, !670}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !603, file: !597, line: 183, baseType: !940, size: 64, offset: 7936)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !603, file: !597, line: 184, baseType: !701, size: 64, offset: 8000)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !603, file: !597, line: 185, baseType: !1036, size: 64, offset: 8064)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!382, !594, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !603, file: !597, line: 186, baseType: !1041, size: 64, offset: 8128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!382, !594, !424, !609, !486}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !603, file: !597, line: 187, baseType: !760, size: 64, offset: 8192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !603, file: !597, line: 189, baseType: !1046, size: 64, offset: 8256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!382, !594, !424, !424, !469, !611}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !603, file: !597, line: 190, baseType: !854, size: 64, offset: 8320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !603, file: !597, line: 191, baseType: !976, size: 64, offset: 8384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !603, file: !597, line: 192, baseType: !980, size: 64, offset: 8448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !603, file: !597, line: 193, baseType: !1053, size: 64, offset: 8512)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!382, !594, !812, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !597, line: 660, size: 5312, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1058, file: !597, line: 661, baseType: !600, size: 4480)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1058, file: !597, line: 661, baseType: !821, size: 32, offset: 4480)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1058, file: !597, line: 662, baseType: !424, size: 32, offset: 4512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1058, file: !597, line: 662, baseType: !424, size: 32, offset: 4544)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1058, file: !597, line: 662, baseType: !424, size: 32, offset: 4576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1058, file: !597, line: 663, baseType: !424, size: 32, offset: 4608)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1058, file: !597, line: 664, baseType: !424, size: 32, offset: 4640)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1058, file: !597, line: 665, baseType: !469, size: 64, offset: 4672)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1058, file: !597, line: 666, baseType: !469, size: 64, offset: 4736)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1058, file: !597, line: 667, baseType: !424, size: 32, offset: 4800)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1058, file: !597, line: 668, baseType: !862, size: 32, offset: 4832)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1058, file: !597, line: 670, baseType: !469, size: 64, offset: 4864)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1058, file: !597, line: 670, baseType: !469, size: 64, offset: 4928)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1058, file: !597, line: 671, baseType: !469, size: 64, offset: 4992)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1058, file: !597, line: 672, baseType: !469, size: 64, offset: 5056)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1058, file: !597, line: 673, baseType: !469, size: 64, offset: 5120)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1058, file: !597, line: 674, baseType: !424, size: 32, offset: 5184)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1058, file: !597, line: 675, baseType: !469, size: 64, offset: 5248)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !603, file: !597, line: 195, baseType: !1079, size: 64, offset: 8576)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!382, !1056, !594, !594}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !603, file: !597, line: 196, baseType: !1079, size: 64, offset: 8640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !603, file: !597, line: 197, baseType: !854, size: 64, offset: 8704)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !603, file: !597, line: 198, baseType: !976, size: 64, offset: 8768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !603, file: !597, line: 199, baseType: !980, size: 64, offset: 8832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !603, file: !597, line: 201, baseType: !1087, size: 64, offset: 8896)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!382, !594, !424, !424}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !603, file: !597, line: 202, baseType: !755, size: 64, offset: 8960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !603, file: !597, line: 203, baseType: !627, size: 64, offset: 9024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !603, file: !597, line: 204, baseType: !809, size: 64, offset: 9088)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !603, file: !597, line: 205, baseType: !940, size: 64, offset: 9152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !603, file: !597, line: 206, baseType: !1095, size: 64, offset: 9216)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!382, !361, !594, !424, !669, !670}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !603, file: !597, line: 208, baseType: !1099, size: 64, offset: 9280)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!382, !424, !765}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !603, file: !597, line: 209, baseType: !980, size: 64, offset: 9344)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !603, file: !597, line: 210, baseType: !772, size: 64, offset: 9408)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !596, file: !597, line: 438, baseType: !1105, size: 64, offset: 13952)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !587, line: 60, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1107, file: !114, line: 241, baseType: !361, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !114, line: 242, baseType: !441, size: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1107, file: !114, line: 243, baseType: !424, size: 32, offset: 96)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1107, file: !114, line: 243, baseType: !424, size: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1107, file: !114, line: 244, baseType: !424, size: 32, offset: 160)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1107, file: !114, line: 244, baseType: !424, size: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1107, file: !114, line: 245, baseType: !469, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1107, file: !114, line: 246, baseType: !539, size: 32, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1107, file: !114, line: 247, baseType: !424, size: 32, offset: 352)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1107, file: !114, line: 251, baseType: !424, size: 32, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1107, file: !114, line: 252, baseType: !911, size: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1107, file: !114, line: 253, baseType: !539, size: 32, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1107, file: !114, line: 254, baseType: !424, size: 32, offset: 544)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1107, file: !114, line: 254, baseType: !424, size: 32, offset: 576)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1107, file: !114, line: 255, baseType: !424, size: 32, offset: 608)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !596, file: !597, line: 438, baseType: !1105, size: 64, offset: 14016)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !596, file: !597, line: 439, baseType: !365, size: 64, offset: 14080)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !596, file: !597, line: 440, baseType: !1127, size: 32, offset: 14144)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !596, file: !597, line: 441, baseType: !539, size: 32, offset: 14176)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !596, file: !597, line: 442, baseType: !539, size: 32, offset: 14208)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !596, file: !597, line: 443, baseType: !1131, size: 448, offset: 14272)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 448, elements: !1133)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !401)
!1133 = !{!1134}
!1134 = !DISubrange(count: 7)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !596, file: !597, line: 444, baseType: !539, size: 32, offset: 14720)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !596, file: !597, line: 445, baseType: !539, size: 32, offset: 14752)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !596, file: !597, line: 446, baseType: !424, size: 32, offset: 14784)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !596, file: !597, line: 447, baseType: !462, size: 64, offset: 14848)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !596, file: !597, line: 448, baseType: !462, size: 64, offset: 14912)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !596, file: !597, line: 449, baseType: !677, size: 640, offset: 14976)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !596, file: !597, line: 450, baseType: !613, size: 32, offset: 15616)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !596, file: !597, line: 451, baseType: !1143, size: 2880, offset: 15680)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !597, line: 318, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !597, line: 319, size: 2880, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1152, !1165, !1166, !1171, !1176, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1191, !1192, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1224, !1225, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1250, !1251, !1252}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1144, file: !597, line: 320, baseType: !424, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1144, file: !597, line: 321, baseType: !424, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1144, file: !597, line: 322, baseType: !424, size: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1144, file: !597, line: 323, baseType: !424, size: 32, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1144, file: !597, line: 324, baseType: !424, size: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1144, file: !597, line: 325, baseType: !424, size: 32, offset: 160)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1144, file: !597, line: 326, baseType: !1153, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !597, line: 293, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !597, line: 295, size: 448, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !597, line: 296, baseType: !1153, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1155, file: !597, line: 297, baseType: !486, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1155, file: !597, line: 297, baseType: !486, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1155, file: !597, line: 298, baseType: !469, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1155, file: !597, line: 298, baseType: !469, size: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1155, file: !597, line: 299, baseType: !424, size: 32, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1155, file: !597, line: 300, baseType: !424, size: 32, offset: 352)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1155, file: !597, line: 301, baseType: !424, size: 32, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1144, file: !597, line: 326, baseType: !1153, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1144, file: !597, line: 328, baseType: !1167, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!382, !594, !1170, !469}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1144, file: !597, line: 329, baseType: !1172, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!382, !1170, !1175, !471, !471, !489, !469}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1144, file: !597, line: 330, baseType: !1177, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!382, !1170}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1144, file: !597, line: 331, baseType: !1177, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1144, file: !597, line: 334, baseType: !361, size: 64, offset: 576)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !597, line: 335, baseType: !441, size: 32, offset: 640)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1144, file: !597, line: 335, baseType: !441, size: 32, offset: 672)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1144, file: !597, line: 336, baseType: !441, size: 32, offset: 704)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1144, file: !597, line: 336, baseType: !441, size: 32, offset: 736)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1144, file: !597, line: 337, baseType: !1187, size: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !362, line: 339, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !362, line: 339, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1144, file: !597, line: 338, baseType: !1187, size: 64, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1144, file: !597, line: 339, baseType: !1193, size: 64, offset: 896)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !362, line: 341, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !362, line: 351, size: 192, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1195, file: !362, line: 354, baseType: !72, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1195, file: !362, line: 355, baseType: !72, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1195, file: !362, line: 356, baseType: !72, size: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1195, file: !362, line: 361, baseType: !72, size: 32, offset: 96)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1195, file: !362, line: 362, baseType: !535, size: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1144, file: !597, line: 340, baseType: !424, size: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1144, file: !597, line: 340, baseType: !424, size: 32, offset: 992)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1144, file: !597, line: 341, baseType: !486, size: 64, offset: 1024)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1144, file: !597, line: 342, baseType: !469, size: 64, offset: 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1144, file: !597, line: 343, baseType: !489, size: 64, offset: 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1144, file: !597, line: 344, baseType: !471, size: 64, offset: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1144, file: !597, line: 345, baseType: !424, size: 32, offset: 1280)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1144, file: !597, line: 346, baseType: !1175, size: 64, offset: 1344)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1144, file: !597, line: 347, baseType: !539, size: 32, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1144, file: !597, line: 348, baseType: !424, size: 32, offset: 1440)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1144, file: !597, line: 351, baseType: !539, size: 32, offset: 1472)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1144, file: !597, line: 352, baseType: !539, size: 32, offset: 1504)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1144, file: !597, line: 353, baseType: !441, size: 32, offset: 1536)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1144, file: !597, line: 354, baseType: !441, size: 32, offset: 1568)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1144, file: !597, line: 355, baseType: !1175, size: 64, offset: 1600)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1144, file: !597, line: 356, baseType: !1175, size: 64, offset: 1664)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1144, file: !597, line: 357, baseType: !1219, size: 64, offset: 1728)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !597, line: 310, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 308, size: 32, elements: !1222)
!1222 = !{!1223}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1221, file: !597, line: 309, baseType: !424, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1144, file: !597, line: 357, baseType: !1219, size: 64, offset: 1792)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1144, file: !597, line: 358, baseType: !1226, size: 64, offset: 1856)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !597, line: 316, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 312, size: 128, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1228, file: !597, line: 313, baseType: !365, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1228, file: !597, line: 314, baseType: !424, size: 32, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1228, file: !597, line: 315, baseType: !403, size: 8, offset: 96)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1144, file: !597, line: 359, baseType: !1226, size: 64, offset: 1920)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1144, file: !597, line: 360, baseType: !1226, size: 64, offset: 1984)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1144, file: !597, line: 361, baseType: !424, size: 32, offset: 2048)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1144, file: !597, line: 362, baseType: !441, size: 32, offset: 2080)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1144, file: !597, line: 363, baseType: !424, size: 32, offset: 2112)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1144, file: !597, line: 364, baseType: !1175, size: 64, offset: 2176)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1144, file: !597, line: 365, baseType: !1193, size: 64, offset: 2240)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1144, file: !597, line: 366, baseType: !441, size: 32, offset: 2304)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1144, file: !597, line: 367, baseType: !441, size: 32, offset: 2336)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1144, file: !597, line: 368, baseType: !1187, size: 64, offset: 2368)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1144, file: !597, line: 369, baseType: !1187, size: 64, offset: 2432)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1144, file: !597, line: 370, baseType: !1245, size: 64, offset: 2496)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1144, file: !597, line: 371, baseType: !1245, size: 64, offset: 2560)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1144, file: !597, line: 372, baseType: !1245, size: 64, offset: 2624)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1144, file: !597, line: 373, baseType: !569, size: 64, offset: 2688)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1144, file: !597, line: 374, baseType: !535, size: 64, offset: 2752)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1144, file: !597, line: 375, baseType: !1253, size: 64, offset: 2816)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !596, file: !597, line: 451, baseType: !1143, size: 2880, offset: 18560)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !596, file: !597, line: 452, baseType: !1256, size: 64, offset: 21440)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !597, line: 681, size: 4864, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1265, !1266, !1270}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1258, file: !597, line: 682, baseType: !600, size: 4480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1258, file: !597, line: 682, baseType: !821, size: 32, offset: 4480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1258, file: !597, line: 683, baseType: !539, size: 32, offset: 4512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1258, file: !597, line: 684, baseType: !424, size: 32, offset: 4544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1258, file: !597, line: 685, baseType: !973, size: 64, offset: 4608)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1258, file: !597, line: 686, baseType: !486, size: 64, offset: 4672)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1258, file: !597, line: 687, baseType: !1267, size: 64, offset: 4736)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!382, !1256, !623, !365}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1258, file: !597, line: 688, baseType: !365, size: 64, offset: 4800)
