; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/xmon.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/xmon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscDrawLG = type opaque
%struct._p_PetscDraw = type opaque
%struct._p_PetscDrawAxis = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prev", scope: !2, file: !3, line: 31, type: !133, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "KSPMonitorLGRange", scope: !3, file: !3, line: 25, type: !4, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !568, retainedNodes: !599)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/xmon.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !78, !133, !115}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !10, line: 22, baseType: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !13, line: 75, size: 12800, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !244, !298, !303, !304, !305, !306, !336, !337, !338, !339, !340, !349, !354, !355, !356, !357, !358, !359, !360, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !404, !410, !411, !412, !413, !418, !419, !420, !421, !426, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !531, !532, !533, !534, !535, !542, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !566, !567}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !12, file: !13, line: 76, baseType: !16, size: 4480)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !17, line: 122, baseType: !18)
!17 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !17, line: 73, size: 4480, elements: !19)
!19 = !{!20, !22, !76, !77, !79, !82, !83, !84, !85, !93, !94, !96, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !118, !119, !120, !122, !123, !125, !127, !128, !129, !130, !131, !134, !136, !137, !138, !139, !140, !143, !145, !146, !147, !157, !159, !160, !164, !165, !234, !239, !241, !242, !243}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !18, file: !17, line: 74, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !18, file: !17, line: 75, baseType: !23, size: 448, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 448, elements: !74)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !17, line: 53, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 448, elements: !26)
!26 = !{!27, !38, !46, !51, !58, !62, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !25, file: !17, line: 46, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!6, !31, !33}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !35, line: 330, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !35, line: 330, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !25, file: !17, line: 47, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !31, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !43, line: 16, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !25, file: !17, line: 48, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !25, file: !17, line: 49, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !31, !55, !31}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !25, file: !17, line: 50, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !31, !55, !50}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !25, file: !17, line: 51, baseType: !63, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !31, !55, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !25, file: !17, line: 52, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !31, !55, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !17, line: 76, baseType: !34, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 77, baseType: !78, size: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !81)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !17, line: 79, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 27, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !18, file: !17, line: 80, baseType: !78, size: 32, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !18, file: !17, line: 81, baseType: !95, size: 32, offset: 992)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !18, file: !17, line: 82, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !18, file: !17, line: 83, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !18, file: !17, line: 84, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !18, file: !17, line: 85, baseType: !105, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !18, file: !17, line: 86, baseType: !105, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !18, file: !17, line: 87, baseType: !105, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !17, line: 88, baseType: !31, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !18, file: !17, line: 89, baseType: !86, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 90, baseType: !105, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !18, file: !17, line: 91, baseType: !105, size: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !18, file: !17, line: 92, baseType: !78, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !18, file: !17, line: 93, baseType: !115, size: 64, offset: 1728)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !17, line: 94, baseType: !117, size: 64, offset: 1792)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !87)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1856)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1888)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !18, file: !17, line: 97, baseType: !124, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !18, file: !17, line: 97, baseType: !126, size: 64, offset: 2112)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !18, file: !17, line: 100, baseType: !132, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !18, file: !17, line: 100, baseType: !135, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2496)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2528)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2560)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2624)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !18, file: !17, line: 103, baseType: !141, size: 64, offset: 2688)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !133)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !18, file: !17, line: 103, baseType: !144, size: 64, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !18, file: !17, line: 104, baseType: !73, size: 64, offset: 2816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !18, file: !17, line: 105, baseType: !78, size: 32, offset: 2880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !18, file: !17, line: 106, baseType: !148, size: 128, offset: 2944)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !17, line: 64, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 61, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !151, file: !17, line: 62, baseType: !66, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !151, file: !17, line: 63, baseType: !115, size: 64, offset: 64)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !18, file: !17, line: 107, baseType: !158, size: 64, offset: 3072)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !18, file: !17, line: 108, baseType: !115, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !18, file: !17, line: 109, baseType: !161, size: 64, offset: 3200)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!6, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !18, file: !17, line: 111, baseType: !78, size: 32, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !18, file: !17, line: 112, baseType: !166, size: 320, offset: 3328)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !232)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !170, !31, !115}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !172, line: 108, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !172, line: 99, size: 640, elements: !174)
!174 = !{!175, !176, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !173, file: !172, line: 100, baseType: !78, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 101, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !172, line: 82, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !172, line: 83, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !188, !189, !190, !194, !201, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !179, file: !172, line: 84, baseType: !105, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !179, file: !172, line: 85, baseType: !105, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !172, line: 86, baseType: !115, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !179, file: !172, line: 87, baseType: !97, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !172, line: 88, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !179, file: !172, line: 89, baseType: !57, size: 8, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !179, file: !172, line: 90, baseType: !105, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !179, file: !172, line: 91, baseType: !191, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !179, file: !172, line: 92, baseType: !195, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !197, size: 32, elements: !198)
!197 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !172, line: 93, baseType: !202, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !172, line: 81, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 81, baseType: !197, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!209 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!210 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!211 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!212 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!213 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!215 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!216 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !172, line: 94, baseType: !177, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !179, file: !172, line: 95, baseType: !105, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !172, line: 96, baseType: !115, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !173, file: !172, line: 103, baseType: !105, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !173, file: !172, line: 104, baseType: !34, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !173, file: !172, line: 106, baseType: !31, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !173, file: !172, line: 107, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !172, line: 10, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !172, line: 10, flags: DIFlagFwdDecl)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !18, file: !17, line: 113, baseType: !235, size: 320, offset: 3648)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!6, !31, !115}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !18, file: !17, line: 114, baseType: !240, size: 320, offset: 3968)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !232)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !18, file: !17, line: 115, baseType: !195, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !18, file: !17, line: 120, baseType: !229, size: 64, offset: 4352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !18, file: !17, line: 121, baseType: !195, size: 32, offset: 4416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !12, file: !13, line: 76, baseType: !245, size: 896, offset: 4480)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 896, elements: !74)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !13, line: 18, size: 896, elements: !247)
!247 = !{!248, !257, !261, !265, !273, !274, !278, !279, !283, !287, !291, !292, !296, !297}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !246, file: !13, line: 19, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!6, !9, !252, !256}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !253, line: 21, baseType: !254)
!253 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !253, line: 21, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !246, file: !13, line: 22, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!6, !9, !252, !252, !256}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !246, file: !13, line: 25, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!6, !9}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !246, file: !13, line: 26, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!6, !9, !269, !269}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !270, line: 16, baseType: !271)
!270 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !270, line: 16, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !246, file: !13, line: 27, baseType: !262, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !246, file: !13, line: 28, baseType: !275, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!6, !170, !9}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !246, file: !13, line: 29, baseType: !262, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !246, file: !13, line: 30, baseType: !280, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!6, !9, !132, !132}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !246, file: !13, line: 31, baseType: !284, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!6, !9, !78, !132, !132, !124}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !246, file: !13, line: 32, baseType: !288, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!6, !9, !195, !195, !124, !256, !132, !132}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !246, file: !13, line: 33, baseType: !262, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !246, file: !13, line: 34, baseType: !293, size: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!6, !9, !42}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !246, file: !13, line: 35, baseType: !262, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !246, file: !13, line: 36, baseType: !293, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !12, file: !13, line: 77, baseType: !299, size: 64, offset: 5376)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !300, line: 14, baseType: !301)
!300 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !300, line: 14, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !12, file: !13, line: 78, baseType: !195, size: 32, offset: 5440)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !12, file: !13, line: 79, baseType: !195, size: 32, offset: 5472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !12, file: !13, line: 81, baseType: !78, size: 32, offset: 5504)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !12, file: !13, line: 82, baseType: !307, size: 64, offset: 5568)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !10, line: 752, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !13, line: 54, size: 5184, elements: !310)
!310 = !{!311, !312, !332, !333, !334, !335}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !309, file: !13, line: 55, baseType: !16, size: 4480)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !309, file: !13, line: 55, baseType: !313, size: 448, offset: 4480)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 448, elements: !74)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !13, line: 41, size: 448, elements: !315)
!315 = !{!316, !320, !321, !325, !326, !327, !331}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !314, file: !13, line: 42, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!6, !307, !252, !252}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !314, file: !13, line: 43, baseType: !317, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !314, file: !13, line: 44, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!6, !307}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !314, file: !13, line: 45, baseType: !322, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !314, file: !13, line: 46, baseType: !322, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !314, file: !13, line: 47, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!6, !307, !42}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !314, file: !13, line: 48, baseType: !322, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !309, file: !13, line: 56, baseType: !9, size: 64, offset: 4928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !309, file: !13, line: 57, baseType: !269, size: 64, offset: 4992)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !309, file: !13, line: 58, baseType: !117, size: 64, offset: 5056)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !13, line: 59, baseType: !115, size: 64, offset: 5120)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !12, file: !13, line: 83, baseType: !195, size: 32, offset: 5632)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !12, file: !13, line: 84, baseType: !195, size: 32, offset: 5664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !12, file: !13, line: 85, baseType: !195, size: 32, offset: 5696)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !12, file: !13, line: 86, baseType: !195, size: 32, offset: 5728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !12, file: !13, line: 87, baseType: !341, size: 32, offset: 5760)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !342, line: 85, baseType: !343)
!342 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !342, line: 85, baseType: !8, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!346 = !DIEnumerator(name: "PC_LEFT", value: 0)
!347 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!348 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !12, file: !13, line: 88, baseType: !350, size: 384, offset: 5792)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 384, elements: !351)
!351 = !{!352, !353}
!352 = !DISubrange(count: 4)
!353 = !DISubrange(count: 3)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !12, file: !13, line: 89, baseType: !133, size: 64, offset: 6208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !12, file: !13, line: 90, baseType: !133, size: 64, offset: 6272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !12, file: !13, line: 91, baseType: !133, size: 64, offset: 6336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !12, file: !13, line: 92, baseType: !133, size: 64, offset: 6400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !12, file: !13, line: 93, baseType: !133, size: 64, offset: 6464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !12, file: !13, line: 94, baseType: !133, size: 64, offset: 6528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !12, file: !13, line: 95, baseType: !361, size: 32, offset: 6592)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !10, line: 540, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 517, baseType: !8, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!364 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!365 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!366 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!367 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!368 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!369 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!370 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!371 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!372 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!373 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!374 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!375 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!376 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!377 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!378 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!379 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!380 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!381 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!382 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!383 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!384 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !12, file: !13, line: 96, baseType: !195, size: 32, offset: 6624)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !12, file: !13, line: 98, baseType: !252, size: 64, offset: 6656)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !12, file: !13, line: 98, baseType: !252, size: 64, offset: 6720)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !12, file: !13, line: 102, baseType: !132, size: 64, offset: 6784)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !12, file: !13, line: 103, baseType: !132, size: 64, offset: 6848)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !12, file: !13, line: 104, baseType: !78, size: 32, offset: 6912)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !12, file: !13, line: 105, baseType: !78, size: 32, offset: 6944)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !12, file: !13, line: 106, baseType: !195, size: 32, offset: 6976)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !12, file: !13, line: 107, baseType: !132, size: 64, offset: 7040)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !12, file: !13, line: 108, baseType: !132, size: 64, offset: 7104)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !12, file: !13, line: 109, baseType: !78, size: 32, offset: 7168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !12, file: !13, line: 110, baseType: !78, size: 32, offset: 7200)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !12, file: !13, line: 111, baseType: !195, size: 32, offset: 7232)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !12, file: !13, line: 113, baseType: !78, size: 32, offset: 7264)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !12, file: !13, line: 114, baseType: !195, size: 32, offset: 7296)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !12, file: !13, line: 117, baseType: !78, size: 32, offset: 7328)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !12, file: !13, line: 120, baseType: !402, size: 320, offset: 7360)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 320, elements: !232)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !12, file: !13, line: 121, baseType: !405, size: 320, offset: 7680)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 320, elements: !232)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!6, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !12, file: !13, line: 122, baseType: !240, size: 320, offset: 8000)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !12, file: !13, line: 123, baseType: !78, size: 32, offset: 8320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !12, file: !13, line: 124, baseType: !195, size: 32, offset: 8352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !12, file: !13, line: 126, baseType: !414, size: 320, offset: 8384)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 320, elements: !232)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!6, !9, !115}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !12, file: !13, line: 127, baseType: !405, size: 320, offset: 8704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !12, file: !13, line: 128, baseType: !240, size: 320, offset: 9024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !12, file: !13, line: 129, baseType: !78, size: 32, offset: 9344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !12, file: !13, line: 131, baseType: !422, size: 64, offset: 9408)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!6, !9, !78, !133, !425, !115}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !12, file: !13, line: 132, baseType: !161, size: 64, offset: 9472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !12, file: !13, line: 133, baseType: !115, size: 64, offset: 9536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !12, file: !13, line: 135, baseType: !115, size: 64, offset: 9600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !12, file: !13, line: 137, baseType: !430, size: 64, offset: 9664)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !342, line: 11, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !342, line: 11, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 139, baseType: !115, size: 64, offset: 9728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9824)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9888)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9920)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9952)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 9984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10016)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10080)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10176)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !12, file: !13, line: 142, baseType: !195, size: 32, offset: 10208)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10368)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10432)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10496)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10560)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10688)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10752)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 10944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 11008)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !12, file: !13, line: 143, baseType: !42, size: 64, offset: 11072)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11136)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !464, line: 162, baseType: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 119, baseType: !197, size: 32, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!467 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!468 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!469 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!470 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!471 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!472 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!473 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!474 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!475 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!476 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!477 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!478 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!479 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!480 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!481 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!482 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!483 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!484 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!485 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!486 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!487 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!488 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!489 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!490 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!491 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!492 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!493 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!494 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!495 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!496 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!497 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!498 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!499 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!500 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!501 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!502 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!503 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!504 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!505 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!506 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!507 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!508 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11168)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11200)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11232)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11264)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11296)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11328)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11360)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11392)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11424)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11456)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11488)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11520)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !12, file: !13, line: 144, baseType: !463, size: 32, offset: 11552)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !12, file: !13, line: 147, baseType: !78, size: 32, offset: 11584)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !12, file: !13, line: 148, baseType: !256, size: 64, offset: 11648)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !12, file: !13, line: 150, baseType: !525, size: 32, offset: 11712)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !13, line: 70, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 70, baseType: !197, size: 32, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!530 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !12, file: !13, line: 151, baseType: !195, size: 32, offset: 11744)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !12, file: !13, line: 153, baseType: !78, size: 32, offset: 11776)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !12, file: !13, line: 154, baseType: !78, size: 32, offset: 11808)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !12, file: !13, line: 156, baseType: !195, size: 32, offset: 11840)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !12, file: !13, line: 161, baseType: !536, size: 192, offset: 11904)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !12, file: !13, line: 157, size: 192, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !536, file: !13, line: 158, baseType: !269, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !536, file: !13, line: 158, baseType: !269, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !536, file: !13, line: 159, baseType: !195, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !536, file: !13, line: 160, baseType: !195, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !12, file: !13, line: 163, baseType: !543, size: 32, offset: 12096)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !10, line: 451, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 451, baseType: !8, size: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !550}
!546 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!547 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!548 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!549 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!550 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !12, file: !13, line: 165, baseType: !341, size: 32, offset: 12128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !12, file: !13, line: 166, baseType: !543, size: 32, offset: 12160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !12, file: !13, line: 171, baseType: !195, size: 32, offset: 12192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !12, file: !13, line: 172, baseType: !195, size: 32, offset: 12224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !12, file: !13, line: 173, baseType: !195, size: 32, offset: 12256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !12, file: !13, line: 174, baseType: !252, size: 64, offset: 12288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !12, file: !13, line: 175, baseType: !252, size: 64, offset: 12352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !12, file: !13, line: 177, baseType: !78, size: 32, offset: 12416)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !12, file: !13, line: 178, baseType: !195, size: 32, offset: 12448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !12, file: !13, line: 180, baseType: !42, size: 64, offset: 12480)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !12, file: !13, line: 182, baseType: !562, size: 64, offset: 12544)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!6, !9, !252, !252, !115}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !12, file: !13, line: 183, baseType: !562, size: 64, offset: 12608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !12, file: !13, line: 184, baseType: !115, size: 64, offset: 12672)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !12, file: !13, line: 184, baseType: !115, size: 64, offset: 12736)
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !570, retainedTypes: !597, globals: !598, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/xmon.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!570 = !{!571, !196, !203, !343, !362, !465, !526, !544, !577}
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 663, baseType: !197, size: 32, elements: !573)
!572 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!573 = !{!574, !575, !576}
!574 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!575 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!576 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 385, baseType: !197, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!579 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!580 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!581 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!582 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!583 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!584 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!585 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!586 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!587 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!588 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!589 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!590 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!591 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!592 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!593 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!594 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!595 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!596 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!597 = !{!34, !115, !55, !42, !31, !133}
!598 = !{!0}
!599 = !{!600, !601, !602, !603, !604, !609, !610, !611, !612, !613, !614, !618, !620, !622, !626, !628, !630, !632, !636, !638, !640, !644, !646, !648, !650, !654, !656, !658, !662, !664, !666, !668, !672, !674, !676, !680, !682, !684, !688, !692}
!600 = !DILocalVariable(name: "ksp", arg: 1, scope: !2, file: !3, line: 25, type: !9)
!601 = !DILocalVariable(name: "n", arg: 2, scope: !2, file: !3, line: 25, type: !78)
!602 = !DILocalVariable(name: "rnorm", arg: 3, scope: !2, file: !3, line: 25, type: !133)
!603 = !DILocalVariable(name: "monctx", arg: 4, scope: !2, file: !3, line: 25, type: !115)
!604 = !DILocalVariable(name: "lg", scope: !2, file: !3, line: 27, type: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !606, line: 43, baseType: !607)
!606 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !606, line: 43, flags: DIFlagFwdDecl)
!609 = !DILocalVariable(name: "ierr", scope: !2, file: !3, line: 28, type: !6)
