; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/lsqr/lsqr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/lsqr/lsqr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!122 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 155, baseType: !5, size: 32, elements: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!142 = !{!143, !144, !145, !146, !147}
!143 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!144 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!145 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!146 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!147 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156}
!150 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!151 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!152 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!153 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!154 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!155 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!156 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!157 = !{!158, !208, !287, !229, !205, !178, !177, !361, !164, !627, !630, !277, !26, !633}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_LSQR", file: !160, line: 23, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/lsqr/lsqr.c", directory: "/home/users/ndemeye/xSDK")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 10, size: 640, elements: !162)
!162 = !{!163, !165, !166, !171, !172, !173, !175, !176, !179, !180, !625, !626}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_n", scope: !161, file: !160, line: 11, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_m", scope: !161, file: !160, line: 11, baseType: !164, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vwork_m", scope: !161, file: !160, line: 12, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !141, line: 21, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !141, line: 21, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "vwork_n", scope: !161, file: !160, line: 13, baseType: !167, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !161, file: !160, line: 14, baseType: !168, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "se_flg", scope: !161, file: !160, line: 15, baseType: !174, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "exact_norm", scope: !161, file: !160, line: 16, baseType: !174, size: 32, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "arnorm", scope: !161, file: !160, line: 17, baseType: !177, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !178)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "anorm", scope: !161, file: !160, line: 18, baseType: !177, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !161, file: !160, line: 20, baseType: !181, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !185, !164, !177, !624, !287}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !188)
!188 = !{!189, !394, !443, !448, !449, !450, !451, !481, !482, !483, !484, !485, !487, !492, !493, !494, !495, !496, !497, !498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !521, !527, !528, !529, !530, !535, !536, !537, !538, !539, !540, !541, !542, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !594, !595, !596, !597, !598, !605, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !621, !622, !623}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !187, file: !102, line: 76, baseType: !190, size: 4480)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !191, line: 122, baseType: !192)
!191 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !191, line: 73, size: 4480, elements: !193)
!193 = !{!194, !196, !250, !251, !252, !254, !255, !256, !257, !265, !266, !268, !272, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !288, !290, !291, !292, !294, !295, !297, !299, !300, !301, !302, !303, !305, !307, !308, !309, !310, !311, !314, !316, !317, !318, !328, !330, !331, !335, !336, !384, !389, !391, !392, !393}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !192, file: !191, line: 74, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !192, file: !191, line: 75, baseType: !197, size: 448, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 448, elements: !248)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !191, line: 53, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 45, size: 448, elements: !200)
!200 = !{!201, !212, !220, !225, !232, !236, !243}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !199, file: !191, line: 46, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!184, !205, !207}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !209, line: 330, baseType: !210)
!209 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !209, line: 330, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !199, file: !191, line: 47, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!184, !205, !216}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !217, line: 16, baseType: !218)
!217 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !217, line: 16, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !199, file: !191, line: 48, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!184, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !199, file: !191, line: 49, baseType: !226, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!184, !205, !229, !205}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !199, file: !191, line: 50, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!184, !205, !229, !224}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !199, file: !191, line: 51, baseType: !237, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!184, !205, !229, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !199, file: !191, line: 52, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!184, !205, !229, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !192, file: !191, line: 76, baseType: !208, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !191, line: 77, baseType: !164, size: 32, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !192, file: !191, line: 78, baseType: !253, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !178)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !192, file: !191, line: 78, baseType: !253, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !192, file: !191, line: 78, baseType: !253, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !192, file: !191, line: 78, baseType: !253, size: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !192, file: !191, line: 79, baseType: !258, size: 64, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !261, line: 27, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !263, line: 43, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!264 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !192, file: !191, line: 80, baseType: !164, size: 32, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !192, file: !191, line: 81, baseType: !267, size: 32, offset: 992)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !192, file: !191, line: 82, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !192, file: !191, line: 83, baseType: !273, size: 64, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !192, file: !191, line: 84, baseType: !277, size: 64, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !192, file: !191, line: 85, baseType: !277, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !192, file: !191, line: 86, baseType: !277, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !192, file: !191, line: 87, baseType: !277, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !192, file: !191, line: 88, baseType: !205, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !192, file: !191, line: 89, baseType: !258, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !191, line: 90, baseType: !277, size: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !192, file: !191, line: 91, baseType: !277, size: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !192, file: !191, line: 92, baseType: !164, size: 32, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !192, file: !191, line: 93, baseType: !287, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !192, file: !191, line: 94, baseType: !289, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !259)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !192, file: !191, line: 95, baseType: !164, size: 32, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !192, file: !191, line: 95, baseType: !164, size: 32, offset: 1888)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !192, file: !191, line: 96, baseType: !293, size: 64, offset: 1920)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !192, file: !191, line: 96, baseType: !293, size: 64, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !192, file: !191, line: 97, baseType: !296, size: 64, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !192, file: !191, line: 97, baseType: !298, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !192, file: !191, line: 98, baseType: !164, size: 32, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !192, file: !191, line: 98, baseType: !164, size: 32, offset: 2208)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !192, file: !191, line: 99, baseType: !293, size: 64, offset: 2240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !192, file: !191, line: 99, baseType: !293, size: 64, offset: 2304)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !192, file: !191, line: 100, baseType: !304, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !192, file: !191, line: 100, baseType: !306, size: 64, offset: 2432)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !192, file: !191, line: 101, baseType: !164, size: 32, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !192, file: !191, line: 101, baseType: !164, size: 32, offset: 2528)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !192, file: !191, line: 102, baseType: !293, size: 64, offset: 2560)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !192, file: !191, line: 102, baseType: !293, size: 64, offset: 2624)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !192, file: !191, line: 103, baseType: !312, size: 64, offset: 2688)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !177)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !192, file: !191, line: 103, baseType: !315, size: 64, offset: 2752)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !192, file: !191, line: 104, baseType: !247, size: 64, offset: 2816)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !192, file: !191, line: 105, baseType: !164, size: 32, offset: 2880)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !192, file: !191, line: 106, baseType: !319, size: 128, offset: 2944)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 128, elements: !326)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !191, line: 64, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 61, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !322, file: !191, line: 62, baseType: !240, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !322, file: !191, line: 63, baseType: !287, size: 64, offset: 64)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !192, file: !191, line: 107, baseType: !329, size: 64, offset: 3072)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !326)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !192, file: !191, line: 108, baseType: !287, size: 64, offset: 3136)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !192, file: !191, line: 109, baseType: !332, size: 64, offset: 3200)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!184, !287}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !192, file: !191, line: 111, baseType: !164, size: 32, offset: 3264)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !192, file: !191, line: 112, baseType: !337, size: 320, offset: 3328)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 320, elements: !382)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!184, !341, !205, !287}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !344)
!344 = !{!345, !346, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !343, file: !10, line: 100, baseType: !164, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !10, line: 101, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !358, !359, !360, !364, !365, !367, !368, !369}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !349, file: !10, line: 84, baseType: !277, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !349, file: !10, line: 85, baseType: !277, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !10, line: 86, baseType: !287, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !349, file: !10, line: 87, baseType: !269, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !349, file: !10, line: 88, baseType: !356, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !349, file: !10, line: 89, baseType: !231, size: 8, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !349, file: !10, line: 90, baseType: !277, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !349, file: !10, line: 91, baseType: !361, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !362, line: 46, baseType: !363)
!362 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!363 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !349, file: !10, line: 92, baseType: !174, size: 32, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !10, line: 93, baseType: !366, size: 32, offset: 544)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !10, line: 94, baseType: !347, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !349, file: !10, line: 95, baseType: !277, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !349, file: !10, line: 96, baseType: !287, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !343, file: !10, line: 102, baseType: !277, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !343, file: !10, line: 102, baseType: !277, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !343, file: !10, line: 103, baseType: !277, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !343, file: !10, line: 104, baseType: !208, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !343, file: !10, line: 105, baseType: !174, size: 32, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !343, file: !10, line: 105, baseType: !174, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !343, file: !10, line: 105, baseType: !174, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !343, file: !10, line: 106, baseType: !205, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !343, file: !10, line: 107, baseType: !379, size: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!382 = !{!383}
!383 = !DISubrange(count: 5)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !192, file: !191, line: 113, baseType: !385, size: 320, offset: 3648)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 320, elements: !382)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!184, !205, !287}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !192, file: !191, line: 114, baseType: !390, size: 320, offset: 3968)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 320, elements: !382)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !192, file: !191, line: 115, baseType: !174, size: 32, offset: 4288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !192, file: !191, line: 120, baseType: !379, size: 64, offset: 4352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !192, file: !191, line: 121, baseType: !174, size: 32, offset: 4416)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !187, file: !102, line: 76, baseType: !395, size: 896, offset: 4480)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 896, elements: !248)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !397)
!397 = !{!398, !402, !406, !410, !418, !419, !423, !424, !428, !432, !436, !437, !441, !442}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !396, file: !102, line: 19, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!184, !185, !168, !167}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !396, file: !102, line: 22, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!184, !185, !168, !168, !167}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !396, file: !102, line: 25, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!184, !185}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !396, file: !102, line: 26, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!184, !185, !414, !414}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !415, line: 16, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !415, line: 16, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !396, file: !102, line: 27, baseType: !407, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !396, file: !102, line: 28, baseType: !420, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!184, !341, !185}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !396, file: !102, line: 29, baseType: !407, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !396, file: !102, line: 30, baseType: !425, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!184, !185, !304, !304}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !396, file: !102, line: 31, baseType: !429, size: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!184, !185, !164, !304, !304, !296}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !396, file: !102, line: 32, baseType: !433, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!184, !185, !174, !174, !296, !167, !304, !304}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !396, file: !102, line: 33, baseType: !407, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !102, line: 34, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!184, !185, !216}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !396, file: !102, line: 35, baseType: !407, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !396, file: !102, line: 36, baseType: !438, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !187, file: !102, line: 77, baseType: !444, size: 64, offset: 5376)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !445, line: 14, baseType: !446)
!445 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !445, line: 14, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !187, file: !102, line: 78, baseType: !174, size: 32, offset: 5440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !187, file: !102, line: 79, baseType: !174, size: 32, offset: 5472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !187, file: !102, line: 81, baseType: !164, size: 32, offset: 5504)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !187, file: !102, line: 82, baseType: !452, size: 64, offset: 5568)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !455)
!455 = !{!456, !457, !477, !478, !479, !480}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !454, file: !102, line: 55, baseType: !190, size: 4480)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !454, file: !102, line: 55, baseType: !458, size: 448, offset: 4480)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 448, elements: !248)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !460)
!460 = !{!461, !465, !466, !470, !471, !472, !476}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !459, file: !102, line: 42, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!184, !452, !168, !168}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !459, file: !102, line: 43, baseType: !462, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !459, file: !102, line: 44, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!184, !452}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !459, file: !102, line: 45, baseType: !467, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !459, file: !102, line: 46, baseType: !467, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !459, file: !102, line: 47, baseType: !473, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!184, !452, !216}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !459, file: !102, line: 48, baseType: !467, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !454, file: !102, line: 56, baseType: !185, size: 64, offset: 4928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !454, file: !102, line: 57, baseType: !414, size: 64, offset: 4992)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !454, file: !102, line: 58, baseType: !289, size: 64, offset: 5056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !102, line: 59, baseType: !287, size: 64, offset: 5120)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !187, file: !102, line: 83, baseType: !174, size: 32, offset: 5632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !187, file: !102, line: 84, baseType: !174, size: 32, offset: 5664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !187, file: !102, line: 85, baseType: !174, size: 32, offset: 5696)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !187, file: !102, line: 86, baseType: !174, size: 32, offset: 5728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !187, file: !102, line: 87, baseType: !486, size: 32, offset: 5760)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !187, file: !102, line: 88, baseType: !488, size: 384, offset: 5792)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 384, elements: !489)
!489 = !{!490, !491}
!490 = !DISubrange(count: 4)
!491 = !DISubrange(count: 3)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !187, file: !102, line: 89, baseType: !177, size: 64, offset: 6208)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !187, file: !102, line: 90, baseType: !177, size: 64, offset: 6272)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !187, file: !102, line: 91, baseType: !177, size: 64, offset: 6336)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !187, file: !102, line: 92, baseType: !177, size: 64, offset: 6400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !187, file: !102, line: 93, baseType: !177, size: 64, offset: 6464)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !187, file: !102, line: 94, baseType: !177, size: 64, offset: 6528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !187, file: !102, line: 95, baseType: !499, size: 32, offset: 6592)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !187, file: !102, line: 96, baseType: !174, size: 32, offset: 6624)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !187, file: !102, line: 98, baseType: !168, size: 64, offset: 6656)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !187, file: !102, line: 98, baseType: !168, size: 64, offset: 6720)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !187, file: !102, line: 102, baseType: !304, size: 64, offset: 6784)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !187, file: !102, line: 103, baseType: !304, size: 64, offset: 6848)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !187, file: !102, line: 104, baseType: !164, size: 32, offset: 6912)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !187, file: !102, line: 105, baseType: !164, size: 32, offset: 6944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !187, file: !102, line: 106, baseType: !174, size: 32, offset: 6976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !187, file: !102, line: 107, baseType: !304, size: 64, offset: 7040)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !187, file: !102, line: 108, baseType: !304, size: 64, offset: 7104)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !187, file: !102, line: 109, baseType: !164, size: 32, offset: 7168)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !187, file: !102, line: 110, baseType: !164, size: 32, offset: 7200)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !187, file: !102, line: 111, baseType: !174, size: 32, offset: 7232)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !187, file: !102, line: 113, baseType: !164, size: 32, offset: 7264)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !187, file: !102, line: 114, baseType: !174, size: 32, offset: 7296)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !187, file: !102, line: 117, baseType: !164, size: 32, offset: 7328)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !187, file: !102, line: 120, baseType: !517, size: 320, offset: 7360)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 320, elements: !382)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!184, !185, !164, !177, !287}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !187, file: !102, line: 121, baseType: !522, size: 320, offset: 7680)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !382)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!184, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !187, file: !102, line: 122, baseType: !390, size: 320, offset: 8000)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !187, file: !102, line: 123, baseType: !164, size: 32, offset: 8320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !187, file: !102, line: 124, baseType: !174, size: 32, offset: 8352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !187, file: !102, line: 126, baseType: !531, size: 320, offset: 8384)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 320, elements: !382)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!184, !185, !287}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !187, file: !102, line: 127, baseType: !522, size: 320, offset: 8704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !187, file: !102, line: 128, baseType: !390, size: 320, offset: 9024)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !187, file: !102, line: 129, baseType: !164, size: 32, offset: 9344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !187, file: !102, line: 131, baseType: !181, size: 64, offset: 9408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !187, file: !102, line: 132, baseType: !332, size: 64, offset: 9472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !187, file: !102, line: 133, baseType: !287, size: 64, offset: 9536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !187, file: !102, line: 135, baseType: !287, size: 64, offset: 9600)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !187, file: !102, line: 137, baseType: !543, size: 64, offset: 9664)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !102, line: 139, baseType: !287, size: 64, offset: 9728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9792)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9824)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9856)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9888)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 9984)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10016)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10080)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10112)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10144)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10176)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !187, file: !102, line: 142, baseType: !174, size: 32, offset: 10208)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10240)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10304)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10368)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10432)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10496)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10560)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10624)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10688)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10752)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10816)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10880)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 10944)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 11008)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !187, file: !102, line: 143, baseType: !216, size: 64, offset: 11072)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11136)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11168)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11200)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11232)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11264)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11296)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11328)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11360)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11392)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11424)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11456)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11488)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11520)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !187, file: !102, line: 144, baseType: !576, size: 32, offset: 11552)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !187, file: !102, line: 147, baseType: !164, size: 32, offset: 11584)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !187, file: !102, line: 148, baseType: !167, size: 64, offset: 11648)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !187, file: !102, line: 150, baseType: !593, size: 32, offset: 11712)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !187, file: !102, line: 151, baseType: !174, size: 32, offset: 11744)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !187, file: !102, line: 153, baseType: !164, size: 32, offset: 11776)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !187, file: !102, line: 154, baseType: !164, size: 32, offset: 11808)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !187, file: !102, line: 156, baseType: !174, size: 32, offset: 11840)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !187, file: !102, line: 161, baseType: !599, size: 192, offset: 11904)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !102, line: 157, size: 192, elements: !600)
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !599, file: !102, line: 158, baseType: !414, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !599, file: !102, line: 158, baseType: !414, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !599, file: !102, line: 159, baseType: !174, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !599, file: !102, line: 160, baseType: !174, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !187, file: !102, line: 163, baseType: !606, size: 32, offset: 12096)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !187, file: !102, line: 165, baseType: !486, size: 32, offset: 12128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !187, file: !102, line: 166, baseType: !606, size: 32, offset: 12160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !187, file: !102, line: 171, baseType: !174, size: 32, offset: 12192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !187, file: !102, line: 172, baseType: !174, size: 32, offset: 12224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !187, file: !102, line: 173, baseType: !174, size: 32, offset: 12256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !187, file: !102, line: 174, baseType: !168, size: 64, offset: 12288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !187, file: !102, line: 175, baseType: !168, size: 64, offset: 12352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !187, file: !102, line: 177, baseType: !164, size: 32, offset: 12416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !187, file: !102, line: 178, baseType: !174, size: 32, offset: 12448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !187, file: !102, line: 180, baseType: !216, size: 64, offset: 12480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !187, file: !102, line: 182, baseType: !618, size: 64, offset: 12544)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!184, !185, !168, !168, !287}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !187, file: !102, line: 183, baseType: !618, size: 64, offset: 12608)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !187, file: !102, line: 184, baseType: !287, size: 64, offset: 12672)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !187, file: !102, line: 184, baseType: !287, size: 64, offset: 12736)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !161, file: !160, line: 21, baseType: !332, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !161, file: !160, line: 22, baseType: !287, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !209, line: 331, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !209, line: 331, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !209, line: 338, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !209, line: 338, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !148)
!634 = !{i32 7, !"Dwarf Version", i32 4}
!635 = !{i32 2, !"Debug Info Version", i32 3}
!636 = !{i32 1, !"wchar_size", i32 4}
!637 = !{i32 7, !"PIC Level", i32 2}
!638 = !{i32 7, !"uwtable", i32 1}
!639 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!640 = distinct !DISubprogram(name: "KSPDestroy_LSQR", scope: !160, file: !160, line: 244, type: !408, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !641)
!641 = !{!642, !643, !644, !645, !649, !653, !655, !657}
!642 = !DILocalVariable(name: "ksp", arg: 1, scope: !640, file: !160, line: 244, type: !185)
!643 = !DILocalVariable(name: "lsqr", scope: !640, file: !160, line: 246, type: !158)
!644 = !DILocalVariable(name: "ierr", scope: !640, file: !160, line: 247, type: !184)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !160, line: 252, type: !184)
!646 = distinct !DILexicalBlock(scope: !647, file: !160, line: 252, column: 57)
!647 = distinct !DILexicalBlock(scope: !648, file: !160, line: 251, column: 22)
!648 = distinct !DILexicalBlock(scope: !640, file: !160, line: 251, column: 7)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !160, line: 255, type: !184)
!650 = distinct !DILexicalBlock(scope: !651, file: !160, line: 255, column: 57)
!651 = distinct !DILexicalBlock(scope: !652, file: !160, line: 254, column: 22)
!652 = distinct !DILexicalBlock(scope: !640, file: !160, line: 254, column: 7)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !160, line: 257, type: !184)
!654 = distinct !DILexicalBlock(scope: !640, file: !160, line: 257, column: 32)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !160, line: 259, type: !184)
!656 = distinct !DILexicalBlock(scope: !640, file: !160, line: 259, column: 87)
!657 = !DILocalVariable(name: "ierr__", scope: !658, file: !160, line: 261, type: !184)
!658 = distinct !DILexicalBlock(scope: !640, file: !160, line: 261, column: 31)
!659 = !DILocation(line: 0, scope: !640)
!660 = !DILocation(line: 246, column: 42, scope: !640)
!661 = !{!662, !667, i64 1216}
!662 = !{!"_p_KSP", !663, i64 0, !665, i64 560, !667, i64 672, !665, i64 680, !665, i64 684, !664, i64 688, !667, i64 696, !665, i64 704, !665, i64 708, !665, i64 712, !665, i64 716, !665, i64 720, !665, i64 724, !668, i64 776, !668, i64 784, !668, i64 792, !668, i64 800, !668, i64 808, !668, i64 816, !665, i64 824, !665, i64 828, !667, i64 832, !667, i64 840, !667, i64 848, !667, i64 856, !664, i64 864, !664, i64 868, !665, i64 872, !667, i64 880, !667, i64 888, !664, i64 896, !664, i64 900, !665, i64 904, !664, i64 908, !665, i64 912, !664, i64 916, !665, i64 920, !665, i64 960, !665, i64 1000, !664, i64 1040, !665, i64 1044, !665, i64 1048, !665, i64 1088, !665, i64 1128, !664, i64 1168, !667, i64 1176, !667, i64 1184, !667, i64 1192, !667, i64 1200, !667, i64 1208, !667, i64 1216, !665, i64 1224, !665, i64 1228, !665, i64 1232, !665, i64 1236, !665, i64 1240, !665, i64 1244, !665, i64 1248, !665, i64 1252, !665, i64 1256, !665, i64 1260, !665, i64 1264, !665, i64 1268, !665, i64 1272, !665, i64 1276, !667, i64 1280, !667, i64 1288, !667, i64 1296, !667, i64 1304, !667, i64 1312, !667, i64 1320, !667, i64 1328, !667, i64 1336, !667, i64 1344, !667, i64 1352, !667, i64 1360, !667, i64 1368, !667, i64 1376, !667, i64 1384, !665, i64 1392, !665, i64 1396, !665, i64 1400, !665, i64 1404, !665, i64 1408, !665, i64 1412, !665, i64 1416, !665, i64 1420, !665, i64 1424, !665, i64 1428, !665, i64 1432, !665, i64 1436, !665, i64 1440, !665, i64 1444, !664, i64 1448, !667, i64 1456, !665, i64 1464, !665, i64 1468, !664, i64 1472, !664, i64 1476, !665, i64 1480, !670, i64 1488, !665, i64 1512, !665, i64 1516, !665, i64 1520, !665, i64 1524, !665, i64 1528, !665, i64 1532, !667, i64 1536, !667, i64 1544, !664, i64 1552, !665, i64 1556, !667, i64 1560, !667, i64 1568, !667, i64 1576, !667, i64 1584, !667, i64 1592}
!663 = !{!"_p_PetscObject", !664, i64 0, !665, i64 8, !667, i64 64, !664, i64 72, !668, i64 80, !668, i64 88, !668, i64 96, !668, i64 104, !669, i64 112, !664, i64 120, !664, i64 124, !667, i64 128, !667, i64 136, !667, i64 144, !667, i64 152, !667, i64 160, !667, i64 168, !667, i64 176, !669, i64 184, !667, i64 192, !667, i64 200, !664, i64 208, !667, i64 216, !669, i64 224, !664, i64 232, !664, i64 236, !667, i64 240, !667, i64 248, !667, i64 256, !667, i64 264, !664, i64 272, !664, i64 276, !667, i64 280, !667, i64 288, !667, i64 296, !667, i64 304, !664, i64 312, !664, i64 316, !667, i64 320, !667, i64 328, !667, i64 336, !667, i64 344, !667, i64 352, !664, i64 360, !665, i64 368, !665, i64 384, !667, i64 392, !667, i64 400, !664, i64 408, !665, i64 416, !665, i64 456, !665, i64 496, !665, i64 536, !667, i64 544, !665, i64 552}
!664 = !{!"int", !665, i64 0}
!665 = !{!"omnipotent char", !666, i64 0}
!666 = !{!"Simple C/C++ TBAA"}
!667 = !{!"any pointer", !665, i64 0}
!668 = !{!"double", !665, i64 0}
!669 = !{!"long", !665, i64 0}
!670 = !{!"", !667, i64 0, !667, i64 8, !665, i64 16, !665, i64 20}
!671 = !DILocation(line: 249, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !160, line: 249, column: 3)
!673 = distinct !DILexicalBlock(scope: !674, file: !160, line: 249, column: 3)
!674 = distinct !DILexicalBlock(scope: !640, file: !160, line: 249, column: 3)
!675 = !{!667, !667, i64 0}
!676 = !DILocation(line: 249, column: 3, scope: !673)
!677 = !DILocation(line: 249, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !160, line: 249, column: 3)
!679 = distinct !DILexicalBlock(scope: !672, file: !160, line: 249, column: 3)
!680 = !{!681, !664, i64 1536}
!681 = !{!"", !665, i64 0, !665, i64 512, !665, i64 1024, !665, i64 1280, !664, i64 1536, !664, i64 1540, !665, i64 1544}
!682 = !DILocation(line: 249, column: 3, scope: !679)
!683 = !DILocation(line: 249, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !678, file: !160, line: 249, column: 3)
!685 = !{!664, !664, i64 0}
!686 = !{!681, !664, i64 1540}
!687 = !DILocation(line: 251, column: 13, scope: !648)
!688 = !{!689, !667, i64 16}
!689 = !{!"", !664, i64 0, !664, i64 4, !667, i64 8, !667, i64 16, !667, i64 24, !665, i64 32, !665, i64 36, !668, i64 40, !668, i64 48, !667, i64 56, !667, i64 64, !667, i64 72}
!690 = !DILocation(line: 251, column: 7, scope: !648)
!691 = !DILocation(line: 251, column: 7, scope: !640)
!692 = !DILocation(line: 252, column: 33, scope: !647)
!693 = !{!689, !664, i64 0}
!694 = !DILocation(line: 252, column: 12, scope: !647)
!695 = !DILocation(line: 0, scope: !646)
!696 = !DILocation(line: 252, column: 57, scope: !697)
!697 = distinct !DILexicalBlock(scope: !646, file: !160, line: 252, column: 57)
!698 = !DILocation(line: 252, column: 57, scope: !646)
!699 = !{!"branch_weights", i32 2000, i32 1}
!700 = !DILocation(line: 254, column: 13, scope: !652)
!701 = !{!689, !667, i64 8}
!702 = !DILocation(line: 254, column: 7, scope: !652)
!703 = !DILocation(line: 254, column: 7, scope: !640)
!704 = !DILocation(line: 255, column: 33, scope: !651)
!705 = !{!689, !664, i64 4}
!706 = !DILocation(line: 255, column: 12, scope: !651)
!707 = !DILocation(line: 0, scope: !650)
!708 = !DILocation(line: 255, column: 57, scope: !709)
!709 = distinct !DILexicalBlock(scope: !650, file: !160, line: 255, column: 57)
!710 = !DILocation(line: 255, column: 57, scope: !650)
!711 = !DILocation(line: 257, column: 28, scope: !640)
!712 = !DILocation(line: 257, column: 10, scope: !640)
!713 = !DILocation(line: 0, scope: !654)
!714 = !DILocation(line: 257, column: 32, scope: !715)
!715 = distinct !DILexicalBlock(scope: !654, file: !160, line: 257, column: 32)
!716 = !DILocation(line: 257, column: 32, scope: !654)
!717 = !DILocation(line: 259, column: 42, scope: !640)
!718 = !{!689, !667, i64 56}
!719 = !DILocation(line: 259, column: 58, scope: !640)
!720 = !{!689, !667, i64 72}
!721 = !DILocation(line: 259, column: 69, scope: !640)
!722 = !{!689, !667, i64 64}
!723 = !DILocation(line: 259, column: 10, scope: !640)
!724 = !DILocation(line: 0, scope: !656)
!725 = !DILocation(line: 259, column: 87, scope: !726)
!726 = distinct !DILexicalBlock(scope: !656, file: !160, line: 259, column: 87)
!727 = !DILocation(line: 259, column: 87, scope: !656)
!728 = !DILocation(line: 261, column: 10, scope: !640)
!729 = !DILocation(line: 0, scope: !658)
!730 = !DILocation(line: 261, column: 31, scope: !731)
!731 = distinct !DILexicalBlock(scope: !658, file: !160, line: 261, column: 31)
!732 = !DILocation(line: 262, column: 3, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !160, line: 262, column: 3)
!734 = distinct !DILexicalBlock(scope: !735, file: !160, line: 262, column: 3)
!735 = distinct !DILexicalBlock(scope: !640, file: !160, line: 262, column: 3)
!736 = !DILocation(line: 262, column: 3, scope: !734)
!737 = !DILocation(line: 262, column: 3, scope: !738)
!738 = distinct !DILexicalBlock(scope: !739, file: !160, line: 262, column: 3)
!739 = distinct !DILexicalBlock(scope: !733, file: !160, line: 262, column: 3)
!740 = !DILocation(line: 262, column: 3, scope: !739)
!741 = !DILocation(line: 262, column: 3, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !160, line: 262, column: 3)
!743 = distinct !DILexicalBlock(scope: !738, file: !160, line: 262, column: 3)
!744 = !{!681, !665, i64 1544}
!745 = !DILocation(line: 262, column: 3, scope: !743)
!746 = !DILocation(line: 262, column: 3, scope: !747)
!747 = distinct !DILexicalBlock(scope: !742, file: !160, line: 262, column: 3)
!748 = !DILocation(line: 262, column: 3, scope: !749)
!749 = distinct !DILexicalBlock(scope: !738, file: !160, line: 262, column: 3)
!750 = !DILocation(line: 262, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !749, file: !160, line: 262, column: 3)
!752 = !DILocation(line: 262, column: 3, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !160, line: 262, column: 3)
!754 = distinct !DILexicalBlock(scope: !751, file: !160, line: 262, column: 3)
!755 = !DILocation(line: 262, column: 3, scope: !754)
!756 = !DILocation(line: 262, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !160, line: 262, column: 3)
!758 = !DILocation(line: 263, column: 1, scope: !640)
!759 = !DISubprogram(name: "VecDestroyVecs", scope: !141, file: !141, line: 249, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !764)
!760 = !DISubroutineType(types: !761)
!761 = !{!26, !26, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!764 = !{}
!765 = !DISubprogram(name: "PetscError", scope: !115, file: !115, line: 668, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !764)
!766 = !DISubroutineType(types: !767)
!767 = !{!184, !210, !26, !229, !229, !26, !114, !229, null}
!768 = !DISubprogram(name: "VecDestroy", scope: !141, file: !141, line: 130, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !764)
!769 = !DISubroutineType(types: !770)
!770 = !{!26, !763}
!771 = !DISubprogram(name: "KSPSetConvergenceTest", scope: !33, file: !33, line: 680, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !764)
!772 = !DISubroutineType(types: !773)
!773 = !{!26, !186, !774, !287, !778}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!26, !186, !26, !178, !777, !287}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!26, !287}
!781 = distinct !DISubprogram(name: "KSPLSQRSetComputeStandardErrorVec", scope: !160, file: !160, line: 281, type: !782, scopeLine: 282, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!184, !185, !174}
!784 = !{!785, !786, !787}
!785 = !DILocalVariable(name: "ksp", arg: 1, scope: !781, file: !160, line: 281, type: !185)
!786 = !DILocalVariable(name: "flg", arg: 2, scope: !781, file: !160, line: 281, type: !174)
!787 = !DILocalVariable(name: "lsqr", scope: !781, file: !160, line: 283, type: !158)
!788 = !DILocation(line: 0, scope: !781)
!789 = !DILocation(line: 283, column: 42, scope: !781)
!790 = !DILocation(line: 285, column: 3, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !160, line: 285, column: 3)
!792 = distinct !DILexicalBlock(scope: !793, file: !160, line: 285, column: 3)
!793 = distinct !DILexicalBlock(scope: !781, file: !160, line: 285, column: 3)
!794 = !DILocation(line: 285, column: 3, scope: !792)
!795 = !DILocation(line: 286, column: 9, scope: !781)
!796 = !DILocation(line: 286, column: 16, scope: !781)
!797 = !{!689, !665, i64 32}
!798 = !DILocation(line: 287, column: 3, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !160, line: 287, column: 3)
!800 = distinct !DILexicalBlock(scope: !781, file: !160, line: 287, column: 3)
!801 = !DILocation(line: 285, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !160, line: 285, column: 3)
!803 = distinct !DILexicalBlock(scope: !791, file: !160, line: 285, column: 3)
!804 = !DILocation(line: 285, column: 3, scope: !803)
!805 = !DILocation(line: 285, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !160, line: 285, column: 3)
!807 = !DILocation(line: 287, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !799, file: !160, line: 287, column: 3)
!809 = !DILocation(line: 287, column: 3, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !160, line: 287, column: 3)
!811 = distinct !DILexicalBlock(scope: !808, file: !160, line: 287, column: 3)
!812 = !DILocation(line: 287, column: 3, scope: !811)
!813 = !DILocation(line: 287, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !160, line: 287, column: 3)
!815 = distinct !DILexicalBlock(scope: !810, file: !160, line: 287, column: 3)
!816 = !DILocation(line: 287, column: 3, scope: !815)
!817 = !DILocation(line: 287, column: 3, scope: !818)
!818 = distinct !DILexicalBlock(scope: !814, file: !160, line: 287, column: 3)
!819 = !DILocation(line: 287, column: 3, scope: !820)
!820 = distinct !DILexicalBlock(scope: !810, file: !160, line: 287, column: 3)
!821 = !DILocation(line: 287, column: 3, scope: !822)
!822 = distinct !DILexicalBlock(scope: !820, file: !160, line: 287, column: 3)
!823 = !DILocation(line: 287, column: 3, scope: !824)
!824 = distinct !DILexicalBlock(scope: !825, file: !160, line: 287, column: 3)
!825 = distinct !DILexicalBlock(scope: !822, file: !160, line: 287, column: 3)
!826 = !DILocation(line: 287, column: 3, scope: !825)
!827 = !DILocation(line: 287, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !824, file: !160, line: 287, column: 3)
!829 = !DILocation(line: 288, column: 1, scope: !781)
!830 = distinct !DISubprogram(name: "KSPLSQRSetExactMatNorm", scope: !160, file: !160, line: 308, type: !782, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !831)
!831 = !{!832, !833, !834}
!832 = !DILocalVariable(name: "ksp", arg: 1, scope: !830, file: !160, line: 308, type: !185)
!833 = !DILocalVariable(name: "flg", arg: 2, scope: !830, file: !160, line: 308, type: !174)
!834 = !DILocalVariable(name: "lsqr", scope: !830, file: !160, line: 310, type: !158)
!835 = !DILocation(line: 0, scope: !830)
!836 = !DILocation(line: 310, column: 42, scope: !830)
!837 = !DILocation(line: 312, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !160, line: 312, column: 3)
!839 = distinct !DILexicalBlock(scope: !840, file: !160, line: 312, column: 3)
!840 = distinct !DILexicalBlock(scope: !830, file: !160, line: 312, column: 3)
!841 = !DILocation(line: 312, column: 3, scope: !839)
!842 = !DILocation(line: 313, column: 9, scope: !830)
!843 = !DILocation(line: 313, column: 20, scope: !830)
!844 = !{!689, !665, i64 36}
!845 = !DILocation(line: 314, column: 3, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !160, line: 314, column: 3)
!847 = distinct !DILexicalBlock(scope: !830, file: !160, line: 314, column: 3)
!848 = !DILocation(line: 312, column: 3, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !160, line: 312, column: 3)
!850 = distinct !DILexicalBlock(scope: !838, file: !160, line: 312, column: 3)
!851 = !DILocation(line: 312, column: 3, scope: !850)
!852 = !DILocation(line: 312, column: 3, scope: !853)
!853 = distinct !DILexicalBlock(scope: !849, file: !160, line: 312, column: 3)
!854 = !DILocation(line: 314, column: 3, scope: !855)
!855 = distinct !DILexicalBlock(scope: !846, file: !160, line: 314, column: 3)
!856 = !DILocation(line: 314, column: 3, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !160, line: 314, column: 3)
!858 = distinct !DILexicalBlock(scope: !855, file: !160, line: 314, column: 3)
!859 = !DILocation(line: 314, column: 3, scope: !858)
!860 = !DILocation(line: 314, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !160, line: 314, column: 3)
!862 = distinct !DILexicalBlock(scope: !857, file: !160, line: 314, column: 3)
!863 = !DILocation(line: 314, column: 3, scope: !862)
!864 = !DILocation(line: 314, column: 3, scope: !865)
!865 = distinct !DILexicalBlock(scope: !861, file: !160, line: 314, column: 3)
!866 = !DILocation(line: 314, column: 3, scope: !867)
!867 = distinct !DILexicalBlock(scope: !857, file: !160, line: 314, column: 3)
!868 = !DILocation(line: 314, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !867, file: !160, line: 314, column: 3)
!870 = !DILocation(line: 314, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !160, line: 314, column: 3)
!872 = distinct !DILexicalBlock(scope: !869, file: !160, line: 314, column: 3)
!873 = !DILocation(line: 314, column: 3, scope: !872)
!874 = !DILocation(line: 314, column: 3, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !160, line: 314, column: 3)
!876 = !DILocation(line: 315, column: 1, scope: !830)
!877 = distinct !DISubprogram(name: "KSPLSQRGetStandardErrorVec", scope: !160, file: !160, line: 341, type: !878, scopeLine: 342, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!184, !185, !167}
!880 = !{!881, !882, !883}
!881 = !DILocalVariable(name: "ksp", arg: 1, scope: !877, file: !160, line: 341, type: !185)
!882 = !DILocalVariable(name: "se", arg: 2, scope: !877, file: !160, line: 341, type: !167)
!883 = !DILocalVariable(name: "lsqr", scope: !877, file: !160, line: 343, type: !158)
!884 = !DILocation(line: 0, scope: !877)
!885 = !DILocation(line: 343, column: 36, scope: !877)
!886 = !DILocation(line: 345, column: 3, scope: !887)
!887 = distinct !DILexicalBlock(scope: !888, file: !160, line: 345, column: 3)
!888 = distinct !DILexicalBlock(scope: !889, file: !160, line: 345, column: 3)
!889 = distinct !DILexicalBlock(scope: !877, file: !160, line: 345, column: 3)
!890 = !DILocation(line: 345, column: 3, scope: !888)
!891 = !DILocation(line: 345, column: 3, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !160, line: 345, column: 3)
!893 = distinct !DILexicalBlock(scope: !887, file: !160, line: 345, column: 3)
!894 = !DILocation(line: 345, column: 3, scope: !893)
!895 = !DILocation(line: 345, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !892, file: !160, line: 345, column: 3)
!897 = !DILocation(line: 346, column: 15, scope: !877)
!898 = !{!689, !667, i64 24}
!899 = !DILocation(line: 346, column: 7, scope: !877)
!900 = !DILocation(line: 347, column: 3, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !160, line: 347, column: 3)
!902 = distinct !DILexicalBlock(scope: !903, file: !160, line: 347, column: 3)
!903 = distinct !DILexicalBlock(scope: !877, file: !160, line: 347, column: 3)
!904 = !DILocation(line: 347, column: 3, scope: !902)
!905 = !DILocation(line: 347, column: 3, scope: !906)
!906 = distinct !DILexicalBlock(scope: !907, file: !160, line: 347, column: 3)
!907 = distinct !DILexicalBlock(scope: !901, file: !160, line: 347, column: 3)
!908 = !DILocation(line: 347, column: 3, scope: !907)
!909 = !DILocation(line: 347, column: 3, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !160, line: 347, column: 3)
!911 = distinct !DILexicalBlock(scope: !906, file: !160, line: 347, column: 3)
!912 = !DILocation(line: 347, column: 3, scope: !911)
!913 = !DILocation(line: 347, column: 3, scope: !914)
!914 = distinct !DILexicalBlock(scope: !910, file: !160, line: 347, column: 3)
!915 = !DILocation(line: 347, column: 3, scope: !916)
!916 = distinct !DILexicalBlock(scope: !906, file: !160, line: 347, column: 3)
!917 = !DILocation(line: 347, column: 3, scope: !918)
!918 = distinct !DILexicalBlock(scope: !916, file: !160, line: 347, column: 3)
!919 = !DILocation(line: 347, column: 3, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !160, line: 347, column: 3)
!921 = distinct !DILexicalBlock(scope: !918, file: !160, line: 347, column: 3)
!922 = !DILocation(line: 347, column: 3, scope: !921)
!923 = !DILocation(line: 347, column: 3, scope: !924)
!924 = distinct !DILexicalBlock(scope: !920, file: !160, line: 347, column: 3)
!925 = !DILocation(line: 348, column: 1, scope: !877)
!926 = distinct !DISubprogram(name: "KSPLSQRGetNorms", scope: !160, file: !160, line: 371, type: !426, scopeLine: 372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !927)
!927 = !{!928, !929, !930, !931}
!928 = !DILocalVariable(name: "ksp", arg: 1, scope: !926, file: !160, line: 371, type: !185)
!929 = !DILocalVariable(name: "arnorm", arg: 2, scope: !926, file: !160, line: 371, type: !304)
!930 = !DILocalVariable(name: "anorm", arg: 3, scope: !926, file: !160, line: 371, type: !304)
!931 = !DILocalVariable(name: "lsqr", scope: !926, file: !160, line: 373, type: !158)
!932 = !DILocation(line: 0, scope: !926)
!933 = !DILocation(line: 373, column: 42, scope: !926)
!934 = !DILocation(line: 375, column: 3, scope: !935)
!935 = distinct !DILexicalBlock(scope: !936, file: !160, line: 375, column: 3)
!936 = distinct !DILexicalBlock(scope: !937, file: !160, line: 375, column: 3)
!937 = distinct !DILexicalBlock(scope: !926, file: !160, line: 375, column: 3)
!938 = !DILocation(line: 375, column: 3, scope: !936)
!939 = !DILocation(line: 375, column: 3, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !160, line: 375, column: 3)
!941 = distinct !DILexicalBlock(scope: !935, file: !160, line: 375, column: 3)
!942 = !DILocation(line: 375, column: 3, scope: !941)
!943 = !DILocation(line: 375, column: 3, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !160, line: 375, column: 3)
!945 = !DILocation(line: 376, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !926, file: !160, line: 376, column: 7)
!947 = !DILocation(line: 376, column: 7, scope: !926)
!948 = !DILocation(line: 376, column: 33, scope: !946)
!949 = !{!689, !668, i64 40}
!950 = !DILocation(line: 376, column: 25, scope: !946)
!951 = !{!668, !668, i64 0}
!952 = !DILocation(line: 376, column: 17, scope: !946)
!953 = !DILocation(line: 377, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !926, file: !160, line: 377, column: 7)
!955 = !DILocation(line: 377, column: 7, scope: !926)
!956 = !DILocation(line: 377, column: 32, scope: !954)
!957 = !{!689, !668, i64 48}
!958 = !DILocation(line: 377, column: 24, scope: !954)
!959 = !DILocation(line: 377, column: 17, scope: !954)
!960 = !DILocation(line: 378, column: 3, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !160, line: 378, column: 3)
!962 = distinct !DILexicalBlock(scope: !963, file: !160, line: 378, column: 3)
!963 = distinct !DILexicalBlock(scope: !926, file: !160, line: 378, column: 3)
!964 = !DILocation(line: 378, column: 3, scope: !962)
!965 = !DILocation(line: 378, column: 3, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !160, line: 378, column: 3)
!967 = distinct !DILexicalBlock(scope: !961, file: !160, line: 378, column: 3)
!968 = !DILocation(line: 378, column: 3, scope: !967)
!969 = !DILocation(line: 378, column: 3, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !160, line: 378, column: 3)
!971 = distinct !DILexicalBlock(scope: !966, file: !160, line: 378, column: 3)
!972 = !DILocation(line: 378, column: 3, scope: !971)
!973 = !DILocation(line: 378, column: 3, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !160, line: 378, column: 3)
!975 = !DILocation(line: 378, column: 3, scope: !976)
!976 = distinct !DILexicalBlock(scope: !966, file: !160, line: 378, column: 3)
!977 = !DILocation(line: 378, column: 3, scope: !978)
!978 = distinct !DILexicalBlock(scope: !976, file: !160, line: 378, column: 3)
!979 = !DILocation(line: 378, column: 3, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !160, line: 378, column: 3)
!981 = distinct !DILexicalBlock(scope: !978, file: !160, line: 378, column: 3)
!982 = !DILocation(line: 378, column: 3, scope: !981)
!983 = !DILocation(line: 378, column: 3, scope: !984)
!984 = distinct !DILexicalBlock(scope: !980, file: !160, line: 378, column: 3)
!985 = !DILocation(line: 379, column: 1, scope: !926)
!986 = distinct !DISubprogram(name: "KSPLSQRMonitorResidual", scope: !160, file: !160, line: 399, type: !987, scopeLine: 400, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1001)
!987 = !DISubroutineType(types: !988)
!988 = !{!184, !185, !164, !177, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !57, line: 178, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 178, size: 256, elements: !992)
!992 = !{!993, !994, !995, !1000}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !991, file: !57, line: 178, baseType: !216, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !991, file: !57, line: 178, baseType: !576, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !991, file: !57, line: 178, baseType: !996, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !997, line: 43, baseType: !998)
!997 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !997, line: 43, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !991, file: !57, line: 178, baseType: !287, size: 64, offset: 192)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1014, !1015, !1016, !1018, !1020, !1022, !1024, !1026, !1028, !1032, !1036, !1039, !1041}
!1002 = !DILocalVariable(name: "ksp", arg: 1, scope: !986, file: !160, line: 399, type: !185)
!1003 = !DILocalVariable(name: "n", arg: 2, scope: !986, file: !160, line: 399, type: !164)
!1004 = !DILocalVariable(name: "rnorm", arg: 3, scope: !986, file: !160, line: 399, type: !177)
!1005 = !DILocalVariable(name: "vf", arg: 4, scope: !986, file: !160, line: 399, type: !989)
!1006 = !DILocalVariable(name: "lsqr", scope: !986, file: !160, line: 401, type: !158)
!1007 = !DILocalVariable(name: "viewer", scope: !986, file: !160, line: 402, type: !216)
!1008 = !DILocalVariable(name: "format", scope: !986, file: !160, line: 403, type: !576)
!1009 = !DILocalVariable(name: "normtype", scope: !986, file: !160, line: 404, type: !1010)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 2048, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 256)
!1013 = !DILocalVariable(name: "tablevel", scope: !986, file: !160, line: 405, type: !164)
!1014 = !DILocalVariable(name: "prefix", scope: !986, file: !160, line: 406, type: !229)
!1015 = !DILocalVariable(name: "ierr", scope: !986, file: !160, line: 407, type: !184)
!1016 = !DILocalVariable(name: "ierr__", scope: !1017, file: !160, line: 411, type: !184)
!1017 = distinct !DILexicalBlock(scope: !986, file: !160, line: 411, column: 63)
!1018 = !DILocalVariable(name: "ierr__", scope: !1019, file: !160, line: 412, type: !184)
!1019 = distinct !DILexicalBlock(scope: !986, file: !160, line: 412, column: 66)
!1020 = !DILocalVariable(name: "ierr__", scope: !1021, file: !160, line: 413, type: !184)
!1021 = distinct !DILexicalBlock(scope: !986, file: !160, line: 413, column: 80)
!1022 = !DILocalVariable(name: "ierr__", scope: !1023, file: !160, line: 414, type: !184)
!1023 = distinct !DILexicalBlock(scope: !986, file: !160, line: 414, column: 36)
!1024 = !DILocalVariable(name: "ierr__", scope: !1025, file: !160, line: 415, type: !184)
!1025 = distinct !DILexicalBlock(scope: !986, file: !160, line: 415, column: 48)
!1026 = !DILocalVariable(name: "ierr__", scope: !1027, file: !160, line: 416, type: !184)
!1027 = distinct !DILexicalBlock(scope: !986, file: !160, line: 416, column: 51)
!1028 = !DILocalVariable(name: "ierr__", scope: !1029, file: !160, line: 417, type: !184)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !160, line: 417, column: 150)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !160, line: 417, column: 25)
!1031 = distinct !DILexicalBlock(scope: !986, file: !160, line: 417, column: 7)
!1032 = !DILocalVariable(name: "ierr__", scope: !1033, file: !160, line: 419, type: !184)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !160, line: 419, column: 90)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !160, line: 418, column: 11)
!1035 = distinct !DILexicalBlock(scope: !986, file: !160, line: 418, column: 7)
!1036 = !DILocalVariable(name: "ierr__", scope: !1037, file: !160, line: 421, type: !184)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !160, line: 421, column: 180)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !160, line: 420, column: 10)
!1039 = !DILocalVariable(name: "ierr__", scope: !1040, file: !160, line: 423, type: !184)
!1040 = distinct !DILexicalBlock(scope: !986, file: !160, line: 423, column: 56)
!1041 = !DILocalVariable(name: "ierr__", scope: !1042, file: !160, line: 424, type: !184)
!1042 = distinct !DILexicalBlock(scope: !986, file: !160, line: 424, column: 39)
!1043 = !DILocation(line: 0, scope: !986)
!1044 = !DILocation(line: 401, column: 46, scope: !986)
!1045 = !DILocation(line: 402, column: 34, scope: !986)
!1046 = !{!1047, !667, i64 0}
!1047 = !{!"", !667, i64 0, !665, i64 8, !667, i64 16, !667, i64 24}
