; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/patch/snespatch.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/patch/snespatch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!148 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!162 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!163 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!164 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!165 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!166 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!167 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!168 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!169 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!170 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!171 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!172 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!173 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!174 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!175 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!176 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!177 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!178 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!179 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!180 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!181 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!182 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!183 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!184 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !186, line: 663, baseType: !5, size: 32, elements: !187)
!186 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!187 = !{!188, !189, !190}
!188 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!189 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!190 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 30, baseType: !5, size: 32, elements: !192)
!192 = !{!193, !194, !195, !196, !197}
!193 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!194 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!195 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!196 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!197 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !199, line: 145, baseType: !5, size: 32, elements: !200)
!199 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcpatchimpl.h", directory: "/home/users/ndemeye/xSDK")
!200 = !{!201, !202, !203}
!201 = !DIEnumerator(name: "SCATTER_INTERIOR", value: 0, isUnsigned: true)
!202 = !DIEnumerator(name: "SCATTER_WITHARTIFICIAL", value: 1, isUnsigned: true)
!203 = !DIEnumerator(name: "SCATTER_WITHALL", value: 2, isUnsigned: true)
!204 = !{!205, !208, !226, !307, !413, !247, !987, !993, !996, !999, !448, !1170}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !206, line: 46, baseType: !207)
!206 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!207 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !211, line: 73, size: 4480, elements: !212)
!211 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!212 = !{!213, !215, !268, !269, !271, !274, !275, !276, !277, !285, !286, !288, !292, !296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !308, !310, !311, !312, !314, !315, !317, !319, !320, !321, !322, !323, !326, !328, !329, !330, !331, !332, !335, !337, !338, !339, !349, !351, !352, !356, !357, !403, !408, !410, !411, !412}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !210, file: !211, line: 74, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !210, file: !211, line: 75, baseType: !216, size: 448, offset: 64)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 448, elements: !266)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !211, line: 53, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 45, size: 448, elements: !219)
!219 = !{!220, !230, !238, !243, !250, !254, !261}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !218, file: !211, line: 46, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !208, !225}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !227, line: 330, baseType: !228)
!227 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !227, line: 330, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !218, file: !211, line: 47, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!224, !208, !234}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !235, line: 16, baseType: !236)
!235 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !235, line: 16, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !218, file: !211, line: 48, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!224, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !218, file: !211, line: 49, baseType: !244, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!224, !208, !247, !208}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !218, file: !211, line: 50, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!224, !208, !247, !242}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !218, file: !211, line: 51, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!224, !208, !247, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !218, file: !211, line: 52, baseType: !262, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!224, !208, !247, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!266 = !{!267}
!267 = !DISubrange(count: 1)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !210, file: !211, line: 76, baseType: !226, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !211, line: 77, baseType: !270, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !210, file: !211, line: 78, baseType: !272, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !273)
!273 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !210, file: !211, line: 78, baseType: !272, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !210, file: !211, line: 78, baseType: !272, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !210, file: !211, line: 78, baseType: !272, size: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !211, line: 79, baseType: !278, size: 64, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !281, line: 27, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !283, line: 43, baseType: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!284 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !210, file: !211, line: 80, baseType: !270, size: 32, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !210, file: !211, line: 81, baseType: !287, size: 32, offset: 992)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !210, file: !211, line: 82, baseType: !289, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !210, file: !211, line: 83, baseType: !293, size: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !210, file: !211, line: 84, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !210, file: !211, line: 85, baseType: !297, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !210, file: !211, line: 86, baseType: !297, size: 64, offset: 1280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !210, file: !211, line: 87, baseType: !297, size: 64, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !210, file: !211, line: 88, baseType: !208, size: 64, offset: 1408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !210, file: !211, line: 89, baseType: !278, size: 64, offset: 1472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !211, line: 90, baseType: !297, size: 64, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !210, file: !211, line: 91, baseType: !297, size: 64, offset: 1600)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !210, file: !211, line: 92, baseType: !270, size: 32, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !210, file: !211, line: 93, baseType: !307, size: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !210, file: !211, line: 94, baseType: !309, size: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !279)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !210, file: !211, line: 95, baseType: !270, size: 32, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !210, file: !211, line: 95, baseType: !270, size: 32, offset: 1888)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !210, file: !211, line: 96, baseType: !313, size: 64, offset: 1920)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !210, file: !211, line: 96, baseType: !313, size: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !210, file: !211, line: 97, baseType: !316, size: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !210, file: !211, line: 97, baseType: !318, size: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !210, file: !211, line: 98, baseType: !270, size: 32, offset: 2176)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !210, file: !211, line: 98, baseType: !270, size: 32, offset: 2208)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !210, file: !211, line: 99, baseType: !313, size: 64, offset: 2240)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !210, file: !211, line: 99, baseType: !313, size: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !210, file: !211, line: 100, baseType: !324, size: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !273)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !210, file: !211, line: 100, baseType: !327, size: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !210, file: !211, line: 101, baseType: !270, size: 32, offset: 2496)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !210, file: !211, line: 101, baseType: !270, size: 32, offset: 2528)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !210, file: !211, line: 102, baseType: !313, size: 64, offset: 2560)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !210, file: !211, line: 102, baseType: !313, size: 64, offset: 2624)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !210, file: !211, line: 103, baseType: !333, size: 64, offset: 2688)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !325)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !210, file: !211, line: 103, baseType: !336, size: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !210, file: !211, line: 104, baseType: !265, size: 64, offset: 2816)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !210, file: !211, line: 105, baseType: !270, size: 32, offset: 2880)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !210, file: !211, line: 106, baseType: !340, size: 128, offset: 2944)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 128, elements: !347)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !211, line: 64, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 61, size: 128, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !343, file: !211, line: 62, baseType: !258, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !343, file: !211, line: 63, baseType: !307, size: 64, offset: 64)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !210, file: !211, line: 107, baseType: !350, size: 64, offset: 3072)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 64, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !210, file: !211, line: 108, baseType: !307, size: 64, offset: 3136)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !210, file: !211, line: 109, baseType: !353, size: 64, offset: 3200)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!224, !307}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !210, file: !211, line: 111, baseType: !270, size: 32, offset: 3264)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !210, file: !211, line: 112, baseType: !358, size: 320, offset: 3328)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 320, elements: !401)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!224, !362, !208, !307}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !365)
!365 = !{!366, !367, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !364, file: !10, line: 100, baseType: !270, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !10, line: 101, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !379, !380, !381, !382, !384, !386, !387, !388}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !370, file: !10, line: 84, baseType: !297, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !370, file: !10, line: 85, baseType: !297, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !10, line: 86, baseType: !307, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !370, file: !10, line: 87, baseType: !289, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !370, file: !10, line: 88, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !370, file: !10, line: 89, baseType: !249, size: 8, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !370, file: !10, line: 90, baseType: !297, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !370, file: !10, line: 91, baseType: !205, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !370, file: !10, line: 92, baseType: !383, size: 32, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !10, line: 93, baseType: !385, size: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !10, line: 94, baseType: !368, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !370, file: !10, line: 95, baseType: !297, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !370, file: !10, line: 96, baseType: !307, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !364, file: !10, line: 102, baseType: !297, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !364, file: !10, line: 102, baseType: !297, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !364, file: !10, line: 103, baseType: !297, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !364, file: !10, line: 104, baseType: !226, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !364, file: !10, line: 105, baseType: !383, size: 32, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !364, file: !10, line: 105, baseType: !383, size: 32, offset: 416)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !364, file: !10, line: 105, baseType: !383, size: 32, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !364, file: !10, line: 106, baseType: !208, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !364, file: !10, line: 107, baseType: !398, size: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !210, file: !211, line: 113, baseType: !404, size: 320, offset: 3648)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!224, !208, !307}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !210, file: !211, line: 114, baseType: !409, size: 320, offset: 3968)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 320, elements: !401)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !210, file: !211, line: 115, baseType: !383, size: 32, offset: 4288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !210, file: !211, line: 120, baseType: !398, size: 64, offset: 4352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !210, file: !211, line: 121, baseType: !383, size: 32, offset: 4416)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_PATCH", file: !199, line: 135, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 11, size: 6592, elements: !416)
!416 = !{!417, !419, !444, !847, !848, !849, !850, !851, !852, !853, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !874, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !904, !905, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !923, !924, !925, !926, !927, !928, !929, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !950, !951, !955, !956, !957, !961, !962, !963, !964, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !415, file: !199, line: 13, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCPatchConstructType", file: !84, line: 339, baseType: !125)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "patchconstructop", scope: !415, file: !199, line: 14, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!224, !307, !423, !270, !427}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !424, line: 14, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !424, line: 14, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHSetI", file: !428, line: 6, baseType: !429)
!428 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashseti.h", directory: "/home/users/ndemeye/xSDK")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HSetI_t", file: !428, line: 6, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HSetI_s", file: !428, line: 6, size: 320, elements: !432)
!432 = !{!433, !437, !438, !439, !440, !442, !443}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !431, file: !428, line: 6, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !435, line: 166, baseType: !436)
!435 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !435, line: 139, baseType: !5)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !428, line: 6, baseType: !434, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !431, file: !428, line: 6, baseType: !434, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !431, file: !428, line: 6, baseType: !434, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !428, line: 6, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !431, file: !428, line: 6, baseType: !316, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !431, file: !428, line: 6, baseType: !297, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "userpatchconstructionop", scope: !415, file: !199, line: 15, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!224, !448, !316, !691, !692, !307}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !84, line: 11, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !451, line: 37, size: 6720, elements: !452)
!451 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!452 = !{!453, !455, !819, !820, !821, !822, !823, !824, !826, !827, !828, !829, !830, !831, !832, !833, !834, !840, !841, !842, !843, !844, !846}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !450, file: !451, line: 38, baseType: !454, size: 4480)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !211, line: 122, baseType: !210)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !450, file: !451, line: 38, baseType: !456, size: 1152, offset: 4480)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 1152, elements: !266)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !451, line: 13, size: 1152, elements: !458)
!458 = !{!459, !463, !768, !775, !781, !786, !787, !791, !795, !803, !804, !809, !810, !811, !812, !813, !817, !818}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !457, file: !451, line: 14, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!224, !448}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !457, file: !451, line: 15, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!224, !448, !467, !467}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !470, line: 142, size: 12800, elements: !471)
!470 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!471 = !{!472, !473, !693, !714, !715, !716, !762, !763, !764, !765, !767}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !469, file: !470, line: 143, baseType: !454, size: 4480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !469, file: !470, line: 143, baseType: !474, size: 5248, offset: 4480)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 5248, elements: !266)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !470, line: 23, size: 5248, elements: !476)
!476 = !{!477, !482, !487, !491, !495, !501, !506, !507, !508, !512, !516, !517, !518, !522, !526, !532, !533, !537, !541, !545, !546, !553, !557, !558, !562, !566, !567, !568, !572, !573, !580, !585, !586, !587, !591, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !612, !613, !614, !618, !622, !623, !624, !625, !629, !630, !631, !632, !633, !634, !635, !639, !640, !644, !651, !652, !657, !658, !662, !663, !664, !665, !666, !667, !668, !669, !673, !674, !675, !681, !685, !686, !687}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !475, file: !470, line: 24, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!224, !467, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !475, file: !470, line: 25, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!224, !467, !270, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !475, file: !470, line: 26, baseType: !488, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!224, !270, !481}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !475, file: !470, line: 27, baseType: !492, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!224, !467, !467, !333}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !475, file: !470, line: 28, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!224, !467, !270, !499, !333}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !475, file: !470, line: 29, baseType: !502, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!224, !467, !505, !324}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !475, file: !470, line: 30, baseType: !492, size: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !475, file: !470, line: 31, baseType: !496, size: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !475, file: !470, line: 32, baseType: !509, size: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!224, !467, !334}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !475, file: !470, line: 33, baseType: !513, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!224, !467, !467}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !475, file: !470, line: 34, baseType: !509, size: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !475, file: !470, line: 35, baseType: !513, size: 64, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !475, file: !470, line: 36, baseType: !519, size: 64, offset: 768)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!224, !467, !334, !467}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !475, file: !470, line: 37, baseType: !523, size: 64, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!224, !467, !334, !334, !467}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !475, file: !470, line: 38, baseType: !527, size: 64, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!224, !467, !270, !530, !481}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !475, file: !470, line: 39, baseType: !519, size: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !475, file: !470, line: 40, baseType: !534, size: 64, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!224, !467, !334, !467, !467}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !475, file: !470, line: 41, baseType: !538, size: 64, offset: 1088)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!224, !467, !334, !334, !334, !467, !467}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !475, file: !470, line: 42, baseType: !542, size: 64, offset: 1152)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!224, !467, !467, !467}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !475, file: !470, line: 43, baseType: !542, size: 64, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !475, file: !470, line: 44, baseType: !547, size: 64, offset: 1280)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!224, !467, !270, !550, !530, !552}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !475, file: !470, line: 45, baseType: !554, size: 64, offset: 1344)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!224, !467}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !475, file: !470, line: 46, baseType: !554, size: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !475, file: !470, line: 47, baseType: !559, size: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!224, !467, !336}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !475, file: !470, line: 48, baseType: !563, size: 64, offset: 1536)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!224, !467, !316}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !475, file: !470, line: 49, baseType: !563, size: 64, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !475, file: !470, line: 50, baseType: !559, size: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !475, file: !470, line: 51, baseType: !569, size: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!224, !467, !316, !324}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !475, file: !470, line: 52, baseType: !569, size: 64, offset: 1792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !475, file: !470, line: 53, baseType: !574, size: 64, offset: 1856)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!224, !467, !577}
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !475, file: !470, line: 54, baseType: !581, size: 64, offset: 1920)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!224, !467, !584, !383}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !475, file: !470, line: 55, baseType: !547, size: 64, offset: 1984)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !475, file: !470, line: 56, baseType: !554, size: 64, offset: 2048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !475, file: !470, line: 57, baseType: !588, size: 64, offset: 2112)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!224, !467, !234}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !475, file: !470, line: 58, baseType: !592, size: 64, offset: 2176)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!224, !467, !530}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !475, file: !470, line: 59, baseType: !592, size: 64, offset: 2240)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !475, file: !470, line: 60, baseType: !492, size: 64, offset: 2304)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !475, file: !470, line: 61, baseType: !492, size: 64, offset: 2368)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !475, file: !470, line: 62, baseType: !502, size: 64, offset: 2432)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !475, file: !470, line: 63, baseType: !496, size: 64, offset: 2496)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !475, file: !470, line: 64, baseType: !496, size: 64, offset: 2560)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !475, file: !470, line: 65, baseType: !588, size: 64, offset: 2624)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !475, file: !470, line: 66, baseType: !554, size: 64, offset: 2688)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !475, file: !470, line: 67, baseType: !554, size: 64, offset: 2752)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !475, file: !470, line: 68, baseType: !605, size: 64, offset: 2816)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!224, !467, !608}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !609, line: 30, baseType: !610)
!609 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !609, line: 30, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !475, file: !470, line: 69, baseType: !547, size: 64, offset: 2880)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !475, file: !470, line: 70, baseType: !554, size: 64, offset: 2944)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !475, file: !470, line: 71, baseType: !615, size: 64, offset: 3008)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!224, !362, !467}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !475, file: !470, line: 72, baseType: !619, size: 64, offset: 3072)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!224, !467, !467, !324}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !475, file: !470, line: 73, baseType: !542, size: 64, offset: 3136)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !475, file: !470, line: 74, baseType: !542, size: 64, offset: 3200)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !475, file: !470, line: 75, baseType: !542, size: 64, offset: 3264)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !475, file: !470, line: 76, baseType: !626, size: 64, offset: 3328)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!224, !467, !270, !550, !333}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !475, file: !470, line: 77, baseType: !554, size: 64, offset: 3392)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !475, file: !470, line: 78, baseType: !554, size: 64, offset: 3456)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !475, file: !470, line: 79, baseType: !554, size: 64, offset: 3520)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !475, file: !470, line: 80, baseType: !554, size: 64, offset: 3584)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !475, file: !470, line: 81, baseType: !509, size: 64, offset: 3648)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !475, file: !470, line: 82, baseType: !554, size: 64, offset: 3712)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !475, file: !470, line: 83, baseType: !636, size: 64, offset: 3776)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!224, !467, !270, !467, !552}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !475, file: !470, line: 84, baseType: !636, size: 64, offset: 3840)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !475, file: !470, line: 85, baseType: !641, size: 64, offset: 3904)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!224, !467, !467, !333, !333}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !475, file: !470, line: 86, baseType: !645, size: 64, offset: 3968)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!224, !467, !648, !481}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !609, line: 11, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !609, line: 11, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !475, file: !470, line: 87, baseType: !645, size: 64, offset: 4032)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !475, file: !470, line: 88, baseType: !653, size: 64, offset: 4096)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!224, !467, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !475, file: !470, line: 89, baseType: !653, size: 64, offset: 4160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !475, file: !470, line: 90, baseType: !659, size: 64, offset: 4224)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!224, !467, !270, !550, !550, !467, !552}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !475, file: !470, line: 91, baseType: !659, size: 64, offset: 4288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !475, file: !470, line: 92, baseType: !588, size: 64, offset: 4352)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !475, file: !470, line: 93, baseType: !588, size: 64, offset: 4416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !475, file: !470, line: 94, baseType: !513, size: 64, offset: 4480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !475, file: !470, line: 95, baseType: !513, size: 64, offset: 4544)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !475, file: !470, line: 96, baseType: !513, size: 64, offset: 4608)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !475, file: !470, line: 97, baseType: !513, size: 64, offset: 4672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !475, file: !470, line: 98, baseType: !670, size: 64, offset: 4736)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!224, !467, !383}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !475, file: !470, line: 99, baseType: !559, size: 64, offset: 4800)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !475, file: !470, line: 100, baseType: !559, size: 64, offset: 4864)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !475, file: !470, line: 101, baseType: !676, size: 64, offset: 4928)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!224, !467, !336, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !475, file: !470, line: 102, baseType: !682, size: 64, offset: 4992)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!224, !467, !656, !679}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !475, file: !470, line: 103, baseType: !559, size: 64, offset: 5056)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !475, file: !470, line: 104, baseType: !653, size: 64, offset: 5120)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !475, file: !470, line: 105, baseType: !688, size: 64, offset: 5184)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!224, !270, !499, !481, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !469, file: !470, line: 144, baseType: !694, size: 64, offset: 9728)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !609, line: 60, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !697, line: 240, size: 640, elements: !698)
!697 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !696, file: !697, line: 241, baseType: !226, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !696, file: !697, line: 242, baseType: !287, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !696, file: !697, line: 243, baseType: !270, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !696, file: !697, line: 243, baseType: !270, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !696, file: !697, line: 244, baseType: !270, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !696, file: !697, line: 244, baseType: !270, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !696, file: !697, line: 245, baseType: !316, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !696, file: !697, line: 246, baseType: !383, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !696, file: !697, line: 247, baseType: !270, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !696, file: !697, line: 251, baseType: !270, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !696, file: !697, line: 252, baseType: !608, size: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !696, file: !697, line: 253, baseType: !383, size: 32, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !696, file: !697, line: 254, baseType: !270, size: 32, offset: 544)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !696, file: !697, line: 254, baseType: !270, size: 32, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !696, file: !697, line: 255, baseType: !270, size: 32, offset: 608)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !470, line: 145, baseType: !307, size: 64, offset: 9792)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !469, file: !470, line: 146, baseType: !383, size: 32, offset: 9856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !469, file: !470, line: 147, baseType: !717, size: 1344, offset: 9920)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !470, line: 140, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 114, size: 1344, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !738, !739, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !718, file: !470, line: 115, baseType: !270, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !718, file: !470, line: 116, baseType: !270, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !718, file: !470, line: 117, baseType: !270, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !718, file: !470, line: 118, baseType: !270, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !718, file: !470, line: 119, baseType: !270, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !718, file: !470, line: 120, baseType: !270, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !718, file: !470, line: 121, baseType: !316, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !718, file: !470, line: 122, baseType: !333, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !718, file: !470, line: 124, baseType: !226, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !470, line: 125, baseType: !287, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !718, file: !470, line: 125, baseType: !287, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !718, file: !470, line: 126, baseType: !287, size: 32, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !718, file: !470, line: 126, baseType: !287, size: 32, offset: 480)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !718, file: !470, line: 127, baseType: !734, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !227, line: 339, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !227, line: 339, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !718, file: !470, line: 128, baseType: !734, size: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !718, file: !470, line: 129, baseType: !740, size: 64, offset: 640)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !227, line: 341, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !227, line: 351, size: 192, elements: !743)
!743 = !{!744, !745, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !742, file: !227, line: 354, baseType: !64, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !742, file: !227, line: 355, baseType: !64, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !742, file: !227, line: 356, baseType: !64, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !742, file: !227, line: 361, baseType: !64, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !742, file: !227, line: 362, baseType: !205, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !718, file: !470, line: 130, baseType: !270, size: 32, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !718, file: !470, line: 130, baseType: !270, size: 32, offset: 736)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !718, file: !470, line: 131, baseType: !333, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !718, file: !470, line: 131, baseType: !333, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !718, file: !470, line: 132, baseType: !316, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !718, file: !470, line: 132, baseType: !316, size: 64, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !718, file: !470, line: 133, baseType: !270, size: 32, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !718, file: !470, line: 134, baseType: !316, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !718, file: !470, line: 135, baseType: !270, size: 32, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !718, file: !470, line: 136, baseType: !383, size: 32, offset: 1184)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !718, file: !470, line: 137, baseType: !383, size: 32, offset: 1216)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !718, file: !470, line: 138, baseType: !552, size: 32, offset: 1248)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !718, file: !470, line: 139, baseType: !316, size: 64, offset: 1280)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !469, file: !470, line: 147, baseType: !717, size: 1344, offset: 11264)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !469, file: !470, line: 148, baseType: !383, size: 32, offset: 12608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !469, file: !470, line: 149, baseType: !270, size: 32, offset: 12640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !469, file: !470, line: 150, baseType: !766, size: 32, offset: 12672)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !469, file: !470, line: 157, baseType: !297, size: 64, offset: 12736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !457, file: !451, line: 16, baseType: !769, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!224, !448, !772, !772}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !91, line: 16, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !91, line: 16, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !457, file: !451, line: 17, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!224, !448, !467, !467, !467, !325, !325, !325, !270, !383, !316, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !84, line: 102, baseType: !110)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !457, file: !451, line: 18, baseType: !782, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!224, !448, !785, !467, !467, !467}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !84, line: 85, baseType: !83)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !457, file: !451, line: 19, baseType: !464, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !457, file: !451, line: 20, baseType: !788, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!224, !448, !270, !467, !467, !467}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !457, file: !451, line: 21, baseType: !792, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!224, !362, !448}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !457, file: !451, line: 22, baseType: !796, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!224, !448, !799, !467, !467}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !800, line: 22, baseType: !801)
!800 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !800, line: 22, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !457, file: !451, line: 23, baseType: !796, size: 64, offset: 576)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !457, file: !451, line: 24, baseType: !805, size: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!224, !448, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !457, file: !451, line: 25, baseType: !464, size: 64, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !457, file: !451, line: 26, baseType: !464, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !457, file: !451, line: 27, baseType: !460, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !457, file: !451, line: 28, baseType: !460, size: 64, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !457, file: !451, line: 29, baseType: !814, size: 64, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!224, !448, !234}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !457, file: !451, line: 30, baseType: !460, size: 64, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !457, file: !451, line: 31, baseType: !814, size: 64, offset: 1088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !450, file: !451, line: 39, baseType: !423, size: 64, offset: 5632)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !450, file: !451, line: 40, baseType: !270, size: 32, offset: 5696)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !450, file: !451, line: 41, baseType: !309, size: 64, offset: 5760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !450, file: !451, line: 41, baseType: !309, size: 64, offset: 5824)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !450, file: !451, line: 42, baseType: !383, size: 32, offset: 5888)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !451, line: 43, baseType: !825, size: 32, offset: 5920)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !91, line: 285, baseType: !90)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !450, file: !451, line: 45, baseType: !270, size: 32, offset: 5952)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !450, file: !451, line: 46, baseType: !383, size: 32, offset: 5984)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !450, file: !451, line: 47, baseType: !772, size: 64, offset: 6016)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !450, file: !451, line: 47, baseType: !772, size: 64, offset: 6080)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !450, file: !451, line: 48, baseType: !467, size: 64, offset: 6144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !450, file: !451, line: 48, baseType: !467, size: 64, offset: 6208)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !450, file: !451, line: 49, baseType: !383, size: 32, offset: 6272)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !450, file: !451, line: 50, baseType: !383, size: 32, offset: 6304)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !450, file: !451, line: 51, baseType: !835, size: 64, offset: 6336)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!224, !448, !270, !838, !838, !808, !307}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !450, file: !451, line: 52, baseType: !307, size: 64, offset: 6400)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !451, line: 53, baseType: !307, size: 64, offset: 6464)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !450, file: !451, line: 54, baseType: !270, size: 32, offset: 6528)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !450, file: !451, line: 55, baseType: !307, size: 64, offset: 6592)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !450, file: !451, line: 56, baseType: !845, size: 32, offset: 6656)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !84, line: 395, baseType: !116)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !450, file: !451, line: 57, baseType: !845, size: 32, offset: 6688)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "userpatchconstructctx", scope: !415, file: !199, line: 16, baseType: !307, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "userIS", scope: !415, file: !199, line: 17, baseType: !692, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "npatch", scope: !415, file: !199, line: 18, baseType: !270, size: 32, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "user_patches", scope: !415, file: !199, line: 19, baseType: !383, size: 32, offset: 352)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !415, file: !199, line: 20, baseType: !270, size: 32, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "codim", scope: !415, file: !199, line: 20, baseType: !270, size: 32, offset: 416)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "cellCounts", scope: !415, file: !199, line: 21, baseType: !854, size: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !855, line: 18, baseType: !856)
!855 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !855, line: 18, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cells", scope: !415, file: !199, line: 22, baseType: !648, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "extFacets", scope: !415, file: !199, line: 23, baseType: !648, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "intFacets", scope: !415, file: !199, line: 24, baseType: !648, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "intFacetsToPatchCell", scope: !415, file: !199, line: 25, baseType: !648, size: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "intFacetCounts", scope: !415, file: !199, line: 26, baseType: !854, size: 64, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "extFacetCounts", scope: !415, file: !199, line: 27, baseType: !854, size: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cellNumbering", scope: !415, file: !199, line: 28, baseType: !854, size: 64, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pointCounts", scope: !415, file: !199, line: 29, baseType: !854, size: 64, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !415, file: !199, line: 30, baseType: !648, size: 64, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "combined", scope: !415, file: !199, line: 32, baseType: !383, size: 32, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nsubspaces", scope: !415, file: !199, line: 33, baseType: !270, size: 32, offset: 1120)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !415, file: !199, line: 34, baseType: !870, size: 64, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !871, line: 15, baseType: !872)
!871 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !871, line: 15, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dofSection", scope: !415, file: !199, line: 35, baseType: !875, size: 64, offset: 1216)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "subspaceOffsets", scope: !415, file: !199, line: 36, baseType: !316, size: 64, offset: 1280)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "cellNodeMap", scope: !415, file: !199, line: 37, baseType: !318, size: 64, offset: 1344)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dofs", scope: !415, file: !199, line: 38, baseType: !648, size: 64, offset: 1408)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !415, file: !199, line: 39, baseType: !648, size: 64, offset: 1472)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dofsWithArtificial", scope: !415, file: !199, line: 40, baseType: !648, size: 64, offset: 1536)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "offsWithArtificial", scope: !415, file: !199, line: 41, baseType: !648, size: 64, offset: 1600)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "dofsWithAll", scope: !415, file: !199, line: 42, baseType: !648, size: 64, offset: 1664)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "offsWithAll", scope: !415, file: !199, line: 43, baseType: !648, size: 64, offset: 1728)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "patchSection", scope: !415, file: !199, line: 44, baseType: !854, size: 64, offset: 1792)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "globalBcNodes", scope: !415, file: !199, line: 45, baseType: !648, size: 64, offset: 1856)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ghostBcNodes", scope: !415, file: !199, line: 46, baseType: !648, size: 64, offset: 1920)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gtolCounts", scope: !415, file: !199, line: 47, baseType: !854, size: 64, offset: 1984)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gtolCountsWithArtificial", scope: !415, file: !199, line: 48, baseType: !854, size: 64, offset: 2048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gtolCountsWithAll", scope: !415, file: !199, line: 49, baseType: !854, size: 64, offset: 2112)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !415, file: !199, line: 50, baseType: !648, size: 64, offset: 2176)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gtolWithArtificial", scope: !415, file: !199, line: 51, baseType: !648, size: 64, offset: 2240)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gtolWithAll", scope: !415, file: !199, line: 52, baseType: !648, size: 64, offset: 2304)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !415, file: !199, line: 53, baseType: !316, size: 64, offset: 2368)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nodesPerCell", scope: !415, file: !199, line: 54, baseType: !316, size: 64, offset: 2432)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "totalDofsPerCell", scope: !415, file: !199, line: 55, baseType: !270, size: 32, offset: 2496)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "subspaces_to_exclude", scope: !415, file: !199, line: 56, baseType: !427, size: 64, offset: 2560)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "vankadim", scope: !415, file: !199, line: 59, baseType: !270, size: 32, offset: 2624)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ignoredim", scope: !415, file: !199, line: 60, baseType: !270, size: 32, offset: 2656)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pardecomp_overlap", scope: !415, file: !199, line: 61, baseType: !270, size: 32, offset: 2688)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputeop", scope: !415, file: !199, line: 63, baseType: !901, size: 64, offset: 2752)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!224, !448, !270, !467, !772, !648, !270, !550, !550, !307}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputeopctx", scope: !415, file: !199, line: 64, baseType: !307, size: 64, offset: 2816)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputef", scope: !415, file: !199, line: 65, baseType: !906, size: 64, offset: 2880)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!224, !448, !270, !467, !467, !648, !270, !550, !550, !307}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputefctx", scope: !415, file: !199, line: 66, baseType: !307, size: 64, offset: 2944)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputeopintfacet", scope: !415, file: !199, line: 68, baseType: !901, size: 64, offset: 3008)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputeopintfacetctx", scope: !415, file: !199, line: 69, baseType: !307, size: 64, offset: 3072)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputefintfacet", scope: !415, file: !199, line: 71, baseType: !906, size: 64, offset: 3136)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "usercomputefintfacetctx", scope: !415, file: !199, line: 72, baseType: !307, size: 64, offset: 3200)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cellIS", scope: !415, file: !199, line: 73, baseType: !648, size: 64, offset: 3264)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "save_operators", scope: !415, file: !199, line: 74, baseType: !383, size: 32, offset: 3328)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "precomputeElementTensors", scope: !415, file: !199, line: 75, baseType: !383, size: 32, offset: 3360)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "allCells", scope: !415, file: !199, line: 76, baseType: !648, size: 64, offset: 3392)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "allIntFacets", scope: !415, file: !199, line: 77, baseType: !648, size: 64, offset: 3456)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "partition_of_unity", scope: !415, file: !199, line: 78, baseType: !383, size: 32, offset: 3520)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "multiplicative", scope: !415, file: !199, line: 79, baseType: !383, size: 32, offset: 3552)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "local_composition_type", scope: !415, file: !199, line: 80, baseType: !922, size: 32, offset: 3584)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCCompositeType", file: !84, line: 180, baseType: !132)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cellMats", scope: !415, file: !199, line: 82, baseType: !467, size: 64, offset: 3648)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "precomputedTensorLocations", scope: !415, file: !199, line: 83, baseType: !316, size: 64, offset: 3712)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "intFacetMats", scope: !415, file: !199, line: 84, baseType: !467, size: 64, offset: 3776)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "precomputedIntFacetTensorLocations", scope: !415, file: !199, line: 85, baseType: !316, size: 64, offset: 3840)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !415, file: !199, line: 86, baseType: !808, size: 64, offset: 3904)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "matWithArtificial", scope: !415, file: !199, line: 87, baseType: !808, size: 64, offset: 3968)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sub_mat_type", scope: !415, file: !199, line: 88, baseType: !930, size: 64, offset: 4032)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !91, line: 25, baseType: !247)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "patchRHS", scope: !415, file: !199, line: 89, baseType: !467, size: 64, offset: 4096)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "patchUpdate", scope: !415, file: !199, line: 89, baseType: !467, size: 64, offset: 4160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dofMappingWithoutToWithArtificial", scope: !415, file: !199, line: 90, baseType: !692, size: 64, offset: 4224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dofMappingWithoutToWithAll", scope: !415, file: !199, line: 91, baseType: !692, size: 64, offset: 4288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "patchRHSWithArtificial", scope: !415, file: !199, line: 92, baseType: !467, size: 64, offset: 4352)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "patch_dof_weights", scope: !415, file: !199, line: 93, baseType: !481, size: 64, offset: 4416)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "localRHS", scope: !415, file: !199, line: 94, baseType: !467, size: 64, offset: 4480)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "localUpdate", scope: !415, file: !199, line: 94, baseType: !467, size: 64, offset: 4544)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dof_weights", scope: !415, file: !199, line: 95, baseType: !467, size: 64, offset: 4608)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrise_sweep", scope: !415, file: !199, line: 96, baseType: !383, size: 32, offset: 4672)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "optionsSet", scope: !415, file: !199, line: 97, baseType: !383, size: 32, offset: 4704)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "iterationSet", scope: !415, file: !199, line: 98, baseType: !648, size: 64, offset: 4736)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "currentPatch", scope: !415, file: !199, line: 99, baseType: !270, size: 32, offset: 4800)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "solver", scope: !415, file: !199, line: 100, baseType: !242, size: 64, offset: 4864)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "denseinverse", scope: !415, file: !199, line: 101, baseType: !383, size: 32, offset: 4928)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "densesolve", scope: !415, file: !199, line: 102, baseType: !947, size: 64, offset: 4992)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!224, !772, !467, !467}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "setupsolver", scope: !415, file: !199, line: 103, baseType: !460, size: 64, offset: 5056)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "applysolver", scope: !415, file: !199, line: 104, baseType: !952, size: 64, offset: 5120)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!224, !448, !270, !467, !467}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "resetsolver", scope: !415, file: !199, line: 105, baseType: !460, size: 64, offset: 5184)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "destroysolver", scope: !415, file: !199, line: 106, baseType: !460, size: 64, offset: 5248)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "updatemultiplicative", scope: !415, file: !199, line: 107, baseType: !958, size: 64, offset: 5312)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!224, !448, !270, !270}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "viewPatches", scope: !415, file: !199, line: 109, baseType: !383, size: 32, offset: 5376)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "viewCells", scope: !415, file: !199, line: 110, baseType: !383, size: 32, offset: 5408)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "viewerCells", scope: !415, file: !199, line: 111, baseType: !234, size: 64, offset: 5440)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "formatCells", scope: !415, file: !199, line: 112, baseType: !965, size: 32, offset: 5504)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !141, line: 162, baseType: !140)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "viewIntFacets", scope: !415, file: !199, line: 113, baseType: !383, size: 32, offset: 5536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "viewerIntFacets", scope: !415, file: !199, line: 114, baseType: !234, size: 64, offset: 5568)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "formatIntFacets", scope: !415, file: !199, line: 115, baseType: !965, size: 32, offset: 5632)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "viewExtFacets", scope: !415, file: !199, line: 116, baseType: !383, size: 32, offset: 5664)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "viewerExtFacets", scope: !415, file: !199, line: 117, baseType: !234, size: 64, offset: 5696)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "formatExtFacets", scope: !415, file: !199, line: 118, baseType: !965, size: 32, offset: 5760)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "viewPoints", scope: !415, file: !199, line: 119, baseType: !383, size: 32, offset: 5792)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPoints", scope: !415, file: !199, line: 120, baseType: !234, size: 64, offset: 5824)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "formatPoints", scope: !415, file: !199, line: 121, baseType: !965, size: 32, offset: 5888)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "viewSection", scope: !415, file: !199, line: 122, baseType: !383, size: 32, offset: 5920)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSection", scope: !415, file: !199, line: 123, baseType: !234, size: 64, offset: 5952)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "formatSection", scope: !415, file: !199, line: 124, baseType: !965, size: 32, offset: 6016)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatrix", scope: !415, file: !199, line: 125, baseType: !383, size: 32, offset: 6048)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatrix", scope: !415, file: !199, line: 126, baseType: !234, size: 64, offset: 6080)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatrix", scope: !415, file: !199, line: 127, baseType: !965, size: 32, offset: 6144)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "patchState", scope: !415, file: !199, line: 129, baseType: !467, size: 64, offset: 6208)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "patchStateWithAll", scope: !415, file: !199, line: 130, baseType: !467, size: 64, offset: 6272)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "localState", scope: !415, file: !199, line: 131, baseType: !467, size: 64, offset: 6336)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "patchResidual", scope: !415, file: !199, line: 132, baseType: !467, size: 64, offset: 6400)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "classname", scope: !415, file: !199, line: 133, baseType: !247, size: 64, offset: 6464)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "isNonlinear", scope: !415, file: !199, line: 134, baseType: !383, size: 32, offset: 6528)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_Patch", file: !989, line: 12, baseType: !990)
!989 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/patch/snespatch.c", directory: "/home/users/ndemeye/xSDK")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 10, size: 64, elements: !991)
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !990, file: !989, line: 11, baseType: !448, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !227, line: 331, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !227, line: 331, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !227, line: 338, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !227, line: 338, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !63, line: 18, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !1002, line: 38, size: 11648, elements: !1003)
!1002 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!1003 = !{!1004, !1005, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1094, !1096, !1097, !1098, !1099, !1100, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1136, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1001, file: !1002, line: 39, baseType: !454, size: 4480)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1001, file: !1002, line: 39, baseType: !1006, size: 1088, offset: 4480)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 1088, elements: !266)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !1002, line: 12, size: 1088, elements: !1008)
!1008 = !{!1009, !1013, !1017, !1021, !1027, !1028, !1032, !1033, !1037, !1041, !1042, !1043, !1048, !1052, !1056, !1060, !1064}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !1007, file: !1002, line: 13, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!224, !999, !467, !307}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !1007, file: !1002, line: 14, baseType: !1014, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!224, !467, !467, !307}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1007, file: !1002, line: 15, baseType: !1018, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!224, !999, !270}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !1007, file: !1002, line: 16, baseType: !1022, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!224, !999, !270, !325, !325, !325, !1025, !307}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !63, line: 257, baseType: !62)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !1007, file: !1002, line: 17, baseType: !353, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1007, file: !1002, line: 18, baseType: !1029, size: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!224, !999}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !1007, file: !1002, line: 19, baseType: !1029, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1007, file: !1002, line: 20, baseType: !1034, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!224, !999, !234}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1007, file: !1002, line: 21, baseType: !1038, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!224, !362, !999}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1007, file: !1002, line: 22, baseType: !1029, size: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1007, file: !1002, line: 23, baseType: !1029, size: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !1007, file: !1002, line: 24, baseType: !1044, size: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!224, !999, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !1007, file: !1002, line: 25, baseType: !1049, size: 64, offset: 768)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!224, !1047}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !1007, file: !1002, line: 26, baseType: !1053, size: 64, offset: 832)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!224, !999, !467, !467}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !1007, file: !1002, line: 27, baseType: !1057, size: 64, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!224, !999, !467, !467, !307}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !1007, file: !1002, line: 28, baseType: !1061, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!224, !999, !467, !772, !772, !307}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !1007, file: !1002, line: 29, baseType: !1034, size: 64, offset: 1024)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !1001, file: !1002, line: 40, baseType: !423, size: 64, offset: 5568)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !1001, file: !1002, line: 41, baseType: !383, size: 32, offset: 5632)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !1001, file: !1002, line: 42, baseType: !999, size: 64, offset: 5696)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !1001, file: !1002, line: 43, baseType: !785, size: 32, offset: 5760)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !1001, file: !1002, line: 44, baseType: !383, size: 32, offset: 5792)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1001, file: !1002, line: 47, baseType: !307, size: 64, offset: 5824)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !1001, file: !1002, line: 49, baseType: !467, size: 64, offset: 5888)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !1001, file: !1002, line: 50, baseType: !467, size: 64, offset: 5952)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !1001, file: !1002, line: 52, baseType: !467, size: 64, offset: 6016)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !1001, file: !1002, line: 54, baseType: !772, size: 64, offset: 6080)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !1001, file: !1002, line: 55, baseType: !772, size: 64, offset: 6144)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !1001, file: !1002, line: 56, baseType: !772, size: 64, offset: 6208)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !1001, file: !1002, line: 57, baseType: !307, size: 64, offset: 6272)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !1001, file: !1002, line: 58, baseType: !799, size: 64, offset: 6336)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !1001, file: !1002, line: 59, baseType: !1080, size: 64, offset: 6400)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !63, line: 526, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !63, line: 526, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !1001, file: !1002, line: 60, baseType: !383, size: 32, offset: 6464)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !1001, file: !1002, line: 61, baseType: !825, size: 32, offset: 6496)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !1001, file: !1002, line: 63, baseType: !467, size: 64, offset: 6528)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !1001, file: !1002, line: 65, baseType: !467, size: 64, offset: 6592)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !1001, file: !1002, line: 66, baseType: !307, size: 64, offset: 6656)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !1001, file: !1002, line: 68, baseType: !325, size: 64, offset: 6720)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !1001, file: !1002, line: 74, baseType: !1090, size: 320, offset: 6784)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 320, elements: !401)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!224, !999, !270, !325, !307}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !1001, file: !1002, line: 75, baseType: !1095, size: 320, offset: 7104)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 320, elements: !401)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !1001, file: !1002, line: 76, baseType: !409, size: 320, offset: 7424)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !1001, file: !1002, line: 77, baseType: !270, size: 32, offset: 7744)
