; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/redundant/dmredundant.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/redundant/dmredundant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 424, baseType: !5, size: 32, elements: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 624, baseType: !5, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !105)
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!109 = !{!110, !113, !114, !190, !318, !321, !200, !121, !324, !150, !284, !325, !5, !327}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !98, line: 330, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !98, line: 330, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !117, line: 73, size: 4480, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !122, !171, !172, !174, !177, !178, !179, !180, !188, !189, !191, !195, !199, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !212, !213, !214, !216, !217, !219, !221, !222, !223, !224, !225, !228, !230, !231, !232, !233, !234, !237, !239, !240, !241, !251, !253, !254, !258, !259, !308, !313, !315, !316, !317}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !116, file: !117, line: 74, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !121)
!121 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !116, file: !117, line: 75, baseType: !123, size: 448, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 448, elements: !169)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !117, line: 53, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 45, size: 448, elements: !126)
!126 = !{!127, !133, !141, !146, !153, !157, !164}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !125, file: !117, line: 46, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !114, !132}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !121)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !125, file: !117, line: 47, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!131, !114, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !138, line: 16, baseType: !139)
!138 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !138, line: 16, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !125, file: !117, line: 48, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!131, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !125, file: !117, line: 49, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!131, !114, !150, !114}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !125, file: !117, line: 50, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!131, !114, !150, !145}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !125, file: !117, line: 51, baseType: !158, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!131, !114, !150, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !125, file: !117, line: 52, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!131, !114, !150, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !116, file: !117, line: 76, baseType: !110, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !117, line: 77, baseType: !173, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !121)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !116, file: !117, line: 78, baseType: !175, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !176)
!176 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !116, file: !117, line: 78, baseType: !175, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !116, file: !117, line: 78, baseType: !175, size: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !116, file: !117, line: 78, baseType: !175, size: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !117, line: 79, baseType: !181, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !184, line: 27, baseType: !185)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !186, line: 43, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!187 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !116, file: !117, line: 80, baseType: !173, size: 32, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !116, file: !117, line: 81, baseType: !190, size: 32, offset: 992)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !121)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !116, file: !117, line: 82, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !116, file: !117, line: 83, baseType: !196, size: 64, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !116, file: !117, line: 84, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !116, file: !117, line: 85, baseType: !200, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !116, file: !117, line: 86, baseType: !200, size: 64, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !116, file: !117, line: 87, baseType: !200, size: 64, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !117, line: 88, baseType: !114, size: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !116, file: !117, line: 89, baseType: !181, size: 64, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 90, baseType: !200, size: 64, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !116, file: !117, line: 91, baseType: !200, size: 64, offset: 1600)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !116, file: !117, line: 92, baseType: !173, size: 32, offset: 1664)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !116, file: !117, line: 93, baseType: !113, size: 64, offset: 1728)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !116, file: !117, line: 94, baseType: !211, size: 64, offset: 1792)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !182)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !116, file: !117, line: 95, baseType: !173, size: 32, offset: 1856)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !116, file: !117, line: 95, baseType: !173, size: 32, offset: 1888)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !116, file: !117, line: 96, baseType: !215, size: 64, offset: 1920)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !116, file: !117, line: 96, baseType: !215, size: 64, offset: 1984)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !116, file: !117, line: 97, baseType: !218, size: 64, offset: 2048)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !116, file: !117, line: 97, baseType: !220, size: 64, offset: 2112)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !116, file: !117, line: 98, baseType: !173, size: 32, offset: 2176)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !116, file: !117, line: 98, baseType: !173, size: 32, offset: 2208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !116, file: !117, line: 99, baseType: !215, size: 64, offset: 2240)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !116, file: !117, line: 99, baseType: !215, size: 64, offset: 2304)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !116, file: !117, line: 100, baseType: !226, size: 64, offset: 2368)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !176)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !116, file: !117, line: 100, baseType: !229, size: 64, offset: 2432)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !116, file: !117, line: 101, baseType: !173, size: 32, offset: 2496)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !116, file: !117, line: 101, baseType: !173, size: 32, offset: 2528)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !116, file: !117, line: 102, baseType: !215, size: 64, offset: 2560)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !116, file: !117, line: 102, baseType: !215, size: 64, offset: 2624)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !116, file: !117, line: 103, baseType: !235, size: 64, offset: 2688)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !227)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !116, file: !117, line: 103, baseType: !238, size: 64, offset: 2752)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !116, file: !117, line: 104, baseType: !168, size: 64, offset: 2816)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !116, file: !117, line: 105, baseType: !173, size: 32, offset: 2880)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !116, file: !117, line: 106, baseType: !242, size: 128, offset: 2944)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 128, elements: !249)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !117, line: 64, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 61, size: 128, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !245, file: !117, line: 62, baseType: !161, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !245, file: !117, line: 63, baseType: !113, size: 64, offset: 64)
!249 = !{!250}
!250 = !DISubrange(count: 2)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !116, file: !117, line: 107, baseType: !252, size: 64, offset: 3072)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 64, elements: !249)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !116, file: !117, line: 108, baseType: !113, size: 64, offset: 3136)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !116, file: !117, line: 109, baseType: !255, size: 64, offset: 3200)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!131, !113}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !116, file: !117, line: 111, baseType: !173, size: 32, offset: 3264)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !116, file: !117, line: 112, baseType: !260, size: 320, offset: 3328)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !306)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!131, !264, !114, !113}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !267)
!267 = !{!268, !269, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !266, file: !10, line: 100, baseType: !173, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !10, line: 101, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !281, !282, !283, !287, !289, !291, !292, !293}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !272, file: !10, line: 84, baseType: !200, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !272, file: !10, line: 85, baseType: !200, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !10, line: 86, baseType: !113, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !272, file: !10, line: 87, baseType: !192, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !272, file: !10, line: 88, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !272, file: !10, line: 89, baseType: !152, size: 8, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !272, file: !10, line: 90, baseType: !200, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !272, file: !10, line: 91, baseType: !284, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !285, line: 46, baseType: !286)
!285 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!286 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !272, file: !10, line: 92, baseType: !288, size: 32, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !10, line: 93, baseType: !290, size: 32, offset: 544)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !10, line: 94, baseType: !270, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !272, file: !10, line: 95, baseType: !200, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !272, file: !10, line: 96, baseType: !113, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !266, file: !10, line: 102, baseType: !200, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !266, file: !10, line: 102, baseType: !200, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !266, file: !10, line: 103, baseType: !200, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !266, file: !10, line: 104, baseType: !110, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 416)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !266, file: !10, line: 106, baseType: !114, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !266, file: !10, line: 107, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!306 = !{!307}
!307 = !DISubrange(count: 5)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !116, file: !117, line: 113, baseType: !309, size: 320, offset: 3648)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 320, elements: !306)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!131, !114, !113}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !116, file: !117, line: 114, baseType: !314, size: 320, offset: 3968)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 320, elements: !306)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !116, file: !117, line: 115, baseType: !288, size: 32, offset: 4288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !116, file: !117, line: 120, baseType: !303, size: 64, offset: 4352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !116, file: !117, line: 121, baseType: !288, size: 32, offset: 4416)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !98, line: 331, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !98, line: 331, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !98, line: 338, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !98, line: 338, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !326, line: 1451, baseType: !161)
!326 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Redundant", file: !329, line: 8, baseType: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/redundant/dmredundant.c", directory: "/home/users/ndemeye/xSDK")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 4, size: 96, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !330, file: !329, line: 5, baseType: !190, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !330, file: !329, line: 6, baseType: !173, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !330, file: !329, line: 7, baseType: !173, size: 32, offset: 64)
!335 = !{i32 7, !"Dwarf Version", i32 4}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{i32 7, !"PIC Level", i32 2}
!339 = !{i32 7, !"uwtable", i32 1}
!340 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!341 = distinct !DISubprogram(name: "DMRedundantSetSize", scope: !329, file: !329, line: 291, type: !342, scopeLine: 292, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1091)
!342 = !DISubroutineType(types: !343)
!343 = !{!131, !344, !190, !173}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !347)
!347 = !{!348, !350, !586, !590, !591, !592, !593, !603, !604, !612, !613, !621, !622, !623, !624, !628, !629, !633, !635, !637, !638, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !666, !678, !690, !702, !711, !712, !735, !736, !737, !738, !739, !740, !742, !833, !834, !854, !855, !856, !857, !858, !859, !863, !864, !868, !869, !870, !871, !872, !873, !874, !875, !876, !879, !891, !892, !893, !902, !990, !991, !1079, !1080, !1081, !1082, !1084, !1086, !1087, !1088, !1089, !1090}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !346, file: !47, line: 203, baseType: !349, size: 4480)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !117, line: 122, baseType: !116)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !346, file: !47, line: 203, baseType: !351, size: 3456, offset: 4480)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 3456, elements: !169)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !353)
!353 = !{!354, !358, !359, !364, !368, !372, !373, !374, !383, !384, !385, !397, !398, !406, !415, !423, !427, !431, !432, !437, !438, !442, !443, !447, !448, !456, !460, !465, !466, !467, !468, !469, !470, !471, !475, !481, !485, !490, !494, !505, !509, !514, !521, !525, !526, !532, !543, !547, !557, !561, !569, !573, !581, !582}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !352, file: !47, line: 31, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!131, !344, !137}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !352, file: !47, line: 32, baseType: !355, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !352, file: !47, line: 33, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!131, !344, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !352, file: !47, line: 34, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!131, !264, !344}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !352, file: !47, line: 35, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!131, !344}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !352, file: !47, line: 36, baseType: !369, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !352, file: !47, line: 37, baseType: !369, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !352, file: !47, line: 38, baseType: !375, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!131, !344, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !380, line: 21, baseType: !381)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !380, line: 21, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !352, file: !47, line: 39, baseType: !375, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !352, file: !47, line: 40, baseType: !369, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !352, file: !47, line: 41, baseType: !386, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!131, !344, !218, !389, !391}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !394, line: 11, baseType: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !394, line: 11, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !352, file: !47, line: 42, baseType: !360, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !352, file: !47, line: 43, baseType: !399, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!131, !344, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !352, file: !47, line: 45, baseType: !407, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!131, !344, !410, !411}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !394, line: 51, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !394, line: 51, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !352, file: !47, line: 46, baseType: !416, size: 64, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!131, !344, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !93, line: 16, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !93, line: 16, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !352, file: !47, line: 47, baseType: !424, size: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!131, !344, !344, !419, !378}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !352, file: !47, line: 48, baseType: !428, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!131, !344, !344, !419}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !352, file: !47, line: 49, baseType: !428, size: 64, offset: 1088)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !352, file: !47, line: 50, baseType: !433, size: 64, offset: 1152)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!131, !344, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !352, file: !47, line: 51, baseType: !428, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !352, file: !47, line: 53, baseType: !439, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!131, !344, !110, !363}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !352, file: !47, line: 54, baseType: !439, size: 64, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !352, file: !47, line: 55, baseType: !444, size: 64, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!131, !344, !173, !363}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !352, file: !47, line: 56, baseType: !444, size: 64, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !352, file: !47, line: 57, baseType: !449, size: 64, offset: 1536)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!131, !344, !452, !363}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !453, line: 12, baseType: !454)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !453, line: 12, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !352, file: !47, line: 58, baseType: !457, size: 64, offset: 1600)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!131, !344, !379, !452, !363}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !352, file: !47, line: 60, baseType: !461, size: 64, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!131, !344, !379, !464, !379}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !352, file: !47, line: 61, baseType: !461, size: 64, offset: 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !352, file: !47, line: 62, baseType: !461, size: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !352, file: !47, line: 63, baseType: !461, size: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !352, file: !47, line: 64, baseType: !461, size: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !352, file: !47, line: 65, baseType: !461, size: 64, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !352, file: !47, line: 67, baseType: !369, size: 64, offset: 2048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !352, file: !47, line: 69, baseType: !472, size: 64, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!131, !344, !379, !379}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !352, file: !47, line: 71, baseType: !476, size: 64, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!131, !344, !173, !479, !392, !363}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !352, file: !47, line: 72, baseType: !482, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!131, !363, !173, !391, !363}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !352, file: !47, line: 73, baseType: !486, size: 64, offset: 2304)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!131, !344, !218, !389, !391, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !352, file: !47, line: 74, baseType: !491, size: 64, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!131, !344, !218, !389, !391, !391, !489}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !352, file: !47, line: 75, baseType: !495, size: 64, offset: 2432)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!131, !344, !173, !363, !498, !498, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !501, line: 59, baseType: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !501, line: 15, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !501, line: 15, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !352, file: !47, line: 77, baseType: !506, size: 64, offset: 2496)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!131, !344, !173, !218, !218}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !352, file: !47, line: 78, baseType: !510, size: 64, offset: 2560)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!131, !344, !379, !513, !502}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !352, file: !47, line: 79, baseType: !515, size: 64, offset: 2624)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!131, !344, !218, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !352, file: !47, line: 80, baseType: !522, size: 64, offset: 2688)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!131, !344, !226, !226}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !352, file: !47, line: 81, baseType: !522, size: 64, offset: 2752)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !352, file: !47, line: 82, baseType: !527, size: 64, offset: 2816)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!131, !344, !379, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !352, file: !47, line: 84, baseType: !533, size: 64, offset: 2880)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!131, !344, !227, !536, !542, !464, !379}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!131, !173, !227, !540, !173, !235, !113}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !352, file: !47, line: 85, baseType: !544, size: 64, offset: 2944)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!131, !344, !227, !452, !173, !479, !173, !479, !536, !542, !464, !379}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !352, file: !47, line: 86, baseType: !548, size: 64, offset: 3008)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!131, !344, !227, !379, !551, !464, !379}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !173, !173, !173, !479, !479, !555, !555, !555, !479, !479, !555, !555, !555, !227, !540, !173, !555, !235}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !352, file: !47, line: 87, baseType: !558, size: 64, offset: 3072)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!131, !344, !227, !452, !173, !479, !173, !479, !379, !551, !464, !379}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !352, file: !47, line: 88, baseType: !562, size: 64, offset: 3136)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!131, !344, !227, !452, !173, !479, !173, !479, !379, !565, !464, !379}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !173, !173, !173, !479, !479, !555, !555, !555, !479, !479, !555, !555, !555, !227, !540, !540, !173, !555, !235}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !352, file: !47, line: 89, baseType: !570, size: 64, offset: 3200)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!131, !344, !227, !536, !542, !379, !226}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !352, file: !47, line: 90, baseType: !574, size: 64, offset: 3264)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!131, !344, !227, !577, !542, !379, !540, !226}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!131, !173, !227, !540, !540, !173, !235, !113}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !352, file: !47, line: 91, baseType: !570, size: 64, offset: 3328)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !352, file: !47, line: 93, baseType: !583, size: 64, offset: 3392)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!131, !344, !344, !436, !436}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !346, file: !47, line: 204, baseType: !587, size: 6400, offset: 7936)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 6400, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 100)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !346, file: !47, line: 204, baseType: !587, size: 6400, offset: 14336)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !346, file: !47, line: 205, baseType: !587, size: 6400, offset: 20736)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !346, file: !47, line: 205, baseType: !587, size: 6400, offset: 27136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !346, file: !47, line: 206, baseType: !594, size: 64, offset: 33536)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !597)
!597 = !{!598, !599, !600, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !596, file: !47, line: 143, baseType: !379, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !47, line: 144, baseType: !200, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !596, file: !47, line: 145, baseType: !601, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !47, line: 146, baseType: !594, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !346, file: !47, line: 207, baseType: !594, size: 64, offset: 33600)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !346, file: !47, line: 208, baseType: !605, size: 64, offset: 33664)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !607, file: !47, line: 151, baseType: !284, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !607, file: !47, line: 152, baseType: !113, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !47, line: 153, baseType: !605, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !346, file: !47, line: 208, baseType: !605, size: 64, offset: 33728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !346, file: !47, line: 209, baseType: !614, size: 64, offset: 33792)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !616, file: !47, line: 159, baseType: !452, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !616, file: !47, line: 160, baseType: !288, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !47, line: 161, baseType: !615, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !346, file: !47, line: 210, baseType: !452, size: 64, offset: 33856)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !346, file: !47, line: 211, baseType: !452, size: 64, offset: 33920)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !346, file: !47, line: 212, baseType: !113, size: 64, offset: 33984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !346, file: !47, line: 213, baseType: !625, size: 64, offset: 34048)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!131, !542}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !346, file: !47, line: 214, baseType: !410, size: 32, offset: 34112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !346, file: !47, line: 215, baseType: !630, size: 64, offset: 34176)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !93, line: 1378, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !93, line: 1378, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !346, file: !47, line: 216, baseType: !634, size: 64, offset: 34240)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !380, line: 83, baseType: !150)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !346, file: !47, line: 217, baseType: !636, size: 64, offset: 34304)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !93, line: 25, baseType: !150)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !346, file: !47, line: 218, baseType: !173, size: 32, offset: 34368)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !346, file: !47, line: 219, baseType: !639, size: 64, offset: 34432)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !394, line: 30, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !394, line: 30, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !346, file: !47, line: 220, baseType: !288, size: 32, offset: 34496)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !346, file: !47, line: 221, baseType: !288, size: 32, offset: 34528)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !346, file: !47, line: 222, baseType: !173, size: 32, offset: 34560)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !346, file: !47, line: 222, baseType: !173, size: 32, offset: 34592)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !346, file: !47, line: 223, baseType: !288, size: 32, offset: 34624)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !346, file: !47, line: 224, baseType: !288, size: 32, offset: 34656)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !47, line: 225, baseType: !113, size: 64, offset: 34688)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !346, file: !47, line: 227, baseType: !344, size: 64, offset: 34752)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !346, file: !47, line: 228, baseType: !344, size: 64, offset: 34816)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !346, file: !47, line: 229, baseType: !652, size: 64, offset: 34880)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !655)
!655 = !{!656, !660, !664, !665}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !654, file: !47, line: 102, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!131, !344, !344, !113}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !654, file: !47, line: 103, baseType: !661, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!131, !344, !420, !379, !420, !344, !113}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !654, file: !47, line: 104, baseType: !113, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !47, line: 105, baseType: !652, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !346, file: !47, line: 230, baseType: !667, size: 64, offset: 34944)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !670)
!670 = !{!671, !672, !676, !677}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !669, file: !47, line: 110, baseType: !657, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !669, file: !47, line: 111, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!131, !344, !420, !344, !113}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !669, file: !47, line: 112, baseType: !113, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !47, line: 113, baseType: !667, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !346, file: !47, line: 231, baseType: !679, size: 64, offset: 35008)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !682)
!682 = !{!683, !684, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !681, file: !47, line: 118, baseType: !657, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !681, file: !47, line: 119, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!131, !344, !500, !500, !344, !113}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !681, file: !47, line: 120, baseType: !113, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !681, file: !47, line: 121, baseType: !679, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !346, file: !47, line: 232, baseType: !691, size: 64, offset: 35072)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !694)
!694 = !{!695, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !693, file: !47, line: 126, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!131, !344, !379, !464, !379, !113}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !693, file: !47, line: 127, baseType: !696, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !693, file: !47, line: 128, baseType: !113, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !47, line: 129, baseType: !691, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !346, file: !47, line: 233, baseType: !703, size: 64, offset: 35136)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !706)
!706 = !{!707, !708, !709, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !705, file: !47, line: 134, baseType: !696, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !705, file: !47, line: 135, baseType: !696, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !705, file: !47, line: 136, baseType: !113, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !47, line: 137, baseType: !703, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !346, file: !47, line: 235, baseType: !173, size: 32, offset: 35200)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !346, file: !47, line: 237, baseType: !713, size: 64, offset: 35264)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !717)
!717 = !{!718, !722, !723, !724, !725, !727, !734}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !716, file: !47, line: 27, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !720, line: 166, baseType: !721)
!720 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !720, line: 139, baseType: !5)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !716, file: !47, line: 27, baseType: !719, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !716, file: !47, line: 27, baseType: !719, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !716, file: !47, line: 27, baseType: !719, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !716, file: !47, line: 27, baseType: !726, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !716, file: !47, line: 27, baseType: !728, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !730, file: !47, line: 19, baseType: !452, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !730, file: !47, line: 20, baseType: !173, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !716, file: !47, line: 27, baseType: !378, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !346, file: !47, line: 239, baseType: !502, size: 64, offset: 35328)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !346, file: !47, line: 240, baseType: !502, size: 64, offset: 35392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !346, file: !47, line: 241, baseType: !502, size: 64, offset: 35456)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !346, file: !47, line: 242, baseType: !502, size: 64, offset: 35520)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !346, file: !47, line: 243, baseType: !288, size: 32, offset: 35584)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !346, file: !47, line: 245, baseType: !741, size: 64, offset: 35616)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !249)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !346, file: !47, line: 246, baseType: !743, size: 64, offset: 35712)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !744, line: 18, baseType: !745)
!744 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !747, line: 29, size: 5760, elements: !748)
!747 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!748 = !{!749, !750, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !768, !769, !770, !771, !796, !797, !798}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !746, file: !747, line: 30, baseType: !349, size: 4480)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !746, file: !747, line: 30, baseType: !751, size: 32, offset: 4480)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !169)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !746, file: !747, line: 31, baseType: !173, size: 32, offset: 4512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !746, file: !747, line: 31, baseType: !173, size: 32, offset: 4544)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !746, file: !747, line: 32, baseType: !393, size: 64, offset: 4608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !746, file: !747, line: 33, baseType: !288, size: 32, offset: 4672)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !746, file: !747, line: 34, baseType: !288, size: 32, offset: 4704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !746, file: !747, line: 35, baseType: !218, size: 64, offset: 4736)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !746, file: !747, line: 36, baseType: !218, size: 64, offset: 4800)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !746, file: !747, line: 37, baseType: !173, size: 32, offset: 4864)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !746, file: !747, line: 38, baseType: !743, size: 64, offset: 4928)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !746, file: !747, line: 39, baseType: !218, size: 64, offset: 4992)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !746, file: !747, line: 40, baseType: !288, size: 32, offset: 5056)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !746, file: !747, line: 42, baseType: !173, size: 32, offset: 5088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !746, file: !747, line: 43, baseType: !390, size: 64, offset: 5120)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !746, file: !747, line: 44, baseType: !218, size: 64, offset: 5184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !746, file: !747, line: 45, baseType: !767, size: 64, offset: 5248)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !746, file: !747, line: 46, baseType: !288, size: 32, offset: 5312)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !746, file: !747, line: 47, baseType: !389, size: 64, offset: 5376)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !746, file: !747, line: 49, baseType: !114, size: 64, offset: 5440)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !746, file: !747, line: 50, baseType: !772, size: 64, offset: 5504)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !747, line: 27, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !747, line: 27, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !747, line: 27, size: 320, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !789}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !775, file: !747, line: 27, baseType: !719, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !775, file: !747, line: 27, baseType: !719, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !775, file: !747, line: 27, baseType: !719, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !775, file: !747, line: 27, baseType: !719, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !775, file: !747, line: 27, baseType: !726, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !775, file: !747, line: 27, baseType: !783, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !747, line: 10, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !747, line: 8, size: 64, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !785, file: !747, line: 9, baseType: !173, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !785, file: !747, line: 9, baseType: !173, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !775, file: !747, line: 27, baseType: !790, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !747, line: 14, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !747, line: 12, size: 128, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !792, file: !747, line: 13, baseType: !218, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !792, file: !747, line: 13, baseType: !218, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !746, file: !747, line: 51, baseType: !743, size: 64, offset: 5568)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !746, file: !747, line: 52, baseType: !393, size: 64, offset: 5632)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !746, file: !747, line: 53, baseType: !799, size: 64, offset: 5696)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !744, line: 33, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !747, line: 72, size: 4864, elements: !802)
!802 = !{!803, !804, !822, !823, !832}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !801, file: !747, line: 73, baseType: !349, size: 4480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !801, file: !747, line: 73, baseType: !805, size: 192, offset: 4480)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 192, elements: !169)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !747, line: 56, size: 192, elements: !807)
!807 = !{!808, !814, !818}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !806, file: !747, line: 57, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!131, !799, !743, !173, !479, !812, !813}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !806, file: !747, line: 58, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!131, !799}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !806, file: !747, line: 59, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!131, !799, !137}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !747, line: 74, baseType: !113, size: 64, offset: 4672)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !801, file: !747, line: 75, baseType: !824, size: 64, offset: 4736)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !747, line: 62, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !747, line: 64, size: 256, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !747, line: 66, baseType: !824, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !826, file: !747, line: 67, baseType: !812, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !826, file: !747, line: 68, baseType: !813, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !826, file: !747, line: 69, baseType: !173, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !801, file: !747, line: 76, baseType: !824, size: 64, offset: 4800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !346, file: !47, line: 247, baseType: !743, size: 64, offset: 35776)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !346, file: !47, line: 248, baseType: !835, size: 64, offset: 35840)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !394, line: 60, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !837, file: !25, line: 241, baseType: !110, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !25, line: 242, baseType: !190, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !837, file: !25, line: 243, baseType: !173, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !837, file: !25, line: 243, baseType: !173, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !837, file: !25, line: 244, baseType: !173, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !837, file: !25, line: 244, baseType: !173, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !837, file: !25, line: 245, baseType: !218, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !837, file: !25, line: 246, baseType: !288, size: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !837, file: !25, line: 247, baseType: !173, size: 32, offset: 352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !837, file: !25, line: 251, baseType: !173, size: 32, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !837, file: !25, line: 252, baseType: !639, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !837, file: !25, line: 253, baseType: !288, size: 32, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !837, file: !25, line: 254, baseType: !173, size: 32, offset: 544)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !837, file: !25, line: 254, baseType: !173, size: 32, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !837, file: !25, line: 255, baseType: !173, size: 32, offset: 608)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !346, file: !47, line: 250, baseType: !743, size: 64, offset: 35904)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !346, file: !47, line: 251, baseType: !420, size: 64, offset: 35968)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !346, file: !47, line: 253, baseType: !344, size: 64, offset: 36032)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !346, file: !47, line: 254, baseType: !379, size: 64, offset: 36096)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !346, file: !47, line: 255, baseType: !113, size: 64, offset: 36160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !346, file: !47, line: 256, baseType: !860, size: 64, offset: 36224)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!131, !344, !113}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !346, file: !47, line: 257, baseType: !860, size: 64, offset: 36288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !346, file: !47, line: 258, baseType: !865, size: 64, offset: 36352)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!131, !344, !540, !288, !813, !113}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !346, file: !47, line: 260, baseType: !173, size: 32, offset: 36416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !346, file: !47, line: 261, baseType: !344, size: 64, offset: 36480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !346, file: !47, line: 262, baseType: !379, size: 64, offset: 36544)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !346, file: !47, line: 263, baseType: !379, size: 64, offset: 36608)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !346, file: !47, line: 264, baseType: !288, size: 32, offset: 36672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !346, file: !47, line: 265, baseType: !403, size: 64, offset: 36736)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !346, file: !47, line: 266, baseType: !226, size: 64, offset: 36800)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !346, file: !47, line: 266, baseType: !226, size: 64, offset: 36864)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !346, file: !47, line: 267, baseType: !877, size: 64, offset: 36928)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !346, file: !47, line: 269, baseType: !880, size: 640, offset: 36992)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 640, elements: !889)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!131, !344, !173, !173, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !93, line: 1723, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !93, line: 1723, flags: DIFlagFwdDecl)
!889 = !{!890}
!890 = !DISubrange(count: 10)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !346, file: !47, line: 270, baseType: !880, size: 640, offset: 37632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !346, file: !47, line: 272, baseType: !173, size: 32, offset: 38272)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !346, file: !47, line: 273, baseType: !894, size: 64, offset: 38336)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !896, file: !47, line: 174, baseType: !114, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !896, file: !47, line: 175, baseType: !452, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !896, file: !47, line: 176, baseType: !741, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !896, file: !47, line: 177, baseType: !288, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !346, file: !47, line: 274, baseType: !903, size: 64, offset: 38400)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !906)
!906 = !{!907, !988, !989}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !905, file: !47, line: 168, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !909, line: 11, baseType: !910)
!909 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !909, line: 13, size: 832, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !979, !981, !982, !983, !984, !985, !986, !987}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !911, file: !909, line: 14, baseType: !150, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !911, file: !909, line: 15, baseType: !452, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !911, file: !909, line: 16, baseType: !150, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !911, file: !909, line: 17, baseType: !173, size: 32, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !911, file: !909, line: 18, baseType: !218, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !911, file: !909, line: 19, baseType: !919, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !920, line: 22, baseType: !921)
!920 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !909, line: 81, size: 4992, elements: !923)
!923 = !{!924, !925, !939, !940, !941, !950}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !922, file: !909, line: 82, baseType: !349, size: 4480)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !922, file: !909, line: 82, baseType: !926, size: 256, offset: 4480)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 256, elements: !169)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !909, line: 74, size: 256, elements: !928)
!928 = !{!929, !933, !934, !938}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !927, file: !909, line: 75, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!131, !919}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !927, file: !909, line: 76, baseType: !930, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !927, file: !909, line: 77, baseType: !935, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!131, !919, !137}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !927, file: !909, line: 78, baseType: !930, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !922, file: !909, line: 83, baseType: !113, size: 64, offset: 4736)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !922, file: !909, line: 85, baseType: !173, size: 32, offset: 4800)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !922, file: !909, line: 86, baseType: !942, size: 64, offset: 4864)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !909, line: 41, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !909, line: 36, size: 256, elements: !945)
!945 = !{!946, !947, !948, !949}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !944, file: !909, line: 37, baseType: !284, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !944, file: !909, line: 38, baseType: !284, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !944, file: !909, line: 39, baseType: !284, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !944, file: !909, line: 40, baseType: !200, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !922, file: !909, line: 87, baseType: !951, size: 64, offset: 4928)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !909, line: 54, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !909, line: 54, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !909, line: 54, size: 320, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !971}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !955, file: !909, line: 54, baseType: !719, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !955, file: !909, line: 54, baseType: !719, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !955, file: !909, line: 54, baseType: !719, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !955, file: !909, line: 54, baseType: !719, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !955, file: !909, line: 54, baseType: !726, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !955, file: !909, line: 54, baseType: !963, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !920, line: 41, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !920, line: 35, size: 192, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !965, file: !920, line: 37, baseType: !452, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !965, file: !920, line: 38, baseType: !173, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !965, file: !920, line: 39, baseType: !173, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !965, file: !920, line: 40, baseType: !173, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !955, file: !909, line: 54, baseType: !972, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !909, line: 34, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !909, line: 30, size: 96, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !974, file: !909, line: 31, baseType: !173, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !974, file: !909, line: 32, baseType: !173, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !974, file: !909, line: 33, baseType: !173, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !911, file: !909, line: 20, baseType: !980, size: 32, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !911, file: !909, line: 21, baseType: !173, size: 32, offset: 416)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !911, file: !909, line: 22, baseType: !173, size: 32, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !911, file: !909, line: 23, baseType: !218, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !911, file: !909, line: 24, baseType: !161, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !911, file: !909, line: 25, baseType: !161, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !911, file: !909, line: 26, baseType: !113, size: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !909, line: 27, baseType: !908, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !905, file: !47, line: 169, baseType: !452, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !47, line: 170, baseType: !903, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !346, file: !47, line: 275, baseType: !173, size: 32, offset: 38464)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !346, file: !47, line: 276, baseType: !992, size: 64, offset: 38528)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !995)
!995 = !{!996, !1077, !1078}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !994, file: !47, line: 181, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !920, line: 13, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !909, line: 98, size: 7232, elements: !1000)
!1000 = !{!1001, !1002, !1016, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !999, file: !909, line: 99, baseType: !349, size: 4480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !999, file: !909, line: 99, baseType: !1003, size: 256, offset: 4480)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 256, elements: !169)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !909, line: 91, size: 256, elements: !1005)
!1005 = !{!1006, !1010, !1011, !1015}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1004, file: !909, line: 92, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!131, !997}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1004, file: !909, line: 93, baseType: !1007, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1004, file: !909, line: 94, baseType: !1012, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!131, !997, !137}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1004, file: !909, line: 95, baseType: !1007, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !999, file: !909, line: 100, baseType: !113, size: 64, offset: 4736)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !999, file: !909, line: 101, baseType: !1018, size: 64, offset: 4800)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !999, file: !909, line: 102, baseType: !288, size: 32, offset: 4864)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !999, file: !909, line: 103, baseType: !288, size: 32, offset: 4896)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !999, file: !909, line: 104, baseType: !173, size: 32, offset: 4928)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !999, file: !909, line: 105, baseType: !173, size: 32, offset: 4960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !999, file: !909, line: 106, baseType: !145, size: 64, offset: 4992)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !999, file: !909, line: 108, baseType: !908, size: 64, offset: 5056)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !999, file: !909, line: 109, baseType: !288, size: 32, offset: 5120)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !999, file: !909, line: 110, baseType: !436, size: 64, offset: 5184)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !999, file: !909, line: 111, baseType: !218, size: 64, offset: 5248)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !999, file: !909, line: 112, baseType: !919, size: 64, offset: 5312)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !999, file: !909, line: 113, baseType: !1030, size: 64, offset: 5376)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !1032, line: 563, baseType: !552)
!1032 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !999, file: !909, line: 114, baseType: !1034, size: 64, offset: 5440)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !1032, line: 580, baseType: !537)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !999, file: !909, line: 115, baseType: !542, size: 64, offset: 5504)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !999, file: !909, line: 116, baseType: !1034, size: 64, offset: 5568)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !999, file: !909, line: 117, baseType: !542, size: 64, offset: 5632)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !999, file: !909, line: 118, baseType: !173, size: 32, offset: 5696)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !999, file: !909, line: 119, baseType: !235, size: 64, offset: 5760)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !999, file: !909, line: 120, baseType: !542, size: 64, offset: 5824)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !999, file: !909, line: 122, baseType: !173, size: 32, offset: 5888)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !999, file: !909, line: 123, baseType: !173, size: 32, offset: 5920)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !999, file: !909, line: 124, baseType: !218, size: 64, offset: 5952)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !999, file: !909, line: 125, baseType: !218, size: 64, offset: 6016)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !999, file: !909, line: 126, baseType: !218, size: 64, offset: 6080)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !999, file: !909, line: 127, baseType: !218, size: 64, offset: 6144)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !999, file: !909, line: 128, baseType: !1049, size: 64, offset: 6208)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
