; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmresdeflation.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmresdeflation.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !{!126, !174, !177, !256, !198, !623, !327, !681, !246, !26}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_AGMRES", file: !128, line: 34, baseType: !129)
!128 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/agmres/agmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 10, size: 5056, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !141, !142, !144, !145, !146, !148, !149, !600, !602, !603, !604, !605, !606, !607, !608, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !129, file: !128, line: 11, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !135)
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !129, file: !128, line: 11, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !129, file: !128, line: 11, baseType: !134, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !129, file: !128, line: 11, baseType: !150, size: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !154, !147}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !157)
!157 = !{!158, !361, !415, !420, !421, !422, !423, !453, !454, !455, !456, !457, !459, !464, !465, !466, !467, !468, !469, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !493, !499, !500, !501, !502, !507, !508, !509, !510, !515, !516, !517, !518, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !570, !571, !572, !573, !574, !581, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !597, !598, !599}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !156, file: !102, line: 76, baseType: !159, size: 4480)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !160, line: 122, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !160, line: 73, size: 4480, elements: !162)
!162 = !{!163, !165, !219, !220, !221, !223, !224, !225, !226, !234, !235, !237, !241, !245, !247, !248, !249, !250, !251, !252, !253, !254, !255, !257, !259, !260, !261, !263, !264, !266, !268, !269, !270, !271, !272, !273, !275, !276, !277, !278, !279, !280, !282, !283, !284, !294, !296, !297, !301, !302, !351, !356, !358, !359, !360}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !161, file: !160, line: 74, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !161, file: !160, line: 75, baseType: !166, size: 448, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 448, elements: !217)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !160, line: 53, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 45, size: 448, elements: !169)
!169 = !{!170, !181, !189, !194, !201, !205, !212}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !168, file: !160, line: 46, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!153, !174, !176}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !178, line: 330, baseType: !179)
!178 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !178, line: 330, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !168, file: !160, line: 47, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!153, !174, !185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !186, line: 16, baseType: !187)
!186 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !186, line: 16, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !168, file: !160, line: 48, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!153, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !168, file: !160, line: 49, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!153, !174, !198, !174}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !168, file: !160, line: 50, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!153, !174, !198, !193}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !168, file: !160, line: 51, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!153, !174, !198, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !168, file: !160, line: 52, baseType: !213, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!153, !174, !198, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!217 = !{!218}
!218 = !DISubrange(count: 1)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !161, file: !160, line: 76, baseType: !177, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !160, line: 77, baseType: !147, size: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !161, file: !160, line: 78, baseType: !222, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !135)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !161, file: !160, line: 78, baseType: !222, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !161, file: !160, line: 78, baseType: !222, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !161, file: !160, line: 78, baseType: !222, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !161, file: !160, line: 79, baseType: !227, size: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !230, line: 27, baseType: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !232, line: 43, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!233 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !161, file: !160, line: 80, baseType: !147, size: 32, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !161, file: !160, line: 81, baseType: !236, size: 32, offset: 992)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !161, file: !160, line: 82, baseType: !238, size: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !161, file: !160, line: 83, baseType: !242, size: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !161, file: !160, line: 84, baseType: !246, size: 64, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !161, file: !160, line: 85, baseType: !246, size: 64, offset: 1216)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !161, file: !160, line: 86, baseType: !246, size: 64, offset: 1280)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !161, file: !160, line: 87, baseType: !246, size: 64, offset: 1344)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !160, line: 88, baseType: !174, size: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !161, file: !160, line: 89, baseType: !227, size: 64, offset: 1472)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !160, line: 90, baseType: !246, size: 64, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !161, file: !160, line: 91, baseType: !246, size: 64, offset: 1600)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !161, file: !160, line: 92, baseType: !147, size: 32, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !161, file: !160, line: 93, baseType: !256, size: 64, offset: 1728)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !161, file: !160, line: 94, baseType: !258, size: 64, offset: 1792)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !228)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !161, file: !160, line: 95, baseType: !147, size: 32, offset: 1856)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !161, file: !160, line: 95, baseType: !147, size: 32, offset: 1888)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !161, file: !160, line: 96, baseType: !262, size: 64, offset: 1920)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !161, file: !160, line: 96, baseType: !262, size: 64, offset: 1984)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !161, file: !160, line: 97, baseType: !265, size: 64, offset: 2048)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !161, file: !160, line: 97, baseType: !267, size: 64, offset: 2112)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !161, file: !160, line: 98, baseType: !147, size: 32, offset: 2176)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !161, file: !160, line: 98, baseType: !147, size: 32, offset: 2208)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !161, file: !160, line: 99, baseType: !262, size: 64, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !161, file: !160, line: 99, baseType: !262, size: 64, offset: 2304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !161, file: !160, line: 100, baseType: !143, size: 64, offset: 2368)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !161, file: !160, line: 100, baseType: !274, size: 64, offset: 2432)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !161, file: !160, line: 101, baseType: !147, size: 32, offset: 2496)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !161, file: !160, line: 101, baseType: !147, size: 32, offset: 2528)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !161, file: !160, line: 102, baseType: !262, size: 64, offset: 2560)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !161, file: !160, line: 102, baseType: !262, size: 64, offset: 2624)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !161, file: !160, line: 103, baseType: !132, size: 64, offset: 2688)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !161, file: !160, line: 103, baseType: !281, size: 64, offset: 2752)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !161, file: !160, line: 104, baseType: !216, size: 64, offset: 2816)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !161, file: !160, line: 105, baseType: !147, size: 32, offset: 2880)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !161, file: !160, line: 106, baseType: !285, size: 128, offset: 2944)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 128, elements: !292)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !160, line: 64, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 61, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !288, file: !160, line: 62, baseType: !209, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !288, file: !160, line: 63, baseType: !256, size: 64, offset: 64)
!292 = !{!293}
!293 = !DISubrange(count: 2)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !161, file: !160, line: 107, baseType: !295, size: 64, offset: 3072)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !292)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !161, file: !160, line: 108, baseType: !256, size: 64, offset: 3136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !161, file: !160, line: 109, baseType: !298, size: 64, offset: 3200)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!153, !256}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !161, file: !160, line: 111, baseType: !147, size: 32, offset: 3264)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !161, file: !160, line: 112, baseType: !303, size: 320, offset: 3328)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 320, elements: !349)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!153, !307, !174, !256}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !310)
!310 = !{!311, !312, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !309, file: !10, line: 100, baseType: !147, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !10, line: 101, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !324, !325, !326, !330, !332, !334, !335, !336}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !315, file: !10, line: 84, baseType: !246, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !315, file: !10, line: 85, baseType: !246, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !10, line: 86, baseType: !256, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !315, file: !10, line: 87, baseType: !238, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !315, file: !10, line: 88, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !315, file: !10, line: 89, baseType: !200, size: 8, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !315, file: !10, line: 90, baseType: !246, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !315, file: !10, line: 91, baseType: !327, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !328, line: 46, baseType: !329)
!328 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!329 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !10, line: 92, baseType: !331, size: 32, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !10, line: 93, baseType: !333, size: 32, offset: 544)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !10, line: 94, baseType: !313, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !315, file: !10, line: 95, baseType: !246, size: 64, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !315, file: !10, line: 96, baseType: !256, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !309, file: !10, line: 102, baseType: !246, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !309, file: !10, line: 102, baseType: !246, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !309, file: !10, line: 103, baseType: !246, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !309, file: !10, line: 104, baseType: !177, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !309, file: !10, line: 105, baseType: !331, size: 32, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !309, file: !10, line: 105, baseType: !331, size: 32, offset: 416)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !309, file: !10, line: 105, baseType: !331, size: 32, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !309, file: !10, line: 106, baseType: !174, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !309, file: !10, line: 107, baseType: !346, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!349 = !{!350}
!350 = !DISubrange(count: 5)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !161, file: !160, line: 113, baseType: !352, size: 320, offset: 3648)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 320, elements: !349)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!153, !174, !256}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !161, file: !160, line: 114, baseType: !357, size: 320, offset: 3968)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 320, elements: !349)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !161, file: !160, line: 115, baseType: !331, size: 32, offset: 4288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !161, file: !160, line: 120, baseType: !346, size: 64, offset: 4352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !161, file: !160, line: 121, baseType: !331, size: 32, offset: 4416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !156, file: !102, line: 76, baseType: !362, size: 896, offset: 4480)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 896, elements: !217)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !364)
!364 = !{!365, !374, !378, !382, !390, !391, !395, !396, !400, !404, !408, !409, !413, !414}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !363, file: !102, line: 19, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!153, !154, !369, !373}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !370, line: 21, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !370, line: 21, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !363, file: !102, line: 22, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!153, !154, !369, !369, !373}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !363, file: !102, line: 25, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!153, !154}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !363, file: !102, line: 26, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!153, !154, !386, !386}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !387, line: 16, baseType: !388)
!387 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !387, line: 16, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !363, file: !102, line: 27, baseType: !379, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !363, file: !102, line: 28, baseType: !392, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!153, !307, !154}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !363, file: !102, line: 29, baseType: !379, size: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !363, file: !102, line: 30, baseType: !397, size: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!153, !154, !143, !143}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !363, file: !102, line: 31, baseType: !401, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!153, !154, !147, !143, !143, !265}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !363, file: !102, line: 32, baseType: !405, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!153, !154, !331, !331, !265, !373, !143, !143}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !363, file: !102, line: 33, baseType: !379, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !363, file: !102, line: 34, baseType: !410, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!153, !154, !185}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !363, file: !102, line: 35, baseType: !379, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !363, file: !102, line: 36, baseType: !410, size: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !156, file: !102, line: 77, baseType: !416, size: 64, offset: 5376)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !417, line: 14, baseType: !418)
!417 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !417, line: 14, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !156, file: !102, line: 78, baseType: !331, size: 32, offset: 5440)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !156, file: !102, line: 79, baseType: !331, size: 32, offset: 5472)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !156, file: !102, line: 81, baseType: !147, size: 32, offset: 5504)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !156, file: !102, line: 82, baseType: !424, size: 64, offset: 5568)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !427)
!427 = !{!428, !429, !449, !450, !451, !452}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !426, file: !102, line: 55, baseType: !159, size: 4480)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !426, file: !102, line: 55, baseType: !430, size: 448, offset: 4480)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 448, elements: !217)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !432)
!432 = !{!433, !437, !438, !442, !443, !444, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !431, file: !102, line: 42, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!153, !424, !369, !369}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !431, file: !102, line: 43, baseType: !434, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !431, file: !102, line: 44, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!153, !424}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !431, file: !102, line: 45, baseType: !439, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !431, file: !102, line: 46, baseType: !439, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !431, file: !102, line: 47, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!153, !424, !185}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !431, file: !102, line: 48, baseType: !439, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !426, file: !102, line: 56, baseType: !154, size: 64, offset: 4928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !426, file: !102, line: 57, baseType: !386, size: 64, offset: 4992)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !426, file: !102, line: 58, baseType: !258, size: 64, offset: 5056)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !102, line: 59, baseType: !256, size: 64, offset: 5120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !156, file: !102, line: 83, baseType: !331, size: 32, offset: 5632)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !156, file: !102, line: 84, baseType: !331, size: 32, offset: 5664)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !156, file: !102, line: 85, baseType: !331, size: 32, offset: 5696)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !156, file: !102, line: 86, baseType: !331, size: 32, offset: 5728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !156, file: !102, line: 87, baseType: !458, size: 32, offset: 5760)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !156, file: !102, line: 88, baseType: !460, size: 384, offset: 5792)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 384, elements: !461)
!461 = !{!462, !463}
!462 = !DISubrange(count: 4)
!463 = !DISubrange(count: 3)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !156, file: !102, line: 89, baseType: !134, size: 64, offset: 6208)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !156, file: !102, line: 90, baseType: !134, size: 64, offset: 6272)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !156, file: !102, line: 91, baseType: !134, size: 64, offset: 6336)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !156, file: !102, line: 92, baseType: !134, size: 64, offset: 6400)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !156, file: !102, line: 93, baseType: !134, size: 64, offset: 6464)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !156, file: !102, line: 94, baseType: !134, size: 64, offset: 6528)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !156, file: !102, line: 95, baseType: !471, size: 32, offset: 6592)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !156, file: !102, line: 96, baseType: !331, size: 32, offset: 6624)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !156, file: !102, line: 98, baseType: !369, size: 64, offset: 6656)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !156, file: !102, line: 98, baseType: !369, size: 64, offset: 6720)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !156, file: !102, line: 102, baseType: !143, size: 64, offset: 6784)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !156, file: !102, line: 103, baseType: !143, size: 64, offset: 6848)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !156, file: !102, line: 104, baseType: !147, size: 32, offset: 6912)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !156, file: !102, line: 105, baseType: !147, size: 32, offset: 6944)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !156, file: !102, line: 106, baseType: !331, size: 32, offset: 6976)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !156, file: !102, line: 107, baseType: !143, size: 64, offset: 7040)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !156, file: !102, line: 108, baseType: !143, size: 64, offset: 7104)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !156, file: !102, line: 109, baseType: !147, size: 32, offset: 7168)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !156, file: !102, line: 110, baseType: !147, size: 32, offset: 7200)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !156, file: !102, line: 111, baseType: !331, size: 32, offset: 7232)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !156, file: !102, line: 113, baseType: !147, size: 32, offset: 7264)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !156, file: !102, line: 114, baseType: !331, size: 32, offset: 7296)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !156, file: !102, line: 117, baseType: !147, size: 32, offset: 7328)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !156, file: !102, line: 120, baseType: !489, size: 320, offset: 7360)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !349)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!153, !154, !147, !134, !256}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !156, file: !102, line: 121, baseType: !494, size: 320, offset: 7680)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 320, elements: !349)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!153, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !156, file: !102, line: 122, baseType: !357, size: 320, offset: 8000)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !156, file: !102, line: 123, baseType: !147, size: 32, offset: 8320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !156, file: !102, line: 124, baseType: !331, size: 32, offset: 8352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !156, file: !102, line: 126, baseType: !503, size: 320, offset: 8384)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !349)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!153, !154, !256}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !156, file: !102, line: 127, baseType: !494, size: 320, offset: 8704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !156, file: !102, line: 128, baseType: !357, size: 320, offset: 9024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !156, file: !102, line: 129, baseType: !147, size: 32, offset: 9344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !156, file: !102, line: 131, baseType: !511, size: 64, offset: 9408)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!153, !154, !147, !134, !514, !256}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !156, file: !102, line: 132, baseType: !298, size: 64, offset: 9472)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !156, file: !102, line: 133, baseType: !256, size: 64, offset: 9536)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !156, file: !102, line: 135, baseType: !256, size: 64, offset: 9600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !156, file: !102, line: 137, baseType: !519, size: 64, offset: 9664)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !102, line: 139, baseType: !256, size: 64, offset: 9728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9824)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9888)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 9984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10016)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10112)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10144)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10176)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !156, file: !102, line: 142, baseType: !331, size: 32, offset: 10208)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10240)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10368)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10432)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10496)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10560)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10624)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10688)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10752)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10816)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10880)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 10944)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 11008)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !156, file: !102, line: 143, baseType: !185, size: 64, offset: 11072)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11136)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11168)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11200)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11232)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11264)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11296)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11360)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11392)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11424)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11456)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11488)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11520)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !156, file: !102, line: 144, baseType: !552, size: 32, offset: 11552)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !156, file: !102, line: 147, baseType: !147, size: 32, offset: 11584)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !156, file: !102, line: 148, baseType: !373, size: 64, offset: 11648)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !156, file: !102, line: 150, baseType: !569, size: 32, offset: 11712)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !156, file: !102, line: 151, baseType: !331, size: 32, offset: 11744)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !156, file: !102, line: 153, baseType: !147, size: 32, offset: 11776)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !156, file: !102, line: 154, baseType: !147, size: 32, offset: 11808)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !156, file: !102, line: 156, baseType: !331, size: 32, offset: 11840)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !156, file: !102, line: 161, baseType: !575, size: 192, offset: 11904)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !102, line: 157, size: 192, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !575, file: !102, line: 158, baseType: !386, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !575, file: !102, line: 158, baseType: !386, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !575, file: !102, line: 159, baseType: !331, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !575, file: !102, line: 160, baseType: !331, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !156, file: !102, line: 163, baseType: !582, size: 32, offset: 12096)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !156, file: !102, line: 165, baseType: !458, size: 32, offset: 12128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !156, file: !102, line: 166, baseType: !582, size: 32, offset: 12160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !156, file: !102, line: 171, baseType: !331, size: 32, offset: 12192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !156, file: !102, line: 172, baseType: !331, size: 32, offset: 12224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !156, file: !102, line: 173, baseType: !331, size: 32, offset: 12256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !156, file: !102, line: 174, baseType: !369, size: 64, offset: 12288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !156, file: !102, line: 175, baseType: !369, size: 64, offset: 12352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !156, file: !102, line: 177, baseType: !147, size: 32, offset: 12416)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !156, file: !102, line: 178, baseType: !331, size: 32, offset: 12448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !156, file: !102, line: 180, baseType: !185, size: 64, offset: 12480)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !156, file: !102, line: 182, baseType: !594, size: 64, offset: 12544)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!153, !154, !369, !369, !256}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !156, file: !102, line: 183, baseType: !594, size: 64, offset: 12608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !156, file: !102, line: 184, baseType: !256, size: 64, offset: 12672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !156, file: !102, line: 184, baseType: !256, size: 64, offset: 12736)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !129, file: !128, line: 11, baseType: !601, size: 32, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !129, file: !128, line: 11, baseType: !373, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !129, file: !128, line: 11, baseType: !373, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 992)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 1024)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 1056)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !129, file: !128, line: 11, baseType: !609, size: 64, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !129, file: !128, line: 11, baseType: !265, size: 64, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 1248)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !129, file: !128, line: 11, baseType: !147, size: 32, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !129, file: !128, line: 11, baseType: !132, size: 64, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !129, file: !128, line: 11, baseType: !369, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !129, file: !128, line: 11, baseType: !134, size: 64, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !129, file: !128, line: 11, baseType: !134, size: 64, offset: 1536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !129, file: !128, line: 12, baseType: !373, size: 64, offset: 1600)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 1664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "TF", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 1728)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "InvP", scope: !129, file: !128, line: 12, baseType: !622, size: 64, offset: 1792)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !4, line: 140, baseType: !26)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "neig", scope: !129, file: !128, line: 12, baseType: !147, size: 32, offset: 1856)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !129, file: !128, line: 12, baseType: !147, size: 32, offset: 1888)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_neig", scope: !129, file: !128, line: 12, baseType: !147, size: 32, offset: 1920)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lambdaN", scope: !129, file: !128, line: 12, baseType: !134, size: 64, offset: 1984)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "smv", scope: !129, file: !128, line: 12, baseType: !134, size: 64, offset: 2048)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !129, file: !128, line: 12, baseType: !331, size: 32, offset: 2112)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matvecs", scope: !129, file: !128, line: 12, baseType: !147, size: 32, offset: 2144)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "GreatestEig", scope: !129, file: !128, line: 12, baseType: !147, size: 32, offset: 2176)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "wr", scope: !129, file: !128, line: 12, baseType: !143, size: 64, offset: 2240)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "wi", scope: !129, file: !128, line: 12, baseType: !143, size: 64, offset: 2304)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "modul", scope: !129, file: !128, line: 12, baseType: !143, size: 64, offset: 2368)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 2432)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 2496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !129, file: !128, line: 12, baseType: !265, size: 64, offset: 2560)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !129, file: !128, line: 12, baseType: !373, size: 64, offset: 2624)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Sr", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 2688)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !129, file: !128, line: 12, baseType: !373, size: 64, offset: 2752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !129, file: !128, line: 12, baseType: !373, size: 64, offset: 2816)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "umx", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 2880)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "xmu", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 2944)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3008)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3072)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3136)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Sr2", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3200)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "auau", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3264)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "auu", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3328)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !129, file: !128, line: 12, baseType: !132, size: 64, offset: 3392)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iwork", scope: !129, file: !128, line: 12, baseType: !622, size: 64, offset: 3456)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "orth", scope: !129, file: !128, line: 12, baseType: !143, size: 64, offset: 3520)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "HasSchur", scope: !129, file: !128, line: 12, baseType: !331, size: 32, offset: 3584)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !129, file: !128, line: 12, baseType: !331, size: 32, offset: 3616)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bgv", scope: !129, file: !128, line: 15, baseType: !134, size: 64, offset: 3648)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ritz", scope: !129, file: !128, line: 16, baseType: !331, size: 32, offset: 3712)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "DeflPrecond", scope: !129, file: !128, line: 17, baseType: !331, size: 32, offset: 3744)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Qloc", scope: !129, file: !128, line: 18, baseType: !132, size: 64, offset: 3776)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Rloc", scope: !129, file: !128, line: 19, baseType: !132, size: 64, offset: 3840)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Rshift", scope: !129, file: !128, line: 20, baseType: !132, size: 64, offset: 3904)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Ishift", scope: !129, file: !128, line: 20, baseType: !132, size: 64, offset: 3968)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Scale", scope: !129, file: !128, line: 21, baseType: !132, size: 64, offset: 4032)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "HasShifts", scope: !129, file: !128, line: 22, baseType: !331, size: 32, offset: 4096)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !129, file: !128, line: 23, baseType: !236, size: 32, offset: 4128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !128, line: 23, baseType: !236, size: 32, offset: 4160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "First", scope: !129, file: !128, line: 24, baseType: !236, size: 32, offset: 4192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Last", scope: !129, file: !128, line: 24, baseType: !236, size: 32, offset: 4224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Ileft", scope: !129, file: !128, line: 24, baseType: !236, size: 32, offset: 4256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Iright", scope: !129, file: !128, line: 24, baseType: !236, size: 32, offset: 4288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "MatEigL", scope: !129, file: !128, line: 25, baseType: !132, size: 64, offset: 4352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "MatEigR", scope: !129, file: !128, line: 25, baseType: !132, size: 64, offset: 4416)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sgn", scope: !129, file: !128, line: 26, baseType: !132, size: 64, offset: 4480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tloc", scope: !129, file: !128, line: 27, baseType: !132, size: 64, offset: 4544)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "TmpU", scope: !129, file: !128, line: 28, baseType: !373, size: 64, offset: 4608)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !129, file: !128, line: 29, baseType: !132, size: 64, offset: 4672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !129, file: !128, line: 30, baseType: !622, size: 64, offset: 4736)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !129, file: !128, line: 31, baseType: !132, size: 64, offset: 4800)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "wbufptr", scope: !129, file: !128, line: 31, baseType: !132, size: 64, offset: 4864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !129, file: !128, line: 32, baseType: !132, size: 64, offset: 4928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !129, file: !128, line: 33, baseType: !236, size: 32, offset: 4992)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !178, line: 331, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !178, line: 331, flags: DIFlagFwdDecl)
!684 = !{i32 7, !"Dwarf Version", i32 4}
!685 = !{i32 2, !"Debug Info Version", i32 3}
!686 = !{i32 1, !"wchar_size", i32 4}
!687 = !{i32 7, !"PIC Level", i32 2}
!688 = !{i32 7, !"uwtable", i32 1}
!689 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!690 = distinct !DISubprogram(name: "KSPAGMRESComputeDeflationData", scope: !691, file: !691, line: 186, type: !380, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !692)
!691 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmresdeflation.c", directory: "/home/users/ndemeye/xSDK")
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !716, !718, !720, !722, !726, !728, !735, !740, !745, !749, !752, !756, !761, !766, !768, !770}
!693 = !DILocalVariable(name: "ksp", arg: 1, scope: !690, file: !691, line: 186, type: !154)
!694 = !DILocalVariable(name: "agmres", scope: !690, file: !691, line: 188, type: !126)
!695 = !DILocalVariable(name: "U", scope: !690, file: !691, line: 189, type: !373)
!696 = !DILocalVariable(name: "TmpU", scope: !690, file: !691, line: 190, type: !373)
!697 = !DILocalVariable(name: "MatEigL", scope: !690, file: !691, line: 191, type: !132)
!698 = !DILocalVariable(name: "MatEigR", scope: !690, file: !691, line: 192, type: !132)
!699 = !DILocalVariable(name: "Sr", scope: !690, file: !691, line: 193, type: !132)
!700 = !DILocalVariable(name: "alpha", scope: !690, file: !691, line: 194, type: !133)
!701 = !DILocalVariable(name: "beta", scope: !690, file: !691, line: 194, type: !133)
!702 = !DILocalVariable(name: "i", scope: !690, file: !691, line: 195, type: !147)
!703 = !DILocalVariable(name: "j", scope: !690, file: !691, line: 195, type: !147)
!704 = !DILocalVariable(name: "ierr", scope: !690, file: !691, line: 196, type: !153)
!705 = !DILocalVariable(name: "max_k", scope: !690, file: !691, line: 197, type: !147)
!706 = !DILocalVariable(name: "CurNeig", scope: !690, file: !691, line: 198, type: !147)
!707 = !DILocalVariable(name: "N", scope: !690, file: !691, line: 199, type: !147)
!708 = !DILocalVariable(name: "bN", scope: !690, file: !691, line: 200, type: !623)
!709 = !DILocalVariable(name: "lC", scope: !690, file: !691, line: 201, type: !147)
!710 = !DILocalVariable(name: "KspSize", scope: !690, file: !691, line: 202, type: !147)
!711 = !DILocalVariable(name: "blC", scope: !690, file: !691, line: 203, type: !623)
!712 = !DILocalVariable(name: "bKspSize", scope: !690, file: !691, line: 203, type: !623)
!713 = !DILocalVariable(name: "PrevNeig", scope: !690, file: !691, line: 204, type: !147)
!714 = !DILocalVariable(name: "ierr__", scope: !715, file: !691, line: 207, type: !153)
!715 = distinct !DILexicalBlock(scope: !690, file: !691, line: 207, column: 73)
!716 = !DILocalVariable(name: "ierr__", scope: !717, file: !691, line: 212, type: !153)
!717 = distinct !DILexicalBlock(scope: !690, file: !691, line: 212, column: 46)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !691, line: 213, type: !153)
!719 = distinct !DILexicalBlock(scope: !690, file: !691, line: 213, column: 36)
!720 = !DILocalVariable(name: "ierr__", scope: !721, file: !691, line: 214, type: !153)
!721 = distinct !DILexicalBlock(scope: !690, file: !691, line: 214, column: 34)
!722 = !DILocalVariable(name: "_7_ierr", scope: !723, file: !691, line: 215, type: !153)
