; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/mpi/mpisbaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/mpi/mpisbaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!318 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 119, baseType: !7, size: 32, elements: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!332 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!374 = !{!375, !393, !474, !414, !583, !1437, !1547, !549, !1592, !1380, !454, !1255, !1637, !464, !74, !1640, !409, !492, !500, !1642, !668, !437, !551, !7, !440, !1643, !439}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !378, line: 73, size: 4480, elements: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!379 = !{!380, !382, !435, !436, !438, !441, !442, !443, !444, !452, !453, !455, !459, !463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !475, !477, !478, !479, !481, !482, !484, !486, !487, !488, !489, !490, !493, !495, !496, !497, !498, !499, !502, !504, !505, !506, !516, !518, !519, !523, !524, !573, !578, !580, !581, !582}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !377, file: !378, line: 74, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !377, file: !378, line: 75, baseType: !383, size: 448, offset: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 448, elements: !433)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !378, line: 53, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 45, size: 448, elements: !386)
!386 = !{!387, !397, !405, !410, !417, !421, !428}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !385, file: !378, line: 46, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!391, !375, !392}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !394, line: 330, baseType: !395)
!394 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !394, line: 330, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !385, file: !378, line: 47, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!391, !375, !401}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !402, line: 16, baseType: !403)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !402, line: 16, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !385, file: !378, line: 48, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!391, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !385, file: !378, line: 49, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!391, !375, !414, !375}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !385, file: !378, line: 50, baseType: !418, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!391, !375, !414, !409}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !385, file: !378, line: 51, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!391, !375, !414, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !385, file: !378, line: 52, baseType: !429, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!391, !375, !414, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!433 = !{!434}
!434 = !DISubrange(count: 1)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !377, file: !378, line: 76, baseType: !393, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !378, line: 77, baseType: !437, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !377, file: !378, line: 78, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !440)
!440 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !377, file: !378, line: 78, baseType: !439, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !377, file: !378, line: 78, baseType: !439, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !377, file: !378, line: 78, baseType: !439, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !378, line: 79, baseType: !445, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !448, line: 27, baseType: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !450, line: 43, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!451 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !377, file: !378, line: 80, baseType: !437, size: 32, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !377, file: !378, line: 81, baseType: !454, size: 32, offset: 992)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !377, file: !378, line: 82, baseType: !456, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !377, file: !378, line: 83, baseType: !460, size: 64, offset: 1088)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !377, file: !378, line: 84, baseType: !464, size: 64, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !377, file: !378, line: 85, baseType: !464, size: 64, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !377, file: !378, line: 86, baseType: !464, size: 64, offset: 1280)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !377, file: !378, line: 87, baseType: !464, size: 64, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !377, file: !378, line: 88, baseType: !375, size: 64, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !377, file: !378, line: 89, baseType: !445, size: 64, offset: 1472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !378, line: 90, baseType: !464, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !377, file: !378, line: 91, baseType: !464, size: 64, offset: 1600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !377, file: !378, line: 92, baseType: !437, size: 32, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !377, file: !378, line: 93, baseType: !474, size: 64, offset: 1728)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !378, line: 94, baseType: !476, size: 64, offset: 1792)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !446)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !377, file: !378, line: 95, baseType: !437, size: 32, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !377, file: !378, line: 95, baseType: !437, size: 32, offset: 1888)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !377, file: !378, line: 96, baseType: !480, size: 64, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !377, file: !378, line: 96, baseType: !480, size: 64, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !377, file: !378, line: 97, baseType: !483, size: 64, offset: 2048)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !377, file: !378, line: 97, baseType: !485, size: 64, offset: 2112)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !377, file: !378, line: 98, baseType: !437, size: 32, offset: 2176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !377, file: !378, line: 98, baseType: !437, size: 32, offset: 2208)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !377, file: !378, line: 99, baseType: !480, size: 64, offset: 2240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !377, file: !378, line: 99, baseType: !480, size: 64, offset: 2304)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !377, file: !378, line: 100, baseType: !491, size: 64, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !440)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !377, file: !378, line: 100, baseType: !494, size: 64, offset: 2432)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !377, file: !378, line: 101, baseType: !437, size: 32, offset: 2496)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !377, file: !378, line: 101, baseType: !437, size: 32, offset: 2528)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !377, file: !378, line: 102, baseType: !480, size: 64, offset: 2560)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !377, file: !378, line: 102, baseType: !480, size: 64, offset: 2624)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !377, file: !378, line: 103, baseType: !500, size: 64, offset: 2688)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !492)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !377, file: !378, line: 103, baseType: !503, size: 64, offset: 2752)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !377, file: !378, line: 104, baseType: !432, size: 64, offset: 2816)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !377, file: !378, line: 105, baseType: !437, size: 32, offset: 2880)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !377, file: !378, line: 106, baseType: !507, size: 128, offset: 2944)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 128, elements: !514)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !378, line: 64, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 61, size: 128, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !510, file: !378, line: 62, baseType: !425, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !510, file: !378, line: 63, baseType: !474, size: 64, offset: 64)
!514 = !{!515}
!515 = !DISubrange(count: 2)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !377, file: !378, line: 107, baseType: !517, size: 64, offset: 3072)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 64, elements: !514)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !377, file: !378, line: 108, baseType: !474, size: 64, offset: 3136)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !377, file: !378, line: 109, baseType: !520, size: 64, offset: 3200)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!391, !474}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !377, file: !378, line: 111, baseType: !437, size: 32, offset: 3264)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !377, file: !378, line: 112, baseType: !525, size: 320, offset: 3328)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !571)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!391, !529, !375, !474}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !532)
!532 = !{!533, !534, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !531, file: !12, line: 100, baseType: !437, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !12, line: 101, baseType: !535, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !546, !547, !548, !552, !554, !556, !557, !558}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !537, file: !12, line: 84, baseType: !464, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !537, file: !12, line: 85, baseType: !464, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !12, line: 86, baseType: !474, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !537, file: !12, line: 87, baseType: !456, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !537, file: !12, line: 88, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !537, file: !12, line: 89, baseType: !416, size: 8, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !537, file: !12, line: 90, baseType: !464, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !537, file: !12, line: 91, baseType: !549, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !550, line: 46, baseType: !551)
!550 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!551 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !537, file: !12, line: 92, baseType: !553, size: 32, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !12, line: 93, baseType: !555, size: 32, offset: 544)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !12, line: 94, baseType: !535, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !537, file: !12, line: 95, baseType: !464, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !537, file: !12, line: 96, baseType: !474, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !531, file: !12, line: 102, baseType: !464, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !531, file: !12, line: 102, baseType: !464, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !531, file: !12, line: 103, baseType: !464, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !531, file: !12, line: 104, baseType: !393, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !531, file: !12, line: 105, baseType: !553, size: 32, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !531, file: !12, line: 105, baseType: !553, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !531, file: !12, line: 105, baseType: !553, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !531, file: !12, line: 106, baseType: !375, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !531, file: !12, line: 107, baseType: !568, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!571 = !{!572}
!572 = !DISubrange(count: 5)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !377, file: !378, line: 113, baseType: !574, size: 320, offset: 3648)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !571)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!391, !375, !474}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !377, file: !378, line: 114, baseType: !579, size: 320, offset: 3968)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 320, elements: !571)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !377, file: !378, line: 115, baseType: !553, size: 32, offset: 4288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !377, file: !378, line: 120, baseType: !568, size: 64, offset: 4352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !377, file: !378, line: 121, baseType: !553, size: 32, offset: 4416)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPISBAIJ", file: !585, line: 20, baseType: !586)
!585 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sbaij/mpi/mpisbaij.h", directory: "/home/users/ndemeye/xSDK")
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 8, size: 3008, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1397, !1398, !1399, !1400, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rangebs", scope: !586, file: !585, line: 9, baseType: !483, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rstartbs", scope: !586, file: !585, line: 9, baseType: !437, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rendbs", scope: !586, file: !585, line: 9, baseType: !437, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cstartbs", scope: !586, file: !585, line: 9, baseType: !437, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cendbs", scope: !586, file: !585, line: 9, baseType: !437, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !586, file: !585, line: 9, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !597, line: 436, size: 23424, elements: !598)
!597 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!598 = !{!599, !601, !1108, !1128, !1129, !1130, !1132, !1133, !1134, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1261, !1262, !1278, !1279, !1280, !1281, !1282, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1317, !1337, !1338, !1340, !1341, !1342, !1343, !1344, !1345, !1363, !1364}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !596, file: !597, line: 437, baseType: !600, size: 4480)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !378, line: 122, baseType: !377)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !596, file: !597, line: 437, baseType: !602, size: 9472, offset: 4480)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 9472, elements: !433)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !597, line: 32, size: 9472, elements: !604)
!604 = !{!605, !614, !618, !619, !626, !630, !631, !632, !633, !634, !635, !636, !660, !664, !669, !675, !694, !699, !703, !704, !709, !714, !715, !720, !724, !728, !732, !736, !740, !741, !742, !743, !744, !748, !749, !754, !755, !756, !757, !758, !763, !770, !775, !779, !783, !787, !791, !792, !796, !797, !804, !809, !810, !811, !812, !874, !882, !883, !887, !888, !892, !893, !897, !902, !903, !907, !911, !918, !919, !920, !921, !922, !923, !928, !929, !933, !937, !941, !942, !943, !947, !957, !958, !962, !963, !967, !968, !972, !973, !978, !979, !983, !987, !988, !989, !990, !991, !992, !993, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1021, !1022, !1023, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1037, !1038, !1039, !1044, !1048, !1049, !1053, !1054, !1055, !1056, !1082, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1096, !1097, !1098, !1102, !1106, !1107}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !603, file: !597, line: 34, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!391, !594, !437, !609, !437, !609, !611, !613}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !603, file: !597, line: 35, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!391, !594, !437, !483, !485, !503}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !603, file: !597, line: 36, baseType: !615, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !603, file: !597, line: 37, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!391, !594, !623, !623}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !603, file: !597, line: 38, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!391, !594, !623, !623, !623}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !603, file: !597, line: 40, baseType: !620, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !603, file: !597, line: 41, baseType: !627, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !603, file: !597, line: 42, baseType: !620, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !603, file: !597, line: 43, baseType: !627, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !603, file: !597, line: 44, baseType: !620, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !603, file: !597, line: 46, baseType: !627, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !603, file: !597, line: 47, baseType: !637, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!391, !594, !640, !640, !644}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !641, line: 11, baseType: !642)
!641 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !641, line: 11, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !647, file: !38, line: 1227, baseType: !492, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !647, file: !38, line: 1228, baseType: !492, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !647, file: !38, line: 1229, baseType: !492, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !647, file: !38, line: 1230, baseType: !492, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !647, file: !38, line: 1231, baseType: !492, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !647, file: !38, line: 1232, baseType: !492, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !647, file: !38, line: 1233, baseType: !492, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !647, file: !38, line: 1234, baseType: !492, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !647, file: !38, line: 1236, baseType: !492, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !647, file: !38, line: 1237, baseType: !492, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !647, file: !38, line: 1238, baseType: !492, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !603, file: !597, line: 48, baseType: !661, size: 64, offset: 768)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!391, !594, !640, !644}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !603, file: !597, line: 49, baseType: !665, size: 64, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!391, !594, !623, !492, !668, !492, !437, !437, !623}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !603, file: !597, line: 50, baseType: !670, size: 64, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!391, !594, !673, !674}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !603, file: !597, line: 52, baseType: !676, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!391, !594, !679, !680}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !682, file: !38, line: 593, baseType: !439, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !682, file: !38, line: 594, baseType: !439, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !682, file: !38, line: 594, baseType: !439, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !682, file: !38, line: 594, baseType: !439, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !682, file: !38, line: 595, baseType: !439, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !682, file: !38, line: 596, baseType: !439, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !682, file: !38, line: 597, baseType: !439, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !682, file: !38, line: 598, baseType: !439, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !682, file: !38, line: 598, baseType: !439, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !682, file: !38, line: 599, baseType: !439, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !603, file: !597, line: 53, baseType: !695, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!391, !594, !594, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !603, file: !597, line: 54, baseType: !700, size: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!391, !594, !623}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !603, file: !597, line: 55, baseType: !620, size: 64, offset: 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !603, file: !597, line: 56, baseType: !705, size: 64, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!391, !594, !708, !491}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !603, file: !597, line: 58, baseType: !710, size: 64, offset: 1280)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!391, !594, !713}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !603, file: !597, line: 59, baseType: !710, size: 64, offset: 1344)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !603, file: !597, line: 60, baseType: !716, size: 64, offset: 1408)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!391, !594, !719, !553}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !603, file: !597, line: 61, baseType: !721, size: 64, offset: 1472)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!391, !594}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !603, file: !597, line: 63, baseType: !725, size: 64, offset: 1536)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!391, !594, !437, !609, !501, !623, !623}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !603, file: !597, line: 64, baseType: !729, size: 64, offset: 1600)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!391, !594, !594, !640, !640, !644}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !603, file: !597, line: 65, baseType: !733, size: 64, offset: 1664)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!391, !594, !594, !644}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !603, file: !597, line: 66, baseType: !737, size: 64, offset: 1728)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!391, !594, !594, !640, !644}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !603, file: !597, line: 67, baseType: !733, size: 64, offset: 1792)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !603, file: !597, line: 69, baseType: !721, size: 64, offset: 1856)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !603, file: !597, line: 70, baseType: !729, size: 64, offset: 1920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !603, file: !597, line: 71, baseType: !737, size: 64, offset: 1984)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !603, file: !597, line: 72, baseType: !745, size: 64, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!391, !594, !674}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !603, file: !597, line: 73, baseType: !721, size: 64, offset: 2112)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !603, file: !597, line: 75, baseType: !750, size: 64, offset: 2176)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!391, !594, !753, !674}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !603, file: !597, line: 76, baseType: !620, size: 64, offset: 2240)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !603, file: !597, line: 77, baseType: !620, size: 64, offset: 2304)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !603, file: !597, line: 78, baseType: !637, size: 64, offset: 2368)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !603, file: !597, line: 79, baseType: !661, size: 64, offset: 2432)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !603, file: !597, line: 81, baseType: !759, size: 64, offset: 2496)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!391, !594, !501, !594, !762}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !603, file: !597, line: 82, baseType: !764, size: 64, offset: 2560)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!391, !594, !437, !767, !767, !673, !769}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !603, file: !597, line: 83, baseType: !771, size: 64, offset: 2624)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!391, !594, !437, !774, !437}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !603, file: !597, line: 84, baseType: !776, size: 64, offset: 2688)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!391, !594, !437, !609, !437, !609, !500}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !603, file: !597, line: 85, baseType: !780, size: 64, offset: 2752)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!391, !594, !594, !762}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !603, file: !597, line: 87, baseType: !784, size: 64, offset: 2816)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!391, !594, !623, !483}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !603, file: !597, line: 88, baseType: !788, size: 64, offset: 2880)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!391, !594, !501}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !603, file: !597, line: 89, baseType: !788, size: 64, offset: 2944)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !603, file: !597, line: 90, baseType: !793, size: 64, offset: 3008)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!391, !594, !623, !613}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !603, file: !597, line: 91, baseType: !725, size: 64, offset: 3072)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !603, file: !597, line: 93, baseType: !798, size: 64, offset: 3136)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!391, !594, !801}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !603, file: !597, line: 94, baseType: !805, size: 64, offset: 3200)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!391, !594, !437, !553, !553, !483, !808, !808, !698}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !603, file: !597, line: 95, baseType: !805, size: 64, offset: 3264)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !603, file: !597, line: 96, baseType: !805, size: 64, offset: 3328)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !603, file: !597, line: 97, baseType: !805, size: 64, offset: 3392)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !603, file: !597, line: 99, baseType: !813, size: 64, offset: 3456)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!391, !594, !816, !819}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !641, line: 51, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !641, line: 51, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !597, line: 609, size: 6208, elements: !822)
!822 = !{!823, !824, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !843, !850, !851, !852, !853, !854, !855, !856, !857, !861, !862, !863, !864, !865, !867, !868, !869, !870, !871, !872, !873}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !821, file: !597, line: 610, baseType: !600, size: 4480)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !821, file: !597, line: 610, baseType: !825, size: 32, offset: 4480)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !433)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !821, file: !597, line: 611, baseType: !437, size: 32, offset: 4512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !821, file: !597, line: 611, baseType: !437, size: 32, offset: 4544)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !821, file: !597, line: 611, baseType: !437, size: 32, offset: 4576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !821, file: !597, line: 612, baseType: !437, size: 32, offset: 4608)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !821, file: !597, line: 613, baseType: !437, size: 32, offset: 4640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !821, file: !597, line: 614, baseType: !483, size: 64, offset: 4672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !821, file: !597, line: 615, baseType: !485, size: 64, offset: 4736)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !821, file: !597, line: 616, baseType: !774, size: 64, offset: 4800)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !821, file: !597, line: 617, baseType: !483, size: 64, offset: 4864)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !821, file: !597, line: 618, baseType: !836, size: 64, offset: 4928)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !597, line: 602, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 598, size: 128, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !838, file: !597, line: 599, baseType: !437, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !838, file: !597, line: 600, baseType: !437, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !838, file: !597, line: 601, baseType: !500, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !821, file: !597, line: 619, baseType: !844, size: 64, offset: 4992)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !597, line: 607, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 604, size: 128, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !846, file: !597, line: 605, baseType: !437, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !846, file: !597, line: 606, baseType: !500, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !821, file: !597, line: 620, baseType: !500, size: 64, offset: 5056)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !821, file: !597, line: 621, baseType: !492, size: 64, offset: 5120)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !821, file: !597, line: 622, baseType: !492, size: 64, offset: 5184)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !821, file: !597, line: 623, baseType: !623, size: 64, offset: 5248)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !821, file: !597, line: 623, baseType: !623, size: 64, offset: 5312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !821, file: !597, line: 623, baseType: !623, size: 64, offset: 5376)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !821, file: !597, line: 624, baseType: !553, size: 32, offset: 5440)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !821, file: !597, line: 625, baseType: !858, size: 64, offset: 5504)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!391}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !821, file: !597, line: 626, baseType: !474, size: 64, offset: 5568)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !821, file: !597, line: 627, baseType: !623, size: 64, offset: 5632)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !821, file: !597, line: 628, baseType: !437, size: 32, offset: 5696)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !821, file: !597, line: 629, baseType: !414, size: 64, offset: 5760)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !821, file: !597, line: 630, baseType: !866, size: 32, offset: 5824)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !821, file: !597, line: 631, baseType: !437, size: 32, offset: 5856)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !821, file: !597, line: 631, baseType: !437, size: 32, offset: 5888)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !821, file: !597, line: 632, baseType: !553, size: 32, offset: 5920)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !821, file: !597, line: 633, baseType: !553, size: 32, offset: 5952)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !821, file: !597, line: 634, baseType: !425, size: 64, offset: 6016)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !821, file: !597, line: 634, baseType: !474, size: 64, offset: 6080)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !821, file: !597, line: 635, baseType: !445, size: 64, offset: 6144)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !603, file: !597, line: 100, baseType: !875, size: 64, offset: 3520)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!391, !594, !437, !437, !878, !881}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !880)
!880 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !603, file: !597, line: 101, baseType: !721, size: 64, offset: 3584)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !603, file: !597, line: 102, baseType: !884, size: 64, offset: 3648)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!391, !594, !640, !640, !674}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !603, file: !597, line: 103, baseType: !606, size: 64, offset: 3712)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !603, file: !597, line: 105, baseType: !889, size: 64, offset: 3776)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!391, !594, !640, !640, !673, !674}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !603, file: !597, line: 106, baseType: !721, size: 64, offset: 3840)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !603, file: !597, line: 107, baseType: !894, size: 64, offset: 3904)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!391, !594, !401}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !603, file: !597, line: 108, baseType: !898, size: 64, offset: 3968)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!391, !594, !901, !673, !674}
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !414)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !603, file: !597, line: 109, baseType: !858, size: 64, offset: 4032)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !603, file: !597, line: 111, baseType: !904, size: 64, offset: 4096)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!391, !594, !594, !594, !492, !594}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !603, file: !597, line: 112, baseType: !908, size: 64, offset: 4160)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!391, !594, !594, !594, !594}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !603, file: !597, line: 113, baseType: !912, size: 64, offset: 4224)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!391, !594, !915, !915}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !641, line: 30, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !641, line: 30, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !603, file: !597, line: 114, baseType: !606, size: 64, offset: 4288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !603, file: !597, line: 115, baseType: !725, size: 64, offset: 4352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !603, file: !597, line: 117, baseType: !784, size: 64, offset: 4416)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !603, file: !597, line: 118, baseType: !784, size: 64, offset: 4480)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !603, file: !597, line: 119, baseType: !898, size: 64, offset: 4544)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !603, file: !597, line: 120, baseType: !924, size: 64, offset: 4608)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!391, !594, !927, !698}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !603, file: !597, line: 121, baseType: !858, size: 64, offset: 4672)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !603, file: !597, line: 123, baseType: !930, size: 64, offset: 4736)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!391, !594, !437, !474}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !603, file: !597, line: 124, baseType: !934, size: 64, offset: 4800)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!391, !594, !819, !623, !474}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !603, file: !597, line: 125, baseType: !938, size: 64, offset: 4864)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!391, !529, !594}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !603, file: !597, line: 126, baseType: !620, size: 64, offset: 4928)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !603, file: !597, line: 127, baseType: !620, size: 64, offset: 4992)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !603, file: !597, line: 129, baseType: !944, size: 64, offset: 5056)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!391, !594, !774}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !603, file: !597, line: 130, baseType: !948, size: 64, offset: 5120)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!391, !594, !951, !951}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !953, file: !62, line: 653, baseType: !437, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !953, file: !62, line: 653, baseType: !623, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !603, file: !597, line: 131, baseType: !948, size: 64, offset: 5184)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !603, file: !597, line: 132, baseType: !959, size: 64, offset: 5248)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!391, !594, !483, !483, !483}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !603, file: !597, line: 133, baseType: !894, size: 64, offset: 5312)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !603, file: !597, line: 135, baseType: !964, size: 64, offset: 5376)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!391, !594, !492, !698}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !603, file: !597, line: 136, baseType: !964, size: 64, offset: 5440)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !603, file: !597, line: 137, baseType: !969, size: 64, offset: 5504)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!391, !594, !698}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !603, file: !597, line: 138, baseType: !606, size: 64, offset: 5568)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !603, file: !597, line: 139, baseType: !974, size: 64, offset: 5632)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!391, !594, !977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !603, file: !597, line: 141, baseType: !858, size: 64, offset: 5696)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !603, file: !597, line: 142, baseType: !980, size: 64, offset: 5760)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!391, !594, !594, !492, !594}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !603, file: !597, line: 143, baseType: !984, size: 64, offset: 5824)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!391, !594, !594, !594}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !603, file: !597, line: 144, baseType: !858, size: 64, offset: 5888)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !603, file: !597, line: 145, baseType: !980, size: 64, offset: 5952)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !603, file: !597, line: 147, baseType: !984, size: 64, offset: 6016)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !603, file: !597, line: 148, baseType: !858, size: 64, offset: 6080)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !603, file: !597, line: 149, baseType: !980, size: 64, offset: 6144)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !603, file: !597, line: 150, baseType: !984, size: 64, offset: 6208)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !603, file: !597, line: 151, baseType: !994, size: 64, offset: 6272)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!391, !594, !553}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !603, file: !597, line: 153, baseType: !721, size: 64, offset: 6336)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !603, file: !597, line: 154, baseType: !721, size: 64, offset: 6400)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !603, file: !597, line: 155, baseType: !721, size: 64, offset: 6464)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !603, file: !597, line: 156, baseType: !721, size: 64, offset: 6528)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !603, file: !597, line: 157, baseType: !894, size: 64, offset: 6592)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !603, file: !597, line: 159, baseType: !1003, size: 64, offset: 6656)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!391, !594, !437, !611}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !603, file: !597, line: 160, baseType: !721, size: 64, offset: 6720)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !603, file: !597, line: 161, baseType: !721, size: 64, offset: 6784)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !603, file: !597, line: 162, baseType: !721, size: 64, offset: 6848)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !603, file: !597, line: 163, baseType: !721, size: 64, offset: 6912)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !603, file: !597, line: 165, baseType: !984, size: 64, offset: 6976)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !603, file: !597, line: 166, baseType: !984, size: 64, offset: 7040)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !603, file: !597, line: 167, baseType: !784, size: 64, offset: 7104)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !603, file: !597, line: 168, baseType: !1014, size: 64, offset: 7168)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!391, !594, !623, !437}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !603, file: !597, line: 169, baseType: !1018, size: 64, offset: 7232)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!391, !594, !698, !483}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !603, file: !597, line: 171, baseType: !745, size: 64, offset: 7296)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !603, file: !597, line: 172, baseType: !721, size: 64, offset: 7360)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !603, file: !597, line: 173, baseType: !1024, size: 64, offset: 7424)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!391, !594, !483, !808}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !603, file: !597, line: 174, baseType: !884, size: 64, offset: 7488)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !603, file: !597, line: 175, baseType: !884, size: 64, offset: 7552)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !603, file: !597, line: 177, baseType: !620, size: 64, offset: 7616)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !603, file: !597, line: 178, baseType: !670, size: 64, offset: 7680)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !603, file: !597, line: 179, baseType: !620, size: 64, offset: 7744)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !603, file: !597, line: 180, baseType: !627, size: 64, offset: 7808)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !603, file: !597, line: 181, baseType: !1034, size: 64, offset: 7872)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!391, !594, !393, !673, !674}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !603, file: !597, line: 183, baseType: !944, size: 64, offset: 7936)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !603, file: !597, line: 184, baseType: !705, size: 64, offset: 8000)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !603, file: !597, line: 185, baseType: !1040, size: 64, offset: 8064)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!391, !594, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !603, file: !597, line: 186, baseType: !1045, size: 64, offset: 8128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!391, !594, !437, !609, !500}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !603, file: !597, line: 187, baseType: !764, size: 64, offset: 8192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !603, file: !597, line: 189, baseType: !1050, size: 64, offset: 8256)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!391, !594, !437, !437, !483, !611}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !603, file: !597, line: 190, baseType: !858, size: 64, offset: 8320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !603, file: !597, line: 191, baseType: !980, size: 64, offset: 8384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !603, file: !597, line: 192, baseType: !984, size: 64, offset: 8448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !603, file: !597, line: 193, baseType: !1057, size: 64, offset: 8512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!391, !594, !816, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !597, line: 660, size: 5312, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1062, file: !597, line: 661, baseType: !600, size: 4480)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1062, file: !597, line: 661, baseType: !825, size: 32, offset: 4480)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1062, file: !597, line: 662, baseType: !437, size: 32, offset: 4512)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1062, file: !597, line: 662, baseType: !437, size: 32, offset: 4544)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1062, file: !597, line: 662, baseType: !437, size: 32, offset: 4576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1062, file: !597, line: 663, baseType: !437, size: 32, offset: 4608)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1062, file: !597, line: 664, baseType: !437, size: 32, offset: 4640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1062, file: !597, line: 665, baseType: !483, size: 64, offset: 4672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1062, file: !597, line: 666, baseType: !483, size: 64, offset: 4736)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1062, file: !597, line: 667, baseType: !437, size: 32, offset: 4800)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1062, file: !597, line: 668, baseType: !866, size: 32, offset: 4832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1062, file: !597, line: 670, baseType: !483, size: 64, offset: 4864)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1062, file: !597, line: 670, baseType: !483, size: 64, offset: 4928)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1062, file: !597, line: 671, baseType: !483, size: 64, offset: 4992)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1062, file: !597, line: 672, baseType: !483, size: 64, offset: 5056)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1062, file: !597, line: 673, baseType: !483, size: 64, offset: 5120)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1062, file: !597, line: 674, baseType: !437, size: 32, offset: 5184)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1062, file: !597, line: 675, baseType: !483, size: 64, offset: 5248)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !603, file: !597, line: 195, baseType: !1083, size: 64, offset: 8576)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!391, !1060, !594, !594}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !603, file: !597, line: 196, baseType: !1083, size: 64, offset: 8640)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !603, file: !597, line: 197, baseType: !858, size: 64, offset: 8704)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !603, file: !597, line: 198, baseType: !980, size: 64, offset: 8768)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !603, file: !597, line: 199, baseType: !984, size: 64, offset: 8832)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !603, file: !597, line: 201, baseType: !1091, size: 64, offset: 8896)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!391, !594, !437, !437}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !603, file: !597, line: 202, baseType: !759, size: 64, offset: 8960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !603, file: !597, line: 203, baseType: !627, size: 64, offset: 9024)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !603, file: !597, line: 204, baseType: !813, size: 64, offset: 9088)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !603, file: !597, line: 205, baseType: !944, size: 64, offset: 9152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !603, file: !597, line: 206, baseType: !1099, size: 64, offset: 9216)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!391, !393, !594, !437, !673, !674}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !603, file: !597, line: 208, baseType: !1103, size: 64, offset: 9280)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!391, !437, !769}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !603, file: !597, line: 209, baseType: !984, size: 64, offset: 9344)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !603, file: !597, line: 210, baseType: !776, size: 64, offset: 9408)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !596, file: !597, line: 438, baseType: !1109, size: 64, offset: 13952)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !641, line: 60, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1111, file: !116, line: 241, baseType: !393, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !116, line: 242, baseType: !454, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1111, file: !116, line: 243, baseType: !437, size: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1111, file: !116, line: 243, baseType: !437, size: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1111, file: !116, line: 244, baseType: !437, size: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1111, file: !116, line: 244, baseType: !437, size: 32, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1111, file: !116, line: 245, baseType: !483, size: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1111, file: !116, line: 246, baseType: !553, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1111, file: !116, line: 247, baseType: !437, size: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1111, file: !116, line: 251, baseType: !437, size: 32, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1111, file: !116, line: 252, baseType: !915, size: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1111, file: !116, line: 253, baseType: !553, size: 32, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1111, file: !116, line: 254, baseType: !437, size: 32, offset: 544)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1111, file: !116, line: 254, baseType: !437, size: 32, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1111, file: !116, line: 255, baseType: !437, size: 32, offset: 608)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !596, file: !597, line: 438, baseType: !1109, size: 64, offset: 14016)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !596, file: !597, line: 439, baseType: !474, size: 64, offset: 14080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !596, file: !597, line: 440, baseType: !1131, size: 32, offset: 14144)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !596, file: !597, line: 441, baseType: !553, size: 32, offset: 14176)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !596, file: !597, line: 442, baseType: !553, size: 32, offset: 14208)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !596, file: !597, line: 443, baseType: !1135, size: 448, offset: 14272)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 448, elements: !1137)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !414)
!1137 = !{!1138}
!1138 = !DISubrange(count: 7)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !596, file: !597, line: 444, baseType: !553, size: 32, offset: 14720)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !596, file: !597, line: 445, baseType: !553, size: 32, offset: 14752)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !596, file: !597, line: 446, baseType: !437, size: 32, offset: 14784)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !596, file: !597, line: 447, baseType: !476, size: 64, offset: 14848)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !596, file: !597, line: 448, baseType: !476, size: 64, offset: 14912)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !596, file: !597, line: 449, baseType: !681, size: 640, offset: 14976)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !596, file: !597, line: 450, baseType: !613, size: 32, offset: 15616)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !596, file: !597, line: 451, baseType: !1147, size: 2880, offset: 15680)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !597, line: 318, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !597, line: 319, size: 2880, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1169, !1170, !1175, !1180, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1195, !1196, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1228, !1229, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1254, !1258, !1259}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1148, file: !597, line: 320, baseType: !437, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1148, file: !597, line: 321, baseType: !437, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1148, file: !597, line: 322, baseType: !437, size: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1148, file: !597, line: 323, baseType: !437, size: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1148, file: !597, line: 324, baseType: !437, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1148, file: !597, line: 325, baseType: !437, size: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1148, file: !597, line: 326, baseType: !1157, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !597, line: 293, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !597, line: 295, size: 448, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1159, file: !597, line: 296, baseType: !1157, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1159, file: !597, line: 297, baseType: !500, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1159, file: !597, line: 297, baseType: !500, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1159, file: !597, line: 298, baseType: !483, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1159, file: !597, line: 298, baseType: !483, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1159, file: !597, line: 299, baseType: !437, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1159, file: !597, line: 300, baseType: !437, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1159, file: !597, line: 301, baseType: !437, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1148, file: !597, line: 326, baseType: !1157, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1148, file: !597, line: 328, baseType: !1171, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!391, !594, !1174, !483}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1148, file: !597, line: 329, baseType: !1176, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!391, !1174, !1179, !485, !485, !503, !483}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1148, file: !597, line: 330, baseType: !1181, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!391, !1174}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1148, file: !597, line: 331, baseType: !1181, size: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1148, file: !597, line: 334, baseType: !393, size: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !597, line: 335, baseType: !454, size: 32, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1148, file: !597, line: 335, baseType: !454, size: 32, offset: 672)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1148, file: !597, line: 336, baseType: !454, size: 32, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1148, file: !597, line: 336, baseType: !454, size: 32, offset: 736)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1148, file: !597, line: 337, baseType: !1191, size: 64, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !394, line: 339, baseType: !1193)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !394, line: 339, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1148, file: !597, line: 338, baseType: !1191, size: 64, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1148, file: !597, line: 339, baseType: !1197, size: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !394, line: 341, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !394, line: 351, size: 192, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1199, file: !394, line: 354, baseType: !74, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1199, file: !394, line: 355, baseType: !74, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1199, file: !394, line: 356, baseType: !74, size: 32, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1199, file: !394, line: 361, baseType: !74, size: 32, offset: 96)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1199, file: !394, line: 362, baseType: !549, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1148, file: !597, line: 340, baseType: !437, size: 32, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1148, file: !597, line: 340, baseType: !437, size: 32, offset: 992)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1148, file: !597, line: 341, baseType: !500, size: 64, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1148, file: !597, line: 342, baseType: !483, size: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1148, file: !597, line: 343, baseType: !503, size: 64, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1148, file: !597, line: 344, baseType: !485, size: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1148, file: !597, line: 345, baseType: !437, size: 32, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1148, file: !597, line: 346, baseType: !1179, size: 64, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1148, file: !597, line: 347, baseType: !553, size: 32, offset: 1408)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1148, file: !597, line: 348, baseType: !437, size: 32, offset: 1440)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1148, file: !597, line: 351, baseType: !553, size: 32, offset: 1472)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1148, file: !597, line: 352, baseType: !553, size: 32, offset: 1504)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1148, file: !597, line: 353, baseType: !454, size: 32, offset: 1536)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1148, file: !597, line: 354, baseType: !454, size: 32, offset: 1568)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1148, file: !597, line: 355, baseType: !1179, size: 64, offset: 1600)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1148, file: !597, line: 356, baseType: !1179, size: 64, offset: 1664)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1148, file: !597, line: 357, baseType: !1223, size: 64, offset: 1728)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !597, line: 310, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 308, size: 32, elements: !1226)
!1226 = !{!1227}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1225, file: !597, line: 309, baseType: !437, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1148, file: !597, line: 357, baseType: !1223, size: 64, offset: 1792)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1148, file: !597, line: 358, baseType: !1230, size: 64, offset: 1856)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !597, line: 316, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 312, size: 128, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1232, file: !597, line: 313, baseType: !474, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1232, file: !597, line: 314, baseType: !437, size: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1232, file: !597, line: 315, baseType: !416, size: 8, offset: 96)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1148, file: !597, line: 359, baseType: !1230, size: 64, offset: 1920)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1148, file: !597, line: 360, baseType: !1230, size: 64, offset: 1984)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1148, file: !597, line: 361, baseType: !437, size: 32, offset: 2048)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1148, file: !597, line: 362, baseType: !454, size: 32, offset: 2080)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1148, file: !597, line: 363, baseType: !437, size: 32, offset: 2112)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1148, file: !597, line: 364, baseType: !1179, size: 64, offset: 2176)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1148, file: !597, line: 365, baseType: !1197, size: 64, offset: 2240)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1148, file: !597, line: 366, baseType: !454, size: 32, offset: 2304)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1148, file: !597, line: 367, baseType: !454, size: 32, offset: 2336)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1148, file: !597, line: 368, baseType: !1191, size: 64, offset: 2368)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1148, file: !597, line: 369, baseType: !1191, size: 64, offset: 2432)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1148, file: !597, line: 370, baseType: !1249, size: 64, offset: 2496)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1148, file: !597, line: 371, baseType: !1249, size: 64, offset: 2560)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1148, file: !597, line: 372, baseType: !1249, size: 64, offset: 2624)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1148, file: !597, line: 373, baseType: !1255, size: 64, offset: 2688)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !394, line: 331, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !394, line: 331, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1148, file: !597, line: 374, baseType: !549, size: 64, offset: 2752)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1148, file: !597, line: 375, baseType: !1260, size: 64, offset: 2816)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !596, file: !597, line: 451, baseType: !1147, size: 2880, offset: 18560)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !596, file: !597, line: 452, baseType: !1263, size: 64, offset: 21440)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !597, line: 681, size: 4864, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1273, !1277}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1265, file: !597, line: 682, baseType: !600, size: 4480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1265, file: !597, line: 682, baseType: !825, size: 32, offset: 4480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1265, file: !597, line: 683, baseType: !553, size: 32, offset: 4512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1265, file: !597, line: 684, baseType: !437, size: 32, offset: 4544)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1265, file: !597, line: 685, baseType: !977, size: 64, offset: 4608)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1265, file: !597, line: 686, baseType: !500, size: 64, offset: 4672)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1265, file: !597, line: 687, baseType: !1274, size: 64, offset: 4736)
