; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/gcr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/gcr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!131 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!132 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!133 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!134 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!135 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!136 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!139 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!157 = !{!158, !366, !176, !257, !197, !332, !367, !369, !220, !627, !630, !247, !26, !633}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !161, line: 73, size: 4480, elements: !162)
!161 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!162 = !{!163, !165, !218, !219, !221, !224, !225, !226, !227, !235, !236, !238, !242, !246, !248, !249, !250, !251, !252, !253, !254, !255, !256, !258, !260, !261, !262, !264, !265, !267, !269, !270, !271, !272, !273, !276, !278, !279, !280, !281, !282, !285, !287, !288, !289, !299, !301, !302, !306, !307, !356, !361, !363, !364, !365}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !160, file: !161, line: 74, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !160, file: !161, line: 75, baseType: !166, size: 448, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 448, elements: !216)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !161, line: 53, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 45, size: 448, elements: !169)
!169 = !{!170, !180, !188, !193, !200, !204, !211}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !168, file: !161, line: 46, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !158, !175}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !177, line: 330, baseType: !178)
!177 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !177, line: 330, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !168, file: !161, line: 47, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!174, !158, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !185, line: 16, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !185, line: 16, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !168, file: !161, line: 48, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!174, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !168, file: !161, line: 49, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!174, !158, !197, !158}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !168, file: !161, line: 50, baseType: !201, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!174, !158, !197, !192}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !168, file: !161, line: 51, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!174, !158, !197, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !168, file: !161, line: 52, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!174, !158, !197, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!216 = !{!217}
!217 = !DISubrange(count: 1)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !160, file: !161, line: 76, baseType: !176, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !161, line: 77, baseType: !220, size: 32, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !160, file: !161, line: 78, baseType: !222, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !223)
!223 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !160, file: !161, line: 78, baseType: !222, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !160, file: !161, line: 78, baseType: !222, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !160, file: !161, line: 78, baseType: !222, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !161, line: 79, baseType: !228, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !231, line: 27, baseType: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !233, line: 43, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!234 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !160, file: !161, line: 80, baseType: !220, size: 32, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !160, file: !161, line: 81, baseType: !237, size: 32, offset: 992)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !160, file: !161, line: 82, baseType: !239, size: 64, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !160, file: !161, line: 83, baseType: !243, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !160, file: !161, line: 84, baseType: !247, size: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !160, file: !161, line: 85, baseType: !247, size: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !160, file: !161, line: 86, baseType: !247, size: 64, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !160, file: !161, line: 87, baseType: !247, size: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !160, file: !161, line: 88, baseType: !158, size: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !160, file: !161, line: 89, baseType: !228, size: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 90, baseType: !247, size: 64, offset: 1536)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !160, file: !161, line: 91, baseType: !247, size: 64, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !160, file: !161, line: 92, baseType: !220, size: 32, offset: 1664)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !160, file: !161, line: 93, baseType: !257, size: 64, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !160, file: !161, line: 94, baseType: !259, size: 64, offset: 1792)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !229)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !160, file: !161, line: 95, baseType: !220, size: 32, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !160, file: !161, line: 95, baseType: !220, size: 32, offset: 1888)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !160, file: !161, line: 96, baseType: !263, size: 64, offset: 1920)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !160, file: !161, line: 96, baseType: !263, size: 64, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !160, file: !161, line: 97, baseType: !266, size: 64, offset: 2048)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !160, file: !161, line: 97, baseType: !268, size: 64, offset: 2112)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !160, file: !161, line: 98, baseType: !220, size: 32, offset: 2176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !160, file: !161, line: 98, baseType: !220, size: 32, offset: 2208)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !160, file: !161, line: 99, baseType: !263, size: 64, offset: 2240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !160, file: !161, line: 99, baseType: !263, size: 64, offset: 2304)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !160, file: !161, line: 100, baseType: !274, size: 64, offset: 2368)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !223)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !160, file: !161, line: 100, baseType: !277, size: 64, offset: 2432)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !160, file: !161, line: 101, baseType: !220, size: 32, offset: 2496)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !160, file: !161, line: 101, baseType: !220, size: 32, offset: 2528)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !160, file: !161, line: 102, baseType: !263, size: 64, offset: 2560)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !160, file: !161, line: 102, baseType: !263, size: 64, offset: 2624)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !160, file: !161, line: 103, baseType: !283, size: 64, offset: 2688)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !275)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !160, file: !161, line: 103, baseType: !286, size: 64, offset: 2752)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !160, file: !161, line: 104, baseType: !215, size: 64, offset: 2816)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !160, file: !161, line: 105, baseType: !220, size: 32, offset: 2880)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !160, file: !161, line: 106, baseType: !290, size: 128, offset: 2944)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !297)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !161, line: 64, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 61, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !293, file: !161, line: 62, baseType: !208, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !293, file: !161, line: 63, baseType: !257, size: 64, offset: 64)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !160, file: !161, line: 107, baseType: !300, size: 64, offset: 3072)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 64, elements: !297)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !160, file: !161, line: 108, baseType: !257, size: 64, offset: 3136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !160, file: !161, line: 109, baseType: !303, size: 64, offset: 3200)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!174, !257}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !160, file: !161, line: 111, baseType: !220, size: 32, offset: 3264)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !160, file: !161, line: 112, baseType: !308, size: 320, offset: 3328)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 320, elements: !354)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!174, !312, !158, !257}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !315)
!315 = !{!316, !317, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !314, file: !10, line: 100, baseType: !220, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !10, line: 101, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !329, !330, !331, !335, !337, !339, !340, !341}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !320, file: !10, line: 84, baseType: !247, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !320, file: !10, line: 85, baseType: !247, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !10, line: 86, baseType: !257, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !320, file: !10, line: 87, baseType: !239, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !320, file: !10, line: 88, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !320, file: !10, line: 89, baseType: !199, size: 8, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !320, file: !10, line: 90, baseType: !247, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !320, file: !10, line: 91, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !333, line: 46, baseType: !334)
!333 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!334 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !10, line: 92, baseType: !336, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !10, line: 93, baseType: !338, size: 32, offset: 544)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !10, line: 94, baseType: !318, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !320, file: !10, line: 95, baseType: !247, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !320, file: !10, line: 96, baseType: !257, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !314, file: !10, line: 102, baseType: !247, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !314, file: !10, line: 102, baseType: !247, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !314, file: !10, line: 103, baseType: !247, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !314, file: !10, line: 104, baseType: !176, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !314, file: !10, line: 105, baseType: !336, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !314, file: !10, line: 106, baseType: !158, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !314, file: !10, line: 107, baseType: !351, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!354 = !{!355}
!355 = !DISubrange(count: 5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !160, file: !161, line: 113, baseType: !357, size: 320, offset: 3648)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !354)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!174, !158, !257}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !160, file: !161, line: 114, baseType: !362, size: 320, offset: 3968)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !354)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !160, file: !161, line: 115, baseType: !336, size: 32, offset: 4288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !161, line: 120, baseType: !351, size: 64, offset: 4352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !160, file: !161, line: 121, baseType: !336, size: 32, offset: 4416)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !368, line: 1451, baseType: !208)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_GCR", file: !371, line: 15, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/gcr.c", directory: "/home/users/ndemeye/xSDK")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 4, size: 512, elements: !373)
!373 = !{!374, !375, !376, !377, !382, !383, !384, !625, !626}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "restart", scope: !372, file: !371, line: 5, baseType: !220, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "n_restarts", scope: !372, file: !371, line: 6, baseType: !220, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !372, file: !371, line: 7, baseType: !283, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "VV", scope: !372, file: !371, line: 8, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SS", scope: !372, file: !371, line: 8, baseType: !378, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !372, file: !371, line: 9, baseType: !379, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc", scope: !372, file: !371, line: 11, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!174, !388, !220, !275, !257}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !391)
!391 = !{!392, !394, !443, !448, !449, !450, !451, !481, !482, !483, !484, !485, !487, !492, !493, !494, !495, !496, !497, !498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !518, !524, !525, !526, !527, !532, !533, !534, !535, !540, !541, !542, !543, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !597, !598, !599, !606, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !622, !623, !624}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !390, file: !102, line: 76, baseType: !393, size: 4480)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !161, line: 122, baseType: !160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !390, file: !102, line: 76, baseType: !395, size: 896, offset: 4480)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 896, elements: !216)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !397)
!397 = !{!398, !402, !406, !410, !418, !419, !423, !424, !428, !432, !436, !437, !441, !442}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !396, file: !102, line: 19, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!174, !388, !379, !378}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !396, file: !102, line: 22, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!174, !388, !379, !379, !378}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !396, file: !102, line: 25, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!174, !388}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !396, file: !102, line: 26, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!174, !388, !414, !414}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !415, line: 16, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !415, line: 16, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !396, file: !102, line: 27, baseType: !407, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !396, file: !102, line: 28, baseType: !420, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!174, !312, !388}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !396, file: !102, line: 29, baseType: !407, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !396, file: !102, line: 30, baseType: !425, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!174, !388, !274, !274}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !396, file: !102, line: 31, baseType: !429, size: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!174, !388, !220, !274, !274, !266}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !396, file: !102, line: 32, baseType: !433, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!174, !388, !336, !336, !266, !378, !274, !274}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !396, file: !102, line: 33, baseType: !407, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !102, line: 34, baseType: !438, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!174, !388, !184}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !396, file: !102, line: 35, baseType: !407, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !396, file: !102, line: 36, baseType: !438, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !390, file: !102, line: 77, baseType: !444, size: 64, offset: 5376)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !445, line: 14, baseType: !446)
!445 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !445, line: 14, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !390, file: !102, line: 78, baseType: !336, size: 32, offset: 5440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !390, file: !102, line: 79, baseType: !336, size: 32, offset: 5472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !390, file: !102, line: 81, baseType: !220, size: 32, offset: 5504)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !390, file: !102, line: 82, baseType: !452, size: 64, offset: 5568)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !455)
!455 = !{!456, !457, !477, !478, !479, !480}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !454, file: !102, line: 55, baseType: !393, size: 4480)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !454, file: !102, line: 55, baseType: !458, size: 448, offset: 4480)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 448, elements: !216)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !460)
!460 = !{!461, !465, !466, !470, !471, !472, !476}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !459, file: !102, line: 42, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!174, !452, !379, !379}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !459, file: !102, line: 43, baseType: !462, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !459, file: !102, line: 44, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!174, !452}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !459, file: !102, line: 45, baseType: !467, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !459, file: !102, line: 46, baseType: !467, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !459, file: !102, line: 47, baseType: !473, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!174, !452, !184}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !459, file: !102, line: 48, baseType: !467, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !454, file: !102, line: 56, baseType: !388, size: 64, offset: 4928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !454, file: !102, line: 57, baseType: !414, size: 64, offset: 4992)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !454, file: !102, line: 58, baseType: !259, size: 64, offset: 5056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !102, line: 59, baseType: !257, size: 64, offset: 5120)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !390, file: !102, line: 83, baseType: !336, size: 32, offset: 5632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !390, file: !102, line: 84, baseType: !336, size: 32, offset: 5664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !390, file: !102, line: 85, baseType: !336, size: 32, offset: 5696)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !390, file: !102, line: 86, baseType: !336, size: 32, offset: 5728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !390, file: !102, line: 87, baseType: !486, size: 32, offset: 5760)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !390, file: !102, line: 88, baseType: !488, size: 384, offset: 5792)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 384, elements: !489)
!489 = !{!490, !491}
!490 = !DISubrange(count: 4)
!491 = !DISubrange(count: 3)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !390, file: !102, line: 89, baseType: !275, size: 64, offset: 6208)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !390, file: !102, line: 90, baseType: !275, size: 64, offset: 6272)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !390, file: !102, line: 91, baseType: !275, size: 64, offset: 6336)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !390, file: !102, line: 92, baseType: !275, size: 64, offset: 6400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !390, file: !102, line: 93, baseType: !275, size: 64, offset: 6464)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !390, file: !102, line: 94, baseType: !275, size: 64, offset: 6528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !390, file: !102, line: 95, baseType: !499, size: 32, offset: 6592)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !390, file: !102, line: 96, baseType: !336, size: 32, offset: 6624)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !390, file: !102, line: 98, baseType: !379, size: 64, offset: 6656)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !390, file: !102, line: 98, baseType: !379, size: 64, offset: 6720)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !390, file: !102, line: 102, baseType: !274, size: 64, offset: 6784)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !390, file: !102, line: 103, baseType: !274, size: 64, offset: 6848)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !390, file: !102, line: 104, baseType: !220, size: 32, offset: 6912)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !390, file: !102, line: 105, baseType: !220, size: 32, offset: 6944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !390, file: !102, line: 106, baseType: !336, size: 32, offset: 6976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !390, file: !102, line: 107, baseType: !274, size: 64, offset: 7040)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !390, file: !102, line: 108, baseType: !274, size: 64, offset: 7104)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !390, file: !102, line: 109, baseType: !220, size: 32, offset: 7168)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !390, file: !102, line: 110, baseType: !220, size: 32, offset: 7200)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !390, file: !102, line: 111, baseType: !336, size: 32, offset: 7232)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !390, file: !102, line: 113, baseType: !220, size: 32, offset: 7264)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !390, file: !102, line: 114, baseType: !336, size: 32, offset: 7296)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !390, file: !102, line: 117, baseType: !220, size: 32, offset: 7328)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !390, file: !102, line: 120, baseType: !517, size: 320, offset: 7360)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 320, elements: !354)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !390, file: !102, line: 121, baseType: !519, size: 320, offset: 7680)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !354)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!174, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !390, file: !102, line: 122, baseType: !362, size: 320, offset: 8000)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !390, file: !102, line: 123, baseType: !220, size: 32, offset: 8320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !390, file: !102, line: 124, baseType: !336, size: 32, offset: 8352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !390, file: !102, line: 126, baseType: !528, size: 320, offset: 8384)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !354)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!174, !388, !257}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !390, file: !102, line: 127, baseType: !519, size: 320, offset: 8704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !390, file: !102, line: 128, baseType: !362, size: 320, offset: 9024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !390, file: !102, line: 129, baseType: !220, size: 32, offset: 9344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !390, file: !102, line: 131, baseType: !536, size: 64, offset: 9408)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!174, !388, !220, !275, !539, !257}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !390, file: !102, line: 132, baseType: !303, size: 64, offset: 9472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !390, file: !102, line: 133, baseType: !257, size: 64, offset: 9536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !390, file: !102, line: 135, baseType: !257, size: 64, offset: 9600)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !390, file: !102, line: 137, baseType: !544, size: 64, offset: 9664)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !102, line: 139, baseType: !257, size: 64, offset: 9728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9792)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9824)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9856)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9888)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9920)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9952)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 9984)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10016)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10048)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10080)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !390, file: !102, line: 142, baseType: !336, size: 32, offset: 10208)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10240)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10304)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10368)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10432)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10560)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10624)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10688)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10816)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10880)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 10944)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 11008)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !390, file: !102, line: 143, baseType: !184, size: 64, offset: 11072)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11136)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11168)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11200)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11232)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11264)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11296)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11328)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11360)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11392)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11424)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11456)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11488)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11520)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !390, file: !102, line: 144, baseType: !577, size: 32, offset: 11552)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !390, file: !102, line: 147, baseType: !220, size: 32, offset: 11584)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !390, file: !102, line: 148, baseType: !378, size: 64, offset: 11648)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !390, file: !102, line: 150, baseType: !594, size: 32, offset: 11712)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !390, file: !102, line: 151, baseType: !336, size: 32, offset: 11744)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !390, file: !102, line: 153, baseType: !220, size: 32, offset: 11776)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !390, file: !102, line: 154, baseType: !220, size: 32, offset: 11808)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !390, file: !102, line: 156, baseType: !336, size: 32, offset: 11840)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !390, file: !102, line: 161, baseType: !600, size: 192, offset: 11904)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !102, line: 157, size: 192, elements: !601)
!601 = !{!602, !603, !604, !605}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !600, file: !102, line: 158, baseType: !414, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !600, file: !102, line: 158, baseType: !414, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !600, file: !102, line: 159, baseType: !336, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !600, file: !102, line: 160, baseType: !336, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !390, file: !102, line: 163, baseType: !607, size: 32, offset: 12096)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !390, file: !102, line: 165, baseType: !486, size: 32, offset: 12128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !390, file: !102, line: 166, baseType: !607, size: 32, offset: 12160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !390, file: !102, line: 171, baseType: !336, size: 32, offset: 12192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !390, file: !102, line: 172, baseType: !336, size: 32, offset: 12224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !390, file: !102, line: 173, baseType: !336, size: 32, offset: 12256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !390, file: !102, line: 174, baseType: !379, size: 64, offset: 12288)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !390, file: !102, line: 175, baseType: !379, size: 64, offset: 12352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !390, file: !102, line: 177, baseType: !220, size: 32, offset: 12416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !390, file: !102, line: 178, baseType: !336, size: 32, offset: 12448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !390, file: !102, line: 180, baseType: !184, size: 64, offset: 12480)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !390, file: !102, line: 182, baseType: !619, size: 64, offset: 12544)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!174, !388, !379, !379, !257}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !390, file: !102, line: 183, baseType: !619, size: 64, offset: 12608)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !390, file: !102, line: 184, baseType: !257, size: 64, offset: 12672)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !390, file: !102, line: 184, baseType: !257, size: 64, offset: 12736)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc_destroy", scope: !372, file: !371, line: 12, baseType: !303, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc_ctx", scope: !372, file: !371, line: 14, baseType: !257, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !177, line: 331, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !177, line: 331, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !177, line: 338, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !177, line: 338, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !128)
!634 = !{i32 7, !"Dwarf Version", i32 4}
!635 = !{i32 2, !"Debug Info Version", i32 3}
!636 = !{i32 1, !"wchar_size", i32 4}
!637 = !{i32 7, !"PIC Level", i32 2}
!638 = !{i32 7, !"uwtable", i32 1}
!639 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!640 = distinct !DISubprogram(name: "KSPGCRSetModifyPC", scope: !371, file: !371, line: 247, type: !641, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!174, !388, !385, !257, !303}
!643 = !{!644, !645, !646, !647, !648, !649, !652, !653, !655, !659}
!644 = !DILocalVariable(name: "ksp", arg: 1, scope: !640, file: !371, line: 247, type: !388)
!645 = !DILocalVariable(name: "function", arg: 2, scope: !640, file: !371, line: 247, type: !385)
!646 = !DILocalVariable(name: "data", arg: 3, scope: !640, file: !371, line: 247, type: !257)
!647 = !DILocalVariable(name: "destroy", arg: 4, scope: !640, file: !371, line: 247, type: !303)
!648 = !DILocalVariable(name: "ierr", scope: !640, file: !371, line: 249, type: !174)
!649 = !DILocalVariable(name: "_7_f", scope: !650, file: !371, line: 252, type: !651)
!650 = distinct !DILexicalBlock(scope: !640, file: !371, line: 252, column: 10)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!652 = !DILocalVariable(name: "_7_ierr", scope: !650, file: !371, line: 252, type: !174)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !371, line: 252, type: !174)
!654 = distinct !DILexicalBlock(scope: !650, file: !371, line: 252, column: 10)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !371, line: 252, type: !174)
!656 = distinct !DILexicalBlock(scope: !657, file: !371, line: 252, column: 10)
!657 = distinct !DILexicalBlock(scope: !658, file: !371, line: 252, column: 10)
!658 = distinct !DILexicalBlock(scope: !650, file: !371, line: 252, column: 10)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !371, line: 252, type: !174)
!660 = distinct !DILexicalBlock(scope: !640, file: !371, line: 252, column: 172)
!661 = !DILocation(line: 0, scope: !640)
!662 = !DILocation(line: 251, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !371, line: 251, column: 3)
!664 = distinct !DILexicalBlock(scope: !665, file: !371, line: 251, column: 3)
!665 = distinct !DILexicalBlock(scope: !640, file: !371, line: 251, column: 3)
!666 = !{!667, !667, i64 0}
!667 = !{!"any pointer", !668, i64 0}
!668 = !{!"omnipotent char", !669, i64 0}
!669 = !{!"Simple C/C++ TBAA"}
!670 = !DILocation(line: 251, column: 3, scope: !664)
!671 = !DILocation(line: 251, column: 3, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !371, line: 251, column: 3)
!673 = distinct !DILexicalBlock(scope: !663, file: !371, line: 251, column: 3)
!674 = !{!675, !676, i64 1536}
!675 = !{!"", !668, i64 0, !668, i64 512, !668, i64 1024, !668, i64 1280, !676, i64 1536, !676, i64 1540, !668, i64 1544}
!676 = !{!"int", !668, i64 0}
!677 = !DILocation(line: 251, column: 3, scope: !673)
