; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/guess/impls/fischer/fischer.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/guess/impls/fischer/fischer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_KSPGuess = type { %struct._p_PetscObject, [1 x %struct._KSPGuessOps], %struct._p_KSP*, %struct._p_Mat*, i64, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!122 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!140 = !{!141, !145, !146, !221, !349, !352, !231, !26, !355, !181, !315, !356, !5, !358, !207}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !142, line: 330, baseType: !143)
!142 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !142, line: 330, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !149, line: 73, size: 4480, elements: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!150 = !{!151, !153, !202, !203, !205, !208, !209, !210, !211, !219, !220, !222, !226, !230, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !244, !245, !247, !248, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !264, !265, !268, !270, !271, !272, !282, !284, !285, !289, !290, !339, !344, !346, !347, !348}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !148, file: !149, line: 74, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !148, file: !149, line: 75, baseType: !154, size: 448, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 448, elements: !200)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !149, line: 53, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 45, size: 448, elements: !157)
!157 = !{!158, !164, !172, !177, !184, !188, !195}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !156, file: !149, line: 46, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !146, !163}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !156, file: !149, line: 47, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!162, !146, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !169, line: 16, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !169, line: 16, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !156, file: !149, line: 48, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!162, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !156, file: !149, line: 49, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!162, !146, !181, !146}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !156, file: !149, line: 50, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!162, !146, !181, !176}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !156, file: !149, line: 51, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!162, !146, !181, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !156, file: !149, line: 52, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!162, !146, !181, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !148, file: !149, line: 76, baseType: !141, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !149, line: 77, baseType: !204, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !207)
!207 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !148, file: !149, line: 78, baseType: !206, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !149, line: 79, baseType: !212, size: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !215, line: 27, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 43, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!218 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !148, file: !149, line: 80, baseType: !204, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !149, line: 81, baseType: !221, size: 32, offset: 992)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !148, file: !149, line: 82, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !148, file: !149, line: 83, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !148, file: !149, line: 84, baseType: !231, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !148, file: !149, line: 85, baseType: !231, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !148, file: !149, line: 86, baseType: !231, size: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !148, file: !149, line: 87, baseType: !231, size: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !148, file: !149, line: 88, baseType: !146, size: 64, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !148, file: !149, line: 89, baseType: !212, size: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 90, baseType: !231, size: 64, offset: 1536)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !148, file: !149, line: 91, baseType: !231, size: 64, offset: 1600)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !148, file: !149, line: 92, baseType: !204, size: 32, offset: 1664)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !148, file: !149, line: 93, baseType: !145, size: 64, offset: 1728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !148, file: !149, line: 94, baseType: !242, size: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !213)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !148, file: !149, line: 95, baseType: !204, size: 32, offset: 1856)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !148, file: !149, line: 95, baseType: !204, size: 32, offset: 1888)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !148, file: !149, line: 96, baseType: !246, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !148, file: !149, line: 96, baseType: !246, size: 64, offset: 1984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !148, file: !149, line: 97, baseType: !249, size: 64, offset: 2048)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !148, file: !149, line: 97, baseType: !251, size: 64, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !148, file: !149, line: 98, baseType: !204, size: 32, offset: 2176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !148, file: !149, line: 98, baseType: !204, size: 32, offset: 2208)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !148, file: !149, line: 99, baseType: !246, size: 64, offset: 2240)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !148, file: !149, line: 99, baseType: !246, size: 64, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !148, file: !149, line: 100, baseType: !257, size: 64, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !207)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !148, file: !149, line: 100, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !148, file: !149, line: 101, baseType: !204, size: 32, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !148, file: !149, line: 101, baseType: !204, size: 32, offset: 2528)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !148, file: !149, line: 102, baseType: !246, size: 64, offset: 2560)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !148, file: !149, line: 102, baseType: !246, size: 64, offset: 2624)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !148, file: !149, line: 103, baseType: !266, size: 64, offset: 2688)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !148, file: !149, line: 103, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !148, file: !149, line: 104, baseType: !199, size: 64, offset: 2816)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !148, file: !149, line: 105, baseType: !204, size: 32, offset: 2880)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !148, file: !149, line: 106, baseType: !273, size: 128, offset: 2944)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !149, line: 64, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 61, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !276, file: !149, line: 62, baseType: !192, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !149, line: 63, baseType: !145, size: 64, offset: 64)
!280 = !{!281}
!281 = !DISubrange(count: 2)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !148, file: !149, line: 107, baseType: !283, size: 64, offset: 3072)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !148, file: !149, line: 108, baseType: !145, size: 64, offset: 3136)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !148, file: !149, line: 109, baseType: !286, size: 64, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!162, !145}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !148, file: !149, line: 111, baseType: !204, size: 32, offset: 3264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !148, file: !149, line: 112, baseType: !291, size: 320, offset: 3328)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !337)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!162, !295, !146, !145}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !298)
!298 = !{!299, !300, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !297, file: !10, line: 100, baseType: !204, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 101, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !312, !313, !314, !318, !320, !322, !323, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !303, file: !10, line: 84, baseType: !231, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !303, file: !10, line: 85, baseType: !231, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !10, line: 86, baseType: !145, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !303, file: !10, line: 87, baseType: !223, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !10, line: 88, baseType: !310, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !303, file: !10, line: 89, baseType: !183, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !303, file: !10, line: 90, baseType: !231, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !303, file: !10, line: 91, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!317 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !303, file: !10, line: 92, baseType: !319, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !10, line: 93, baseType: !321, size: 32, offset: 544)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !10, line: 94, baseType: !301, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !303, file: !10, line: 95, baseType: !231, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !303, file: !10, line: 96, baseType: !145, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !297, file: !10, line: 102, baseType: !231, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !297, file: !10, line: 103, baseType: !231, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !297, file: !10, line: 104, baseType: !141, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !297, file: !10, line: 106, baseType: !146, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !10, line: 107, baseType: !334, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!337 = !{!338}
!338 = !DISubrange(count: 5)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !148, file: !149, line: 113, baseType: !340, size: 320, offset: 3648)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !337)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!162, !146, !145}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !148, file: !149, line: 114, baseType: !345, size: 320, offset: 3968)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 320, elements: !337)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !148, file: !149, line: 115, baseType: !319, size: 32, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !148, file: !149, line: 120, baseType: !334, size: 64, offset: 4352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !148, file: !149, line: 121, baseType: !319, size: 32, offset: 4416)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !142, line: 331, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !142, line: 331, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !142, line: 338, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !142, line: 338, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !357, line: 1451, baseType: !192)
!357 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuessFischer", file: !360, line: 13, baseType: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/guess/impls/fischer/fischer.c", directory: "/home/users/ndemeye/xSDK")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 3, size: 448, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !374, !375, !376}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !361, file: !360, line: 4, baseType: !204, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !361, file: !360, line: 5, baseType: !204, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "maxl", scope: !361, file: !360, line: 6, baseType: !204, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !361, file: !360, line: 7, baseType: !319, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !361, file: !360, line: 8, baseType: !266, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "xtilde", scope: !361, file: !360, line: 9, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !371, line: 21, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !371, line: 21, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "btilde", scope: !361, file: !360, line: 10, baseType: !369, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Ax", scope: !361, file: !360, line: 11, baseType: !370, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !361, file: !360, line: 12, baseType: !370, size: 64, offset: 384)
!377 = !{i32 7, !"Dwarf Version", i32 4}
!378 = !{i32 2, !"Debug Info Version", i32 3}
!379 = !{i32 1, !"wchar_size", i32 4}
!380 = !{i32 7, !"PIC Level", i32 2}
!381 = !{i32 7, !"uwtable", i32 1}
!382 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!383 = distinct !DISubprogram(name: "KSPGuessFischerSetModel", scope: !360, file: !360, line: 262, type: !384, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !626)
!384 = !DISubroutineType(types: !385)
!385 = !{!162, !386, !204, !204}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !389)
!389 = !{!390, !392, !412, !623, !624, !625}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !388, file: !102, line: 55, baseType: !391, size: 4480)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !149, line: 122, baseType: !148)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !388, file: !102, line: 55, baseType: !393, size: 448, offset: 4480)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 448, elements: !200)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !395)
!395 = !{!396, !400, !401, !405, !406, !407, !411}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !394, file: !102, line: 42, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!162, !386, !370, !370}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !394, file: !102, line: 43, baseType: !397, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !394, file: !102, line: 44, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!162, !386}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !394, file: !102, line: 45, baseType: !402, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !394, file: !102, line: 46, baseType: !402, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !394, file: !102, line: 47, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!162, !386, !168}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !394, file: !102, line: 48, baseType: !402, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !388, file: !102, line: 56, baseType: !413, size: 64, offset: 4928)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !416)
!416 = !{!417, !418, !467, !472, !473, !474, !475, !476, !477, !478, !479, !480, !482, !487, !488, !489, !490, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !516, !522, !523, !524, !525, !530, !531, !532, !533, !538, !539, !540, !541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !593, !594, !595, !596, !597, !604, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !620, !621, !622}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !415, file: !102, line: 76, baseType: !391, size: 4480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !415, file: !102, line: 76, baseType: !419, size: 896, offset: 4480)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 896, elements: !200)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !421)
!421 = !{!422, !426, !430, !434, !442, !443, !447, !448, !452, !456, !460, !461, !465, !466}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !420, file: !102, line: 19, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!162, !413, !370, !369}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !420, file: !102, line: 22, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!162, !413, !370, !370, !369}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !420, file: !102, line: 25, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!162, !413}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !420, file: !102, line: 26, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!162, !413, !438, !438}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !439, line: 16, baseType: !440)
!439 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !439, line: 16, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !420, file: !102, line: 27, baseType: !431, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !420, file: !102, line: 28, baseType: !444, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!162, !295, !413}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !420, file: !102, line: 29, baseType: !431, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !420, file: !102, line: 30, baseType: !449, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!162, !413, !257, !257}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !420, file: !102, line: 31, baseType: !453, size: 64, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!162, !413, !204, !257, !257, !249}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !420, file: !102, line: 32, baseType: !457, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!162, !413, !319, !319, !249, !369, !257, !257}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !420, file: !102, line: 33, baseType: !431, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !420, file: !102, line: 34, baseType: !462, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!162, !413, !168}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !420, file: !102, line: 35, baseType: !431, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !420, file: !102, line: 36, baseType: !462, size: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !415, file: !102, line: 77, baseType: !468, size: 64, offset: 5376)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !469, line: 14, baseType: !470)
!469 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !469, line: 14, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !415, file: !102, line: 78, baseType: !319, size: 32, offset: 5440)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !415, file: !102, line: 79, baseType: !319, size: 32, offset: 5472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !415, file: !102, line: 81, baseType: !204, size: 32, offset: 5504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !415, file: !102, line: 82, baseType: !386, size: 64, offset: 5568)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !415, file: !102, line: 83, baseType: !319, size: 32, offset: 5632)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !415, file: !102, line: 84, baseType: !319, size: 32, offset: 5664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !415, file: !102, line: 85, baseType: !319, size: 32, offset: 5696)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !415, file: !102, line: 86, baseType: !319, size: 32, offset: 5728)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !415, file: !102, line: 87, baseType: !481, size: 32, offset: 5760)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !415, file: !102, line: 88, baseType: !483, size: 384, offset: 5792)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 384, elements: !484)
!484 = !{!485, !486}
!485 = !DISubrange(count: 4)
!486 = !DISubrange(count: 3)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !415, file: !102, line: 89, baseType: !258, size: 64, offset: 6208)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !415, file: !102, line: 90, baseType: !258, size: 64, offset: 6272)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !415, file: !102, line: 91, baseType: !258, size: 64, offset: 6336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !415, file: !102, line: 92, baseType: !258, size: 64, offset: 6400)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !415, file: !102, line: 93, baseType: !258, size: 64, offset: 6464)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !415, file: !102, line: 94, baseType: !258, size: 64, offset: 6528)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !415, file: !102, line: 95, baseType: !494, size: 32, offset: 6592)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !415, file: !102, line: 96, baseType: !319, size: 32, offset: 6624)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !415, file: !102, line: 98, baseType: !370, size: 64, offset: 6656)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !415, file: !102, line: 98, baseType: !370, size: 64, offset: 6720)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !415, file: !102, line: 102, baseType: !257, size: 64, offset: 6784)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !415, file: !102, line: 103, baseType: !257, size: 64, offset: 6848)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !415, file: !102, line: 104, baseType: !204, size: 32, offset: 6912)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !415, file: !102, line: 105, baseType: !204, size: 32, offset: 6944)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !415, file: !102, line: 106, baseType: !319, size: 32, offset: 6976)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !415, file: !102, line: 107, baseType: !257, size: 64, offset: 7040)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !415, file: !102, line: 108, baseType: !257, size: 64, offset: 7104)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !415, file: !102, line: 109, baseType: !204, size: 32, offset: 7168)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !415, file: !102, line: 110, baseType: !204, size: 32, offset: 7200)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !415, file: !102, line: 111, baseType: !319, size: 32, offset: 7232)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !415, file: !102, line: 113, baseType: !204, size: 32, offset: 7264)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !415, file: !102, line: 114, baseType: !319, size: 32, offset: 7296)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !415, file: !102, line: 117, baseType: !204, size: 32, offset: 7328)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !415, file: !102, line: 120, baseType: !512, size: 320, offset: 7360)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !337)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!162, !413, !204, !258, !145}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !415, file: !102, line: 121, baseType: !517, size: 320, offset: 7680)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 320, elements: !337)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!162, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !415, file: !102, line: 122, baseType: !345, size: 320, offset: 8000)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !415, file: !102, line: 123, baseType: !204, size: 32, offset: 8320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !415, file: !102, line: 124, baseType: !319, size: 32, offset: 8352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !415, file: !102, line: 126, baseType: !526, size: 320, offset: 8384)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !337)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!162, !413, !145}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !415, file: !102, line: 127, baseType: !517, size: 320, offset: 8704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !415, file: !102, line: 128, baseType: !345, size: 320, offset: 9024)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !415, file: !102, line: 129, baseType: !204, size: 32, offset: 9344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !415, file: !102, line: 131, baseType: !534, size: 64, offset: 9408)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!162, !413, !204, !258, !537, !145}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !415, file: !102, line: 132, baseType: !286, size: 64, offset: 9472)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !415, file: !102, line: 133, baseType: !145, size: 64, offset: 9536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !415, file: !102, line: 135, baseType: !145, size: 64, offset: 9600)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !415, file: !102, line: 137, baseType: !542, size: 64, offset: 9664)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !102, line: 139, baseType: !145, size: 64, offset: 9728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9824)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9888)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9952)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 9984)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10016)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10048)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10080)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10176)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !415, file: !102, line: 142, baseType: !319, size: 32, offset: 10208)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10304)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10368)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10432)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10496)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10560)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10624)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10688)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10752)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10816)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10880)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 10944)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 11008)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !415, file: !102, line: 143, baseType: !168, size: 64, offset: 11072)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11136)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11168)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11232)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11264)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11296)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11328)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11360)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11392)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11424)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11456)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11488)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11520)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !415, file: !102, line: 144, baseType: !575, size: 32, offset: 11552)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !415, file: !102, line: 147, baseType: !204, size: 32, offset: 11584)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !415, file: !102, line: 148, baseType: !369, size: 64, offset: 11648)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !415, file: !102, line: 150, baseType: !592, size: 32, offset: 11712)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !415, file: !102, line: 151, baseType: !319, size: 32, offset: 11744)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !415, file: !102, line: 153, baseType: !204, size: 32, offset: 11776)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !415, file: !102, line: 154, baseType: !204, size: 32, offset: 11808)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !415, file: !102, line: 156, baseType: !319, size: 32, offset: 11840)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !415, file: !102, line: 161, baseType: !598, size: 192, offset: 11904)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !102, line: 157, size: 192, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !598, file: !102, line: 158, baseType: !438, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !598, file: !102, line: 158, baseType: !438, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !598, file: !102, line: 159, baseType: !319, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !598, file: !102, line: 160, baseType: !319, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !415, file: !102, line: 163, baseType: !605, size: 32, offset: 12096)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !415, file: !102, line: 165, baseType: !481, size: 32, offset: 12128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !415, file: !102, line: 166, baseType: !605, size: 32, offset: 12160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !415, file: !102, line: 171, baseType: !319, size: 32, offset: 12192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !415, file: !102, line: 172, baseType: !319, size: 32, offset: 12224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !415, file: !102, line: 173, baseType: !319, size: 32, offset: 12256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !415, file: !102, line: 174, baseType: !370, size: 64, offset: 12288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !415, file: !102, line: 175, baseType: !370, size: 64, offset: 12352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !415, file: !102, line: 177, baseType: !204, size: 32, offset: 12416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !415, file: !102, line: 178, baseType: !319, size: 32, offset: 12448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !415, file: !102, line: 180, baseType: !168, size: 64, offset: 12480)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !415, file: !102, line: 182, baseType: !617, size: 64, offset: 12544)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!162, !413, !370, !370, !145}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !415, file: !102, line: 183, baseType: !617, size: 64, offset: 12608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !415, file: !102, line: 184, baseType: !145, size: 64, offset: 12672)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !415, file: !102, line: 184, baseType: !145, size: 64, offset: 12736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !388, file: !102, line: 57, baseType: !438, size: 64, offset: 4992)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !388, file: !102, line: 58, baseType: !242, size: 64, offset: 5056)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !102, line: 59, baseType: !145, size: 64, offset: 5120)
!626 = !{!627, !628, !629, !630, !631, !633, !634, !635, !636, !638, !642, !643, !645, !651, !652, !654, !657, !658, !660, !663, !664, !667, !668, !670, !674}
!627 = !DILocalVariable(name: "guess", arg: 1, scope: !383, file: !360, line: 262, type: !386)
!628 = !DILocalVariable(name: "model", arg: 2, scope: !383, file: !360, line: 262, type: !204)
!629 = !DILocalVariable(name: "size", arg: 3, scope: !383, file: !360, line: 262, type: !204)
!630 = !DILocalVariable(name: "ierr", scope: !383, file: !360, line: 264, type: !162)
!631 = !DILocalVariable(name: "_7_ierr", scope: !632, file: !360, line: 268, type: !162)
!632 = distinct !DILexicalBlock(scope: !383, file: !360, line: 268, column: 3)
!633 = !DILocalVariable(name: "b0", scope: !632, file: !360, line: 268, type: !204)
!634 = !DILocalVariable(name: "b1", scope: !632, file: !360, line: 268, type: !283)
!635 = !DILocalVariable(name: "b2", scope: !632, file: !360, line: 268, type: !283)
!636 = !DILocalVariable(name: "_4_ierr", scope: !637, file: !360, line: 268, type: !162)
!637 = distinct !DILexicalBlock(scope: !632, file: !360, line: 268, column: 3)
!638 = !DILocalVariable(name: "a_b1", scope: !637, file: !360, line: 268, type: !639)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 192, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 6)
!642 = !DILocalVariable(name: "a_b2", scope: !637, file: !360, line: 268, type: !639)
!643 = !DILocalVariable(name: "_7_errorcode", scope: !644, file: !360, line: 268, type: !162)
!644 = distinct !DILexicalBlock(scope: !637, file: !360, line: 268, column: 3)
!645 = !DILocalVariable(name: "_7_errorstring", scope: !646, file: !360, line: 268, type: !648)
!646 = distinct !DILexicalBlock(scope: !647, file: !360, line: 268, column: 3)
!647 = distinct !DILexicalBlock(scope: !644, file: !360, line: 268, column: 3)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2048, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 256)
!651 = !DILocalVariable(name: "_7_resultlen", scope: !646, file: !360, line: 268, type: !221)
!652 = !DILocalVariable(name: "_7_errorcode", scope: !653, file: !360, line: 268, type: !162)
!653 = distinct !DILexicalBlock(scope: !637, file: !360, line: 268, column: 3)
!654 = !DILocalVariable(name: "_7_errorstring", scope: !655, file: !360, line: 268, type: !648)
!655 = distinct !DILexicalBlock(scope: !656, file: !360, line: 268, column: 3)
!656 = distinct !DILexicalBlock(scope: !653, file: !360, line: 268, column: 3)
!657 = !DILocalVariable(name: "_7_resultlen", scope: !655, file: !360, line: 268, type: !221)
!658 = !DILocalVariable(name: "_7_errorcode", scope: !659, file: !360, line: 268, type: !162)
!659 = distinct !DILexicalBlock(scope: !632, file: !360, line: 268, column: 3)
!660 = !DILocalVariable(name: "_7_errorstring", scope: !661, file: !360, line: 268, type: !648)
!661 = distinct !DILexicalBlock(scope: !662, file: !360, line: 268, column: 3)
!662 = distinct !DILexicalBlock(scope: !659, file: !360, line: 268, column: 3)
!663 = !DILocalVariable(name: "_7_resultlen", scope: !661, file: !360, line: 268, type: !221)
!664 = !DILocalVariable(name: "_7_f", scope: !665, file: !360, line: 269, type: !666)
!665 = distinct !DILexicalBlock(scope: !383, file: !360, line: 269, column: 10)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!667 = !DILocalVariable(name: "_7_ierr", scope: !665, file: !360, line: 269, type: !162)
!668 = !DILocalVariable(name: "ierr__", scope: !669, file: !360, line: 269, type: !162)
!669 = distinct !DILexicalBlock(scope: !665, file: !360, line: 269, column: 10)
!670 = !DILocalVariable(name: "ierr__", scope: !671, file: !360, line: 269, type: !162)
!671 = distinct !DILexicalBlock(scope: !672, file: !360, line: 269, column: 10)
!672 = distinct !DILexicalBlock(scope: !673, file: !360, line: 269, column: 10)
!673 = distinct !DILexicalBlock(scope: !665, file: !360, line: 269, column: 10)
!674 = !DILocalVariable(name: "ierr__", scope: !675, file: !360, line: 269, type: !162)
!675 = distinct !DILexicalBlock(scope: !383, file: !360, line: 269, column: 108)
!676 = !DILocation(line: 0, scope: !383)
!677 = !DILocation(line: 266, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !360, line: 266, column: 3)
!679 = distinct !DILexicalBlock(scope: !680, file: !360, line: 266, column: 3)
!680 = distinct !DILexicalBlock(scope: !383, file: !360, line: 266, column: 3)
!681 = !{!682, !682, i64 0}
!682 = !{!"any pointer", !683, i64 0}
!683 = !{!"omnipotent char", !684, i64 0}
!684 = !{!"Simple C/C++ TBAA"}
!685 = !DILocation(line: 266, column: 3, scope: !679)
!686 = !DILocation(line: 266, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !360, line: 266, column: 3)
!688 = distinct !DILexicalBlock(scope: !678, file: !360, line: 266, column: 3)
!689 = !{!690, !691, i64 1536}
!690 = !{!"", !683, i64 0, !683, i64 512, !683, i64 1024, !683, i64 1280, !691, i64 1536, !691, i64 1540, !683, i64 1544}
!691 = !{!"int", !683, i64 0}
!692 = !DILocation(line: 266, column: 3, scope: !688)
!693 = !DILocation(line: 266, column: 3, scope: !694)
!694 = distinct !DILexicalBlock(scope: !687, file: !360, line: 266, column: 3)
!695 = !{!691, !691, i64 0}
!696 = !{!690, !691, i64 1540}
!697 = !DILocation(line: 267, column: 3, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !360, line: 267, column: 3)
!699 = distinct !DILexicalBlock(scope: !383, file: !360, line: 267, column: 3)
!700 = !DILocation(line: 267, column: 3, scope: !699)
!701 = !DILocation(line: 267, column: 3, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !360, line: 267, column: 3)
!703 = !DILocation(line: 267, column: 3, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !360, line: 267, column: 3)
!705 = !{!706, !691, i64 0}
!706 = !{!"_p_PetscObject", !691, i64 0, !683, i64 8, !682, i64 64, !691, i64 72, !707, i64 80, !707, i64 88, !707, i64 96, !707, i64 104, !708, i64 112, !691, i64 120, !691, i64 124, !682, i64 128, !682, i64 136, !682, i64 144, !682, i64 152, !682, i64 160, !682, i64 168, !682, i64 176, !708, i64 184, !682, i64 192, !682, i64 200, !691, i64 208, !682, i64 216, !708, i64 224, !691, i64 232, !691, i64 236, !682, i64 240, !682, i64 248, !682, i64 256, !682, i64 264, !691, i64 272, !691, i64 276, !682, i64 280, !682, i64 288, !682, i64 296, !682, i64 304, !691, i64 312, !691, i64 316, !682, i64 320, !682, i64 328, !682, i64 336, !682, i64 344, !682, i64 352, !691, i64 360, !683, i64 368, !683, i64 384, !682, i64 392, !682, i64 400, !691, i64 408, !683, i64 416, !683, i64 456, !683, i64 496, !683, i64 536, !682, i64 544, !683, i64 552}
!707 = !{!"double", !683, i64 0}
!708 = !{!"long", !683, i64 0}
!709 = !DILocation(line: 267, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !360, line: 267, column: 3)
!711 = distinct !DILexicalBlock(scope: !704, file: !360, line: 267, column: 3)
!712 = !DILocation(line: 267, column: 3, scope: !711)
!713 = !DILocation(line: 0, scope: !632)
!714 = !DILocation(line: 268, column: 3, scope: !632)
!715 = !DILocation(line: 268, column: 3, scope: !637)
!716 = !DILocalVariable(name: "comm", arg: 1, scope: !717, file: !718, line: 498, type: !141)
!717 = distinct !DISubprogram(name: "PetscMPIParallelComm", scope: !718, file: !718, line: 498, type: !719, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !721)
!718 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!719 = !DISubroutineType(types: !720)
!720 = !{!26, !141}
!721 = !{!716, !722}
!722 = !DILocalVariable(name: "size", scope: !717, file: !718, line: 500, type: !221)
!723 = !DILocation(line: 0, scope: !717, inlinedAt: !724)
!724 = distinct !DILocation(line: 268, column: 3, scope: !637)
!725 = !DILocation(line: 500, column: 3, scope: !717, inlinedAt: !724)
!726 = !DILocation(line: 500, column: 21, scope: !717, inlinedAt: !724)
!727 = !DILocation(line: 500, column: 55, scope: !717, inlinedAt: !724)
!728 = !DILocation(line: 500, column: 60, scope: !717, inlinedAt: !724)
!729 = !DILocation(line: 501, column: 1, scope: !717, inlinedAt: !724)
!730 = !{!707, !707, i64 0}
!731 = !DILocation(line: 0, scope: !637)
!732 = !DILocation(line: 0, scope: !644)
!733 = !DILocation(line: 268, column: 3, scope: !647)
!734 = !DILocation(line: 268, column: 3, scope: !644)
!735 = !{!"branch_weights", i32 2000, i32 1}
!736 = !DILocation(line: 268, column: 3, scope: !646)
!737 = !DILocation(line: 0, scope: !646)
!738 = !DILocation(line: 268, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !637, file: !360, line: 268, column: 3)
!740 = !DILocation(line: 268, column: 3, scope: !741)
!741 = distinct !DILexicalBlock(scope: !637, file: !360, line: 268, column: 3)
!742 = !DILocation(line: 268, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !637, file: !360, line: 268, column: 3)
!744 = !DILocation(line: 0, scope: !717, inlinedAt: !745)
!745 = distinct !DILocation(line: 268, column: 3, scope: !637)
!746 = !DILocation(line: 500, column: 3, scope: !717, inlinedAt: !745)
!747 = !DILocation(line: 500, column: 21, scope: !717, inlinedAt: !745)
!748 = !DILocation(line: 500, column: 55, scope: !717, inlinedAt: !745)
!749 = !DILocation(line: 500, column: 60, scope: !717, inlinedAt: !745)
!750 = !DILocation(line: 501, column: 1, scope: !717, inlinedAt: !745)
!751 = !DILocation(line: 0, scope: !653)
!752 = !DILocation(line: 268, column: 3, scope: !656)
!753 = !DILocation(line: 268, column: 3, scope: !653)
!754 = !DILocation(line: 268, column: 3, scope: !655)
!755 = !DILocation(line: 0, scope: !655)
!756 = !DILocation(line: 268, column: 3, scope: !757)
!757 = distinct !DILexicalBlock(scope: !632, file: !360, line: 268, column: 3)
!758 = !DILocation(line: 268, column: 3, scope: !383)
!759 = !DILocation(line: 269, column: 10, scope: !665)
!760 = !DILocation(line: 0, scope: !665)
!761 = !DILocation(line: 0, scope: !669)
!762 = !DILocation(line: 269, column: 10, scope: !763)
!763 = distinct !DILexicalBlock(scope: !669, file: !360, line: 269, column: 10)
!764 = !DILocation(line: 269, column: 10, scope: !669)
!765 = !DILocation(line: 269, column: 10, scope: !673)
!766 = !DILocation(line: 269, column: 10, scope: !672)
!767 = !DILocation(line: 0, scope: !671)
!768 = !DILocation(line: 269, column: 10, scope: !769)
!769 = distinct !DILexicalBlock(scope: !671, file: !360, line: 269, column: 10)
!770 = !DILocation(line: 269, column: 10, scope: !671)
!771 = !DILocation(line: 269, column: 10, scope: !383)
!772 = !DILocation(line: 270, column: 3, scope: !773)
!773 = distinct !DILexicalBlock(scope: !774, file: !360, line: 270, column: 3)
!774 = distinct !DILexicalBlock(scope: !775, file: !360, line: 270, column: 3)
!775 = distinct !DILexicalBlock(scope: !383, file: !360, line: 270, column: 3)
!776 = !DILocation(line: 270, column: 3, scope: !774)
!777 = !DILocation(line: 270, column: 3, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !360, line: 270, column: 3)
!779 = distinct !DILexicalBlock(scope: !773, file: !360, line: 270, column: 3)
!780 = !DILocation(line: 270, column: 3, scope: !779)
!781 = !DILocation(line: 270, column: 3, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !360, line: 270, column: 3)
!783 = distinct !DILexicalBlock(scope: !778, file: !360, line: 270, column: 3)
!784 = !{!690, !683, i64 1544}
!785 = !DILocation(line: 270, column: 3, scope: !783)
!786 = !DILocation(line: 270, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !782, file: !360, line: 270, column: 3)
!788 = !DILocation(line: 270, column: 3, scope: !789)
!789 = distinct !DILexicalBlock(scope: !778, file: !360, line: 270, column: 3)
!790 = !DILocation(line: 270, column: 3, scope: !791)
!791 = distinct !DILexicalBlock(scope: !789, file: !360, line: 270, column: 3)
!792 = !DILocation(line: 270, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !360, line: 270, column: 3)
!794 = distinct !DILexicalBlock(scope: !791, file: !360, line: 270, column: 3)
!795 = !DILocation(line: 270, column: 3, scope: !794)
!796 = !DILocation(line: 270, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !793, file: !360, line: 270, column: 3)
!798 = !DILocation(line: 271, column: 1, scope: !383)
!799 = !DISubprogram(name: "PetscError", scope: !115, file: !115, line: 668, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{!162, !143, !26, !181, !181, !26, !114, !181, null}
!802 = !{}
!803 = !DISubprogram(name: "PetscCheckPointer", scope: !149, file: !149, line: 183, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!804 = !DISubroutineType(types: !805)
!805 = !{!3, !806, !120}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!808 = !DISubprogram(name: "PetscObjectComm", scope: !357, file: !357, line: 2649, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!809 = !DISubroutineType(types: !810)
!810 = !{!143, !147}
!811 = !DISubprogram(name: "MPI_Allreduce", scope: !142, file: !142, line: 1218, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!812 = !DISubroutineType(types: !813)
!813 = !{!26, !806, !145, !26, !350, !353, !143}
!814 = !DISubprogram(name: "MPI_Error_string", scope: !142, file: !142, line: 1357, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!815 = !DISubroutineType(types: !816)
!816 = !{!26, !26, !231, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!818 = !DISubprogram(name: "PetscObjectQueryFunction_Private", scope: !357, file: !357, line: 1495, type: !819, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!819 = !DISubroutineType(types: !820)
!820 = !{!26, !147, !181, !199}
!821 = distinct !DISubprogram(name: "KSPGuessCreate_Fischer", scope: !360, file: !360, line: 330, type: !403, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !822)
!822 = !{!823, !824, !825, !826, !828}
!823 = !DILocalVariable(name: "guess", arg: 1, scope: !821, file: !360, line: 330, type: !386)
!824 = !DILocalVariable(name: "fischer", scope: !821, file: !360, line: 332, type: !358)
!825 = !DILocalVariable(name: "ierr", scope: !821, file: !360, line: 333, type: !162)
!826 = !DILocalVariable(name: "ierr__", scope: !827, file: !360, line: 336, type: !162)
!827 = distinct !DILexicalBlock(scope: !821, file: !360, line: 336, column: 38)
!828 = !DILocalVariable(name: "ierr__", scope: !829, file: !360, line: 349, type: !162)
!829 = distinct !DILexicalBlock(scope: !821, file: !360, line: 349, column: 117)
!830 = !DILocation(line: 0, scope: !821)
!831 = !DILocation(line: 332, column: 3, scope: !821)
!832 = !DILocation(line: 335, column: 3, scope: !833)
!833 = distinct !DILexicalBlock(scope: !834, file: !360, line: 335, column: 3)
!834 = distinct !DILexicalBlock(scope: !835, file: !360, line: 335, column: 3)
!835 = distinct !DILexicalBlock(scope: !821, file: !360, line: 335, column: 3)
!836 = !DILocation(line: 335, column: 3, scope: !834)
!837 = !DILocation(line: 335, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !360, line: 335, column: 3)
!839 = distinct !DILexicalBlock(scope: !833, file: !360, line: 335, column: 3)
!840 = !DILocation(line: 335, column: 3, scope: !839)
!841 = !DILocation(line: 335, column: 3, scope: !842)
!842 = distinct !DILexicalBlock(scope: !838, file: !360, line: 335, column: 3)
!843 = !DILocation(line: 336, column: 10, scope: !821)
!844 = !{!"branch_weights", i32 2146410443, i32 1073205}
!845 = !DILocation(line: 0, scope: !827)
!846 = !DILocation(line: 336, column: 38, scope: !827)
!847 = !DILocation(line: 336, column: 38, scope: !848)
!848 = distinct !DILexicalBlock(scope: !827, file: !360, line: 336, column: 38)
!849 = !DILocation(line: 337, column: 3, scope: !821)
!850 = !DILocation(line: 337, column: 12, scope: !821)
!851 = !DILocation(line: 337, column: 19, scope: !821)
!852 = !{!853, !691, i64 0}
!853 = !{!"", !691, i64 0, !691, i64 4, !691, i64 8, !683, i64 12, !682, i64 16, !682, i64 24, !682, i64 32, !682, i64 40, !682, i64 48}
!854 = !DILocation(line: 338, column: 12, scope: !821)
!855 = !DILocation(line: 338, column: 19, scope: !821)
!856 = !{!853, !691, i64 8}
!857 = !DILocation(line: 339, column: 10, scope: !821)
!858 = !DILocation(line: 339, column: 19, scope: !821)
!859 = !{!860, !682, i64 640}
!860 = !{!"_p_KSPGuess", !706, i64 0, !683, i64 560, !682, i64 616, !682, i64 624, !708, i64 632, !682, i64 640}
!861 = !DILocation(line: 341, column: 15, scope: !821)
!862 = !DILocation(line: 341, column: 30, scope: !821)
!863 = !{!864, !682, i64 16}
!864 = !{!"_KSPGuessOps", !682, i64 0, !682, i64 8, !682, i64 16, !682, i64 24, !682, i64 32, !682, i64 40, !682, i64 48}
!865 = !DILocation(line: 342, column: 15, scope: !821)
!866 = !DILocation(line: 342, column: 30, scope: !821)
!867 = !{!864, !682, i64 32}
!868 = !DILocation(line: 343, column: 15, scope: !821)
!869 = !DILocation(line: 343, column: 30, scope: !821)
!870 = !{!864, !682, i64 24}
!871 = !DILocation(line: 344, column: 15, scope: !821)
!872 = !DILocation(line: 344, column: 30, scope: !821)
!873 = !{!864, !682, i64 40}
!874 = !DILocation(line: 345, column: 15, scope: !821)
!875 = !DILocation(line: 345, column: 30, scope: !821)
!876 = !{!864, !682, i64 48}
!877 = !DILocation(line: 346, column: 15, scope: !821)
!878 = !DILocation(line: 346, column: 30, scope: !821)
!879 = !{!864, !682, i64 8}
!880 = !DILocation(line: 347, column: 15, scope: !821)
!881 = !DILocation(line: 347, column: 30, scope: !821)
!882 = !{!864, !682, i64 0}
!883 = !DILocation(line: 349, column: 10, scope: !821)
!884 = !DILocation(line: 0, scope: !829)
!885 = !DILocation(line: 349, column: 117, scope: !886)
!886 = distinct !DILexicalBlock(scope: !829, file: !360, line: 349, column: 117)
!887 = !DILocation(line: 349, column: 117, scope: !829)
!888 = !DILocation(line: 350, column: 3, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !360, line: 350, column: 3)
!890 = distinct !DILexicalBlock(scope: !891, file: !360, line: 350, column: 3)
!891 = distinct !DILexicalBlock(scope: !821, file: !360, line: 350, column: 3)
!892 = !DILocation(line: 350, column: 3, scope: !890)
!893 = !DILocation(line: 350, column: 3, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !360, line: 350, column: 3)
!895 = distinct !DILexicalBlock(scope: !889, file: !360, line: 350, column: 3)
!896 = !DILocation(line: 350, column: 3, scope: !895)
!897 = !DILocation(line: 350, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !360, line: 350, column: 3)
!899 = distinct !DILexicalBlock(scope: !894, file: !360, line: 350, column: 3)
!900 = !DILocation(line: 350, column: 3, scope: !899)
!901 = !DILocation(line: 350, column: 3, scope: !902)
!902 = distinct !DILexicalBlock(scope: !898, file: !360, line: 350, column: 3)
!903 = !DILocation(line: 350, column: 3, scope: !904)
!904 = distinct !DILexicalBlock(scope: !894, file: !360, line: 350, column: 3)
!905 = !DILocation(line: 350, column: 3, scope: !906)
!906 = distinct !DILexicalBlock(scope: !904, file: !360, line: 350, column: 3)
!907 = !DILocation(line: 350, column: 3, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !360, line: 350, column: 3)
!909 = distinct !DILexicalBlock(scope: !906, file: !360, line: 350, column: 3)
!910 = !DILocation(line: 350, column: 3, scope: !909)
!911 = !DILocation(line: 350, column: 3, scope: !912)
!912 = distinct !DILexicalBlock(scope: !908, file: !360, line: 350, column: 3)
!913 = !DILocation(line: 351, column: 1, scope: !821)
!914 = !DISubprogram(name: "PetscMallocA", scope: !357, file: !357, line: 1288, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!915 = !DISubroutineType(types: !916)
!916 = !{!162, !26, !3, !26, !181, !181, !317, !145, null}
!917 = !DISubprogram(name: "PetscLogObjectMemory", scope: !718, file: !718, line: 228, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!918 = !DISubroutineType(types: !919)
!919 = !{!26, !147, !207}
!920 = distinct !DISubprogram(name: "KSPGuessSetFromOptions_Fischer", scope: !360, file: !360, line: 211, type: !403, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !930, !931, !935, !937, !939, !941, !945, !947, !949}
!922 = !DILocalVariable(name: "guess", arg: 1, scope: !920, file: !360, line: 211, type: !386)
!923 = !DILocalVariable(name: "ITG", scope: !920, file: !360, line: 213, type: !358)
!924 = !DILocalVariable(name: "nmax", scope: !920, file: !360, line: 214, type: !204)
!925 = !DILocalVariable(name: "model", scope: !920, file: !360, line: 214, type: !283)
!926 = !DILocalVariable(name: "flg", scope: !920, file: !360, line: 215, type: !319)
!927 = !DILocalVariable(name: "ierr", scope: !920, file: !360, line: 216, type: !162)
!928 = !DILocalVariable(name: "PetscOptionsObjectBase", scope: !929, file: !360, line: 221, type: !296)
!929 = distinct !DILexicalBlock(scope: !920, file: !360, line: 221, column: 10)
!930 = !DILocalVariable(name: "PetscOptionsObject", scope: !929, file: !360, line: 221, type: !295)
!931 = !DILocalVariable(name: "_5_ierr", scope: !932, file: !360, line: 221, type: !162)
!932 = distinct !DILexicalBlock(scope: !933, file: !360, line: 221, column: 10)
!933 = distinct !DILexicalBlock(scope: !934, file: !360, line: 221, column: 10)
!934 = distinct !DILexicalBlock(scope: !929, file: !360, line: 221, column: 10)
!935 = !DILocalVariable(name: "ierr__", scope: !936, file: !360, line: 221, type: !162)
!936 = distinct !DILexicalBlock(scope: !932, file: !360, line: 221, column: 10)
!937 = !DILocalVariable(name: "ierr__", scope: !938, file: !360, line: 221, type: !162)
!938 = distinct !DILexicalBlock(scope: !932, file: !360, line: 221, column: 129)
!939 = !DILocalVariable(name: "ierr__", scope: !940, file: !360, line: 222, type: !162)
!940 = distinct !DILexicalBlock(scope: !932, file: !360, line: 222, column: 138)
!941 = !DILocalVariable(name: "ierr__", scope: !942, file: !360, line: 224, type: !162)
!942 = distinct !DILexicalBlock(scope: !943, file: !360, line: 224, column: 61)
!943 = distinct !DILexicalBlock(scope: !944, file: !360, line: 223, column: 12)
!944 = distinct !DILexicalBlock(scope: !932, file: !360, line: 223, column: 7)
!945 = !DILocalVariable(name: "ierr__", scope: !946, file: !360, line: 226, type: !162)
!946 = distinct !DILexicalBlock(scope: !932, file: !360, line: 226, column: 114)
!947 = !DILocalVariable(name: "ierr__", scope: !948, file: !360, line: 227, type: !162)
!948 = distinct !DILexicalBlock(scope: !932, file: !360, line: 227, column: 10)
!949 = !DILocalVariable(name: "ierr__", scope: !950, file: !360, line: 227, type: !162)
!950 = distinct !DILexicalBlock(scope: !920, file: !360, line: 227, column: 28)
!951 = !DILocation(line: 0, scope: !920)
!952 = !DILocation(line: 213, column: 52, scope: !920)
!953 = !DILocation(line: 214, column: 3, scope: !920)
!954 = !DILocation(line: 214, column: 19, scope: !920)
!955 = !DILocation(line: 214, column: 29, scope: !920)
!956 = !DILocation(line: 215, column: 3, scope: !920)
!957 = !DILocation(line: 218, column: 3, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !360, line: 218, column: 3)
!959 = distinct !DILexicalBlock(scope: !960, file: !360, line: 218, column: 3)
!960 = distinct !DILexicalBlock(scope: !920, file: !360, line: 218, column: 3)
!961 = !DILocation(line: 218, column: 3, scope: !959)
!962 = !DILocation(line: 218, column: 3, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !360, line: 218, column: 3)
!964 = distinct !DILexicalBlock(scope: !958, file: !360, line: 218, column: 3)
!965 = !DILocation(line: 218, column: 3, scope: !964)
!966 = !DILocation(line: 218, column: 3, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !360, line: 218, column: 3)
!968 = !DILocation(line: 219, column: 19, scope: !920)
!969 = !DILocation(line: 219, column: 3, scope: !920)
!970 = !DILocation(line: 219, column: 12, scope: !920)
!971 = !DILocation(line: 220, column: 19, scope: !920)
!972 = !DILocation(line: 220, column: 3, scope: !920)
!973 = !DILocation(line: 220, column: 12, scope: !920)
!974 = !DILocation(line: 221, column: 10, scope: !929)
!975 = !DILocation(line: 0, scope: !929)
!976 = !DILocalVariable(name: "a", arg: 1, scope: !977, file: !357, line: 1856, type: !145)
!977 = distinct !DISubprogram(name: "PetscMemzero", scope: !357, file: !357, line: 1856, type: !978, scopeLine: 1857, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{!162, !145, !315}
!980 = !{!976, !981}
!981 = !DILocalVariable(name: "n", arg: 2, scope: !977, file: !357, line: 1856, type: !315)
!982 = !DILocation(line: 0, scope: !977, inlinedAt: !983)
!983 = distinct !DILocation(line: 221, column: 10, scope: !929)
!984 = !DILocation(line: 1877, column: 7, scope: !985, inlinedAt: !983)
!985 = distinct !DILexicalBlock(scope: !986, file: !357, line: 1858, column: 14)
!986 = distinct !DILexicalBlock(scope: !977, file: !357, line: 1858, column: 7)
!987 = !DILocation(line: 221, column: 10, scope: !934)
!988 = !{!683, !683, i64 0}
!989 = !DILocation(line: 0, scope: !934)
!990 = !{!991, !691, i64 0}
!991 = !{!"_p_PetscOptionItems", !691, i64 0, !682, i64 8, !682, i64 16, !682, i64 24, !682, i64 32, !682, i64 40, !683, i64 48, !683, i64 52, !683, i64 56, !682, i64 64, !682, i64 72}
!992 = !DILocation(line: 221, column: 10, scope: !932)
!993 = !{!706, !682, i64 200}
!994 = !DILocation(line: 0, scope: !932)
!995 = !DILocation(line: 0, scope: !936)
!996 = !DILocation(line: 221, column: 10, scope: !997)
!997 = distinct !DILexicalBlock(scope: !936, file: !360, line: 221, column: 10)
!998 = !DILocation(line: 221, column: 10, scope: !936)
!999 = !DILocation(line: 222, column: 10, scope: !932)
!1000 = !DILocation(line: 0, scope: !940)
!1001 = !DILocation(line: 222, column: 138, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !940, file: !360, line: 222, column: 138)
!1003 = !DILocation(line: 222, column: 138, scope: !940)
!1004 = !DILocation(line: 223, column: 7, scope: !944)
!1005 = !DILocation(line: 223, column: 7, scope: !932)
!1006 = !DILocation(line: 224, column: 42, scope: !943)
!1007 = !DILocation(line: 224, column: 51, scope: !943)
!1008 = !DILocation(line: 224, column: 12, scope: !943)
!1009 = !DILocation(line: 0, scope: !942)
!1010 = !DILocation(line: 224, column: 61, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !942, file: !360, line: 224, column: 61)
!1012 = !DILocation(line: 224, column: 61, scope: !942)
!1013 = !DILocation(line: 226, column: 10, scope: !932)
!1014 = !{!853, !683, i64 12}
!1015 = !DILocation(line: 0, scope: !946)
!1016 = !DILocation(line: 226, column: 114, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !946, file: !360, line: 226, column: 114)
!1018 = !DILocation(line: 226, column: 114, scope: !946)
!1019 = !DILocation(line: 227, column: 10, scope: !932)
!1020 = !DILocation(line: 0, scope: !948)
!1021 = !DILocation(line: 227, column: 10, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !948, file: !360, line: 227, column: 10)
!1023 = !DILocation(line: 227, column: 10, scope: !948)
!1024 = !DILocation(line: 227, column: 10, scope: !920)
!1025 = !DILocation(line: 221, column: 10, scope: !933)
!1026 = distinct !{!1026, !987, !1027, !1028}
!1027 = !DILocation(line: 227, column: 10, scope: !934)
!1028 = !{!"llvm.loop.mustprogress"}
!1029 = !DILocation(line: 228, column: 3, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !360, line: 228, column: 3)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !360, line: 228, column: 3)
!1032 = distinct !DILexicalBlock(scope: !920, file: !360, line: 228, column: 3)
!1033 = !DILocation(line: 228, column: 3, scope: !1031)
!1034 = !DILocation(line: 228, column: 3, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !360, line: 228, column: 3)
!1036 = distinct !DILexicalBlock(scope: !1030, file: !360, line: 228, column: 3)
!1037 = !DILocation(line: 228, column: 3, scope: !1036)
!1038 = !DILocation(line: 228, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !360, line: 228, column: 3)
!1040 = distinct !DILexicalBlock(scope: !1035, file: !360, line: 228, column: 3)
!1041 = !DILocation(line: 228, column: 3, scope: !1040)
!1042 = !DILocation(line: 228, column: 3, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !360, line: 228, column: 3)
!1044 = !DILocation(line: 228, column: 3, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1035, file: !360, line: 228, column: 3)
!1046 = !DILocation(line: 228, column: 3, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1045, file: !360, line: 228, column: 3)
!1048 = !DILocation(line: 228, column: 3, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !360, line: 228, column: 3)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !360, line: 228, column: 3)
!1051 = !DILocation(line: 228, column: 3, scope: !1050)
!1052 = !DILocation(line: 228, column: 3, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !360, line: 228, column: 3)
!1054 = !DILocation(line: 229, column: 1, scope: !920)
!1055 = distinct !DISubprogram(name: "KSPGuessDestroy_Fischer", scope: !360, file: !360, line: 73, type: !403, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1062, !1064, !1066, !1068, !1070, !1072}
!1057 = !DILocalVariable(name: "guess", arg: 1, scope: !1055, file: !360, line: 73, type: !386)
!1058 = !DILocalVariable(name: "itg", scope: !1055, file: !360, line: 75, type: !358)
!1059 = !DILocalVariable(name: "ierr", scope: !1055, file: !360, line: 76, type: !162)
!1060 = !DILocalVariable(name: "ierr__", scope: !1061, file: !360, line: 79, type: !162)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 79, column: 32)
!1062 = !DILocalVariable(name: "ierr__", scope: !1063, file: !360, line: 80, type: !162)
!1063 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 80, column: 49)
!1064 = !DILocalVariable(name: "ierr__", scope: !1065, file: !360, line: 81, type: !162)
!1065 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 81, column: 49)
!1066 = !DILocalVariable(name: "ierr__", scope: !1067, file: !360, line: 82, type: !162)
!1067 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 82, column: 34)
!1068 = !DILocalVariable(name: "ierr__", scope: !1069, file: !360, line: 83, type: !162)
!1069 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 83, column: 31)
!1070 = !DILocalVariable(name: "ierr__", scope: !1071, file: !360, line: 84, type: !162)
!1071 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 84, column: 25)
!1072 = !DILocalVariable(name: "ierr__", scope: !1073, file: !360, line: 85, type: !162)
!1073 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 85, column: 90)
!1074 = !DILocation(line: 0, scope: !1055)
!1075 = !DILocation(line: 75, column: 51, scope: !1055)
!1076 = !DILocation(line: 78, column: 3, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !360, line: 78, column: 3)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !360, line: 78, column: 3)
!1079 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 78, column: 3)
!1080 = !DILocation(line: 78, column: 3, scope: !1078)
!1081 = !DILocation(line: 78, column: 3, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !360, line: 78, column: 3)
!1083 = distinct !DILexicalBlock(scope: !1077, file: !360, line: 78, column: 3)
!1084 = !DILocation(line: 78, column: 3, scope: !1083)
!1085 = !DILocation(line: 78, column: 3, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !360, line: 78, column: 3)
!1087 = !DILocation(line: 79, column: 10, scope: !1055)
!1088 = !{!853, !682, i64 16}
!1089 = !DILocation(line: 0, scope: !1061)
!1090 = !DILocation(line: 79, column: 32, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1061, file: !360, line: 79, column: 32)
!1092 = !DILocation(line: 80, column: 30, scope: !1055)
!1093 = !DILocation(line: 80, column: 41, scope: !1055)
!1094 = !DILocation(line: 80, column: 10, scope: !1055)
!1095 = !DILocation(line: 0, scope: !1063)
!1096 = !DILocation(line: 80, column: 49, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1063, file: !360, line: 80, column: 49)
!1098 = !DILocation(line: 80, column: 49, scope: !1063)
!1099 = !DILocation(line: 81, column: 30, scope: !1055)
!1100 = !DILocation(line: 81, column: 41, scope: !1055)
!1101 = !DILocation(line: 81, column: 10, scope: !1055)
!1102 = !DILocation(line: 0, scope: !1065)
!1103 = !DILocation(line: 81, column: 49, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1065, file: !360, line: 81, column: 49)
!1105 = !DILocation(line: 81, column: 49, scope: !1065)
!1106 = !DILocation(line: 82, column: 27, scope: !1055)
!1107 = !DILocation(line: 82, column: 10, scope: !1055)
!1108 = !DILocation(line: 0, scope: !1067)
!1109 = !DILocation(line: 82, column: 34, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1067, file: !360, line: 82, column: 34)
!1111 = !DILocation(line: 82, column: 34, scope: !1067)
!1112 = !DILocation(line: 83, column: 27, scope: !1055)
!1113 = !DILocation(line: 83, column: 10, scope: !1055)
!1114 = !DILocation(line: 0, scope: !1069)
!1115 = !DILocation(line: 83, column: 31, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1069, file: !360, line: 83, column: 31)
!1117 = !DILocation(line: 83, column: 31, scope: !1069)
!1118 = !DILocation(line: 84, column: 10, scope: !1055)
!1119 = !DILocation(line: 0, scope: !1071)
!1120 = !DILocation(line: 84, column: 25, scope: !1071)
!1121 = !DILocation(line: 84, column: 25, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1071, file: !360, line: 84, column: 25)
!1123 = !DILocation(line: 85, column: 10, scope: !1055)
!1124 = !DILocation(line: 0, scope: !1073)
!1125 = !DILocation(line: 85, column: 90, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1073, file: !360, line: 85, column: 90)
!1127 = !DILocation(line: 85, column: 90, scope: !1073)
!1128 = !DILocation(line: 86, column: 3, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !360, line: 86, column: 3)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !360, line: 86, column: 3)
!1131 = distinct !DILexicalBlock(scope: !1055, file: !360, line: 86, column: 3)
!1132 = !DILocation(line: 86, column: 3, scope: !1130)
!1133 = !DILocation(line: 86, column: 3, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !360, line: 86, column: 3)
!1135 = distinct !DILexicalBlock(scope: !1129, file: !360, line: 86, column: 3)
!1136 = !DILocation(line: 86, column: 3, scope: !1135)
!1137 = !DILocation(line: 86, column: 3, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !360, line: 86, column: 3)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !360, line: 86, column: 3)
!1140 = !DILocation(line: 86, column: 3, scope: !1139)
!1141 = !DILocation(line: 86, column: 3, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1138, file: !360, line: 86, column: 3)
!1143 = !DILocation(line: 86, column: 3, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1134, file: !360, line: 86, column: 3)
!1145 = !DILocation(line: 86, column: 3, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1144, file: !360, line: 86, column: 3)
!1147 = !DILocation(line: 86, column: 3, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !360, line: 86, column: 3)
!1149 = distinct !DILexicalBlock(scope: !1146, file: !360, line: 86, column: 3)
!1150 = !DILocation(line: 86, column: 3, scope: !1149)
!1151 = !DILocation(line: 86, column: 3, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1148, file: !360, line: 86, column: 3)
!1153 = !DILocation(line: 87, column: 1, scope: !1055)
!1154 = distinct !DISubprogram(name: "KSPGuessSetUp_Fischer", scope: !360, file: !360, line: 44, type: !403, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1163, !1165, !1169, !1171, !1176, !1178, !1182, !1184, !1189, !1191, !1195, !1197, !1201}
!1156 = !DILocalVariable(name: "guess", arg: 1, scope: !1154, file: !360, line: 44, type: !386)
!1157 = !DILocalVariable(name: "itg", scope: !1154, file: !360, line: 46, type: !358)
!1158 = !DILocalVariable(name: "ierr", scope: !1154, file: !360, line: 47, type: !162)
!1159 = !DILocalVariable(name: "ierr__", scope: !1160, file: !360, line: 51, type: !162)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !360, line: 51, column: 48)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !360, line: 50, column: 20)
!1162 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 50, column: 7)
!1163 = !DILocalVariable(name: "ierr__", scope: !1164, file: !360, line: 52, type: !162)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !360, line: 52, column: 83)
!1165 = !DILocalVariable(name: "ierr__", scope: !1166, file: !360, line: 55, type: !162)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !360, line: 55, column: 68)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !360, line: 54, column: 21)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 54, column: 7)
!1169 = !DILocalVariable(name: "_i", scope: !1170, file: !360, line: 56, type: !26)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !360, line: 56, column: 12)
!1171 = !DILocalVariable(name: "ierr__", scope: !1172, file: !360, line: 56, type: !162)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !360, line: 56, column: 12)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !360, line: 56, column: 12)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !360, line: 56, column: 12)
!1175 = distinct !DILexicalBlock(scope: !1170, file: !360, line: 56, column: 12)
!1176 = !DILocalVariable(name: "ierr__", scope: !1177, file: !360, line: 56, type: !162)
!1177 = distinct !DILexicalBlock(scope: !1167, file: !360, line: 56, column: 63)
!1178 = !DILocalVariable(name: "ierr__", scope: !1179, file: !360, line: 59, type: !162)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !360, line: 59, column: 68)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !360, line: 58, column: 41)
!1181 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 58, column: 7)
!1182 = !DILocalVariable(name: "_i", scope: !1183, file: !360, line: 60, type: !26)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !360, line: 60, column: 12)
!1184 = !DILocalVariable(name: "ierr__", scope: !1185, file: !360, line: 60, type: !162)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !360, line: 60, column: 12)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !360, line: 60, column: 12)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !360, line: 60, column: 12)
!1188 = distinct !DILexicalBlock(scope: !1183, file: !360, line: 60, column: 12)
!1189 = !DILocalVariable(name: "ierr__", scope: !1190, file: !360, line: 60, type: !162)
!1190 = distinct !DILexicalBlock(scope: !1180, file: !360, line: 60, column: 63)
!1191 = !DILocalVariable(name: "ierr__", scope: !1192, file: !360, line: 63, type: !162)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !360, line: 63, column: 50)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !360, line: 62, column: 37)
!1194 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 62, column: 7)
!1195 = !DILocalVariable(name: "ierr__", scope: !1196, file: !360, line: 64, type: !162)
!1196 = distinct !DILexicalBlock(scope: !1193, file: !360, line: 64, column: 74)
!1197 = !DILocalVariable(name: "ierr__", scope: !1198, file: !360, line: 67, type: !162)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !360, line: 67, column: 53)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !360, line: 66, column: 20)
!1200 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 66, column: 7)
!1201 = !DILocalVariable(name: "ierr__", scope: !1202, file: !360, line: 68, type: !162)
!1202 = distinct !DILexicalBlock(scope: !1199, file: !360, line: 68, column: 77)
!1203 = !DILocation(line: 0, scope: !1154)
!1204 = !DILocation(line: 46, column: 51, scope: !1154)
!1205 = !DILocation(line: 49, column: 3, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !360, line: 49, column: 3)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !360, line: 49, column: 3)
!1208 = distinct !DILexicalBlock(scope: !1154, file: !360, line: 49, column: 3)
!1209 = !DILocation(line: 49, column: 3, scope: !1207)
!1210 = !DILocation(line: 49, column: 3, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !360, line: 49, column: 3)
!1212 = distinct !DILexicalBlock(scope: !1206, file: !360, line: 49, column: 3)
!1213 = !DILocation(line: 49, column: 3, scope: !1212)
!1214 = !DILocation(line: 49, column: 3, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !360, line: 49, column: 3)
!1216 = !DILocation(line: 50, column: 13, scope: !1162)
!1217 = !DILocation(line: 50, column: 8, scope: !1162)
!1218 = !DILocation(line: 50, column: 7, scope: !1154)
!1219 = !DILocation(line: 51, column: 12, scope: !1161)
!1220 = !DILocation(line: 0, scope: !1160)
!1221 = !DILocation(line: 51, column: 48, scope: !1222)
