; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/brgn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/brgn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 285, baseType: !7, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279}
!271 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!272 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!274 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!275 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!276 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!277 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!278 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!279 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 155, baseType: !7, size: 32, elements: !282)
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!282 = !{!283, !284, !285, !286, !287}
!283 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!287 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!288 = !{!289, !320, !343, !478, !323, !403, !393, !28, !354}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BRGN", file: !291, line: 28, baseType: !292)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/leastsquares/impls/brgn/brgn.h", directory: "/home/users/ndemeye/xSDK")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !291, line: 13, size: 1408, elements: !293)
!293 = !{!294, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "regularizerobjandgrad", scope: !292, file: !291, line: 14, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !299, !520, !420, !520, !403}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !302, line: 45, size: 14656, elements: !303)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!303 = !{!304, !512, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !600, !606, !608, !609, !610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !685, !686, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !725, !726, !727, !728, !729, !730, !731, !732}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !301, file: !302, line: 46, baseType: !305, size: 4480)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !306, line: 122, baseType: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !306, line: 73, size: 4480, elements: !308)
!308 = !{!309, !311, !364, !365, !367, !370, !371, !372, !373, !381, !382, !384, !388, !392, !394, !395, !396, !397, !398, !399, !400, !401, !402, !404, !406, !407, !408, !410, !411, !413, !415, !416, !417, !418, !419, !422, !424, !425, !426, !427, !428, !431, !433, !434, !435, !445, !447, !448, !452, !453, !502, !507, !509, !510, !511}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !307, file: !306, line: 74, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !307, file: !306, line: 75, baseType: !312, size: 448, offset: 64)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 448, elements: !362)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !306, line: 53, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 45, size: 448, elements: !315)
!315 = !{!316, !326, !334, !339, !346, !350, !357}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !314, file: !306, line: 46, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!298, !320, !322}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !75, line: 330, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !75, line: 330, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !314, file: !306, line: 47, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!298, !320, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !331, line: 16, baseType: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !331, line: 16, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !314, file: !306, line: 48, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!298, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !314, file: !306, line: 49, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!298, !320, !343, !320}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !314, file: !306, line: 50, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!298, !320, !343, !338}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !314, file: !306, line: 51, baseType: !351, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!298, !320, !343, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !314, file: !306, line: 52, baseType: !358, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!298, !320, !343, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!362 = !{!363}
!363 = !DISubrange(count: 1)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !307, file: !306, line: 76, baseType: !323, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !306, line: 77, baseType: !366, size: 32, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !307, file: !306, line: 78, baseType: !368, size: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !369)
!369 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !307, file: !306, line: 78, baseType: !368, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !307, file: !306, line: 78, baseType: !368, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !307, file: !306, line: 78, baseType: !368, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !307, file: !306, line: 79, baseType: !374, size: 64, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !377, line: 27, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !379, line: 43, baseType: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!380 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !307, file: !306, line: 80, baseType: !366, size: 32, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !307, file: !306, line: 81, baseType: !383, size: 32, offset: 992)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !307, file: !306, line: 82, baseType: !385, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !307, file: !306, line: 83, baseType: !389, size: 64, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !307, file: !306, line: 84, baseType: !393, size: 64, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !307, file: !306, line: 85, baseType: !393, size: 64, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !307, file: !306, line: 86, baseType: !393, size: 64, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !307, file: !306, line: 87, baseType: !393, size: 64, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !307, file: !306, line: 88, baseType: !320, size: 64, offset: 1408)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !307, file: !306, line: 89, baseType: !374, size: 64, offset: 1472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !306, line: 90, baseType: !393, size: 64, offset: 1536)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !307, file: !306, line: 91, baseType: !393, size: 64, offset: 1600)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !307, file: !306, line: 92, baseType: !366, size: 32, offset: 1664)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !307, file: !306, line: 93, baseType: !403, size: 64, offset: 1728)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !307, file: !306, line: 94, baseType: !405, size: 64, offset: 1792)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !375)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !307, file: !306, line: 95, baseType: !366, size: 32, offset: 1856)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !307, file: !306, line: 95, baseType: !366, size: 32, offset: 1888)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !307, file: !306, line: 96, baseType: !409, size: 64, offset: 1920)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !307, file: !306, line: 96, baseType: !409, size: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !307, file: !306, line: 97, baseType: !412, size: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !307, file: !306, line: 97, baseType: !414, size: 64, offset: 2112)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !307, file: !306, line: 98, baseType: !366, size: 32, offset: 2176)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !307, file: !306, line: 98, baseType: !366, size: 32, offset: 2208)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !307, file: !306, line: 99, baseType: !409, size: 64, offset: 2240)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !307, file: !306, line: 99, baseType: !409, size: 64, offset: 2304)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !307, file: !306, line: 100, baseType: !420, size: 64, offset: 2368)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !369)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !307, file: !306, line: 100, baseType: !423, size: 64, offset: 2432)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !307, file: !306, line: 101, baseType: !366, size: 32, offset: 2496)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !307, file: !306, line: 101, baseType: !366, size: 32, offset: 2528)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !307, file: !306, line: 102, baseType: !409, size: 64, offset: 2560)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !307, file: !306, line: 102, baseType: !409, size: 64, offset: 2624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !307, file: !306, line: 103, baseType: !429, size: 64, offset: 2688)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !421)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !307, file: !306, line: 103, baseType: !432, size: 64, offset: 2752)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !307, file: !306, line: 104, baseType: !361, size: 64, offset: 2816)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !307, file: !306, line: 105, baseType: !366, size: 32, offset: 2880)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !307, file: !306, line: 106, baseType: !436, size: 128, offset: 2944)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !443)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !306, line: 64, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 61, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !439, file: !306, line: 62, baseType: !354, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !439, file: !306, line: 63, baseType: !403, size: 64, offset: 64)
!443 = !{!444}
!444 = !DISubrange(count: 2)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !307, file: !306, line: 107, baseType: !446, size: 64, offset: 3072)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 64, elements: !443)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !307, file: !306, line: 108, baseType: !403, size: 64, offset: 3136)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !307, file: !306, line: 109, baseType: !449, size: 64, offset: 3200)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!298, !403}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !307, file: !306, line: 111, baseType: !366, size: 32, offset: 3264)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !307, file: !306, line: 112, baseType: !454, size: 320, offset: 3328)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 320, elements: !500)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!298, !458, !320, !403}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !461)
!461 = !{!462, !463, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !460, file: !12, line: 100, baseType: !366, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !12, line: 101, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !475, !476, !477, !481, !483, !485, !486, !487}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !466, file: !12, line: 84, baseType: !393, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !466, file: !12, line: 85, baseType: !393, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !12, line: 86, baseType: !403, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !466, file: !12, line: 87, baseType: !385, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !466, file: !12, line: 88, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !466, file: !12, line: 89, baseType: !345, size: 8, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !466, file: !12, line: 90, baseType: !393, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !466, file: !12, line: 91, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !479, line: 46, baseType: !480)
!479 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!480 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !466, file: !12, line: 92, baseType: !482, size: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !12, line: 93, baseType: !484, size: 32, offset: 544)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !12, line: 94, baseType: !464, size: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !466, file: !12, line: 95, baseType: !393, size: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !466, file: !12, line: 96, baseType: !403, size: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !460, file: !12, line: 102, baseType: !393, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !460, file: !12, line: 102, baseType: !393, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !460, file: !12, line: 103, baseType: !393, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !460, file: !12, line: 104, baseType: !323, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !460, file: !12, line: 105, baseType: !482, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !460, file: !12, line: 105, baseType: !482, size: 32, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !460, file: !12, line: 105, baseType: !482, size: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !460, file: !12, line: 106, baseType: !320, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !460, file: !12, line: 107, baseType: !497, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!500 = !{!501}
!501 = !DISubrange(count: 5)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !307, file: !306, line: 113, baseType: !503, size: 320, offset: 3648)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !500)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!298, !320, !403}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !307, file: !306, line: 114, baseType: !508, size: 320, offset: 3968)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 320, elements: !500)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !307, file: !306, line: 115, baseType: !482, size: 32, offset: 4288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !307, file: !306, line: 120, baseType: !497, size: 64, offset: 4352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !307, file: !306, line: 121, baseType: !482, size: 32, offset: 4416)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !301, file: !302, line: 46, baseType: !513, size: 1536, offset: 4480)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 1536, elements: !362)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !302, line: 13, size: 1536, elements: !515)
!515 = !{!516, !523, !524, !528, !535, !536, !537, !538, !539, !540, !541, !545, !549, !550, !551, !552, !556, !560, !561, !565, !569, !570, !574, !578}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !514, file: !302, line: 15, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!298, !299, !520, !420, !403}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !281, line: 21, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !281, line: 21, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !514, file: !302, line: 16, baseType: !295, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !514, file: !302, line: 17, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!298, !299, !520, !520, !403}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !514, file: !302, line: 18, baseType: !529, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!298, !299, !520, !532, !532, !403}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !82, line: 16, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !82, line: 16, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !514, file: !302, line: 19, baseType: !525, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !514, file: !302, line: 20, baseType: !529, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !514, file: !302, line: 21, baseType: !525, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !514, file: !302, line: 22, baseType: !525, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !514, file: !302, line: 23, baseType: !525, size: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !514, file: !302, line: 24, baseType: !529, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !514, file: !302, line: 25, baseType: !542, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!298, !299, !520, !532, !532, !532, !403}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !514, file: !302, line: 26, baseType: !546, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!298, !299, !520, !532, !403}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !514, file: !302, line: 27, baseType: !529, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !514, file: !302, line: 28, baseType: !529, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !514, file: !302, line: 29, baseType: !525, size: 64, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !514, file: !302, line: 30, baseType: !553, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!298, !299, !366, !403}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !514, file: !302, line: 31, baseType: !557, size: 64, offset: 1024)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!298, !299, !403}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !514, file: !302, line: 32, baseType: !449, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !514, file: !302, line: 35, baseType: !562, size: 64, offset: 1152)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!298, !299, !520, !520}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !514, file: !302, line: 36, baseType: !566, size: 64, offset: 1216)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!298, !299}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !514, file: !302, line: 37, baseType: !566, size: 64, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !514, file: !302, line: 38, baseType: !571, size: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!298, !299, !330}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !514, file: !302, line: 39, baseType: !575, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!298, !458, !299}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !514, file: !302, line: 40, baseType: !566, size: 64, offset: 1472)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !301, file: !302, line: 47, baseType: !403, size: 64, offset: 6016)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !301, file: !302, line: 48, baseType: !403, size: 64, offset: 6080)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !301, file: !302, line: 49, baseType: !403, size: 64, offset: 6144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !301, file: !302, line: 50, baseType: !403, size: 64, offset: 6208)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !301, file: !302, line: 51, baseType: !403, size: 64, offset: 6272)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !301, file: !302, line: 52, baseType: !403, size: 64, offset: 6336)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !301, file: !302, line: 53, baseType: !403, size: 64, offset: 6400)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !301, file: !302, line: 54, baseType: !403, size: 64, offset: 6464)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !301, file: !302, line: 55, baseType: !403, size: 64, offset: 6528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !301, file: !302, line: 56, baseType: !403, size: 64, offset: 6592)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !301, file: !302, line: 57, baseType: !403, size: 64, offset: 6656)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !301, file: !302, line: 58, baseType: !403, size: 64, offset: 6720)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !301, file: !302, line: 59, baseType: !403, size: 64, offset: 6784)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !301, file: !302, line: 60, baseType: !403, size: 64, offset: 6848)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !301, file: !302, line: 61, baseType: !403, size: 64, offset: 6912)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !301, file: !302, line: 62, baseType: !403, size: 64, offset: 6976)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !301, file: !302, line: 63, baseType: !403, size: 64, offset: 7040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !301, file: !302, line: 65, baseType: !597, size: 640, offset: 7104)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 640, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 10)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !301, file: !302, line: 66, baseType: !601, size: 640, offset: 7744)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 640, elements: !598)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!298, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !301, file: !302, line: 67, baseType: !607, size: 640, offset: 8384)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 640, elements: !598)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !301, file: !302, line: 68, baseType: !366, size: 32, offset: 9024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !301, file: !302, line: 69, baseType: !403, size: 64, offset: 9088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !301, file: !302, line: 70, baseType: !611, size: 32, offset: 9152)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !301, file: !302, line: 72, baseType: !482, size: 32, offset: 9184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 73, baseType: !403, size: 64, offset: 9216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !301, file: !302, line: 75, baseType: !520, size: 64, offset: 9280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !301, file: !302, line: 76, baseType: !520, size: 64, offset: 9344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !301, file: !302, line: 77, baseType: !520, size: 64, offset: 9408)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !301, file: !302, line: 78, baseType: !520, size: 64, offset: 9472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !301, file: !302, line: 79, baseType: !520, size: 64, offset: 9536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !301, file: !302, line: 80, baseType: !520, size: 64, offset: 9600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !301, file: !302, line: 81, baseType: !520, size: 64, offset: 9664)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !301, file: !302, line: 82, baseType: !520, size: 64, offset: 9728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !301, file: !302, line: 83, baseType: !520, size: 64, offset: 9792)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !301, file: !302, line: 84, baseType: !532, size: 64, offset: 9856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !301, file: !302, line: 85, baseType: !532, size: 64, offset: 9920)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !301, file: !302, line: 86, baseType: !532, size: 64, offset: 9984)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !301, file: !302, line: 87, baseType: !520, size: 64, offset: 10048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !301, file: !302, line: 88, baseType: !520, size: 64, offset: 10112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !301, file: !302, line: 89, baseType: !532, size: 64, offset: 10176)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !301, file: !302, line: 90, baseType: !532, size: 64, offset: 10240)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !301, file: !302, line: 91, baseType: !520, size: 64, offset: 10304)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !301, file: !302, line: 92, baseType: !366, size: 32, offset: 10368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !301, file: !302, line: 93, baseType: !412, size: 64, offset: 10432)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !301, file: !302, line: 94, baseType: !412, size: 64, offset: 10496)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !301, file: !302, line: 95, baseType: !420, size: 64, offset: 10560)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !301, file: !302, line: 96, baseType: !520, size: 64, offset: 10624)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !301, file: !302, line: 97, baseType: !520, size: 64, offset: 10688)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !301, file: !302, line: 98, baseType: !520, size: 64, offset: 10752)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !301, file: !302, line: 99, baseType: !532, size: 64, offset: 10816)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !301, file: !302, line: 100, baseType: !532, size: 64, offset: 10880)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !301, file: !302, line: 101, baseType: !532, size: 64, offset: 10944)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !301, file: !302, line: 102, baseType: !532, size: 64, offset: 11008)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !301, file: !302, line: 103, baseType: !532, size: 64, offset: 11072)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !301, file: !302, line: 104, baseType: !532, size: 64, offset: 11136)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !301, file: !302, line: 105, baseType: !532, size: 64, offset: 11200)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !301, file: !302, line: 106, baseType: !532, size: 64, offset: 11264)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !301, file: !302, line: 107, baseType: !532, size: 64, offset: 11328)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !301, file: !302, line: 108, baseType: !532, size: 64, offset: 11392)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !301, file: !302, line: 109, baseType: !532, size: 64, offset: 11456)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !301, file: !302, line: 110, baseType: !650, size: 64, offset: 11520)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !651, line: 11, baseType: !652)
!651 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !651, line: 11, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !301, file: !302, line: 111, baseType: !650, size: 64, offset: 11584)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !301, file: !302, line: 112, baseType: !421, size: 64, offset: 11648)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !301, file: !302, line: 113, baseType: !421, size: 64, offset: 11712)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !301, file: !302, line: 114, baseType: !421, size: 64, offset: 11776)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !301, file: !302, line: 115, baseType: !421, size: 64, offset: 11840)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !301, file: !302, line: 116, baseType: !421, size: 64, offset: 11904)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !301, file: !302, line: 117, baseType: !421, size: 64, offset: 11968)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !301, file: !302, line: 119, baseType: !366, size: 32, offset: 12032)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !301, file: !302, line: 120, baseType: !366, size: 32, offset: 12064)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !301, file: !302, line: 121, baseType: !366, size: 32, offset: 12096)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !301, file: !302, line: 122, baseType: !366, size: 32, offset: 12128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !301, file: !302, line: 123, baseType: !366, size: 32, offset: 12160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !301, file: !302, line: 124, baseType: !366, size: 32, offset: 12192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !301, file: !302, line: 125, baseType: !366, size: 32, offset: 12224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !301, file: !302, line: 126, baseType: !366, size: 32, offset: 12256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !301, file: !302, line: 127, baseType: !366, size: 32, offset: 12288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !301, file: !302, line: 128, baseType: !366, size: 32, offset: 12320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !301, file: !302, line: 129, baseType: !366, size: 32, offset: 12352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !301, file: !302, line: 130, baseType: !366, size: 32, offset: 12384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !301, file: !302, line: 131, baseType: !366, size: 32, offset: 12416)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !301, file: !302, line: 132, baseType: !366, size: 32, offset: 12448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !301, file: !302, line: 133, baseType: !366, size: 32, offset: 12480)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !301, file: !302, line: 134, baseType: !366, size: 32, offset: 12512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !301, file: !302, line: 135, baseType: !366, size: 32, offset: 12544)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !301, file: !302, line: 137, baseType: !366, size: 32, offset: 12576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !301, file: !302, line: 138, baseType: !366, size: 32, offset: 12608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !301, file: !302, line: 140, baseType: !681, size: 64, offset: 12672)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !682, line: 5, baseType: !683)
!682 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !682, line: 5, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !301, file: !302, line: 141, baseType: !482, size: 32, offset: 12736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !301, file: !302, line: 142, baseType: !687, size: 64, offset: 12800)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !688, line: 22, baseType: !689)
!688 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !688, line: 22, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !301, file: !302, line: 143, baseType: !421, size: 64, offset: 12864)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !301, file: !302, line: 144, baseType: !421, size: 64, offset: 12928)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !301, file: !302, line: 146, baseType: !421, size: 64, offset: 12992)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !301, file: !302, line: 147, baseType: !421, size: 64, offset: 13056)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !301, file: !302, line: 148, baseType: !421, size: 64, offset: 13120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !301, file: !302, line: 149, baseType: !421, size: 64, offset: 13184)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !301, file: !302, line: 150, baseType: !421, size: 64, offset: 13248)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !301, file: !302, line: 151, baseType: !421, size: 64, offset: 13312)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !301, file: !302, line: 152, baseType: !421, size: 64, offset: 13376)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !301, file: !302, line: 153, baseType: !482, size: 32, offset: 13440)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !301, file: !302, line: 154, baseType: !482, size: 32, offset: 13472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !301, file: !302, line: 155, baseType: !482, size: 32, offset: 13504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !301, file: !302, line: 156, baseType: !482, size: 32, offset: 13536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !301, file: !302, line: 157, baseType: !482, size: 32, offset: 13568)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !301, file: !302, line: 158, baseType: !482, size: 32, offset: 13600)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !301, file: !302, line: 159, baseType: !482, size: 32, offset: 13632)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !301, file: !302, line: 160, baseType: !482, size: 32, offset: 13664)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !301, file: !302, line: 161, baseType: !482, size: 32, offset: 13696)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !301, file: !302, line: 162, baseType: !482, size: 32, offset: 13728)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !301, file: !302, line: 163, baseType: !482, size: 32, offset: 13760)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !301, file: !302, line: 164, baseType: !482, size: 32, offset: 13792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !301, file: !302, line: 165, baseType: !482, size: 32, offset: 13824)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !301, file: !302, line: 166, baseType: !482, size: 32, offset: 13856)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !301, file: !302, line: 167, baseType: !482, size: 32, offset: 13888)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !301, file: !302, line: 168, baseType: !482, size: 32, offset: 13920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !301, file: !302, line: 169, baseType: !482, size: 32, offset: 13952)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !301, file: !302, line: 170, baseType: !482, size: 32, offset: 13984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !301, file: !302, line: 171, baseType: !482, size: 32, offset: 14016)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !301, file: !302, line: 172, baseType: !482, size: 32, offset: 14048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !301, file: !302, line: 173, baseType: !482, size: 32, offset: 14080)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !301, file: !302, line: 174, baseType: !482, size: 32, offset: 14112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !301, file: !302, line: 175, baseType: !482, size: 32, offset: 14144)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !301, file: !302, line: 177, baseType: !724, size: 32, offset: 14176)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !301, file: !302, line: 178, baseType: !366, size: 32, offset: 14208)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !301, file: !302, line: 179, baseType: !420, size: 64, offset: 14272)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !301, file: !302, line: 180, baseType: !420, size: 64, offset: 14336)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !301, file: !302, line: 181, baseType: !420, size: 64, offset: 14400)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !301, file: !302, line: 182, baseType: !412, size: 64, offset: 14464)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !301, file: !302, line: 183, baseType: !366, size: 32, offset: 14528)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !301, file: !302, line: 184, baseType: !482, size: 32, offset: 14560)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !301, file: !302, line: 185, baseType: !482, size: 32, offset: 14592)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "regularizerhessian", scope: !292, file: !291, line: 15, baseType: !546, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg_obj_ctx", scope: !292, file: !291, line: 16, baseType: !403, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reg_hess_ctx", scope: !292, file: !291, line: 17, baseType: !403, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !292, file: !291, line: 18, baseType: !532, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Hreg", scope: !292, file: !291, line: 18, baseType: !532, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !292, file: !291, line: 18, baseType: !532, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "x_old", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "x_work", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "r_work", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "y_work", scope: !292, file: !291, line: 19, baseType: !520, size: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !292, file: !291, line: 20, baseType: !520, size: 64, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "subsolver", scope: !292, file: !291, line: 21, baseType: !299, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !292, file: !291, line: 21, baseType: !299, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !292, file: !291, line: 22, baseType: !421, size: 64, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !292, file: !291, line: 22, baseType: !421, size: 64, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fc_old", scope: !292, file: !291, line: 22, baseType: !421, size: 64, offset: 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "downhill_lambda_change", scope: !292, file: !291, line: 23, baseType: !421, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uphill_lambda_change", scope: !292, file: !291, line: 23, baseType: !421, size: 64, offset: 1280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reg_type", scope: !292, file: !291, line: 26, baseType: !366, size: 32, offset: 1344)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mat_explicit", scope: !292, file: !291, line: 27, baseType: !482, size: 32, offset: 1376)
!755 = !{!0}
!756 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/brgn.c", directory: "/home/users/ndemeye/xSDK")
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 4096, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 64)
!760 = !{i32 7, !"Dwarf Version", i32 4}
!761 = !{i32 2, !"Debug Info Version", i32 3}
!762 = !{i32 1, !"wchar_size", i32 4}
!763 = !{i32 7, !"PIC Level", i32 2}
!764 = !{i32 7, !"uwtable", i32 1}
!765 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!766 = distinct !DISubprogram(name: "TaoBRGNGetDampingVector", scope: !756, file: !756, line: 75, type: !767, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !770)
!767 = !DISubroutineType(types: !768)
!768 = !{!298, !299, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!770 = !{!771, !772, !773}
!771 = !DILocalVariable(name: "tao", arg: 1, scope: !766, file: !756, line: 75, type: !299)
!772 = !DILocalVariable(name: "d", arg: 2, scope: !766, file: !756, line: 75, type: !769)
!773 = !DILocalVariable(name: "gn", scope: !766, file: !756, line: 77, type: !289)
!774 = !DILocation(line: 0, scope: !766)
!775 = !DILocation(line: 77, column: 35, scope: !766)
!776 = !{!777, !782, i64 1152}
!777 = !{!"_p_Tao", !778, i64 0, !780, i64 560, !782, i64 752, !782, i64 760, !782, i64 768, !782, i64 776, !782, i64 784, !782, i64 792, !782, i64 800, !782, i64 808, !782, i64 816, !782, i64 824, !782, i64 832, !782, i64 840, !782, i64 848, !782, i64 856, !782, i64 864, !782, i64 872, !782, i64 880, !780, i64 888, !780, i64 968, !780, i64 1048, !779, i64 1128, !782, i64 1136, !780, i64 1144, !780, i64 1148, !782, i64 1152, !782, i64 1160, !782, i64 1168, !782, i64 1176, !782, i64 1184, !782, i64 1192, !782, i64 1200, !782, i64 1208, !782, i64 1216, !782, i64 1224, !782, i64 1232, !782, i64 1240, !782, i64 1248, !782, i64 1256, !782, i64 1264, !782, i64 1272, !782, i64 1280, !782, i64 1288, !779, i64 1296, !782, i64 1304, !782, i64 1312, !782, i64 1320, !782, i64 1328, !782, i64 1336, !782, i64 1344, !782, i64 1352, !782, i64 1360, !782, i64 1368, !782, i64 1376, !782, i64 1384, !782, i64 1392, !782, i64 1400, !782, i64 1408, !782, i64 1416, !782, i64 1424, !782, i64 1432, !782, i64 1440, !782, i64 1448, !783, i64 1456, !783, i64 1464, !783, i64 1472, !783, i64 1480, !783, i64 1488, !783, i64 1496, !779, i64 1504, !779, i64 1508, !779, i64 1512, !779, i64 1516, !779, i64 1520, !779, i64 1524, !779, i64 1528, !779, i64 1532, !779, i64 1536, !779, i64 1540, !779, i64 1544, !779, i64 1548, !779, i64 1552, !779, i64 1556, !779, i64 1560, !779, i64 1564, !779, i64 1568, !779, i64 1572, !779, i64 1576, !782, i64 1584, !780, i64 1592, !782, i64 1600, !783, i64 1608, !783, i64 1616, !783, i64 1624, !783, i64 1632, !783, i64 1640, !783, i64 1648, !783, i64 1656, !783, i64 1664, !783, i64 1672, !780, i64 1680, !780, i64 1684, !780, i64 1688, !780, i64 1692, !780, i64 1696, !780, i64 1700, !780, i64 1704, !780, i64 1708, !780, i64 1712, !780, i64 1716, !780, i64 1720, !780, i64 1724, !780, i64 1728, !780, i64 1732, !780, i64 1736, !780, i64 1740, !780, i64 1744, !780, i64 1748, !780, i64 1752, !780, i64 1756, !780, i64 1760, !780, i64 1764, !780, i64 1768, !780, i64 1772, !779, i64 1776, !782, i64 1784, !782, i64 1792, !782, i64 1800, !782, i64 1808, !779, i64 1816, !780, i64 1820, !780, i64 1824}
