; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/kspmatregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/kspmatregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!421 = !DILocation(line: 24, column: 67, scope: !422)
!422 = distinct !DILexicalBlock(scope: !349, file: !332, line: 24, column: 67)
!423 = !DILocation(line: 24, column: 67, scope: !349)
!424 = !DILocation(line: 25, column: 10, scope: !340)
!425 = !DILocation(line: 0, scope: !351)
!426 = !DILocation(line: 25, column: 68, scope: !427)
!427 = distinct !DILexicalBlock(scope: !351, file: !332, line: 25, column: 68)
!428 = !DILocation(line: 25, column: 68, scope: !351)
!429 = !DILocation(line: 26, column: 10, scope: !340)
!430 = !DILocation(line: 0, scope: !353)
!431 = !DILocation(line: 26, column: 67, scope: !432)
!432 = distinct !DILexicalBlock(scope: !353, file: !332, line: 26, column: 67)
!433 = !DILocation(line: 26, column: 67, scope: !353)
!434 = !DILocation(line: 27, column: 10, scope: !340)
!435 = !DILocation(line: 0, scope: !355)
!436 = !DILocation(line: 27, column: 68, scope: !437)
!437 = distinct !DILexicalBlock(scope: !355, file: !332, line: 27, column: 68)
!438 = !DILocation(line: 27, column: 68, scope: !355)
!439 = !DILocation(line: 28, column: 10, scope: !340)
!440 = !DILocation(line: 0, scope: !357)
!441 = !DILocation(line: 28, column: 71, scope: !442)
!442 = distinct !DILexicalBlock(scope: !357, file: !332, line: 28, column: 71)
!443 = !DILocation(line: 28, column: 71, scope: !357)
!444 = !DILocation(line: 29, column: 10, scope: !340)
!445 = !DILocation(line: 0, scope: !359)
!446 = !DILocation(line: 29, column: 71, scope: !447)
!447 = distinct !DILexicalBlock(scope: !359, file: !332, line: 29, column: 71)
!448 = !DILocation(line: 29, column: 71, scope: !359)
!449 = !DILocation(line: 30, column: 10, scope: !340)
!450 = !DILocation(line: 0, scope: !361)
!451 = !DILocation(line: 30, column: 74, scope: !452)
!452 = distinct !DILexicalBlock(scope: !361, file: !332, line: 30, column: 74)
!453 = !DILocation(line: 30, column: 74, scope: !361)
!454 = !DILocation(line: 31, column: 10, scope: !340)
!455 = !DILocation(line: 0, scope: !363)
!456 = !DILocation(line: 31, column: 72, scope: !457)
!457 = distinct !DILexicalBlock(scope: !363, file: !332, line: 31, column: 72)
!458 = !DILocation(line: 31, column: 72, scope: !363)
!459 = !DILocation(line: 32, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !332, line: 32, column: 3)
!461 = distinct !DILexicalBlock(scope: !462, file: !332, line: 32, column: 3)
!462 = distinct !DILexicalBlock(scope: !340, file: !332, line: 32, column: 3)
!463 = !DILocation(line: 32, column: 3, scope: !461)
!464 = !DILocation(line: 32, column: 3, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !332, line: 32, column: 3)
!466 = distinct !DILexicalBlock(scope: !460, file: !332, line: 32, column: 3)
!467 = !DILocation(line: 32, column: 3, scope: !466)
!468 = !DILocation(line: 32, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !332, line: 32, column: 3)
!470 = distinct !DILexicalBlock(scope: !465, file: !332, line: 32, column: 3)
!471 = !DILocation(line: 32, column: 3, scope: !470)
!472 = !DILocation(line: 32, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !469, file: !332, line: 32, column: 3)
!474 = !DILocation(line: 32, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !465, file: !332, line: 32, column: 3)
!476 = !DILocation(line: 32, column: 3, scope: !477)
!477 = distinct !DILexicalBlock(scope: !475, file: !332, line: 32, column: 3)
!478 = !DILocation(line: 32, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !332, line: 32, column: 3)
!480 = distinct !DILexicalBlock(scope: !477, file: !332, line: 32, column: 3)
!481 = !DILocation(line: 32, column: 3, scope: !480)
!482 = !DILocation(line: 32, column: 3, scope: !483)
!483 = distinct !DILexicalBlock(scope: !479, file: !332, line: 32, column: 3)
!484 = !DILocation(line: 33, column: 1, scope: !340)
!485 = !DISubprogram(name: "MatRegister", scope: !65, file: !65, line: 259, type: !486, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1704)
!486 = !DISubroutineType(types: !487)
!487 = !{!93, !322, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!93, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !493, line: 436, size: 23424, elements: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!494 = !{!495, !695, !1479, !1480, !1481, !1482, !1484, !1485, !1486, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1600, !1601, !1617, !1618, !1619, !1620, !1621, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1656, !1676, !1677, !1679, !1680, !1681, !1682, !1683, !1684, !1702, !1703}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !492, file: !493, line: 437, baseType: !496, size: 4480)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !497, line: 122, baseType: !498)
!497 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !497, line: 73, size: 4480, elements: !499)
!499 = !{!500, !502, !549, !550, !552, !555, !556, !557, !558, !566, !567, !569, !573, !577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !590, !591, !592, !594, !595, !597, !599, !600, !601, !602, !603, !606, !608, !609, !610, !611, !612, !615, !617, !618, !619, !629, !631, !632, !636, !637, !685, !690, !692, !693, !694}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !498, file: !497, line: 74, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !498, file: !497, line: 75, baseType: !503, size: 448, offset: 64)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 448, elements: !547)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !497, line: 53, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 45, size: 448, elements: !506)
!506 = !{!507, !514, !522, !527, !531, !535, !542}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !505, file: !497, line: 46, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!343, !511, !513}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !505, file: !497, line: 47, baseType: !515, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!343, !511, !518}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !519, line: 16, baseType: !520)
!519 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !519, line: 16, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !505, file: !497, line: 48, baseType: !523, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!343, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !505, file: !497, line: 49, baseType: !528, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!343, !511, !322, !511}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !505, file: !497, line: 50, baseType: !532, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!343, !511, !322, !526}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !505, file: !497, line: 51, baseType: !536, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!343, !511, !322, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !505, file: !497, line: 52, baseType: !543, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!343, !511, !322, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!547 = !{!548}
!548 = !DISubrange(count: 1)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !498, file: !497, line: 76, baseType: !325, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !497, line: 77, baseType: !551, size: 32, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !498, file: !497, line: 78, baseType: !553, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !554)
!554 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !498, file: !497, line: 78, baseType: !553, size: 64, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !498, file: !497, line: 78, baseType: !553, size: 64, offset: 768)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !498, file: !497, line: 78, baseType: !553, size: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !498, file: !497, line: 79, baseType: !559, size: 64, offset: 896)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !562, line: 27, baseType: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !564, line: 43, baseType: !565)
!564 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!565 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !498, file: !497, line: 80, baseType: !551, size: 32, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !498, file: !497, line: 81, baseType: !568, size: 32, offset: 992)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !498, file: !497, line: 82, baseType: !570, size: 64, offset: 1024)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !498, file: !497, line: 83, baseType: !574, size: 64, offset: 1088)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !498, file: !497, line: 84, baseType: !578, size: 64, offset: 1152)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !498, file: !497, line: 85, baseType: !578, size: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !498, file: !497, line: 86, baseType: !578, size: 64, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !498, file: !497, line: 87, baseType: !578, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !498, file: !497, line: 88, baseType: !511, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !498, file: !497, line: 89, baseType: !559, size: 64, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !497, line: 90, baseType: !578, size: 64, offset: 1536)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !498, file: !497, line: 91, baseType: !578, size: 64, offset: 1600)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !498, file: !497, line: 92, baseType: !551, size: 32, offset: 1664)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !498, file: !497, line: 93, baseType: !329, size: 64, offset: 1728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !498, file: !497, line: 94, baseType: !589, size: 64, offset: 1792)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !560)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !498, file: !497, line: 95, baseType: !551, size: 32, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !498, file: !497, line: 95, baseType: !551, size: 32, offset: 1888)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !498, file: !497, line: 96, baseType: !593, size: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !498, file: !497, line: 96, baseType: !593, size: 64, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !498, file: !497, line: 97, baseType: !596, size: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !498, file: !497, line: 97, baseType: !598, size: 64, offset: 2112)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !498, file: !497, line: 98, baseType: !551, size: 32, offset: 2176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !498, file: !497, line: 98, baseType: !551, size: 32, offset: 2208)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !498, file: !497, line: 99, baseType: !593, size: 64, offset: 2240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !498, file: !497, line: 99, baseType: !593, size: 64, offset: 2304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !498, file: !497, line: 100, baseType: !604, size: 64, offset: 2368)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !554)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !498, file: !497, line: 100, baseType: !607, size: 64, offset: 2432)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !498, file: !497, line: 101, baseType: !551, size: 32, offset: 2496)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !498, file: !497, line: 101, baseType: !551, size: 32, offset: 2528)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !498, file: !497, line: 102, baseType: !593, size: 64, offset: 2560)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !498, file: !497, line: 102, baseType: !593, size: 64, offset: 2624)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !498, file: !497, line: 103, baseType: !613, size: 64, offset: 2688)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !605)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !498, file: !497, line: 103, baseType: !616, size: 64, offset: 2752)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !498, file: !497, line: 104, baseType: !546, size: 64, offset: 2816)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !498, file: !497, line: 105, baseType: !551, size: 32, offset: 2880)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !498, file: !497, line: 106, baseType: !620, size: 128, offset: 2944)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !627)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !497, line: 64, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 61, size: 128, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !623, file: !497, line: 62, baseType: !539, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !623, file: !497, line: 63, baseType: !329, size: 64, offset: 64)
!627 = !{!628}
!628 = !DISubrange(count: 2)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !498, file: !497, line: 107, baseType: !630, size: 64, offset: 3072)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !627)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !498, file: !497, line: 108, baseType: !329, size: 64, offset: 3136)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !498, file: !497, line: 109, baseType: !633, size: 64, offset: 3200)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!343, !329}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !498, file: !497, line: 111, baseType: !551, size: 32, offset: 3264)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !498, file: !497, line: 112, baseType: !638, size: 320, offset: 3328)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 320, elements: !683)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!343, !642, !511, !329}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !645)
!645 = !{!646, !647, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !644, file: !12, line: 100, baseType: !551, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !12, line: 101, baseType: !648, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !659, !660, !661, !665, !666, !668, !669, !670}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !650, file: !12, line: 84, baseType: !578, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !650, file: !12, line: 85, baseType: !578, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !12, line: 86, baseType: !329, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !650, file: !12, line: 87, baseType: !570, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !650, file: !12, line: 88, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !650, file: !12, line: 89, baseType: !324, size: 8, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !650, file: !12, line: 90, baseType: !578, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !650, file: !12, line: 91, baseType: !662, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !663, line: 46, baseType: !664)
!663 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!664 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !650, file: !12, line: 92, baseType: !333, size: 32, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !12, line: 93, baseType: !667, size: 32, offset: 544)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !12, line: 94, baseType: !648, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !650, file: !12, line: 95, baseType: !578, size: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !650, file: !12, line: 96, baseType: !329, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !644, file: !12, line: 102, baseType: !578, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !644, file: !12, line: 102, baseType: !578, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !644, file: !12, line: 103, baseType: !578, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !644, file: !12, line: 104, baseType: !325, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !644, file: !12, line: 105, baseType: !333, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !644, file: !12, line: 105, baseType: !333, size: 32, offset: 416)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !644, file: !12, line: 105, baseType: !333, size: 32, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !644, file: !12, line: 106, baseType: !511, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !644, file: !12, line: 107, baseType: !680, size: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!683 = !{!684}
!684 = !DISubrange(count: 5)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !498, file: !497, line: 113, baseType: !686, size: 320, offset: 3648)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 320, elements: !683)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!343, !511, !329}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !498, file: !497, line: 114, baseType: !691, size: 320, offset: 3968)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !683)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !498, file: !497, line: 115, baseType: !333, size: 32, offset: 4288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !498, file: !497, line: 120, baseType: !680, size: 64, offset: 4352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !498, file: !497, line: 121, baseType: !333, size: 32, offset: 4416)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !492, file: !493, line: 437, baseType: !696, size: 9472, offset: 4480)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 9472, elements: !547)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !493, line: 32, size: 9472, elements: !698)
!698 = !{!699, !709, !713, !714, !1013, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1043, !1047, !1052, !1058, !1077, !1082, !1086, !1087, !1091, !1096, !1097, !1102, !1106, !1110, !1114, !1118, !1122, !1123, !1124, !1125, !1126, !1130, !1131, !1136, !1137, !1138, !1139, !1140, !1145, !1152, !1156, !1160, !1164, !1168, !1172, !1173, !1177, !1178, !1182, !1187, !1188, !1189, !1190, !1250, !1258, !1259, !1263, !1264, !1268, !1269, !1273, !1278, !1279, !1283, !1287, !1291, !1292, !1293, !1294, !1295, !1296, !1301, !1302, !1306, !1310, !1314, !1315, !1316, !1320, !1330, !1331, !1335, !1336, !1340, !1341, !1345, !1346, !1350, !1351, !1355, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1369, !1370, !1371, !1372, !1373, !1374, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1389, !1393, !1394, !1395, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1409, !1410, !1411, !1415, !1419, !1420, !1424, !1425, !1426, !1427, !1453, !1457, !1458, !1459, !1460, !1461, !1465, !1466, !1467, !1468, !1469, !1473, !1477, !1478}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !697, file: !493, line: 34, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!343, !703, !551, !704, !551, !704, !706, !708}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !491)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !697, file: !493, line: 35, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!343, !703, !551, !596, !598, !616}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !697, file: !493, line: 36, baseType: !710, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !697, file: !493, line: 37, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!343, !703, !718, !718}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !721, line: 142, size: 12800, elements: !722)
!721 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!722 = !{!723, !724, !939, !959, !960, !961, !1007, !1008, !1009, !1010, !1012}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !720, file: !721, line: 143, baseType: !496, size: 4480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !720, file: !721, line: 143, baseType: !725, size: 5248, offset: 4480)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 5248, elements: !547)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !721, line: 23, size: 5248, elements: !727)
!727 = !{!728, !733, !738, !742, !746, !752, !757, !758, !759, !763, !767, !768, !769, !773, !777, !781, !782, !786, !790, !794, !795, !799, !803, !804, !808, !812, !813, !814, !818, !819, !826, !831, !832, !833, !837, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !858, !859, !860, !864, !868, !869, !870, !871, !875, !876, !877, !878, !879, !880, !881, !885, !886, !890, !897, !898, !903, !904, !908, !909, !910, !911, !912, !913, !914, !915, !919, !920, !921, !927, !931, !932, !933}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !726, file: !721, line: 24, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!343, !718, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !726, file: !721, line: 25, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!343, !718, !551, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !726, file: !721, line: 26, baseType: !739, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!343, !551, !732}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !726, file: !721, line: 27, baseType: !743, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!343, !718, !718, !613}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !726, file: !721, line: 28, baseType: !747, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!343, !718, !551, !750, !613}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !726, file: !721, line: 29, baseType: !753, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!343, !718, !756, !604}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !726, file: !721, line: 30, baseType: !743, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !726, file: !721, line: 31, baseType: !747, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !726, file: !721, line: 32, baseType: !760, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!343, !718, !614}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !726, file: !721, line: 33, baseType: !764, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!343, !718, !718}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !726, file: !721, line: 34, baseType: !760, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !726, file: !721, line: 35, baseType: !764, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !726, file: !721, line: 36, baseType: !770, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!343, !718, !614, !718}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !726, file: !721, line: 37, baseType: !774, size: 64, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!343, !718, !614, !614, !718}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !726, file: !721, line: 38, baseType: !778, size: 64, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!343, !718, !551, !706, !732}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !726, file: !721, line: 39, baseType: !770, size: 64, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !726, file: !721, line: 40, baseType: !783, size: 64, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!343, !718, !614, !718, !718}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !726, file: !721, line: 41, baseType: !787, size: 64, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!343, !718, !614, !614, !614, !718, !718}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !726, file: !721, line: 42, baseType: !791, size: 64, offset: 1152)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!343, !718, !718, !718}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !726, file: !721, line: 43, baseType: !791, size: 64, offset: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !726, file: !721, line: 44, baseType: !796, size: 64, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!343, !718, !551, !704, !706, !708}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !726, file: !721, line: 45, baseType: !800, size: 64, offset: 1344)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!343, !718}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !726, file: !721, line: 46, baseType: !800, size: 64, offset: 1408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !726, file: !721, line: 47, baseType: !805, size: 64, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!343, !718, !616}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !726, file: !721, line: 48, baseType: !809, size: 64, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!343, !718, !596}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !726, file: !721, line: 49, baseType: !809, size: 64, offset: 1600)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !726, file: !721, line: 50, baseType: !805, size: 64, offset: 1664)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !726, file: !721, line: 51, baseType: !815, size: 64, offset: 1728)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!343, !718, !596, !604}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !726, file: !721, line: 52, baseType: !815, size: 64, offset: 1792)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !726, file: !721, line: 53, baseType: !820, size: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!343, !718, !823}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !726, file: !721, line: 54, baseType: !827, size: 64, offset: 1920)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!343, !718, !830, !333}
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !726, file: !721, line: 55, baseType: !796, size: 64, offset: 1984)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !726, file: !721, line: 56, baseType: !800, size: 64, offset: 2048)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !726, file: !721, line: 57, baseType: !834, size: 64, offset: 2112)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!343, !718, !518}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !726, file: !721, line: 58, baseType: !838, size: 64, offset: 2176)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!343, !718, !706}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !726, file: !721, line: 59, baseType: !838, size: 64, offset: 2240)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !726, file: !721, line: 60, baseType: !743, size: 64, offset: 2304)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !726, file: !721, line: 61, baseType: !743, size: 64, offset: 2368)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !726, file: !721, line: 62, baseType: !753, size: 64, offset: 2432)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !726, file: !721, line: 63, baseType: !747, size: 64, offset: 2496)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !726, file: !721, line: 64, baseType: !747, size: 64, offset: 2560)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !726, file: !721, line: 65, baseType: !834, size: 64, offset: 2624)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !726, file: !721, line: 66, baseType: !800, size: 64, offset: 2688)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !726, file: !721, line: 67, baseType: !800, size: 64, offset: 2752)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !726, file: !721, line: 68, baseType: !851, size: 64, offset: 2816)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!343, !718, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !855, line: 30, baseType: !856)
!855 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !855, line: 30, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !726, file: !721, line: 69, baseType: !796, size: 64, offset: 2880)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !726, file: !721, line: 70, baseType: !800, size: 64, offset: 2944)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !726, file: !721, line: 71, baseType: !861, size: 64, offset: 3008)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!343, !642, !718}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !726, file: !721, line: 72, baseType: !865, size: 64, offset: 3072)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!343, !718, !718, !604}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !726, file: !721, line: 73, baseType: !791, size: 64, offset: 3136)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !726, file: !721, line: 74, baseType: !791, size: 64, offset: 3200)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !726, file: !721, line: 75, baseType: !791, size: 64, offset: 3264)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !726, file: !721, line: 76, baseType: !872, size: 64, offset: 3328)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!343, !718, !551, !704, !613}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !726, file: !721, line: 77, baseType: !800, size: 64, offset: 3392)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !726, file: !721, line: 78, baseType: !800, size: 64, offset: 3456)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !726, file: !721, line: 79, baseType: !800, size: 64, offset: 3520)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !726, file: !721, line: 80, baseType: !800, size: 64, offset: 3584)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !726, file: !721, line: 81, baseType: !760, size: 64, offset: 3648)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !726, file: !721, line: 82, baseType: !800, size: 64, offset: 3712)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !726, file: !721, line: 83, baseType: !882, size: 64, offset: 3776)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!343, !718, !551, !718, !708}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !726, file: !721, line: 84, baseType: !882, size: 64, offset: 3840)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !726, file: !721, line: 85, baseType: !887, size: 64, offset: 3904)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!343, !718, !718, !613, !613}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !726, file: !721, line: 86, baseType: !891, size: 64, offset: 3968)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!343, !718, !894, !732}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !855, line: 11, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !855, line: 11, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !726, file: !721, line: 87, baseType: !891, size: 64, offset: 4032)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !726, file: !721, line: 88, baseType: !899, size: 64, offset: 4096)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!343, !718, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !726, file: !721, line: 89, baseType: !899, size: 64, offset: 4160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !726, file: !721, line: 90, baseType: !905, size: 64, offset: 4224)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!343, !718, !551, !704, !704, !718, !708}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !726, file: !721, line: 91, baseType: !905, size: 64, offset: 4288)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !726, file: !721, line: 92, baseType: !834, size: 64, offset: 4352)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !726, file: !721, line: 93, baseType: !834, size: 64, offset: 4416)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !726, file: !721, line: 94, baseType: !764, size: 64, offset: 4480)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !726, file: !721, line: 95, baseType: !764, size: 64, offset: 4544)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !726, file: !721, line: 96, baseType: !764, size: 64, offset: 4608)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !726, file: !721, line: 97, baseType: !764, size: 64, offset: 4672)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !726, file: !721, line: 98, baseType: !916, size: 64, offset: 4736)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!343, !718, !333}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !726, file: !721, line: 99, baseType: !805, size: 64, offset: 4800)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !726, file: !721, line: 100, baseType: !805, size: 64, offset: 4864)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !726, file: !721, line: 101, baseType: !922, size: 64, offset: 4928)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!343, !718, !616, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !726, file: !721, line: 102, baseType: !928, size: 64, offset: 4992)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!343, !718, !902, !925}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !726, file: !721, line: 103, baseType: !805, size: 64, offset: 5056)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !726, file: !721, line: 104, baseType: !899, size: 64, offset: 5120)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !726, file: !721, line: 105, baseType: !934, size: 64, offset: 5184)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!343, !551, !750, !732, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !720, file: !721, line: 144, baseType: !940, size: 64, offset: 9728)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !855, line: 60, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !942, file: !135, line: 241, baseType: !325, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !942, file: !135, line: 242, baseType: !568, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !942, file: !135, line: 243, baseType: !551, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !942, file: !135, line: 243, baseType: !551, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !942, file: !135, line: 244, baseType: !551, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !942, file: !135, line: 244, baseType: !551, size: 32, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !942, file: !135, line: 245, baseType: !596, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !942, file: !135, line: 246, baseType: !333, size: 32, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !942, file: !135, line: 247, baseType: !551, size: 32, offset: 352)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !942, file: !135, line: 251, baseType: !551, size: 32, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !942, file: !135, line: 252, baseType: !854, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !942, file: !135, line: 253, baseType: !333, size: 32, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !942, file: !135, line: 254, baseType: !551, size: 32, offset: 544)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !942, file: !135, line: 254, baseType: !551, size: 32, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !942, file: !135, line: 255, baseType: !551, size: 32, offset: 608)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !720, file: !721, line: 145, baseType: !329, size: 64, offset: 9792)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !720, file: !721, line: 146, baseType: !333, size: 32, offset: 9856)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !720, file: !721, line: 147, baseType: !962, size: 1344, offset: 9920)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !721, line: 140, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !721, line: 114, size: 1344, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !983, !984, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !963, file: !721, line: 115, baseType: !551, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !963, file: !721, line: 116, baseType: !551, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !963, file: !721, line: 117, baseType: !551, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !963, file: !721, line: 118, baseType: !551, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !963, file: !721, line: 119, baseType: !551, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !963, file: !721, line: 120, baseType: !551, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !963, file: !721, line: 121, baseType: !596, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !963, file: !721, line: 122, baseType: !613, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !963, file: !721, line: 124, baseType: !325, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !963, file: !721, line: 125, baseType: !568, size: 32, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !963, file: !721, line: 125, baseType: !568, size: 32, offset: 416)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !963, file: !721, line: 126, baseType: !568, size: 32, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !963, file: !721, line: 126, baseType: !568, size: 32, offset: 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !963, file: !721, line: 127, baseType: !979, size: 64, offset: 512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !326, line: 339, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !326, line: 339, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !963, file: !721, line: 128, baseType: !979, size: 64, offset: 576)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !963, file: !721, line: 129, baseType: !985, size: 64, offset: 640)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !326, line: 341, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !326, line: 351, size: 192, elements: !988)
!988 = !{!989, !990, !991, !992, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !987, file: !326, line: 354, baseType: !93, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !987, file: !326, line: 355, baseType: !93, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !987, file: !326, line: 356, baseType: !93, size: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !987, file: !326, line: 361, baseType: !93, size: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !987, file: !326, line: 362, baseType: !662, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !963, file: !721, line: 130, baseType: !551, size: 32, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !963, file: !721, line: 130, baseType: !551, size: 32, offset: 736)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !963, file: !721, line: 131, baseType: !613, size: 64, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !963, file: !721, line: 131, baseType: !613, size: 64, offset: 832)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !963, file: !721, line: 132, baseType: !596, size: 64, offset: 896)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !963, file: !721, line: 132, baseType: !596, size: 64, offset: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !963, file: !721, line: 133, baseType: !551, size: 32, offset: 1024)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !963, file: !721, line: 134, baseType: !596, size: 64, offset: 1088)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !963, file: !721, line: 135, baseType: !551, size: 32, offset: 1152)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !963, file: !721, line: 136, baseType: !333, size: 32, offset: 1184)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !963, file: !721, line: 137, baseType: !333, size: 32, offset: 1216)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !963, file: !721, line: 138, baseType: !708, size: 32, offset: 1248)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !963, file: !721, line: 139, baseType: !596, size: 64, offset: 1280)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !720, file: !721, line: 147, baseType: !962, size: 1344, offset: 11264)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !720, file: !721, line: 148, baseType: !333, size: 32, offset: 12608)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !720, file: !721, line: 149, baseType: !551, size: 32, offset: 12640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !720, file: !721, line: 150, baseType: !1011, size: 32, offset: 12672)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !57)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !720, file: !721, line: 157, baseType: !578, size: 64, offset: 12736)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !697, file: !493, line: 38, baseType: !1014, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!343, !703, !718, !718, !718}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !697, file: !493, line: 40, baseType: !715, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !697, file: !493, line: 41, baseType: !1014, size: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !697, file: !493, line: 42, baseType: !715, size: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !697, file: !493, line: 43, baseType: !1014, size: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !697, file: !493, line: 44, baseType: !715, size: 64, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !697, file: !493, line: 46, baseType: !1014, size: 64, offset: 640)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !697, file: !493, line: 47, baseType: !1024, size: 64, offset: 704)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!343, !703, !894, !894, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !65, line: 1239, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 1226, size: 704, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !1030, file: !65, line: 1227, baseType: !605, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !1030, file: !65, line: 1228, baseType: !605, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1030, file: !65, line: 1229, baseType: !605, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !1030, file: !65, line: 1230, baseType: !605, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !1030, file: !65, line: 1231, baseType: !605, size: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1030, file: !65, line: 1232, baseType: !605, size: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !1030, file: !65, line: 1233, baseType: !605, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !1030, file: !65, line: 1234, baseType: !605, size: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !1030, file: !65, line: 1236, baseType: !605, size: 64, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !1030, file: !65, line: 1237, baseType: !605, size: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !1030, file: !65, line: 1238, baseType: !605, size: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !697, file: !493, line: 48, baseType: !1044, size: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!343, !703, !894, !1027}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !697, file: !493, line: 49, baseType: !1048, size: 64, offset: 832)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!343, !703, !718, !605, !1051, !605, !551, !551, !718}
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !65, line: 1291, baseType: !64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !697, file: !493, line: 50, baseType: !1053, size: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!343, !703, !1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !65, line: 238, baseType: !77)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !697, file: !493, line: 52, baseType: !1059, size: 64, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!343, !703, !1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !65, line: 612, baseType: !83)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1065, file: !65, line: 593, baseType: !553, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !1065, file: !65, line: 594, baseType: !553, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !1065, file: !65, line: 594, baseType: !553, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !1065, file: !65, line: 594, baseType: !553, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1065, file: !65, line: 595, baseType: !553, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !1065, file: !65, line: 596, baseType: !553, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !1065, file: !65, line: 597, baseType: !553, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !1065, file: !65, line: 598, baseType: !553, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !1065, file: !65, line: 598, baseType: !553, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !1065, file: !65, line: 599, baseType: !553, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !697, file: !493, line: 53, baseType: !1078, size: 64, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!343, !703, !703, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !697, file: !493, line: 54, baseType: !1083, size: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!343, !703, !718}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !697, file: !493, line: 55, baseType: !715, size: 64, offset: 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !697, file: !493, line: 56, baseType: !1088, size: 64, offset: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!343, !703, !756, !604}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !697, file: !493, line: 58, baseType: !1092, size: 64, offset: 1280)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!343, !703, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !65, line: 424, baseType: !88)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !697, file: !493, line: 59, baseType: !1092, size: 64, offset: 1344)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !697, file: !493, line: 60, baseType: !1098, size: 64, offset: 1408)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!343, !703, !1101, !333}
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !65, line: 469, baseType: !92)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !697, file: !493, line: 61, baseType: !1103, size: 64, offset: 1472)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!343, !703}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !697, file: !493, line: 63, baseType: !1107, size: 64, offset: 1536)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!343, !703, !551, !704, !614, !718, !718}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !697, file: !493, line: 64, baseType: !1111, size: 64, offset: 1600)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!343, !703, !703, !894, !894, !1027}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !697, file: !493, line: 65, baseType: !1115, size: 64, offset: 1664)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!343, !703, !703, !1027}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !697, file: !493, line: 66, baseType: !1119, size: 64, offset: 1728)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!343, !703, !703, !894, !1027}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !697, file: !493, line: 67, baseType: !1115, size: 64, offset: 1792)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !697, file: !493, line: 69, baseType: !1103, size: 64, offset: 1856)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !697, file: !493, line: 70, baseType: !1111, size: 64, offset: 1920)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !697, file: !493, line: 71, baseType: !1119, size: 64, offset: 1984)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !697, file: !493, line: 72, baseType: !1127, size: 64, offset: 2048)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!343, !703, !1057}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !697, file: !493, line: 73, baseType: !1103, size: 64, offset: 2112)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !697, file: !493, line: 75, baseType: !1132, size: 64, offset: 2176)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!343, !703, !1135, !1057}
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !65, line: 563, baseType: !123)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !697, file: !493, line: 76, baseType: !715, size: 64, offset: 2240)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !697, file: !493, line: 77, baseType: !715, size: 64, offset: 2304)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !697, file: !493, line: 78, baseType: !1024, size: 64, offset: 2368)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !697, file: !493, line: 79, baseType: !1044, size: 64, offset: 2432)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !697, file: !493, line: 81, baseType: !1141, size: 64, offset: 2496)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!343, !703, !614, !703, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !65, line: 285, baseType: !128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !697, file: !493, line: 82, baseType: !1146, size: 64, offset: 2560)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!343, !703, !551, !1149, !1149, !1056, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !697, file: !493, line: 83, baseType: !1153, size: 64, offset: 2624)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!343, !703, !551, !938, !551}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !697, file: !493, line: 84, baseType: !1157, size: 64, offset: 2688)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!343, !703, !551, !704, !551, !704, !613}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !697, file: !493, line: 85, baseType: !1161, size: 64, offset: 2752)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!343, !703, !703, !1144}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !697, file: !493, line: 87, baseType: !1165, size: 64, offset: 2816)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!343, !703, !718, !596}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !697, file: !493, line: 88, baseType: !1169, size: 64, offset: 2880)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!343, !703, !614}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !697, file: !493, line: 89, baseType: !1169, size: 64, offset: 2944)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !697, file: !493, line: 90, baseType: !1174, size: 64, offset: 3008)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!343, !703, !718, !708}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !697, file: !493, line: 91, baseType: !1107, size: 64, offset: 3072)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !697, file: !493, line: 93, baseType: !1179, size: 64, offset: 3136)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!343, !703, !823}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !697, file: !493, line: 94, baseType: !1183, size: 64, offset: 3200)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!343, !703, !551, !333, !333, !596, !1186, !1186, !1081}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !697, file: !493, line: 95, baseType: !1183, size: 64, offset: 3264)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !697, file: !493, line: 96, baseType: !1183, size: 64, offset: 3328)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !697, file: !493, line: 97, baseType: !1183, size: 64, offset: 3392)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !697, file: !493, line: 99, baseType: !1191, size: 64, offset: 3456)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!343, !703, !1194, !1197}
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !855, line: 51, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !855, line: 51, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !65, line: 1378, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !493, line: 609, size: 6208, elements: !1200)
!1200 = !{!1201, !1202, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1221, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1237, !1238, !1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1199, file: !493, line: 610, baseType: !496, size: 4480)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1199, file: !493, line: 610, baseType: !1203, size: 32, offset: 4480)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !547)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1199, file: !493, line: 611, baseType: !551, size: 32, offset: 4512)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1199, file: !493, line: 611, baseType: !551, size: 32, offset: 4544)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1199, file: !493, line: 611, baseType: !551, size: 32, offset: 4576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1199, file: !493, line: 612, baseType: !551, size: 32, offset: 4608)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1199, file: !493, line: 613, baseType: !551, size: 32, offset: 4640)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1199, file: !493, line: 614, baseType: !596, size: 64, offset: 4672)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1199, file: !493, line: 615, baseType: !598, size: 64, offset: 4736)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1199, file: !493, line: 616, baseType: !938, size: 64, offset: 4800)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1199, file: !493, line: 617, baseType: !596, size: 64, offset: 4864)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1199, file: !493, line: 618, baseType: !1214, size: 64, offset: 4928)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !493, line: 602, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 598, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1216, file: !493, line: 599, baseType: !551, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1216, file: !493, line: 600, baseType: !551, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1216, file: !493, line: 601, baseType: !613, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1199, file: !493, line: 619, baseType: !1222, size: 64, offset: 4992)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !493, line: 607, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 604, size: 128, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1224, file: !493, line: 605, baseType: !551, size: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1224, file: !493, line: 606, baseType: !613, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1199, file: !493, line: 620, baseType: !613, size: 64, offset: 5056)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1199, file: !493, line: 621, baseType: !605, size: 64, offset: 5120)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1199, file: !493, line: 622, baseType: !605, size: 64, offset: 5184)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1199, file: !493, line: 623, baseType: !718, size: 64, offset: 5248)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1199, file: !493, line: 623, baseType: !718, size: 64, offset: 5312)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1199, file: !493, line: 623, baseType: !718, size: 64, offset: 5376)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1199, file: !493, line: 624, baseType: !333, size: 32, offset: 5440)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1199, file: !493, line: 625, baseType: !1236, size: 64, offset: 5504)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1199, file: !493, line: 626, baseType: !329, size: 64, offset: 5568)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1199, file: !493, line: 627, baseType: !718, size: 64, offset: 5632)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1199, file: !493, line: 628, baseType: !551, size: 32, offset: 5696)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1199, file: !493, line: 629, baseType: !322, size: 64, offset: 5760)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1199, file: !493, line: 630, baseType: !1242, size: 32, offset: 5824)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !135, line: 213, baseType: !134)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1199, file: !493, line: 631, baseType: !551, size: 32, offset: 5856)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1199, file: !493, line: 631, baseType: !551, size: 32, offset: 5888)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1199, file: !493, line: 632, baseType: !333, size: 32, offset: 5920)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1199, file: !493, line: 633, baseType: !333, size: 32, offset: 5952)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1199, file: !493, line: 634, baseType: !539, size: 64, offset: 6016)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1199, file: !493, line: 634, baseType: !329, size: 64, offset: 6080)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1199, file: !493, line: 635, baseType: !559, size: 64, offset: 6144)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !697, file: !493, line: 100, baseType: !1251, size: 64, offset: 3520)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!343, !703, !551, !551, !1254, !1257}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !135, line: 215, baseType: !1256)
!1256 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !697, file: !493, line: 101, baseType: !1103, size: 64, offset: 3584)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !697, file: !493, line: 102, baseType: !1260, size: 64, offset: 3648)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!343, !703, !894, !894, !1057}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !697, file: !493, line: 103, baseType: !700, size: 64, offset: 3712)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !697, file: !493, line: 105, baseType: !1265, size: 64, offset: 3776)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!343, !703, !894, !894, !1056, !1057}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !697, file: !493, line: 106, baseType: !1103, size: 64, offset: 3840)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !697, file: !493, line: 107, baseType: !1270, size: 64, offset: 3904)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!343, !703, !518}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !697, file: !493, line: 108, baseType: !1274, size: 64, offset: 3968)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!343, !703, !1277, !1056, !1057}
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !65, line: 25, baseType: !322)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !697, file: !493, line: 109, baseType: !1236, size: 64, offset: 4032)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !697, file: !493, line: 111, baseType: !1280, size: 64, offset: 4096)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!343, !703, !703, !703, !605, !703}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !697, file: !493, line: 112, baseType: !1284, size: 64, offset: 4160)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!343, !703, !703, !703, !703}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !697, file: !493, line: 113, baseType: !1288, size: 64, offset: 4224)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!343, !703, !854, !854}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !697, file: !493, line: 114, baseType: !700, size: 64, offset: 4288)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !697, file: !493, line: 115, baseType: !1107, size: 64, offset: 4352)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !697, file: !493, line: 117, baseType: !1165, size: 64, offset: 4416)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !697, file: !493, line: 118, baseType: !1165, size: 64, offset: 4480)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !697, file: !493, line: 119, baseType: !1274, size: 64, offset: 4544)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !697, file: !493, line: 120, baseType: !1297, size: 64, offset: 4608)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!343, !703, !1300, !1081}
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !65, line: 1675, baseType: !139)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !697, file: !493, line: 121, baseType: !1236, size: 64, offset: 4672)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !697, file: !493, line: 123, baseType: !1303, size: 64, offset: 4736)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!343, !703, !551, !329}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !697, file: !493, line: 124, baseType: !1307, size: 64, offset: 4800)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!343, !703, !1197, !718, !329}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !697, file: !493, line: 125, baseType: !1311, size: 64, offset: 4864)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!343, !642, !703}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !697, file: !493, line: 126, baseType: !715, size: 64, offset: 4928)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !697, file: !493, line: 127, baseType: !715, size: 64, offset: 4992)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !697, file: !493, line: 129, baseType: !1317, size: 64, offset: 5056)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!343, !703, !938}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !697, file: !493, line: 130, baseType: !1321, size: 64, offset: 5120)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!343, !703, !1324, !1324}
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !38, line: 654, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !38, line: 653, size: 128, elements: !1327)
!1327 = !{!1328, !1329}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1326, file: !38, line: 653, baseType: !551, size: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1326, file: !38, line: 653, baseType: !718, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !697, file: !493, line: 131, baseType: !1321, size: 64, offset: 5184)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !697, file: !493, line: 132, baseType: !1332, size: 64, offset: 5248)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!343, !703, !596, !596, !596}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !697, file: !493, line: 133, baseType: !1270, size: 64, offset: 5312)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !697, file: !493, line: 135, baseType: !1337, size: 64, offset: 5376)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!343, !703, !605, !1081}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !697, file: !493, line: 136, baseType: !1337, size: 64, offset: 5440)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !697, file: !493, line: 137, baseType: !1342, size: 64, offset: 5504)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!343, !703, !1081}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !697, file: !493, line: 138, baseType: !700, size: 64, offset: 5568)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !697, file: !493, line: 139, baseType: !1347, size: 64, offset: 5632)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!343, !703, !732, !732}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !697, file: !493, line: 141, baseType: !1236, size: 64, offset: 5696)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !697, file: !493, line: 142, baseType: !1352, size: 64, offset: 5760)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!343, !703, !703, !605, !703}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !697, file: !493, line: 143, baseType: !1356, size: 64, offset: 5824)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!343, !703, !703, !703}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !697, file: !493, line: 144, baseType: !1236, size: 64, offset: 5888)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !697, file: !493, line: 145, baseType: !1352, size: 64, offset: 5952)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !697, file: !493, line: 147, baseType: !1356, size: 64, offset: 6016)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !697, file: !493, line: 148, baseType: !1236, size: 64, offset: 6080)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !697, file: !493, line: 149, baseType: !1352, size: 64, offset: 6144)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !697, file: !493, line: 150, baseType: !1356, size: 64, offset: 6208)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !697, file: !493, line: 151, baseType: !1366, size: 64, offset: 6272)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!343, !703, !333}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !697, file: !493, line: 153, baseType: !1103, size: 64, offset: 6336)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !697, file: !493, line: 154, baseType: !1103, size: 64, offset: 6400)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !697, file: !493, line: 155, baseType: !1103, size: 64, offset: 6464)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !697, file: !493, line: 156, baseType: !1103, size: 64, offset: 6528)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !697, file: !493, line: 157, baseType: !1270, size: 64, offset: 6592)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !697, file: !493, line: 159, baseType: !1375, size: 64, offset: 6656)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!343, !703, !551, !706}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !697, file: !493, line: 160, baseType: !1103, size: 64, offset: 6720)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !697, file: !493, line: 161, baseType: !1103, size: 64, offset: 6784)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !697, file: !493, line: 162, baseType: !1103, size: 64, offset: 6848)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !697, file: !493, line: 163, baseType: !1103, size: 64, offset: 6912)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !697, file: !493, line: 165, baseType: !1356, size: 64, offset: 6976)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !697, file: !493, line: 166, baseType: !1356, size: 64, offset: 7040)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !697, file: !493, line: 167, baseType: !1165, size: 64, offset: 7104)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !697, file: !493, line: 168, baseType: !1386, size: 64, offset: 7168)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!343, !703, !718, !551}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !697, file: !493, line: 169, baseType: !1390, size: 64, offset: 7232)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!343, !703, !1081, !596}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !697, file: !493, line: 171, baseType: !1127, size: 64, offset: 7296)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !697, file: !493, line: 172, baseType: !1103, size: 64, offset: 7360)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !697, file: !493, line: 173, baseType: !1396, size: 64, offset: 7424)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!343, !703, !596, !1186}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !697, file: !493, line: 174, baseType: !1260, size: 64, offset: 7488)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !697, file: !493, line: 175, baseType: !1260, size: 64, offset: 7552)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !697, file: !493, line: 177, baseType: !715, size: 64, offset: 7616)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !697, file: !493, line: 178, baseType: !1053, size: 64, offset: 7680)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !697, file: !493, line: 179, baseType: !715, size: 64, offset: 7744)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !697, file: !493, line: 180, baseType: !1014, size: 64, offset: 7808)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !697, file: !493, line: 181, baseType: !1406, size: 64, offset: 7872)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!343, !703, !325, !1056, !1057}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !697, file: !493, line: 183, baseType: !1317, size: 64, offset: 7936)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !697, file: !493, line: 184, baseType: !1088, size: 64, offset: 8000)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !697, file: !493, line: 185, baseType: !1412, size: 64, offset: 8064)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!343, !703, !902}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !697, file: !493, line: 186, baseType: !1416, size: 64, offset: 8128)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!343, !703, !551, !704, !613}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !697, file: !493, line: 187, baseType: !1146, size: 64, offset: 8192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !697, file: !493, line: 189, baseType: !1421, size: 64, offset: 8256)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!343, !703, !551, !551, !596, !706}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !697, file: !493, line: 190, baseType: !1236, size: 64, offset: 8320)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !697, file: !493, line: 191, baseType: !1352, size: 64, offset: 8384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !697, file: !493, line: 192, baseType: !1356, size: 64, offset: 8448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !697, file: !493, line: 193, baseType: !1428, size: 64, offset: 8512)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!343, !703, !1194, !1431}
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !65, line: 1401, baseType: !1432)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !493, line: 660, size: 5312, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1433, file: !493, line: 661, baseType: !496, size: 4480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1433, file: !493, line: 661, baseType: !1203, size: 32, offset: 4480)
