; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/network/networkmonitor.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/network/networkmonitor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_DM = type opaque
%struct._p_DMNetworkMonitor = type { %struct.ompi_communicator_t*, %struct._p_DM*, %struct._p_DMNetworkMonitorList* }
%struct.ompi_communicator_t = type opaque
%struct._p_DMNetworkMonitorList = type { %struct._p_PetscViewer*, %struct._p_Vec*, i32, i32, i32, i32, %struct._p_DMNetworkMonitorList* }
%struct._p_PetscViewer = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscObject = type opaque
%struct._p_PetscDrawLG = type opaque
%struct._p_PetscDrawAxis = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.DMNetworkMonitorCreate = private unnamed_addr constant [23 x i8] c"DMNetworkMonitorCreate\00", align 1
@.str = private unnamed_addr constant [91 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/network/networkmonitor.c\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1

!28 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!60 = !{!61, !64, !68, !69, !71, !72, !75}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !11, line: 430, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !11, line: 430, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !65, line: 330, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !65, line: 330, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 46, baseType: !74)
!73 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!77 = !{i32 7, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 7, !"PIC Level", i32 2}
!81 = !{i32 7, !"uwtable", i32 1}
!82 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!83 = distinct !DISubprogram(name: "DMNetworkMonitorCreate", scope: !84, file: !84, line: 19, type: !85, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !121)
!84 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/network/networkmonitor.c", directory: "/home/users/ndemeye/xSDK")
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !88, !92}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !11, line: 14, baseType: !71)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !89, line: 14, baseType: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !89, line: 14, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNetworkMonitor", file: !94, line: 71, baseType: !95)
!94 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmnetwork.h", directory: "/home/users/ndemeye/xSDK")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMNetworkMonitor", file: !94, line: 72, size: 192, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !96, file: !94, line: 74, baseType: !64, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "network", scope: !96, file: !94, line: 75, baseType: !88, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "firstnode", scope: !96, file: !94, line: 76, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNetworkMonitorList", file: !94, line: 59, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMNetworkMonitorList", file: !94, line: 60, size: 320, elements: !104)
!104 = !{!105, !110, !115, !117, !118, !119, !120}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !103, file: !94, line: 62, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !107, line: 16, baseType: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !107, line: 16, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !103, file: !94, line: 63, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !112, line: 21, baseType: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !112, line: 21, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !103, file: !94, line: 64, baseType: !116, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !11, line: 102, baseType: !71)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !103, file: !94, line: 65, baseType: !116, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !103, file: !94, line: 66, baseType: !116, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !103, file: !94, line: 67, baseType: !116, size: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !94, line: 68, baseType: !101, size: 64, offset: 256)
!121 = !{!122, !123, !124, !125, !126, !127, !129, !131, !133, !139, !140}
!122 = !DILocalVariable(name: "network", arg: 1, scope: !83, file: !84, line: 19, type: !88)
!123 = !DILocalVariable(name: "monitorptr", arg: 2, scope: !83, file: !84, line: 19, type: !92)
!124 = !DILocalVariable(name: "ierr", scope: !83, file: !84, line: 21, type: !87)
!125 = !DILocalVariable(name: "monitor", scope: !83, file: !84, line: 22, type: !93)
!126 = !DILocalVariable(name: "comm", scope: !83, file: !84, line: 23, type: !64)
!127 = !DILocalVariable(name: "size", scope: !83, file: !84, line: 24, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !11, line: 49, baseType: !71)
!129 = !DILocalVariable(name: "ierr__", scope: !130, file: !84, line: 27, type: !87)
!130 = distinct !DILexicalBlock(scope: !83, file: !84, line: 27, column: 57)
!131 = !DILocalVariable(name: "_7_errorcode", scope: !132, file: !84, line: 28, type: !87)
!132 = distinct !DILexicalBlock(scope: !83, file: !84, line: 28, column: 37)
!133 = !DILocalVariable(name: "_7_errorstring", scope: !134, file: !84, line: 28, type: !136)
!134 = distinct !DILexicalBlock(scope: !135, file: !84, line: 28, column: 37)
!135 = distinct !DILexicalBlock(scope: !132, file: !84, line: 28, column: 37)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 256)
!139 = !DILocalVariable(name: "_7_resultlen", scope: !134, file: !84, line: 28, type: !128)
!140 = !DILocalVariable(name: "ierr__", scope: !141, file: !84, line: 31, type: !87)
!141 = distinct !DILexicalBlock(scope: !83, file: !84, line: 31, column: 35)
!142 = !DILocation(line: 0, scope: !83)
!143 = !DILocation(line: 22, column: 3, scope: !83)
!144 = !DILocation(line: 23, column: 3, scope: !83)
!145 = !DILocation(line: 24, column: 3, scope: !83)
!146 = !DILocation(line: 26, column: 3, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !84, line: 26, column: 3)
!148 = distinct !DILexicalBlock(scope: !149, file: !84, line: 26, column: 3)
!149 = distinct !DILexicalBlock(scope: !83, file: !84, line: 26, column: 3)
!150 = !{!151, !151, i64 0}
!151 = !{!"any pointer", !152, i64 0}
!152 = !{!"omnipotent char", !153, i64 0}
!153 = !{!"Simple C/C++ TBAA"}
!154 = !DILocation(line: 26, column: 3, scope: !148)
!155 = !DILocation(line: 26, column: 3, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !84, line: 26, column: 3)
!157 = distinct !DILexicalBlock(scope: !147, file: !84, line: 26, column: 3)
!158 = !{!159, !160, i64 1536}
!159 = !{!"", !152, i64 0, !152, i64 512, !152, i64 1024, !152, i64 1280, !160, i64 1536, !160, i64 1540, !152, i64 1544}
!160 = !{!"int", !152, i64 0}
!161 = !DILocation(line: 26, column: 3, scope: !157)
!162 = !DILocation(line: 26, column: 3, scope: !163)
!163 = distinct !DILexicalBlock(scope: !156, file: !84, line: 26, column: 3)
!164 = !{!160, !160, i64 0}
!165 = !{!159, !160, i64 1540}
!166 = !DILocation(line: 27, column: 29, scope: !83)
!167 = !DILocation(line: 27, column: 10, scope: !83)
!168 = !DILocation(line: 0, scope: !130)
!169 = !DILocation(line: 27, column: 57, scope: !170)
!170 = distinct !DILexicalBlock(scope: !130, file: !84, line: 27, column: 57)
!171 = !DILocation(line: 27, column: 57, scope: !130)
!172 = !{!"branch_weights", i32 2000, i32 1}
!173 = !DILocation(line: 28, column: 24, scope: !83)
!174 = !DILocation(line: 28, column: 10, scope: !83)
!175 = !DILocation(line: 0, scope: !132)
!176 = !DILocation(line: 28, column: 37, scope: !135)
!177 = !DILocation(line: 28, column: 37, scope: !132)
!178 = !DILocation(line: 28, column: 37, scope: !134)
!179 = !DILocation(line: 0, scope: !134)
!180 = !DILocation(line: 29, column: 7, scope: !181)
!181 = distinct !DILexicalBlock(scope: !83, file: !84, line: 29, column: 7)
!182 = !DILocation(line: 29, column: 12, scope: !181)
