; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/interface/ftn-custom/zsf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/interface/ftn-custom/zsf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 663, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!56 = !{!57, !63, !67, !68, !71, !74, !75, !60, !77}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !59, line: 135, baseType: !60)
!59 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !61, line: 100, baseType: !62)
!61 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !64, line: 330, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !64, line: 330, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !64, line: 331, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !64, line: 331, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !73)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !62)
!76 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null}
!80 = !{i32 7, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 4}
!83 = !{i32 7, !"PIC Level", i32 2}
!84 = !{i32 7, !"uwtable", i32 1}
!85 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!86 = distinct !DISubprogram(name: "petscsfview_", scope: !87, file: !87, line: 24, type: !88, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !481)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/interface/ftn-custom/zsf.c", directory: "/home/users/ndemeye/xSDK")
!88 = !DISubroutineType(types: !89)
!89 = !{null, !90, !479, !480}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !92, line: 15, baseType: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !95)
!95 = !{!96, !293, !387, !402, !403, !404, !405, !406, !407, !408, !410, !411, !412, !413, !415, !416, !417, !419, !420, !422, !423, !428, !429, !430, !431, !432, !433, !434, !435, !436, !440, !441, !442, !443, !444, !446, !447, !472, !473, !474, !475, !476, !478}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !94, file: !44, line: 67, baseType: !97, size: 4480)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !98, line: 122, baseType: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !98, line: 73, size: 4480, elements: !100)
!100 = !{!101, !103, !151, !152, !153, !156, !157, !158, !159, !167, !168, !170, !174, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !191, !192, !193, !195, !196, !197, !199, !200, !201, !202, !203, !206, !208, !209, !210, !211, !212, !215, !217, !218, !219, !229, !231, !232, !236, !237, !283, !288, !290, !291, !292}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !99, file: !98, line: 74, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !73)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !99, file: !98, line: 75, baseType: !104, size: 448, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 448, elements: !149)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !98, line: 53, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 45, size: 448, elements: !107)
!107 = !{!108, !116, !124, !129, !136, !140, !144}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !106, file: !98, line: 46, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !113, !115}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !73)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !106, file: !98, line: 47, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!112, !113, !120}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !121, line: 16, baseType: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !121, line: 16, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !106, file: !98, line: 48, baseType: !125, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!112, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !106, file: !98, line: 49, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!112, !113, !133, !113}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !106, file: !98, line: 50, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!112, !113, !133, !128}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !106, file: !98, line: 51, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!112, !113, !133, !77}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !106, file: !98, line: 52, baseType: !145, size: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!112, !113, !133, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !99, file: !98, line: 76, baseType: !63, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !98, line: 77, baseType: !72, size: 32, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !155)
!155 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !98, line: 79, baseType: !160, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !163, line: 27, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !165, line: 43, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !99, file: !98, line: 80, baseType: !72, size: 32, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !98, line: 81, baseType: !169, size: 32, offset: 992)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !73)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !99, file: !98, line: 82, baseType: !171, size: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !99, file: !98, line: 83, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !99, file: !98, line: 84, baseType: !179, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !99, file: !98, line: 85, baseType: !179, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !99, file: !98, line: 86, baseType: !179, size: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !99, file: !98, line: 87, baseType: !179, size: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !98, line: 88, baseType: !113, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !99, file: !98, line: 89, baseType: !160, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !98, line: 90, baseType: !179, size: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !99, file: !98, line: 91, baseType: !179, size: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !99, file: !98, line: 92, baseType: !72, size: 32, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !99, file: !98, line: 93, baseType: !67, size: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !98, line: 94, baseType: !190, size: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !99, file: !98, line: 95, baseType: !72, size: 32, offset: 1856)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !99, file: !98, line: 95, baseType: !72, size: 32, offset: 1888)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !99, file: !98, line: 96, baseType: !194, size: 64, offset: 1920)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !99, file: !98, line: 96, baseType: !194, size: 64, offset: 1984)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !99, file: !98, line: 97, baseType: !71, size: 64, offset: 2048)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !99, file: !98, line: 97, baseType: !198, size: 64, offset: 2112)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !99, file: !98, line: 98, baseType: !72, size: 32, offset: 2176)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !99, file: !98, line: 98, baseType: !72, size: 32, offset: 2208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !99, file: !98, line: 99, baseType: !194, size: 64, offset: 2240)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !99, file: !98, line: 99, baseType: !194, size: 64, offset: 2304)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !99, file: !98, line: 100, baseType: !204, size: 64, offset: 2368)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !155)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !99, file: !98, line: 100, baseType: !207, size: 64, offset: 2432)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !99, file: !98, line: 101, baseType: !72, size: 32, offset: 2496)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !99, file: !98, line: 101, baseType: !72, size: 32, offset: 2528)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !99, file: !98, line: 102, baseType: !194, size: 64, offset: 2560)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !99, file: !98, line: 102, baseType: !194, size: 64, offset: 2624)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !99, file: !98, line: 103, baseType: !213, size: 64, offset: 2688)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !205)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !99, file: !98, line: 103, baseType: !216, size: 64, offset: 2752)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !99, file: !98, line: 104, baseType: !148, size: 64, offset: 2816)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !99, file: !98, line: 105, baseType: !72, size: 32, offset: 2880)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !99, file: !98, line: 106, baseType: !220, size: 128, offset: 2944)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, elements: !227)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !98, line: 64, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 61, size: 128, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !223, file: !98, line: 62, baseType: !77, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !223, file: !98, line: 63, baseType: !67, size: 64, offset: 64)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !99, file: !98, line: 107, baseType: !230, size: 64, offset: 3072)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !227)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !99, file: !98, line: 108, baseType: !67, size: 64, offset: 3136)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !99, file: !98, line: 109, baseType: !233, size: 64, offset: 3200)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!112, !67}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !99, file: !98, line: 111, baseType: !72, size: 32, offset: 3264)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !99, file: !98, line: 112, baseType: !238, size: 320, offset: 3328)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 320, elements: !281)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!112, !242, !113, !67}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !245)
!245 = !{!246, !247, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !244, file: !10, line: 100, baseType: !72, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !10, line: 101, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !259, !260, !261, !262, !264, !266, !267, !268}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !250, file: !10, line: 84, baseType: !179, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !250, file: !10, line: 85, baseType: !179, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !10, line: 86, baseType: !67, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !250, file: !10, line: 87, baseType: !171, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !250, file: !10, line: 88, baseType: !257, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !250, file: !10, line: 89, baseType: !135, size: 8, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !250, file: !10, line: 90, baseType: !179, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !250, file: !10, line: 91, baseType: !75, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !250, file: !10, line: 92, baseType: !263, size: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !10, line: 93, baseType: !265, size: 32, offset: 544)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !10, line: 94, baseType: !248, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !250, file: !10, line: 95, baseType: !179, size: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !250, file: !10, line: 96, baseType: !67, size: 64, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !244, file: !10, line: 102, baseType: !179, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !244, file: !10, line: 102, baseType: !179, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !244, file: !10, line: 103, baseType: !179, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !244, file: !10, line: 104, baseType: !63, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !244, file: !10, line: 105, baseType: !263, size: 32, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !244, file: !10, line: 105, baseType: !263, size: 32, offset: 416)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !244, file: !10, line: 105, baseType: !263, size: 32, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !244, file: !10, line: 106, baseType: !113, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !244, file: !10, line: 107, baseType: !278, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!281 = !{!282}
!282 = !DISubrange(count: 5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !99, file: !98, line: 113, baseType: !284, size: 320, offset: 3648)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 320, elements: !281)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!112, !113, !67}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !99, file: !98, line: 114, baseType: !289, size: 320, offset: 3968)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, elements: !281)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !99, file: !98, line: 115, baseType: !263, size: 32, offset: 4288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !99, file: !98, line: 120, baseType: !278, size: 64, offset: 4352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !99, file: !98, line: 121, baseType: !263, size: 32, offset: 4416)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !94, file: !44, line: 67, baseType: !294, size: 1344, offset: 4480)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1344, elements: !149)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !296)
!296 = !{!297, !301, !302, !303, !307, !311, !316, !326, !330, !331, !332, !336, !340, !344, !354, !358, !362, !374, !378, !379, !383}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !295, file: !44, line: 40, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!112, !91}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !295, file: !44, line: 41, baseType: !298, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !295, file: !44, line: 42, baseType: !298, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !295, file: !44, line: 43, baseType: !304, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!112, !242, !91}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !295, file: !44, line: 44, baseType: !308, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!112, !91, !120}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !295, file: !44, line: 45, baseType: !312, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!112, !91, !315, !91}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !295, file: !44, line: 46, baseType: !317, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!112, !91, !68, !320, !321, !320, !67, !323}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !64, line: 338, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !64, line: 338, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !295, file: !44, line: 47, baseType: !327, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!112, !91, !68, !321, !67, !323}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !295, file: !44, line: 48, baseType: !317, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !295, file: !44, line: 49, baseType: !327, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !295, file: !44, line: 50, baseType: !333, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!112, !91, !68, !320, !67, !320, !321, !67, !323}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !295, file: !44, line: 51, baseType: !337, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!112, !91, !68, !67, !321, !67, !323}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !295, file: !44, line: 52, baseType: !341, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!112, !91, !68, !320, !321, !320, !67}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !295, file: !44, line: 53, baseType: !345, size: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!112, !91, !71, !348, !351, !351, !351}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !295, file: !44, line: 54, baseType: !355, size: 64, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!112, !91, !71, !348, !351, !351}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !295, file: !44, line: 55, baseType: !359, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!112, !91, !90}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !295, file: !44, line: 56, baseType: !363, size: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!112, !91, !71, !71, !351, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !92, line: 49, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 46, size: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !370, file: !92, line: 47, baseType: !72, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !370, file: !92, line: 48, baseType: !72, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !295, file: !44, line: 57, baseType: !375, size: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!112, !91, !72, !352, !90}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !295, file: !44, line: 58, baseType: !375, size: 64, offset: 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !295, file: !44, line: 60, baseType: !380, size: 64, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!112, !320, !75, !74}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !295, file: !44, line: 61, baseType: !384, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!112, !320, !67}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !94, file: !44, line: 78, baseType: !388, size: 512, offset: 5824)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !44, line: 68, size: 512, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !397, !398, !399, !400, !401}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !388, file: !44, line: 69, baseType: !72, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !388, file: !44, line: 69, baseType: !72, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !388, file: !44, line: 70, baseType: !263, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !388, file: !44, line: 71, baseType: !263, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !388, file: !44, line: 72, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !388, file: !44, line: 73, baseType: !213, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !388, file: !44, line: 74, baseType: !91, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !388, file: !44, line: 75, baseType: !72, size: 32, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !388, file: !44, line: 76, baseType: !68, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !388, file: !44, line: 77, baseType: !263, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !94, file: !44, line: 81, baseType: !72, size: 32, offset: 6336)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !94, file: !44, line: 82, baseType: !72, size: 32, offset: 6368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !94, file: !44, line: 83, baseType: !71, size: 64, offset: 6400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !94, file: !44, line: 84, baseType: !71, size: 64, offset: 6464)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !94, file: !44, line: 85, baseType: !72, size: 32, offset: 6528)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !94, file: !44, line: 85, baseType: !72, size: 32, offset: 6560)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !94, file: !44, line: 86, baseType: !409, size: 64, offset: 6592)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !94, file: !44, line: 87, baseType: !409, size: 64, offset: 6656)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !94, file: !44, line: 88, baseType: !72, size: 32, offset: 6720)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !94, file: !44, line: 89, baseType: !72, size: 32, offset: 6752)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !94, file: !44, line: 90, baseType: !414, size: 64, offset: 6784)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !94, file: !44, line: 91, baseType: !71, size: 64, offset: 6848)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !94, file: !44, line: 92, baseType: !71, size: 64, offset: 6912)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !94, file: !44, line: 93, baseType: !418, size: 128, offset: 6976)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !227)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !94, file: !44, line: 96, baseType: !230, size: 64, offset: 7104)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !94, file: !44, line: 97, baseType: !421, size: 64, offset: 7168)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !227)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !94, file: !44, line: 98, baseType: !230, size: 64, offset: 7232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !94, file: !44, line: 99, baseType: !424, size: 128, offset: 7296)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 128, elements: !227)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !44, line: 64, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !94, file: !44, line: 100, baseType: !424, size: 128, offset: 7424)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !94, file: !44, line: 101, baseType: !421, size: 64, offset: 7552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !94, file: !44, line: 103, baseType: !72, size: 32, offset: 7616)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !94, file: !44, line: 104, baseType: !71, size: 64, offset: 7680)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !94, file: !44, line: 105, baseType: !263, size: 32, offset: 7744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !94, file: !44, line: 106, baseType: !71, size: 64, offset: 7808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !94, file: !44, line: 107, baseType: !71, size: 64, offset: 7872)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !94, file: !44, line: 108, baseType: !263, size: 32, offset: 7936)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !94, file: !44, line: 109, baseType: !437, size: 64, offset: 8000)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !64, line: 336, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !64, line: 336, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !94, file: !44, line: 110, baseType: !437, size: 64, offset: 8064)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !94, file: !44, line: 111, baseType: !91, size: 64, offset: 8128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !94, file: !44, line: 112, baseType: !263, size: 32, offset: 8192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !94, file: !44, line: 113, baseType: !263, size: 32, offset: 8224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !94, file: !44, line: 114, baseType: !445, size: 32, offset: 8256)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !94, file: !44, line: 115, baseType: !263, size: 32, offset: 8288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !94, file: !44, line: 116, baseType: !448, size: 64, offset: 8320)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !449, line: 60, baseType: !450)
!449 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !452, line: 240, size: 640, elements: !453)
!452 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !468, !469, !470, !471}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !451, file: !452, line: 241, baseType: !63, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !452, line: 242, baseType: !169, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !451, file: !452, line: 243, baseType: !72, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !451, file: !452, line: 243, baseType: !72, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !451, file: !452, line: 244, baseType: !72, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !451, file: !452, line: 244, baseType: !72, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !451, file: !452, line: 245, baseType: !71, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !451, file: !452, line: 246, baseType: !263, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !451, file: !452, line: 247, baseType: !72, size: 32, offset: 352)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !451, file: !452, line: 251, baseType: !72, size: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !451, file: !452, line: 252, baseType: !465, size: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !449, line: 30, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !449, line: 30, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !451, file: !452, line: 253, baseType: !263, size: 32, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !451, file: !452, line: 254, baseType: !72, size: 32, offset: 544)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !451, file: !452, line: 254, baseType: !72, size: 32, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !451, file: !452, line: 255, baseType: !72, size: 32, offset: 608)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !94, file: !44, line: 117, baseType: !263, size: 32, offset: 8384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !94, file: !44, line: 118, baseType: !263, size: 32, offset: 8416)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !94, file: !44, line: 119, baseType: !263, size: 32, offset: 8448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !94, file: !44, line: 120, baseType: !72, size: 32, offset: 8480)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !94, file: !44, line: 121, baseType: !477, size: 32, offset: 8512)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !44, line: 122, baseType: !67, size: 64, offset: 8576)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!481 = !{!482, !483, !484, !485}
!482 = !DILocalVariable(name: "sf", arg: 1, scope: !86, file: !87, line: 24, type: !90)
!483 = !DILocalVariable(name: "vin", arg: 2, scope: !86, file: !87, line: 24, type: !479)
!484 = !DILocalVariable(name: "ierr", arg: 3, scope: !86, file: !87, line: 24, type: !480)
!485 = !DILocalVariable(name: "v", scope: !86, file: !87, line: 26, type: !120)
!486 = !DILocation(line: 0, scope: !86)
!487 = !DILocation(line: 28, column: 3, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !87, line: 28, column: 3)
!489 = distinct !DILexicalBlock(scope: !86, file: !87, line: 28, column: 3)
!490 = !{!491, !491, i64 0}
!491 = !{!"long", !492, i64 0}
!492 = !{!"omnipotent char", !493, i64 0}
!493 = !{!"Simple C/C++ TBAA"}
!494 = !DILocation(line: 28, column: 3, scope: !489)
!495 = !DILocation(line: 28, column: 3, scope: !496)
!496 = distinct !DILexicalBlock(scope: !488, file: !87, line: 28, column: 3)
!497 = !{!498, !498, i64 0}
!498 = !{!"any pointer", !492, i64 0}
!499 = !DILocation(line: 28, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !87, line: 28, column: 3)
!501 = distinct !DILexicalBlock(scope: !488, file: !87, line: 28, column: 3)
!502 = !DILocation(line: 28, column: 3, scope: !503)
!503 = distinct !DILexicalBlock(scope: !504, file: !87, line: 28, column: 3)
!504 = distinct !DILexicalBlock(scope: !501, file: !87, line: 28, column: 3)
!505 = !DILocation(line: 28, column: 3, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !87, line: 28, column: 3)
!507 = distinct !DILexicalBlock(scope: !504, file: !87, line: 28, column: 3)
!508 = !DILocation(line: 28, column: 3, scope: !509)
!509 = distinct !DILexicalBlock(scope: !510, file: !87, line: 28, column: 3)
!510 = distinct !DILexicalBlock(scope: !507, file: !87, line: 28, column: 3)
!511 = !DILocation(line: 28, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !87, line: 28, column: 3)
!513 = distinct !DILexicalBlock(scope: !510, file: !87, line: 28, column: 3)
!514 = !DILocation(line: 28, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !87, line: 28, column: 3)
!516 = distinct !DILexicalBlock(scope: !513, file: !87, line: 28, column: 3)
!517 = !DILocation(line: 28, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !87, line: 28, column: 3)
!519 = distinct !DILexicalBlock(scope: !516, file: !87, line: 28, column: 3)
!520 = !DILocation(line: 28, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !87, line: 28, column: 3)
!522 = distinct !DILexicalBlock(scope: !519, file: !87, line: 28, column: 3)
!523 = !DILocation(line: 28, column: 3, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !87, line: 28, column: 3)
!525 = distinct !DILexicalBlock(scope: !522, file: !87, line: 28, column: 3)
!526 = !DILocation(line: 28, column: 3, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !87, line: 28, column: 3)
!528 = distinct !DILexicalBlock(scope: !525, file: !87, line: 28, column: 3)
!529 = !DILocation(line: 28, column: 3, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !87, line: 28, column: 3)
!531 = distinct !DILexicalBlock(scope: !528, file: !87, line: 28, column: 3)
!532 = !DILocation(line: 0, scope: !488)
!533 = !DILocation(line: 29, column: 23, scope: !86)
!534 = !DILocation(line: 29, column: 11, scope: !86)
!535 = !DILocation(line: 29, column: 9, scope: !86)
!536 = !{!537, !537, i64 0}
!537 = !{!"int", !492, i64 0}
!538 = !DILocation(line: 30, column: 1, scope: !86)
