; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/ftn-custom/zsnesf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/ftn-custom/zsnesf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_SNES = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!43 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!44 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!45 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!46 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!47 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!48 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!49 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!50 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!51 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!52 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!53 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!54 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!55 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!56 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!57 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!58 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 119, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!62 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!104 = !{!105, !312, !203, !314, !154, !319, !321, !122, !322, !278, !325, !331, !345, !348, !143, !328}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !27, line: 73, size: 4480, elements: !108)
!108 = !{!109, !111, !164, !165, !167, !170, !171, !172, !173, !181, !182, !184, !188, !192, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !206, !207, !208, !210, !211, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !227, !228, !231, !233, !234, !235, !245, !247, !248, !252, !253, !302, !307, !309, !310, !311}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !107, file: !27, line: 74, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !107, file: !27, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !162)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !27, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 45, size: 448, elements: !115)
!115 = !{!116, !126, !134, !139, !146, !150, !157}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !27, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !105, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !123, line: 330, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !123, line: 330, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !27, line: 47, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!120, !105, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !131, line: 16, baseType: !132)
!131 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !131, line: 16, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !27, line: 48, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!120, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !27, line: 49, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!120, !105, !143, !105}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !27, line: 50, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !105, !143, !138}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !27, line: 51, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!120, !105, !143, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !27, line: 52, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!120, !105, !143, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !107, file: !27, line: 76, baseType: !122, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !27, line: 77, baseType: !166, size: 32, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !107, file: !27, line: 78, baseType: !168, size: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !169)
!169 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !107, file: !27, line: 78, baseType: !168, size: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !107, file: !27, line: 78, baseType: !168, size: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !107, file: !27, line: 78, baseType: !168, size: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !27, line: 79, baseType: !174, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !177, line: 27, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !179, line: 43, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!180 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !107, file: !27, line: 80, baseType: !166, size: 32, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !107, file: !27, line: 81, baseType: !183, size: 32, offset: 992)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !107, file: !27, line: 82, baseType: !185, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !107, file: !27, line: 83, baseType: !189, size: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !107, file: !27, line: 84, baseType: !193, size: 64, offset: 1152)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !107, file: !27, line: 85, baseType: !193, size: 64, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !107, file: !27, line: 86, baseType: !193, size: 64, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !107, file: !27, line: 87, baseType: !193, size: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !27, line: 88, baseType: !105, size: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !107, file: !27, line: 89, baseType: !174, size: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !27, line: 90, baseType: !193, size: 64, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !107, file: !27, line: 91, baseType: !193, size: 64, offset: 1600)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !107, file: !27, line: 92, baseType: !166, size: 32, offset: 1664)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !107, file: !27, line: 93, baseType: !203, size: 64, offset: 1728)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !107, file: !27, line: 94, baseType: !205, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !175)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !107, file: !27, line: 95, baseType: !166, size: 32, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !107, file: !27, line: 95, baseType: !166, size: 32, offset: 1888)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !107, file: !27, line: 96, baseType: !209, size: 64, offset: 1920)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !107, file: !27, line: 96, baseType: !209, size: 64, offset: 1984)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !107, file: !27, line: 97, baseType: !212, size: 64, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !107, file: !27, line: 97, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !107, file: !27, line: 98, baseType: !166, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !107, file: !27, line: 98, baseType: !166, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !107, file: !27, line: 99, baseType: !209, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !107, file: !27, line: 99, baseType: !209, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !107, file: !27, line: 100, baseType: !220, size: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !169)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !107, file: !27, line: 100, baseType: !223, size: 64, offset: 2432)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !107, file: !27, line: 101, baseType: !166, size: 32, offset: 2496)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !107, file: !27, line: 101, baseType: !166, size: 32, offset: 2528)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !107, file: !27, line: 102, baseType: !209, size: 64, offset: 2560)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !107, file: !27, line: 102, baseType: !209, size: 64, offset: 2624)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !107, file: !27, line: 103, baseType: !229, size: 64, offset: 2688)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !221)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !107, file: !27, line: 103, baseType: !232, size: 64, offset: 2752)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !107, file: !27, line: 104, baseType: !161, size: 64, offset: 2816)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !107, file: !27, line: 105, baseType: !166, size: 32, offset: 2880)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !107, file: !27, line: 106, baseType: !236, size: 128, offset: 2944)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 128, elements: !243)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !27, line: 64, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 61, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !239, file: !27, line: 62, baseType: !154, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !239, file: !27, line: 63, baseType: !203, size: 64, offset: 64)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !107, file: !27, line: 107, baseType: !246, size: 64, offset: 3072)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !107, file: !27, line: 108, baseType: !203, size: 64, offset: 3136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !107, file: !27, line: 109, baseType: !249, size: 64, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!120, !203}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !107, file: !27, line: 111, baseType: !166, size: 32, offset: 3264)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !107, file: !27, line: 112, baseType: !254, size: 320, offset: 3328)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 320, elements: !300)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!120, !258, !105, !203}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !261)
!261 = !{!262, !263, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !260, file: !12, line: 100, baseType: !166, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !12, line: 101, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !275, !276, !277, !281, !283, !285, !286, !287}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !266, file: !12, line: 84, baseType: !193, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !266, file: !12, line: 85, baseType: !193, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !12, line: 86, baseType: !203, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !266, file: !12, line: 87, baseType: !185, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !266, file: !12, line: 88, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !266, file: !12, line: 89, baseType: !145, size: 8, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !266, file: !12, line: 90, baseType: !193, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !266, file: !12, line: 91, baseType: !278, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !279, line: 46, baseType: !280)
!279 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!280 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !266, file: !12, line: 92, baseType: !282, size: 32, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !12, line: 93, baseType: !284, size: 32, offset: 544)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !12, line: 94, baseType: !264, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !266, file: !12, line: 95, baseType: !193, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !266, file: !12, line: 96, baseType: !203, size: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !260, file: !12, line: 102, baseType: !193, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !260, file: !12, line: 102, baseType: !193, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !260, file: !12, line: 103, baseType: !193, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !260, file: !12, line: 104, baseType: !122, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !260, file: !12, line: 105, baseType: !282, size: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !260, file: !12, line: 105, baseType: !282, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !260, file: !12, line: 105, baseType: !282, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !260, file: !12, line: 106, baseType: !105, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !260, file: !12, line: 107, baseType: !297, size: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!300 = !{!301}
!301 = !DISubrange(count: 5)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !107, file: !27, line: 113, baseType: !303, size: 320, offset: 3648)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 320, elements: !300)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!120, !105, !203}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !107, file: !27, line: 114, baseType: !308, size: 320, offset: 3968)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, elements: !300)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !107, file: !27, line: 115, baseType: !282, size: 32, offset: 4288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !27, line: 120, baseType: !297, size: 64, offset: 4352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !107, file: !27, line: 121, baseType: !282, size: 32, offset: 4416)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !313, line: 1451, baseType: !154)
!313 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !316, line: 1378, baseType: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !316, line: 1378, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !320, line: 100, baseType: !280)
!320 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !324, line: 135, baseType: !319)
!324 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!120, !328, !166, !221, !203}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !39, line: 18, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !39, line: 18, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !60, line: 178, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 178, size: 256, elements: !335)
!335 = !{!336, !337, !339, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !334, file: !60, line: 178, baseType: !130, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !334, file: !60, line: 178, baseType: !338, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !60, line: 162, baseType: !59)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !334, file: !60, line: 178, baseType: !340, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !341, line: 43, baseType: !342)
!341 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !341, line: 43, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !60, line: 178, baseType: !203, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!120, !321}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!349 = !{!0}
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/ftn-custom/zsnesf.c", directory: "/home/users/ndemeye/xSDK")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 76, size: 320, elements: !352)
!352 = !{!353, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !351, file: !350, line: 77, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !27, line: 56, baseType: !40)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !351, file: !350, line: 78, baseType: !354, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !351, file: !350, line: 79, baseType: !354, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !351, file: !350, line: 80, baseType: !354, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !351, file: !350, line: 81, baseType: !354, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mondestroy", scope: !351, file: !350, line: 82, baseType: !354, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !351, file: !350, line: 83, baseType: !354, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !351, file: !350, line: 84, baseType: !354, size: 32, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "trprecheck", scope: !351, file: !350, line: 85, baseType: !354, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "trpostcheck", scope: !351, file: !350, line: 86, baseType: !354, size: 32, offset: 288)
!364 = !{i32 7, !"Dwarf Version", i32 4}
!365 = !{i32 2, !"Debug Info Version", i32 3}
!366 = !{i32 1, !"wchar_size", i32 4}
!367 = !{i32 7, !"PIC Level", i32 2}
!368 = !{i32 7, !"uwtable", i32 1}
!369 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!370 = distinct !DISubprogram(name: "snesnewtontrsetprecheck_", scope: !350, file: !350, line: 103, type: !371, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373, !374, !203, !382}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !328, !377, !377, !381, !203}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !378, line: 21, baseType: !379)
!378 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !378, line: 21, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!383 = !{!384, !385, !386, !387}
!384 = !DILocalVariable(name: "snes", arg: 1, scope: !370, file: !350, line: 103, type: !373)
!385 = !DILocalVariable(name: "func", arg: 2, scope: !370, file: !350, line: 103, type: !374)
!386 = !DILocalVariable(name: "ctx", arg: 3, scope: !370, file: !350, line: 103, type: !203)
!387 = !DILocalVariable(name: "ierr", arg: 4, scope: !370, file: !350, line: 103, type: !382)
!388 = !DILocation(line: 0, scope: !370)
!389 = !DILocation(line: 105, column: 54, scope: !370)
!390 = !{!391, !391, i64 0}
!391 = !{!"any pointer", !392, i64 0}
!392 = !{!"omnipotent char", !393, i64 0}
!393 = !{!"Simple C/C++ TBAA"}
!394 = !DILocation(line: 105, column: 105, scope: !370)
!395 = !DILocation(line: 105, column: 11, scope: !370)
!396 = !DILocation(line: 105, column: 9, scope: !370)
!397 = !{!398, !398, i64 0}
!398 = !{!"int", !392, i64 0}
!399 = !DILocation(line: 105, column: 138, scope: !400)
!400 = distinct !DILexicalBlock(scope: !370, file: !350, line: 105, column: 138)
!401 = !DILocation(line: 105, column: 138, scope: !370)
!402 = !DILocation(line: 109, column: 27, scope: !370)
!403 = !DILocation(line: 109, column: 3, scope: !370)
!404 = !DILocation(line: 110, column: 1, scope: !370)
!405 = !DISubprogram(name: "PetscObjectSetFortranCallback", scope: !27, file: !27, line: 176, type: !406, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !409)
!406 = !DISubroutineType(types: !407)
!407 = !{!40, !106, !26, !408, !154, !203}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!409 = !{}
!410 = !DISubprogram(name: "SNESNewtonTRSetPreCheck", scope: !39, file: !39, line: 141, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !409)
!411 = !DISubroutineType(types: !412)
!412 = !{!40, !329, !413, !203}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!40, !329, !379, !379, !416, !203}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!417 = distinct !DISubprogram(name: "ourtrprecheckfunction", scope: !350, file: !350, line: 94, type: !418, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{!120, !328, !377, !377, !381, !203}
