; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/nasm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/nasm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!103 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !106)
!106 = !{!107}
!107 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 119, baseType: !7, size: 32, elements: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!111 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 155, baseType: !7, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159}
!155 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!159 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!160 = !{!161, !369, !179, !260, !200, !218, !372, !335, !370, !250, !28, !395, !596, !597, !240, !598, !601, !7}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !164, line: 73, size: 4480, elements: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!165 = !{!166, !168, !221, !222, !224, !227, !228, !229, !230, !238, !239, !241, !245, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !261, !263, !264, !265, !267, !268, !270, !272, !273, !274, !275, !276, !279, !281, !282, !283, !284, !285, !288, !290, !291, !292, !302, !304, !305, !309, !310, !359, !364, !366, !367, !368}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !163, file: !164, line: 74, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !163, file: !164, line: 75, baseType: !169, size: 448, offset: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 448, elements: !219)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !164, line: 53, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 45, size: 448, elements: !172)
!172 = !{!173, !183, !191, !196, !203, !207, !214}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !171, file: !164, line: 46, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !161, !178}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !180, line: 330, baseType: !181)
!180 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !180, line: 330, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !171, file: !164, line: 47, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!177, !161, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !188, line: 16, baseType: !189)
!188 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !188, line: 16, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !171, file: !164, line: 48, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!177, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !171, file: !164, line: 49, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!177, !161, !200, !161}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !171, file: !164, line: 50, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!177, !161, !200, !195}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !171, file: !164, line: 51, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!177, !161, !200, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !171, file: !164, line: 52, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!177, !161, !200, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!219 = !{!220}
!220 = !DISubrange(count: 1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !163, file: !164, line: 76, baseType: !179, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !164, line: 77, baseType: !223, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !163, file: !164, line: 78, baseType: !225, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !226)
!226 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !163, file: !164, line: 78, baseType: !225, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !163, file: !164, line: 78, baseType: !225, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !163, file: !164, line: 78, baseType: !225, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !164, line: 79, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !234, line: 27, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !236, line: 43, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!237 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !163, file: !164, line: 80, baseType: !223, size: 32, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !163, file: !164, line: 81, baseType: !240, size: 32, offset: 992)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !163, file: !164, line: 82, baseType: !242, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !163, file: !164, line: 83, baseType: !246, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !163, file: !164, line: 84, baseType: !250, size: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !163, file: !164, line: 85, baseType: !250, size: 64, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !163, file: !164, line: 86, baseType: !250, size: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !163, file: !164, line: 87, baseType: !250, size: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !164, line: 88, baseType: !161, size: 64, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !163, file: !164, line: 89, baseType: !231, size: 64, offset: 1472)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !164, line: 90, baseType: !250, size: 64, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !163, file: !164, line: 91, baseType: !250, size: 64, offset: 1600)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !163, file: !164, line: 92, baseType: !223, size: 32, offset: 1664)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !163, file: !164, line: 93, baseType: !260, size: 64, offset: 1728)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 94, baseType: !262, size: 64, offset: 1792)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !232)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !163, file: !164, line: 95, baseType: !223, size: 32, offset: 1856)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !163, file: !164, line: 95, baseType: !223, size: 32, offset: 1888)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !163, file: !164, line: 96, baseType: !266, size: 64, offset: 1920)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !163, file: !164, line: 96, baseType: !266, size: 64, offset: 1984)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !163, file: !164, line: 97, baseType: !269, size: 64, offset: 2048)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !163, file: !164, line: 97, baseType: !271, size: 64, offset: 2112)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !163, file: !164, line: 98, baseType: !223, size: 32, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !163, file: !164, line: 98, baseType: !223, size: 32, offset: 2208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !163, file: !164, line: 99, baseType: !266, size: 64, offset: 2240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !163, file: !164, line: 99, baseType: !266, size: 64, offset: 2304)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !163, file: !164, line: 100, baseType: !277, size: 64, offset: 2368)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !226)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !163, file: !164, line: 100, baseType: !280, size: 64, offset: 2432)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !163, file: !164, line: 101, baseType: !223, size: 32, offset: 2496)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !163, file: !164, line: 101, baseType: !223, size: 32, offset: 2528)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !163, file: !164, line: 102, baseType: !266, size: 64, offset: 2560)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !163, file: !164, line: 102, baseType: !266, size: 64, offset: 2624)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !163, file: !164, line: 103, baseType: !286, size: 64, offset: 2688)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !278)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !163, file: !164, line: 103, baseType: !289, size: 64, offset: 2752)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !163, file: !164, line: 104, baseType: !218, size: 64, offset: 2816)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !163, file: !164, line: 105, baseType: !223, size: 32, offset: 2880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !163, file: !164, line: 106, baseType: !293, size: 128, offset: 2944)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 128, elements: !300)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !164, line: 64, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 61, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !296, file: !164, line: 62, baseType: !211, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !296, file: !164, line: 63, baseType: !260, size: 64, offset: 64)
!300 = !{!301}
!301 = !DISubrange(count: 2)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !163, file: !164, line: 107, baseType: !303, size: 64, offset: 3072)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !300)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !163, file: !164, line: 108, baseType: !260, size: 64, offset: 3136)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !163, file: !164, line: 109, baseType: !306, size: 64, offset: 3200)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!177, !260}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !163, file: !164, line: 111, baseType: !223, size: 32, offset: 3264)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !163, file: !164, line: 112, baseType: !311, size: 320, offset: 3328)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 320, elements: !357)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!177, !315, !161, !260}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !318)
!318 = !{!319, !320, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !317, file: !12, line: 100, baseType: !223, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !12, line: 101, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !332, !333, !334, !338, !340, !342, !343, !344}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !323, file: !12, line: 84, baseType: !250, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !323, file: !12, line: 85, baseType: !250, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !12, line: 86, baseType: !260, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !323, file: !12, line: 87, baseType: !242, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !323, file: !12, line: 88, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !323, file: !12, line: 89, baseType: !202, size: 8, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !323, file: !12, line: 90, baseType: !250, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !323, file: !12, line: 91, baseType: !335, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !336, line: 46, baseType: !337)
!336 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!337 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !323, file: !12, line: 92, baseType: !339, size: 32, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !12, line: 93, baseType: !341, size: 32, offset: 544)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !12, line: 94, baseType: !321, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !323, file: !12, line: 95, baseType: !250, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !323, file: !12, line: 96, baseType: !260, size: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !317, file: !12, line: 102, baseType: !250, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !317, file: !12, line: 102, baseType: !250, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !317, file: !12, line: 103, baseType: !250, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !317, file: !12, line: 104, baseType: !179, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !317, file: !12, line: 105, baseType: !339, size: 32, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !317, file: !12, line: 105, baseType: !339, size: 32, offset: 416)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !317, file: !12, line: 105, baseType: !339, size: 32, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !317, file: !12, line: 106, baseType: !161, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !317, file: !12, line: 107, baseType: !354, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!357 = !{!358}
!358 = !DISubrange(count: 5)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !163, file: !164, line: 113, baseType: !360, size: 320, offset: 3648)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 320, elements: !357)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!177, !161, !260}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !163, file: !164, line: 114, baseType: !365, size: 320, offset: 3968)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !357)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !163, file: !164, line: 115, baseType: !339, size: 32, offset: 4288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !163, file: !164, line: 120, baseType: !354, size: 64, offset: 4352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !163, file: !164, line: 121, baseType: !339, size: 32, offset: 4416)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !371, line: 1451, baseType: !211)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NASM", file: !374, line: 28, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/nasm.c", directory: "/home/users/ndemeye/xSDK")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 4, size: 1088, elements: !376)
!376 = !{!377, !378, !569, !570, !571, !572, !573, !574, !581, !582, !583, !584, !586, !587, !588, !589, !590, !593, !594, !595}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !375, file: !374, line: 5, baseType: !223, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "subsnes", scope: !375, file: !374, line: 6, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !383, line: 38, size: 11648, elements: !384)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!384 = !{!385, !387, !453, !458, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !476, !480, !481, !483, !484, !485, !486, !487, !492, !494, !495, !496, !497, !498, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !534, !536, !537, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !382, file: !383, line: 39, baseType: !386, size: 4480)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !164, line: 122, baseType: !163)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !382, file: !383, line: 39, baseType: !388, size: 1088, offset: 4480)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 1088, elements: !219)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !383, line: 12, size: 1088, elements: !390)
!390 = !{!391, !398, !402, !406, !412, !413, !417, !418, !422, !426, !427, !428, !433, !437, !441, !445, !452}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !389, file: !383, line: 13, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!177, !380, !395, !260}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !98, line: 21, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !98, line: 21, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !389, file: !383, line: 14, baseType: !399, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!177, !395, !395, !260}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !389, file: !383, line: 15, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!177, !380, !223}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !389, file: !383, line: 16, baseType: !407, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!177, !380, !223, !278, !278, !278, !410, !260}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !389, file: !383, line: 17, baseType: !306, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !389, file: !383, line: 18, baseType: !414, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!177, !380}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !389, file: !383, line: 19, baseType: !414, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !389, file: !383, line: 20, baseType: !419, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!177, !380, !187}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !389, file: !383, line: 21, baseType: !423, size: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!177, !315, !380}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !389, file: !383, line: 22, baseType: !414, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !389, file: !383, line: 23, baseType: !414, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !389, file: !383, line: 24, baseType: !429, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!177, !380, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !389, file: !383, line: 25, baseType: !434, size: 64, offset: 768)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!177, !432}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !389, file: !383, line: 26, baseType: !438, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!177, !380, !395, !395}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !389, file: !383, line: 27, baseType: !442, size: 64, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!177, !380, !395, !395, !260}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !389, file: !383, line: 28, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!177, !380, !395, !449, !449, !260}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !389, file: !383, line: 29, baseType: !419, size: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !382, file: !383, line: 40, baseType: !454, size: 64, offset: 5568)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !455, line: 14, baseType: !456)
!455 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !455, line: 14, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !382, file: !383, line: 41, baseType: !339, size: 32, offset: 5632)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !382, file: !383, line: 42, baseType: !380, size: 64, offset: 5696)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !382, file: !383, line: 43, baseType: !461, size: 32, offset: 5760)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !382, file: !383, line: 44, baseType: !339, size: 32, offset: 5792)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !382, file: !383, line: 47, baseType: !260, size: 64, offset: 5824)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !382, file: !383, line: 49, baseType: !395, size: 64, offset: 5888)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !382, file: !383, line: 50, baseType: !395, size: 64, offset: 5952)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !382, file: !383, line: 52, baseType: !395, size: 64, offset: 6016)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !382, file: !383, line: 54, baseType: !449, size: 64, offset: 6080)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !382, file: !383, line: 55, baseType: !449, size: 64, offset: 6144)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !382, file: !383, line: 56, baseType: !449, size: 64, offset: 6208)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !382, file: !383, line: 57, baseType: !260, size: 64, offset: 6272)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !382, file: !383, line: 58, baseType: !472, size: 64, offset: 6336)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !473, line: 22, baseType: !474)
!473 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !473, line: 22, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !382, file: !383, line: 59, baseType: !477, size: 64, offset: 6400)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !382, file: !383, line: 60, baseType: !339, size: 32, offset: 6464)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !382, file: !383, line: 61, baseType: !482, size: 32, offset: 6496)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !382, file: !383, line: 63, baseType: !395, size: 64, offset: 6528)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !382, file: !383, line: 65, baseType: !395, size: 64, offset: 6592)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !382, file: !383, line: 66, baseType: !260, size: 64, offset: 6656)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !382, file: !383, line: 68, baseType: !278, size: 64, offset: 6720)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !382, file: !383, line: 74, baseType: !488, size: 320, offset: 6784)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !357)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!177, !380, !223, !278, !260}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !382, file: !383, line: 75, baseType: !493, size: 320, offset: 7104)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 320, elements: !357)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !382, file: !383, line: 76, baseType: !365, size: 320, offset: 7424)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !382, file: !383, line: 77, baseType: !223, size: 32, offset: 7744)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !382, file: !383, line: 78, baseType: !260, size: 64, offset: 7808)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !382, file: !383, line: 79, baseType: !411, size: 32, offset: 7872)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !382, file: !383, line: 80, baseType: !499, size: 320, offset: 7936)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !357)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!177, !380, !260}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !382, file: !383, line: 81, baseType: !493, size: 320, offset: 8256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !382, file: !383, line: 82, baseType: !365, size: 320, offset: 8576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !382, file: !383, line: 83, baseType: !223, size: 32, offset: 8896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !382, file: !383, line: 84, baseType: !339, size: 32, offset: 8928)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !382, file: !383, line: 88, baseType: !339, size: 32, offset: 8960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !383, line: 89, baseType: !260, size: 64, offset: 9024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !382, file: !383, line: 93, baseType: !223, size: 32, offset: 9088)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !382, file: !383, line: 94, baseType: !223, size: 32, offset: 9120)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !382, file: !383, line: 95, baseType: !223, size: 32, offset: 9152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !382, file: !383, line: 96, baseType: !223, size: 32, offset: 9184)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !382, file: !383, line: 97, baseType: !223, size: 32, offset: 9216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !382, file: !383, line: 98, baseType: !278, size: 64, offset: 9280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !382, file: !383, line: 99, baseType: !278, size: 64, offset: 9344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !382, file: !383, line: 100, baseType: !278, size: 64, offset: 9408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !382, file: !383, line: 101, baseType: !278, size: 64, offset: 9472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !382, file: !383, line: 102, baseType: !278, size: 64, offset: 9536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !382, file: !383, line: 103, baseType: !278, size: 64, offset: 9600)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !382, file: !383, line: 104, baseType: !278, size: 64, offset: 9664)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !382, file: !383, line: 105, baseType: !278, size: 64, offset: 9728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !382, file: !383, line: 106, baseType: !339, size: 32, offset: 9792)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !382, file: !383, line: 107, baseType: !223, size: 32, offset: 9824)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !382, file: !383, line: 108, baseType: !223, size: 32, offset: 9856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !382, file: !383, line: 109, baseType: !223, size: 32, offset: 9888)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !382, file: !383, line: 110, baseType: !339, size: 32, offset: 9920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !382, file: !383, line: 111, baseType: !223, size: 32, offset: 9952)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !382, file: !383, line: 112, baseType: !339, size: 32, offset: 9984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !382, file: !383, line: 113, baseType: !223, size: 32, offset: 10016)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !382, file: !383, line: 115, baseType: !339, size: 32, offset: 10048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !382, file: !383, line: 117, baseType: !339, size: 32, offset: 10080)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !382, file: !383, line: 119, baseType: !533, size: 32, offset: 10112)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !382, file: !383, line: 120, baseType: !535, size: 32, offset: 10144)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !382, file: !383, line: 124, baseType: !223, size: 32, offset: 10176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !382, file: !383, line: 125, baseType: !538, size: 64, offset: 10240)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !382, file: !383, line: 129, baseType: !223, size: 32, offset: 10304)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !382, file: !383, line: 130, baseType: !277, size: 64, offset: 10368)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !382, file: !383, line: 132, baseType: !269, size: 64, offset: 10432)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !382, file: !383, line: 133, baseType: !223, size: 32, offset: 10496)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !382, file: !383, line: 134, baseType: !223, size: 32, offset: 10528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !382, file: !383, line: 135, baseType: !339, size: 32, offset: 10560)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !382, file: !383, line: 136, baseType: !339, size: 32, offset: 10592)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !382, file: !383, line: 137, baseType: !339, size: 32, offset: 10624)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !382, file: !383, line: 140, baseType: !223, size: 32, offset: 10656)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !382, file: !383, line: 141, baseType: !223, size: 32, offset: 10688)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !382, file: !383, line: 143, baseType: !223, size: 32, offset: 10720)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !382, file: !383, line: 144, baseType: !223, size: 32, offset: 10752)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !382, file: !383, line: 146, baseType: !339, size: 32, offset: 10784)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !382, file: !383, line: 147, baseType: !339, size: 32, offset: 10816)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !382, file: !383, line: 148, baseType: !339, size: 32, offset: 10848)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !382, file: !383, line: 150, baseType: !339, size: 32, offset: 10880)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !382, file: !383, line: 151, baseType: !260, size: 64, offset: 10944)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !382, file: !383, line: 154, baseType: !278, size: 64, offset: 11008)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !382, file: !383, line: 155, baseType: !278, size: 64, offset: 11072)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !382, file: !383, line: 157, baseType: !538, size: 64, offset: 11136)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !382, file: !383, line: 158, baseType: !223, size: 32, offset: 11200)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !382, file: !383, line: 160, baseType: !339, size: 32, offset: 11232)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !382, file: !383, line: 161, baseType: !339, size: 32, offset: 11264)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !382, file: !383, line: 162, baseType: !223, size: 32, offset: 11296)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !382, file: !383, line: 164, baseType: !278, size: 64, offset: 11328)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !382, file: !383, line: 165, baseType: !395, size: 64, offset: 11392)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !382, file: !383, line: 165, baseType: !395, size: 64, offset: 11456)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !382, file: !383, line: 166, baseType: !223, size: 32, offset: 11520)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !382, file: !383, line: 167, baseType: !339, size: 32, offset: 11552)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !382, file: !383, line: 169, baseType: !339, size: 32, offset: 11584)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !375, file: !374, line: 7, baseType: !538, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !375, file: !374, line: 8, baseType: !538, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !375, file: !374, line: 9, baseType: !538, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !375, file: !374, line: 10, baseType: !538, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !375, file: !374, line: 11, baseType: !395, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "oscatter", scope: !375, file: !374, line: 12, baseType: !575, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !577, line: 59, baseType: !578)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !577, line: 15, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !577, line: 15, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "oscatter_copy", scope: !375, file: !374, line: 13, baseType: !575, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "iscatter", scope: !375, file: !374, line: 14, baseType: !575, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "gscatter", scope: !375, file: !374, line: 15, baseType: !575, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !374, line: 16, baseType: !585, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCASMType", file: !48, line: 132, baseType: !74)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "usesdm", scope: !375, file: !374, line: 17, baseType: !339, size: 32, offset: 736)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "finaljacobian", scope: !375, file: !374, line: 18, baseType: !339, size: 32, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !375, file: !374, line: 19, baseType: !278, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "weight_set", scope: !375, file: !374, line: 20, baseType: !339, size: 32, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "eventrestrictinterp", scope: !375, file: !374, line: 23, baseType: !591, size: 32, offset: 928)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !592, line: 80, baseType: !28)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!593 = !DIDerivedType(tag: DW_TAG_member, name: "eventsubsolve", scope: !375, file: !374, line: 24, baseType: !591, size: 32, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fjtype", scope: !375, file: !374, line: 26, baseType: !223, size: 32, offset: 992)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "xinit", scope: !375, file: !374, line: 27, baseType: !395, size: 64, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !105)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !180, line: 331, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !180, line: 331, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !180, line: 338, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !180, line: 338, flags: DIFlagFwdDecl)
!604 = !{!0, !605}
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "SNESNASMFJTypes", scope: !2, file: !374, line: 31, type: !607, isLocal: false, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 192, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 3)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 448, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 7)
!613 = !{i32 7, !"Dwarf Version", i32 4}
!614 = !{i32 2, !"Debug Info Version", i32 3}
!615 = !{i32 1, !"wchar_size", i32 4}
!616 = !{i32 7, !"PIC Level", i32 2}
!617 = !{i32 7, !"uwtable", i32 1}
!618 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!619 = distinct !DISubprogram(name: "SNESNASMSetType", scope: !374, file: !374, line: 285, type: !620, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{!177, !380, !585}
!622 = !{!623, !624, !625, !626, !628, !630}
!623 = !DILocalVariable(name: "snes", arg: 1, scope: !619, file: !374, line: 285, type: !380)
!624 = !DILocalVariable(name: "type", arg: 2, scope: !619, file: !374, line: 285, type: !585)
!625 = !DILocalVariable(name: "ierr", scope: !619, file: !374, line: 287, type: !177)
!626 = !DILocalVariable(name: "f", scope: !619, file: !374, line: 288, type: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !374, line: 291, type: !177)
!629 = distinct !DILexicalBlock(scope: !619, file: !374, line: 291, column: 77)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !374, line: 292, type: !177)
!631 = distinct !DILexicalBlock(scope: !632, file: !374, line: 292, column: 33)
!632 = distinct !DILexicalBlock(scope: !633, file: !374, line: 292, column: 10)
!633 = distinct !DILexicalBlock(scope: !619, file: !374, line: 292, column: 7)
!634 = !DILocation(line: 0, scope: !619)
!635 = !DILocation(line: 288, column: 3, scope: !619)
!636 = !DILocation(line: 290, column: 3, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !374, line: 290, column: 3)
!638 = distinct !DILexicalBlock(scope: !639, file: !374, line: 290, column: 3)
!639 = distinct !DILexicalBlock(scope: !619, file: !374, line: 290, column: 3)
!640 = !{!641, !641, i64 0}
!641 = !{!"any pointer", !642, i64 0}
!642 = !{!"omnipotent char", !643, i64 0}
!643 = !{!"Simple C/C++ TBAA"}
!644 = !DILocation(line: 290, column: 3, scope: !638)
!645 = !DILocation(line: 290, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !374, line: 290, column: 3)
!647 = distinct !DILexicalBlock(scope: !637, file: !374, line: 290, column: 3)
!648 = !{!649, !650, i64 1536}
!649 = !{!"", !642, i64 0, !642, i64 512, !642, i64 1024, !642, i64 1280, !650, i64 1536, !650, i64 1540, !642, i64 1544}
!650 = !{!"int", !642, i64 0}
!651 = !DILocation(line: 290, column: 3, scope: !647)
