; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/draw.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._n_PetscOptions = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }

!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 204, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43}
!35 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 141, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 385, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!52 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!70 = !{!71, !75, !76, !79, !152, !280, !283, !162, !86, !246, !7}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !72, line: 330, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !72, line: 330, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !87, !133, !134, !136, !139, !140, !141, !142, !150, !151, !153, !157, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !178, !179, !181, !183, !184, !185, !186, !187, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !213, !215, !216, !220, !221, !270, !275, !277, !278, !279}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !88, size: 448, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 448, elements: !131)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !91)
!91 = !{!92, !98, !106, !111, !115, !119, !126}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !90, file: !82, line: 46, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !79, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !86)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !90, file: !82, line: 47, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!96, !79, !102}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !103, line: 16, baseType: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !103, line: 16, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !90, file: !82, line: 48, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!96, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !90, file: !82, line: 49, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!96, !79, !76, !79}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !90, file: !82, line: 50, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!96, !79, !76, !110}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !90, file: !82, line: 51, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!96, !79, !76, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !90, file: !82, line: 52, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!96, !79, !76, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !71, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !135, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !86)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !138)
!138 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !143, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !146, line: 27, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 43, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !135, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !152, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !86)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !162, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !162, size: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !162, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !162, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !143, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !162, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !162, size: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !135, size: 32, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !75, size: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !173, size: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !144)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !135, size: 32, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !135, size: 32, offset: 1888)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !177, size: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !177, size: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !180, size: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !182, size: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !135, size: 32, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !135, size: 32, offset: 2208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !177, size: 64, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !177, size: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !188, size: 64, offset: 2368)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !191, size: 64, offset: 2432)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !135, size: 32, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !135, size: 32, offset: 2528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !177, size: 64, offset: 2560)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !177, size: 64, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !197, size: 64, offset: 2688)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !200, size: 64, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !130, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !135, size: 32, offset: 2880)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !204, size: 128, offset: 2944)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !211)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !207, file: !82, line: 62, baseType: !123, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !207, file: !82, line: 63, baseType: !75, size: 64, offset: 64)
!211 = !{!212}
!212 = !DISubrange(count: 2)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !214, size: 64, offset: 3072)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !75, size: 64, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !217, size: 64, offset: 3200)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!96, !75}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !135, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !222, size: 320, offset: 3328)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !268)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!96, !226, !79, !75}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !229)
!229 = !{!230, !231, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !228, file: !18, line: 100, baseType: !135, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !18, line: 101, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !243, !244, !245, !249, !251, !253, !254, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !234, file: !18, line: 84, baseType: !162, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !234, file: !18, line: 85, baseType: !162, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !18, line: 86, baseType: !75, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !234, file: !18, line: 87, baseType: !154, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !234, file: !18, line: 88, baseType: !241, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !234, file: !18, line: 89, baseType: !78, size: 8, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !234, file: !18, line: 90, baseType: !162, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !234, file: !18, line: 91, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !234, file: !18, line: 92, baseType: !250, size: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !18, line: 93, baseType: !252, size: 32, offset: 544)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !18, line: 94, baseType: !232, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !234, file: !18, line: 95, baseType: !162, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !234, file: !18, line: 96, baseType: !75, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !228, file: !18, line: 102, baseType: !162, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !228, file: !18, line: 102, baseType: !162, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !228, file: !18, line: 103, baseType: !162, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !228, file: !18, line: 104, baseType: !71, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !228, file: !18, line: 105, baseType: !250, size: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !228, file: !18, line: 105, baseType: !250, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !228, file: !18, line: 105, baseType: !250, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !228, file: !18, line: 106, baseType: !79, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !228, file: !18, line: 107, baseType: !265, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!268 = !{!269}
!269 = !DISubrange(count: 5)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !271, size: 320, offset: 3648)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !268)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!96, !79, !75}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !276, size: 320, offset: 3968)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 320, elements: !268)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !250, size: 32, offset: 4288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !265, size: 64, offset: 4352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !250, size: 32, offset: 4416)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !72, line: 331, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !72, line: 331, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !72, line: 338, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !72, line: 338, flags: DIFlagFwdDecl)
!286 = !{!287, !290}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "PETSC_DRAW_CLASSID", scope: !2, file: !289, line: 8, type: !85, isLocal: false, isDefinition: true)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/draw.c", directory: "/home/users/ndemeye/xSDK")
!290 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!291 = !{i32 7, !"Dwarf Version", i32 4}
!292 = !{i32 2, !"Debug Info Version", i32 3}
!293 = !{i32 1, !"wchar_size", i32 4}
!294 = !{i32 7, !"PIC Level", i32 2}
!295 = !{i32 7, !"uwtable", i32 1}
!296 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!297 = distinct !DISubprogram(name: "PetscDrawFinalizePackage", scope: !289, file: !289, line: 19, type: !298, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!96}
!300 = !{!301, !302}
!301 = !DILocalVariable(name: "ierr", scope: !297, file: !289, line: 21, type: !96)
!302 = !DILocalVariable(name: "ierr__", scope: !303, file: !289, line: 24, type: !96)
!303 = distinct !DILexicalBlock(scope: !297, file: !289, line: 24, column: 51)
!304 = !DILocation(line: 23, column: 3, scope: !305)
!305 = distinct !DILexicalBlock(scope: !306, file: !289, line: 23, column: 3)
!306 = distinct !DILexicalBlock(scope: !307, file: !289, line: 23, column: 3)
!307 = distinct !DILexicalBlock(scope: !297, file: !289, line: 23, column: 3)
!308 = !{!309, !309, i64 0}
!309 = !{!"any pointer", !310, i64 0}
!310 = !{!"omnipotent char", !311, i64 0}
!311 = !{!"Simple C/C++ TBAA"}
!312 = !DILocation(line: 23, column: 3, scope: !306)
!313 = !DILocation(line: 23, column: 3, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !289, line: 23, column: 3)
!315 = distinct !DILexicalBlock(scope: !305, file: !289, line: 23, column: 3)
!316 = !{!317, !318, i64 1536}
!317 = !{!"", !310, i64 0, !310, i64 512, !310, i64 1024, !310, i64 1280, !318, i64 1536, !318, i64 1540, !310, i64 1544}
!318 = !{!"int", !310, i64 0}
!319 = !DILocation(line: 23, column: 3, scope: !315)
!320 = !DILocation(line: 23, column: 3, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !289, line: 23, column: 3)
!322 = !{!318, !318, i64 0}
!323 = !{!317, !318, i64 1540}
!324 = !DILocation(line: 24, column: 10, scope: !297)
!325 = !DILocation(line: 0, scope: !297)
!326 = !DILocation(line: 0, scope: !303)
!327 = !DILocation(line: 24, column: 51, scope: !328)
!328 = distinct !DILexicalBlock(scope: !303, file: !289, line: 24, column: 51)
!329 = !DILocation(line: 24, column: 51, scope: !303)
!330 = !{!"branch_weights", i32 2000, i32 1}
!331 = !DILocation(line: 25, column: 31, scope: !297)
!332 = !DILocation(line: 26, column: 31, scope: !297)
!333 = !{!310, !310, i64 0}
!334 = !DILocation(line: 27, column: 3, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !289, line: 27, column: 3)
!336 = distinct !DILexicalBlock(scope: !337, file: !289, line: 27, column: 3)
!337 = distinct !DILexicalBlock(scope: !297, file: !289, line: 27, column: 3)
!338 = !DILocation(line: 27, column: 3, scope: !336)
!339 = !DILocation(line: 27, column: 3, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !289, line: 27, column: 3)
!341 = distinct !DILexicalBlock(scope: !335, file: !289, line: 27, column: 3)
!342 = !DILocation(line: 27, column: 3, scope: !341)
!343 = !DILocation(line: 27, column: 3, scope: !344)
!344 = distinct !DILexicalBlock(scope: !345, file: !289, line: 27, column: 3)
!345 = distinct !DILexicalBlock(scope: !340, file: !289, line: 27, column: 3)
!346 = !{!317, !310, i64 1544}
!347 = !DILocation(line: 27, column: 3, scope: !345)
!348 = !DILocation(line: 27, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !344, file: !289, line: 27, column: 3)
!350 = !DILocation(line: 27, column: 3, scope: !351)
!351 = distinct !DILexicalBlock(scope: !340, file: !289, line: 27, column: 3)
!352 = !DILocation(line: 27, column: 3, scope: !353)
!353 = distinct !DILexicalBlock(scope: !351, file: !289, line: 27, column: 3)
!354 = !DILocation(line: 27, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !289, line: 27, column: 3)
!356 = distinct !DILexicalBlock(scope: !353, file: !289, line: 27, column: 3)
!357 = !DILocation(line: 27, column: 3, scope: !356)
!358 = !DILocation(line: 27, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !289, line: 27, column: 3)
!360 = !DILocation(line: 28, column: 1, scope: !297)
!361 = !DISubprogram(name: "PetscFunctionListDestroy", scope: !362, file: !362, line: 1565, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DISubroutineType(types: !364)
!364 = !{!86, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!366 = !{}
!367 = !DISubprogram(name: "PetscError", scope: !6, file: !6, line: 668, type: !368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!368 = !DISubroutineType(types: !369)
!369 = !{!96, !73, !86, !76, !76, !86, !5, !76, null}
!370 = distinct !DISubprogram(name: "PetscDrawInitializePackage", scope: !289, file: !289, line: 39, type: !298, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !371)
!371 = !{!372, !376, !377, !378, !379, !381, !383, !385, !387, !389, !391, !393, !398, !400, !402, !406, !410, !412, !414, !416, !418, !420}
!372 = !DILocalVariable(name: "logList", scope: !370, file: !289, line: 41, type: !373)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 2048, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 256)
!376 = !DILocalVariable(name: "opt", scope: !370, file: !289, line: 42, type: !250)
!377 = !DILocalVariable(name: "pkg", scope: !370, file: !289, line: 42, type: !250)
!378 = !DILocalVariable(name: "ierr", scope: !370, file: !289, line: 43, type: !96)
!379 = !DILocalVariable(name: "ierr__", scope: !380, file: !289, line: 49, type: !96)
!380 = distinct !DILexicalBlock(scope: !370, file: !289, line: 49, column: 59)
!381 = !DILocalVariable(name: "ierr__", scope: !382, file: !289, line: 50, type: !96)
!382 = distinct !DILexicalBlock(scope: !370, file: !289, line: 50, column: 68)
!383 = !DILocalVariable(name: "ierr__", scope: !384, file: !289, line: 51, type: !96)
!384 = distinct !DILexicalBlock(scope: !370, file: !289, line: 51, column: 67)
!385 = !DILocalVariable(name: "ierr__", scope: !386, file: !289, line: 52, type: !96)
!386 = distinct !DILexicalBlock(scope: !370, file: !289, line: 52, column: 66)
!387 = !DILocalVariable(name: "ierr__", scope: !388, file: !289, line: 53, type: !96)
!388 = distinct !DILexicalBlock(scope: !370, file: !289, line: 53, column: 67)
!389 = !DILocalVariable(name: "ierr__", scope: !390, file: !289, line: 54, type: !96)
!390 = distinct !DILexicalBlock(scope: !370, file: !289, line: 54, column: 69)
!391 = !DILocalVariable(name: "ierr__", scope: !392, file: !289, line: 56, type: !96)
!392 = distinct !DILexicalBlock(scope: !370, file: !289, line: 56, column: 33)
!393 = !DILocalVariable(name: "classids", scope: !394, file: !289, line: 59, type: !395)
!394 = distinct !DILexicalBlock(scope: !370, file: !289, line: 58, column: 3)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 192, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 6)
!398 = !DILocalVariable(name: "ierr__", scope: !399, file: !289, line: 67, type: !96)
!399 = distinct !DILexicalBlock(scope: !394, file: !289, line: 67, column: 55)
!400 = !DILocalVariable(name: "ierr__", scope: !401, file: !289, line: 70, type: !96)
!401 = distinct !DILexicalBlock(scope: !370, file: !289, line: 70, column: 87)
!402 = !DILocalVariable(name: "ierr__", scope: !403, file: !289, line: 72, type: !96)
!403 = distinct !DILexicalBlock(scope: !404, file: !289, line: 72, column: 52)
!404 = distinct !DILexicalBlock(scope: !405, file: !289, line: 71, column: 12)
!405 = distinct !DILexicalBlock(scope: !370, file: !289, line: 71, column: 7)
!406 = !DILocalVariable(name: "ierr__", scope: !407, file: !289, line: 74, type: !96)
!407 = distinct !DILexicalBlock(scope: !408, file: !289, line: 74, column: 60)
!408 = distinct !DILexicalBlock(scope: !409, file: !289, line: 73, column: 14)
!409 = distinct !DILexicalBlock(scope: !404, file: !289, line: 73, column: 9)
!410 = !DILocalVariable(name: "ierr__", scope: !411, file: !289, line: 75, type: !96)
!411 = distinct !DILexicalBlock(scope: !408, file: !289, line: 75, column: 64)
!412 = !DILocalVariable(name: "ierr__", scope: !413, file: !289, line: 76, type: !96)
!413 = distinct !DILexicalBlock(scope: !408, file: !289, line: 76, column: 62)
!414 = !DILocalVariable(name: "ierr__", scope: !415, file: !289, line: 77, type: !96)
!415 = distinct !DILexicalBlock(scope: !408, file: !289, line: 77, column: 62)
!416 = !DILocalVariable(name: "ierr__", scope: !417, file: !289, line: 78, type: !96)
!417 = distinct !DILexicalBlock(scope: !408, file: !289, line: 78, column: 63)
!418 = !DILocalVariable(name: "ierr__", scope: !419, file: !289, line: 79, type: !96)
!419 = distinct !DILexicalBlock(scope: !408, file: !289, line: 79, column: 62)
!420 = !DILocalVariable(name: "ierr__", scope: !421, file: !289, line: 83, type: !96)
!421 = distinct !DILexicalBlock(scope: !370, file: !289, line: 83, column: 58)
!422 = !DILocation(line: 41, column: 3, scope: !370)
!423 = !DILocation(line: 41, column: 18, scope: !370)
!424 = !DILocation(line: 42, column: 3, scope: !370)
!425 = !DILocation(line: 45, column: 3, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !289, line: 45, column: 3)
!427 = distinct !DILexicalBlock(scope: !428, file: !289, line: 45, column: 3)
!428 = distinct !DILexicalBlock(scope: !370, file: !289, line: 45, column: 3)
!429 = !DILocation(line: 45, column: 3, scope: !427)
!430 = !DILocation(line: 45, column: 3, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !289, line: 45, column: 3)
!432 = distinct !DILexicalBlock(scope: !426, file: !289, line: 45, column: 3)
!433 = !DILocation(line: 45, column: 3, scope: !432)
!434 = !DILocation(line: 45, column: 3, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !289, line: 45, column: 3)
!436 = !DILocation(line: 46, column: 7, scope: !437)
!437 = distinct !DILexicalBlock(scope: !370, file: !289, line: 46, column: 7)
!438 = !DILocation(line: 46, column: 7, scope: !370)
!439 = !DILocation(line: 46, column: 36, scope: !440)
!440 = distinct !DILexicalBlock(scope: !441, file: !289, line: 46, column: 36)
!441 = distinct !DILexicalBlock(scope: !442, file: !289, line: 46, column: 36)
!442 = distinct !DILexicalBlock(scope: !443, file: !289, line: 46, column: 36)
!443 = distinct !DILexicalBlock(scope: !444, file: !289, line: 46, column: 36)
!444 = distinct !DILexicalBlock(scope: !437, file: !289, line: 46, column: 36)
!445 = !DILocation(line: 46, column: 36, scope: !441)
!446 = !DILocation(line: 46, column: 36, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !289, line: 46, column: 36)
!448 = distinct !DILexicalBlock(scope: !440, file: !289, line: 46, column: 36)
!449 = !DILocation(line: 46, column: 36, scope: !448)
!450 = !DILocation(line: 46, column: 36, scope: !451)
!451 = distinct !DILexicalBlock(scope: !447, file: !289, line: 46, column: 36)
!452 = !DILocation(line: 46, column: 36, scope: !453)
!453 = distinct !DILexicalBlock(scope: !440, file: !289, line: 46, column: 36)
!454 = !DILocation(line: 46, column: 36, scope: !455)
!455 = distinct !DILexicalBlock(scope: !453, file: !289, line: 46, column: 36)
!456 = !DILocation(line: 46, column: 36, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !289, line: 46, column: 36)
!458 = distinct !DILexicalBlock(scope: !455, file: !289, line: 46, column: 36)
!459 = !DILocation(line: 46, column: 36, scope: !458)
!460 = !DILocation(line: 46, column: 36, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !289, line: 46, column: 36)
!462 = !DILocation(line: 47, column: 31, scope: !370)
!463 = !DILocation(line: 49, column: 10, scope: !370)
!464 = !DILocation(line: 0, scope: !370)
!465 = !DILocation(line: 0, scope: !380)
!466 = !DILocation(line: 49, column: 59, scope: !467)
!467 = distinct !DILexicalBlock(scope: !380, file: !289, line: 49, column: 59)
!468 = !DILocation(line: 49, column: 59, scope: !380)
!469 = !DILocation(line: 50, column: 10, scope: !370)
!470 = !DILocation(line: 0, scope: !382)
!471 = !DILocation(line: 50, column: 68, scope: !472)
!472 = distinct !DILexicalBlock(scope: !382, file: !289, line: 50, column: 68)
!473 = !DILocation(line: 50, column: 68, scope: !382)
!474 = !DILocation(line: 51, column: 10, scope: !370)
!475 = !DILocation(line: 0, scope: !384)
!476 = !DILocation(line: 51, column: 67, scope: !477)
!477 = distinct !DILexicalBlock(scope: !384, file: !289, line: 51, column: 67)
!478 = !DILocation(line: 51, column: 67, scope: !384)
!479 = !DILocation(line: 52, column: 10, scope: !370)
!480 = !DILocation(line: 0, scope: !386)
!481 = !DILocation(line: 52, column: 66, scope: !482)
!482 = distinct !DILexicalBlock(scope: !386, file: !289, line: 52, column: 66)
!483 = !DILocation(line: 52, column: 66, scope: !386)
!484 = !DILocation(line: 53, column: 10, scope: !370)
!485 = !DILocation(line: 0, scope: !388)
!486 = !DILocation(line: 53, column: 67, scope: !487)
!487 = distinct !DILexicalBlock(scope: !388, file: !289, line: 53, column: 67)
!488 = !DILocation(line: 53, column: 67, scope: !388)
!489 = !DILocation(line: 54, column: 10, scope: !370)
!490 = !DILocation(line: 0, scope: !390)
!491 = !DILocation(line: 54, column: 69, scope: !492)
!492 = distinct !DILexicalBlock(scope: !390, file: !289, line: 54, column: 69)
!493 = !DILocation(line: 54, column: 69, scope: !390)
!494 = !DILocation(line: 56, column: 10, scope: !370)
!495 = !DILocation(line: 0, scope: !392)
!496 = !DILocation(line: 56, column: 33, scope: !497)
!497 = distinct !DILexicalBlock(scope: !392, file: !289, line: 56, column: 33)
!498 = !DILocation(line: 56, column: 33, scope: !392)
!499 = !DILocation(line: 59, column: 5, scope: !394)
!500 = !DILocation(line: 59, column: 19, scope: !394)
!501 = !DILocation(line: 61, column: 19, scope: !394)
!502 = !DILocation(line: 61, column: 5, scope: !394)
!503 = !DILocation(line: 61, column: 17, scope: !394)
!504 = !DILocation(line: 62, column: 19, scope: !394)
!505 = !DILocation(line: 62, column: 5, scope: !394)
!506 = !DILocation(line: 62, column: 17, scope: !394)
!507 = !DILocation(line: 63, column: 19, scope: !394)
!508 = !DILocation(line: 63, column: 5, scope: !394)
!509 = !DILocation(line: 63, column: 17, scope: !394)
!510 = !DILocation(line: 64, column: 19, scope: !394)
!511 = !DILocation(line: 64, column: 5, scope: !394)
!512 = !DILocation(line: 64, column: 17, scope: !394)
!513 = !DILocation(line: 65, column: 19, scope: !394)
!514 = !DILocation(line: 65, column: 5, scope: !394)
!515 = !DILocation(line: 65, column: 17, scope: !394)
!516 = !DILocation(line: 66, column: 19, scope: !394)
!517 = !DILocation(line: 66, column: 5, scope: !394)
!518 = !DILocation(line: 66, column: 17, scope: !394)
!519 = !DILocation(line: 67, column: 12, scope: !394)
!520 = !DILocation(line: 0, scope: !399)
!521 = !DILocation(line: 67, column: 55, scope: !522)
!522 = distinct !DILexicalBlock(scope: !399, file: !289, line: 67, column: 55)
!523 = !DILocation(line: 67, column: 55, scope: !399)
!524 = !DILocation(line: 68, column: 3, scope: !370)
!525 = !DILocation(line: 70, column: 10, scope: !370)
!526 = !DILocation(line: 0, scope: !401)
!527 = !DILocation(line: 70, column: 87, scope: !528)
!528 = distinct !DILexicalBlock(scope: !401, file: !289, line: 70, column: 87)
!529 = !DILocation(line: 70, column: 87, scope: !401)
!530 = !DILocation(line: 71, column: 7, scope: !405)
!531 = !DILocation(line: 71, column: 7, scope: !370)
!532 = !DILocation(line: 72, column: 12, scope: !404)
!533 = !DILocation(line: 0, scope: !403)
!534 = !DILocation(line: 72, column: 52, scope: !535)
!535 = distinct !DILexicalBlock(scope: !403, file: !289, line: 72, column: 52)
!536 = !DILocation(line: 72, column: 52, scope: !403)
!537 = !DILocation(line: 73, column: 9, scope: !409)
!538 = !DILocation(line: 73, column: 9, scope: !404)
!539 = !DILocation(line: 74, column: 40, scope: !408)
!540 = !DILocation(line: 74, column: 14, scope: !408)
!541 = !DILocation(line: 0, scope: !407)
!542 = !DILocation(line: 74, column: 60, scope: !543)
!543 = distinct !DILexicalBlock(scope: !407, file: !289, line: 74, column: 60)
!544 = !DILocation(line: 74, column: 60, scope: !407)
!545 = !DILocation(line: 75, column: 40, scope: !408)
!546 = !DILocation(line: 75, column: 14, scope: !408)
!547 = !DILocation(line: 0, scope: !411)
!548 = !DILocation(line: 75, column: 64, scope: !549)
!549 = distinct !DILexicalBlock(scope: !411, file: !289, line: 75, column: 64)
!550 = !DILocation(line: 75, column: 64, scope: !411)
!551 = !DILocation(line: 76, column: 40, scope: !408)
!552 = !DILocation(line: 76, column: 14, scope: !408)
!553 = !DILocation(line: 0, scope: !413)
!554 = !DILocation(line: 76, column: 62, scope: !555)
!555 = distinct !DILexicalBlock(scope: !413, file: !289, line: 76, column: 62)
!556 = !DILocation(line: 76, column: 62, scope: !413)
!557 = !DILocation(line: 77, column: 40, scope: !408)
!558 = !DILocation(line: 77, column: 14, scope: !408)
!559 = !DILocation(line: 0, scope: !415)
!560 = !DILocation(line: 77, column: 62, scope: !561)
!561 = distinct !DILexicalBlock(scope: !415, file: !289, line: 77, column: 62)
!562 = !DILocation(line: 77, column: 62, scope: !415)
!563 = !DILocation(line: 78, column: 40, scope: !408)
!564 = !DILocation(line: 78, column: 14, scope: !408)
!565 = !DILocation(line: 0, scope: !417)
!566 = !DILocation(line: 78, column: 63, scope: !567)
!567 = distinct !DILexicalBlock(scope: !417, file: !289, line: 78, column: 63)
!568 = !DILocation(line: 78, column: 63, scope: !417)
!569 = !DILocation(line: 79, column: 40, scope: !408)
!570 = !DILocation(line: 79, column: 14, scope: !408)
!571 = !DILocation(line: 0, scope: !419)
!572 = !DILocation(line: 79, column: 62, scope: !573)
!573 = distinct !DILexicalBlock(scope: !419, file: !289, line: 79, column: 62)
!574 = !DILocation(line: 79, column: 62, scope: !419)
!575 = !DILocation(line: 83, column: 10, scope: !370)
!576 = !DILocation(line: 0, scope: !421)
!577 = !DILocation(line: 83, column: 58, scope: !578)
!578 = distinct !DILexicalBlock(scope: !421, file: !289, line: 83, column: 58)
!579 = !DILocation(line: 83, column: 58, scope: !421)
!580 = !DILocation(line: 84, column: 3, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !289, line: 84, column: 3)
!582 = distinct !DILexicalBlock(scope: !583, file: !289, line: 84, column: 3)
!583 = distinct !DILexicalBlock(scope: !370, file: !289, line: 84, column: 3)
!584 = !DILocation(line: 84, column: 3, scope: !582)
!585 = !DILocation(line: 84, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !289, line: 84, column: 3)
!587 = distinct !DILexicalBlock(scope: !581, file: !289, line: 84, column: 3)
!588 = !DILocation(line: 84, column: 3, scope: !587)
!589 = !DILocation(line: 84, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !289, line: 84, column: 3)
!591 = distinct !DILexicalBlock(scope: !586, file: !289, line: 84, column: 3)
!592 = !DILocation(line: 84, column: 3, scope: !591)
!593 = !DILocation(line: 84, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !590, file: !289, line: 84, column: 3)
!595 = !DILocation(line: 84, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !586, file: !289, line: 84, column: 3)
!597 = !DILocation(line: 84, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !596, file: !289, line: 84, column: 3)
!599 = !DILocation(line: 84, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !601, file: !289, line: 84, column: 3)
!601 = distinct !DILexicalBlock(scope: !598, file: !289, line: 84, column: 3)
!602 = !DILocation(line: 84, column: 3, scope: !601)
!603 = !DILocation(line: 84, column: 3, scope: !604)
!604 = distinct !DILexicalBlock(scope: !600, file: !289, line: 84, column: 3)
!605 = !DILocation(line: 85, column: 1, scope: !370)
!606 = !DISubprogram(name: "PetscClassIdRegister", scope: !362, file: !362, line: 1408, type: !607, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!607 = !DISubroutineType(types: !608)
!608 = !{!86, !76, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!610 = !DISubprogram(name: "PetscDrawRegisterAll", scope: !611, file: !611, line: 12, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!611 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!612 = !DISubroutineType(types: !613)
!613 = !{!86}
!614 = !DISubprogram(name: "PetscInfoProcessClass", scope: !615, file: !615, line: 66, type: !616, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!615 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!616 = !DISubroutineType(types: !617)
!617 = !{!86, !76, !86, !609}
!618 = !DISubprogram(name: "PetscOptionsGetString", scope: !18, file: !18, line: 26, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!619 = !DISubroutineType(types: !620)
!620 = !{!86, !266, !76, !76, !162, !248, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!622 = !DISubprogram(name: "PetscStrInList", scope: !362, file: !362, line: 1376, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!623 = !DISubroutineType(types: !624)
!624 = !{!86, !76, !76, !78, !621}
!625 = !DISubprogram(name: "PetscLogEventExcludeClass", scope: !615, file: !615, line: 391, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!626 = !DISubroutineType(types: !627)
!627 = !{!86, !86}
!628 = !DISubprogram(name: "PetscRegisterFinalize", scope: !362, file: !362, line: 1509, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !366)
!629 = !DISubroutineType(types: !630)
!630 = !{!86, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!632 = distinct !DISubprogram(name: "PetscDrawResizeWindow", scope: !289, file: !289, line: 100, type: !633, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !792)
!633 = !DISubroutineType(types: !634)
!634 = !{!96, !635, !86, !86}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !636, line: 25, baseType: !637)
!636 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !611, line: 53, size: 11072, elements: !639)
!639 = !{!640, !642, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !767, !768, !769, !770, !771, !772, !773, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !638, file: !611, line: 54, baseType: !641, size: 4480)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !638, file: !611, line: 54, baseType: !643, size: 2304, offset: 4480)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 2304, elements: !131)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !611, line: 14, size: 2304, elements: !645)
!645 = !{!646, !650, !651, !655, !659, !663, !667, !668, !672, !673, !677, !681, !685, !686, !690, !694, !695, !701, !702, !703, !704, !709, !713, !714, !716, !717, !721, !722, !723, !724, !736, !737, !738, !742, !746, !750}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !644, file: !611, line: 15, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!96, !635}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !644, file: !611, line: 16, baseType: !647, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !644, file: !611, line: 17, baseType: !652, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!96, !635, !189, !189, !189, !189, !86}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !644, file: !611, line: 18, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!96, !635, !189}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !644, file: !611, line: 19, baseType: !660, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!96, !635, !188}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !644, file: !611, line: 20, baseType: !664, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!96, !635, !189, !189, !86}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !644, file: !611, line: 21, baseType: !656, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !644, file: !611, line: 22, baseType: !669, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!96, !635, !189, !189, !86, !76}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !644, file: !611, line: 23, baseType: !669, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !644, file: !611, line: 24, baseType: !674, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!96, !635, !189, !189}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !644, file: !611, line: 25, baseType: !678, size: 64, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!96, !635, !188, !188}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !644, file: !611, line: 26, baseType: !682, size: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!96, !635, !189, !189, !189, !189}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !644, file: !611, line: 27, baseType: !647, size: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !644, file: !611, line: 28, baseType: !687, size: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!96, !635, !189, !189, !189, !189, !86, !86, !86, !86}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !644, file: !611, line: 29, baseType: !691, size: 64, offset: 896)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!96, !635, !189, !189, !189, !189, !189, !189, !86, !86, !86}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !644, file: !611, line: 30, baseType: !652, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !644, file: !611, line: 31, baseType: !696, size: 64, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!96, !635, !699, !188, !188, !188, !188}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !33, line: 207, baseType: !32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !644, file: !611, line: 32, baseType: !647, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !644, file: !611, line: 33, baseType: !647, size: 64, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !644, file: !611, line: 34, baseType: !647, size: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !644, file: !611, line: 35, baseType: !705, size: 64, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!96, !635, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !644, file: !611, line: 36, baseType: !710, size: 64, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!96, !635, !76}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !644, file: !611, line: 37, baseType: !647, size: 64, offset: 1408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !644, file: !611, line: 38, baseType: !715, size: 64, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !644, file: !611, line: 39, baseType: !647, size: 64, offset: 1536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !644, file: !611, line: 40, baseType: !718, size: 64, offset: 1600)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!96, !635, !102}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !644, file: !611, line: 41, baseType: !705, size: 64, offset: 1664)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !644, file: !611, line: 42, baseType: !705, size: 64, offset: 1728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !644, file: !611, line: 43, baseType: !647, size: 64, offset: 1792)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !644, file: !611, line: 44, baseType: !725, size: 64, offset: 1856)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!96, !635, !728, !733, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 24, elements: !731)
!730 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!731 = !{!732}
!732 = !DISubrange(count: 3)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !644, file: !611, line: 45, baseType: !682, size: 64, offset: 1920)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !644, file: !611, line: 46, baseType: !652, size: 64, offset: 1984)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !644, file: !611, line: 47, baseType: !739, size: 64, offset: 2048)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!96, !635, !189, !189, !609, !609}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !644, file: !611, line: 48, baseType: !743, size: 64, offset: 2112)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!96, !635, !86, !86, !188, !188}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !644, file: !611, line: 49, baseType: !747, size: 64, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!96, !635, !86, !86, !86}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !644, file: !611, line: 50, baseType: !751, size: 64, offset: 2240)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!96, !635, !189, !189, !86, !86, !76, !188, !188}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !638, file: !611, line: 55, baseType: !189, size: 64, offset: 6784)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !638, file: !611, line: 56, baseType: !189, size: 64, offset: 6848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !638, file: !611, line: 56, baseType: !189, size: 64, offset: 6912)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !638, file: !611, line: 56, baseType: !189, size: 64, offset: 6976)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !638, file: !611, line: 56, baseType: !189, size: 64, offset: 7040)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !638, file: !611, line: 57, baseType: !189, size: 64, offset: 7104)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !638, file: !611, line: 57, baseType: !189, size: 64, offset: 7168)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !638, file: !611, line: 57, baseType: !189, size: 64, offset: 7232)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !638, file: !611, line: 57, baseType: !189, size: 64, offset: 7296)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !638, file: !611, line: 58, baseType: !764, size: 1280, offset: 7360)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1280, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 20)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !638, file: !611, line: 58, baseType: !764, size: 1280, offset: 8640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !638, file: !611, line: 59, baseType: !189, size: 64, offset: 9920)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !638, file: !611, line: 59, baseType: !189, size: 64, offset: 9984)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !638, file: !611, line: 59, baseType: !189, size: 64, offset: 10048)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !638, file: !611, line: 59, baseType: !189, size: 64, offset: 10112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !638, file: !611, line: 60, baseType: !135, size: 32, offset: 10176)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !638, file: !611, line: 61, baseType: !774, size: 32, offset: 10208)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !33, line: 141, baseType: !44)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !638, file: !611, line: 62, baseType: !162, size: 64, offset: 10240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !638, file: !611, line: 63, baseType: !162, size: 64, offset: 10304)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !638, file: !611, line: 64, baseType: !635, size: 64, offset: 10368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !638, file: !611, line: 65, baseType: !86, size: 32, offset: 10432)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !638, file: !611, line: 65, baseType: !86, size: 32, offset: 10464)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !638, file: !611, line: 65, baseType: !86, size: 32, offset: 10496)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !638, file: !611, line: 65, baseType: !86, size: 32, offset: 10528)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !638, file: !611, line: 66, baseType: !162, size: 64, offset: 10560)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !638, file: !611, line: 67, baseType: !162, size: 64, offset: 10624)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !638, file: !611, line: 68, baseType: !162, size: 64, offset: 10688)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !638, file: !611, line: 69, baseType: !135, size: 32, offset: 10752)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !638, file: !611, line: 70, baseType: !250, size: 32, offset: 10784)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !638, file: !611, line: 71, baseType: !135, size: 32, offset: 10816)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !638, file: !611, line: 72, baseType: !162, size: 64, offset: 10880)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !638, file: !611, line: 73, baseType: !250, size: 32, offset: 10944)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !638, file: !611, line: 74, baseType: !250, size: 32, offset: 10976)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !638, file: !611, line: 75, baseType: !75, size: 64, offset: 11008)
!792 = !{!793, !794, !795, !796, !797, !799, !800, !801, !802, !804, !806, !807, !809, !812, !813, !815, !818, !819, !821, !824, !825, !827, !828, !829, !830, !832, !833, !834, !836, !839, !840, !842, !845, !846, !848, !851, !852}
!793 = !DILocalVariable(name: "draw", arg: 1, scope: !632, file: !289, line: 100, type: !635)
!794 = !DILocalVariable(name: "w", arg: 2, scope: !632, file: !289, line: 100, type: !86)
!795 = !DILocalVariable(name: "h", arg: 3, scope: !632, file: !289, line: 100, type: !86)
!796 = !DILocalVariable(name: "ierr", scope: !632, file: !289, line: 102, type: !96)
!797 = !DILocalVariable(name: "_7_ierr", scope: !798, file: !289, line: 106, type: !96)
!798 = distinct !DILexicalBlock(scope: !632, file: !289, line: 106, column: 3)
!799 = !DILocalVariable(name: "b0", scope: !798, file: !289, line: 106, type: !135)
!800 = !DILocalVariable(name: "b1", scope: !798, file: !289, line: 106, type: !214)
!801 = !DILocalVariable(name: "b2", scope: !798, file: !289, line: 106, type: !214)
!802 = !DILocalVariable(name: "_4_ierr", scope: !803, file: !289, line: 106, type: !96)
!803 = distinct !DILexicalBlock(scope: !798, file: !289, line: 106, column: 3)
!804 = !DILocalVariable(name: "a_b1", scope: !803, file: !289, line: 106, type: !805)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 192, elements: !396)
!806 = !DILocalVariable(name: "a_b2", scope: !803, file: !289, line: 106, type: !805)
!807 = !DILocalVariable(name: "_7_errorcode", scope: !808, file: !289, line: 106, type: !96)
!808 = distinct !DILexicalBlock(scope: !803, file: !289, line: 106, column: 3)
!809 = !DILocalVariable(name: "_7_errorstring", scope: !810, file: !289, line: 106, type: !373)
!810 = distinct !DILexicalBlock(scope: !811, file: !289, line: 106, column: 3)
!811 = distinct !DILexicalBlock(scope: !808, file: !289, line: 106, column: 3)
!812 = !DILocalVariable(name: "_7_resultlen", scope: !810, file: !289, line: 106, type: !152)
!813 = !DILocalVariable(name: "_7_errorcode", scope: !814, file: !289, line: 106, type: !96)
!814 = distinct !DILexicalBlock(scope: !803, file: !289, line: 106, column: 3)
!815 = !DILocalVariable(name: "_7_errorstring", scope: !816, file: !289, line: 106, type: !373)
!816 = distinct !DILexicalBlock(scope: !817, file: !289, line: 106, column: 3)
!817 = distinct !DILexicalBlock(scope: !814, file: !289, line: 106, column: 3)
!818 = !DILocalVariable(name: "_7_resultlen", scope: !816, file: !289, line: 106, type: !152)
!819 = !DILocalVariable(name: "_7_errorcode", scope: !820, file: !289, line: 106, type: !96)
!820 = distinct !DILexicalBlock(scope: !798, file: !289, line: 106, column: 3)
!821 = !DILocalVariable(name: "_7_errorstring", scope: !822, file: !289, line: 106, type: !373)
!822 = distinct !DILexicalBlock(scope: !823, file: !289, line: 106, column: 3)
!823 = distinct !DILexicalBlock(scope: !820, file: !289, line: 106, column: 3)
!824 = !DILocalVariable(name: "_7_resultlen", scope: !822, file: !289, line: 106, type: !152)
!825 = !DILocalVariable(name: "_7_ierr", scope: !826, file: !289, line: 107, type: !96)
!826 = distinct !DILexicalBlock(scope: !632, file: !289, line: 107, column: 3)
!827 = !DILocalVariable(name: "b0", scope: !826, file: !289, line: 107, type: !135)
!828 = !DILocalVariable(name: "b1", scope: !826, file: !289, line: 107, type: !214)
!829 = !DILocalVariable(name: "b2", scope: !826, file: !289, line: 107, type: !214)
!830 = !DILocalVariable(name: "_4_ierr", scope: !831, file: !289, line: 107, type: !96)
!831 = distinct !DILexicalBlock(scope: !826, file: !289, line: 107, column: 3)
!832 = !DILocalVariable(name: "a_b1", scope: !831, file: !289, line: 107, type: !805)
!833 = !DILocalVariable(name: "a_b2", scope: !831, file: !289, line: 107, type: !805)
!834 = !DILocalVariable(name: "_7_errorcode", scope: !835, file: !289, line: 107, type: !96)
