; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/andor.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/andor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_VecTagger = type { %struct._p_PetscObject, [1 x %struct._VecTaggerOps], i8*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 155, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 663, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!75 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!93 = !{!94, !129, !209, !126, !150, !284}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger_AndOr", file: !96, line: 9, baseType: !97)
!96 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/utils/tagger/impls/andor.h", directory: "/home/users/ndemeye/xSDK")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 5, size: 192, elements: !98)
!98 = !{!99, !102, !655}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nsubs", scope: !97, file: !96, line: 6, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !101)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !97, file: !96, line: 7, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !25, line: 721, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !107, line: 339, size: 5120, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !318, !651, !652, !653, !654}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !106, file: !107, line: 340, baseType: !110, size: 4480)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !111, line: 122, baseType: !112)
!111 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !111, line: 73, size: 4480, elements: !113)
!113 = !{!114, !116, !171, !172, !173, !176, !177, !178, !179, !187, !188, !190, !194, !198, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !212, !213, !214, !216, !217, !219, !221, !222, !223, !224, !225, !228, !230, !231, !232, !233, !234, !237, !239, !240, !241, !251, !253, !254, !258, !259, !308, !313, !315, !316, !317}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !112, file: !111, line: 74, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !101)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !112, file: !111, line: 75, baseType: !117, size: 448, offset: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 448, elements: !169)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !111, line: 53, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 45, size: 448, elements: !120)
!120 = !{!121, !133, !141, !146, !153, !157, !164}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !119, file: !111, line: 46, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !126, !128}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !101)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !130, line: 330, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !130, line: 330, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !119, file: !111, line: 47, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!125, !126, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !138, line: 16, baseType: !139)
!138 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !138, line: 16, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !119, file: !111, line: 48, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!125, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !119, file: !111, line: 49, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!125, !126, !150, !126}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !119, file: !111, line: 50, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!125, !126, !150, !145}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !119, file: !111, line: 51, baseType: !158, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!125, !126, !150, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !119, file: !111, line: 52, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!125, !126, !150, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !112, file: !111, line: 76, baseType: !129, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !111, line: 77, baseType: !100, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !112, file: !111, line: 78, baseType: !174, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !175)
!175 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !112, file: !111, line: 78, baseType: !174, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !112, file: !111, line: 78, baseType: !174, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !112, file: !111, line: 78, baseType: !174, size: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 79, baseType: !180, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !183, line: 27, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !185, line: 43, baseType: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!186 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !112, file: !111, line: 80, baseType: !100, size: 32, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !112, file: !111, line: 81, baseType: !189, size: 32, offset: 992)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !101)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !112, file: !111, line: 82, baseType: !191, size: 64, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !112, file: !111, line: 83, baseType: !195, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !112, file: !111, line: 84, baseType: !199, size: 64, offset: 1152)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !112, file: !111, line: 85, baseType: !199, size: 64, offset: 1216)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !112, file: !111, line: 86, baseType: !199, size: 64, offset: 1280)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !112, file: !111, line: 87, baseType: !199, size: 64, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !112, file: !111, line: 88, baseType: !126, size: 64, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !112, file: !111, line: 89, baseType: !180, size: 64, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !111, line: 90, baseType: !199, size: 64, offset: 1536)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !112, file: !111, line: 91, baseType: !199, size: 64, offset: 1600)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !112, file: !111, line: 92, baseType: !100, size: 32, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !112, file: !111, line: 93, baseType: !209, size: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !112, file: !111, line: 94, baseType: !211, size: 64, offset: 1792)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !181)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !112, file: !111, line: 95, baseType: !100, size: 32, offset: 1856)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !112, file: !111, line: 95, baseType: !100, size: 32, offset: 1888)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !112, file: !111, line: 96, baseType: !215, size: 64, offset: 1920)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !112, file: !111, line: 96, baseType: !215, size: 64, offset: 1984)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !112, file: !111, line: 97, baseType: !218, size: 64, offset: 2048)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !112, file: !111, line: 97, baseType: !220, size: 64, offset: 2112)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !112, file: !111, line: 98, baseType: !100, size: 32, offset: 2176)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !112, file: !111, line: 98, baseType: !100, size: 32, offset: 2208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !112, file: !111, line: 99, baseType: !215, size: 64, offset: 2240)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !112, file: !111, line: 99, baseType: !215, size: 64, offset: 2304)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !112, file: !111, line: 100, baseType: !226, size: 64, offset: 2368)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !175)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !112, file: !111, line: 100, baseType: !229, size: 64, offset: 2432)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !112, file: !111, line: 101, baseType: !100, size: 32, offset: 2496)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !112, file: !111, line: 101, baseType: !100, size: 32, offset: 2528)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !112, file: !111, line: 102, baseType: !215, size: 64, offset: 2560)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !112, file: !111, line: 102, baseType: !215, size: 64, offset: 2624)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !112, file: !111, line: 103, baseType: !235, size: 64, offset: 2688)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !227)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !112, file: !111, line: 103, baseType: !238, size: 64, offset: 2752)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !112, file: !111, line: 104, baseType: !168, size: 64, offset: 2816)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !112, file: !111, line: 105, baseType: !100, size: 32, offset: 2880)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !112, file: !111, line: 106, baseType: !242, size: 128, offset: 2944)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 128, elements: !249)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !111, line: 64, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 61, size: 128, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !245, file: !111, line: 62, baseType: !161, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !245, file: !111, line: 63, baseType: !209, size: 64, offset: 64)
!249 = !{!250}
!250 = !DISubrange(count: 2)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !112, file: !111, line: 107, baseType: !252, size: 64, offset: 3072)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !249)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !112, file: !111, line: 108, baseType: !209, size: 64, offset: 3136)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !112, file: !111, line: 109, baseType: !255, size: 64, offset: 3200)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!125, !209}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !112, file: !111, line: 111, baseType: !100, size: 32, offset: 3264)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !112, file: !111, line: 112, baseType: !260, size: 320, offset: 3328)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 320, elements: !306)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!125, !264, !126, !209}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !267)
!267 = !{!268, !269, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !266, file: !10, line: 100, baseType: !100, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !10, line: 101, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !281, !282, !283, !287, !289, !291, !292, !293}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !272, file: !10, line: 84, baseType: !199, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !272, file: !10, line: 85, baseType: !199, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !10, line: 86, baseType: !209, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !272, file: !10, line: 87, baseType: !191, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !272, file: !10, line: 88, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !272, file: !10, line: 89, baseType: !152, size: 8, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !272, file: !10, line: 90, baseType: !199, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !272, file: !10, line: 91, baseType: !284, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !285, line: 46, baseType: !286)
!285 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!286 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !272, file: !10, line: 92, baseType: !288, size: 32, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !10, line: 93, baseType: !290, size: 32, offset: 544)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !10, line: 94, baseType: !270, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !272, file: !10, line: 95, baseType: !199, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !272, file: !10, line: 96, baseType: !209, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !266, file: !10, line: 102, baseType: !199, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !266, file: !10, line: 102, baseType: !199, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !266, file: !10, line: 103, baseType: !199, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !266, file: !10, line: 104, baseType: !129, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 416)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !266, file: !10, line: 105, baseType: !288, size: 32, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !266, file: !10, line: 106, baseType: !126, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !266, file: !10, line: 107, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!306 = !{!307}
!307 = !DISubrange(count: 5)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !112, file: !111, line: 113, baseType: !309, size: 320, offset: 3648)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 320, elements: !306)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!125, !126, !209}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !112, file: !111, line: 114, baseType: !314, size: 320, offset: 3968)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 320, elements: !306)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !112, file: !111, line: 115, baseType: !288, size: 32, offset: 4288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 120, baseType: !303, size: 64, offset: 4352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !112, file: !111, line: 121, baseType: !288, size: 32, offset: 4416)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !106, file: !107, line: 340, baseType: !319, size: 448, offset: 4480)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 448, elements: !169)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !107, line: 330, size: 448, elements: !321)
!321 = !{!322, !326, !327, !331, !332, !336, !647}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !320, file: !107, line: 331, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!125, !104}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !320, file: !107, line: 332, baseType: !323, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !320, file: !107, line: 333, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!125, !264, !104}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !320, file: !107, line: 334, baseType: !323, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !320, file: !107, line: 335, baseType: !333, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!125, !104, !137}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !320, file: !107, line: 336, baseType: !337, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!125, !104, !340, !218, !640}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !107, line: 142, size: 12800, elements: !343)
!343 = !{!344, !345, !565, !586, !587, !588, !634, !635, !636, !637, !639}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !342, file: !107, line: 143, baseType: !110, size: 4480)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !107, line: 143, baseType: !346, size: 5248, offset: 4480)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 5248, elements: !169)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !107, line: 23, size: 5248, elements: !348)
!348 = !{!349, !354, !359, !363, !367, !373, !378, !379, !380, !384, !388, !389, !390, !394, !398, !404, !405, !409, !413, !417, !418, !425, !429, !430, !434, !438, !439, !440, !444, !445, !452, !457, !458, !459, !463, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !484, !485, !486, !490, !494, !495, !496, !497, !501, !502, !503, !504, !505, !506, !507, !511, !512, !516, !523, !524, !529, !530, !534, !535, !536, !537, !538, !539, !540, !541, !545, !546, !547, !553, !557, !558, !559}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !347, file: !107, line: 24, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!125, !340, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !347, file: !107, line: 25, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!125, !340, !100, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !347, file: !107, line: 26, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!125, !100, !353}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !347, file: !107, line: 27, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!125, !340, !340, !235}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !347, file: !107, line: 28, baseType: !368, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!125, !340, !100, !371, !235}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !347, file: !107, line: 29, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!125, !340, !377, !226}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !347, file: !107, line: 30, baseType: !364, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !347, file: !107, line: 31, baseType: !368, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !347, file: !107, line: 32, baseType: !381, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!125, !340, !236}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !347, file: !107, line: 33, baseType: !385, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!125, !340, !340}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !347, file: !107, line: 34, baseType: !381, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !347, file: !107, line: 35, baseType: !385, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !347, file: !107, line: 36, baseType: !391, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!125, !340, !236, !340}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !347, file: !107, line: 37, baseType: !395, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!125, !340, !236, !236, !340}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !347, file: !107, line: 38, baseType: !399, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!125, !340, !100, !402, !353}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !347, file: !107, line: 39, baseType: !391, size: 64, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !347, file: !107, line: 40, baseType: !406, size: 64, offset: 1024)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!125, !340, !236, !340, !340}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !347, file: !107, line: 41, baseType: !410, size: 64, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!125, !340, !236, !236, !236, !340, !340}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !347, file: !107, line: 42, baseType: !414, size: 64, offset: 1152)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!125, !340, !340, !340}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !347, file: !107, line: 43, baseType: !414, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !347, file: !107, line: 44, baseType: !419, size: 64, offset: 1280)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!125, !340, !100, !422, !402, !424}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !347, file: !107, line: 45, baseType: !426, size: 64, offset: 1344)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!125, !340}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !347, file: !107, line: 46, baseType: !426, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !347, file: !107, line: 47, baseType: !431, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!125, !340, !238}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !347, file: !107, line: 48, baseType: !435, size: 64, offset: 1536)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!125, !340, !218}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !347, file: !107, line: 49, baseType: !435, size: 64, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !347, file: !107, line: 50, baseType: !431, size: 64, offset: 1664)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !347, file: !107, line: 51, baseType: !441, size: 64, offset: 1728)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!125, !340, !218, !226}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !347, file: !107, line: 52, baseType: !441, size: 64, offset: 1792)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !347, file: !107, line: 53, baseType: !446, size: 64, offset: 1856)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!125, !340, !449}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !347, file: !107, line: 54, baseType: !453, size: 64, offset: 1920)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!125, !340, !456, !288}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !347, file: !107, line: 55, baseType: !419, size: 64, offset: 1984)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !347, file: !107, line: 56, baseType: !426, size: 64, offset: 2048)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !347, file: !107, line: 57, baseType: !460, size: 64, offset: 2112)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!125, !340, !137}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !347, file: !107, line: 58, baseType: !464, size: 64, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!125, !340, !402}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !347, file: !107, line: 59, baseType: !464, size: 64, offset: 2240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !347, file: !107, line: 60, baseType: !364, size: 64, offset: 2304)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !347, file: !107, line: 61, baseType: !364, size: 64, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !347, file: !107, line: 62, baseType: !374, size: 64, offset: 2432)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !347, file: !107, line: 63, baseType: !368, size: 64, offset: 2496)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !347, file: !107, line: 64, baseType: !368, size: 64, offset: 2560)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !347, file: !107, line: 65, baseType: !460, size: 64, offset: 2624)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !347, file: !107, line: 66, baseType: !426, size: 64, offset: 2688)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !347, file: !107, line: 67, baseType: !426, size: 64, offset: 2752)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !347, file: !107, line: 68, baseType: !477, size: 64, offset: 2816)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!125, !340, !480}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !481, line: 30, baseType: !482)
!481 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !481, line: 30, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !347, file: !107, line: 69, baseType: !419, size: 64, offset: 2880)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !347, file: !107, line: 70, baseType: !426, size: 64, offset: 2944)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !347, file: !107, line: 71, baseType: !487, size: 64, offset: 3008)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!125, !264, !340}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !347, file: !107, line: 72, baseType: !491, size: 64, offset: 3072)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!125, !340, !340, !226}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !347, file: !107, line: 73, baseType: !414, size: 64, offset: 3136)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !347, file: !107, line: 74, baseType: !414, size: 64, offset: 3200)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !347, file: !107, line: 75, baseType: !414, size: 64, offset: 3264)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !347, file: !107, line: 76, baseType: !498, size: 64, offset: 3328)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!125, !340, !100, !422, !235}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !347, file: !107, line: 77, baseType: !426, size: 64, offset: 3392)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !347, file: !107, line: 78, baseType: !426, size: 64, offset: 3456)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !347, file: !107, line: 79, baseType: !426, size: 64, offset: 3520)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !347, file: !107, line: 80, baseType: !426, size: 64, offset: 3584)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !347, file: !107, line: 81, baseType: !381, size: 64, offset: 3648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !347, file: !107, line: 82, baseType: !426, size: 64, offset: 3712)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !347, file: !107, line: 83, baseType: !508, size: 64, offset: 3776)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!125, !340, !100, !340, !424}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !347, file: !107, line: 84, baseType: !508, size: 64, offset: 3840)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !347, file: !107, line: 85, baseType: !513, size: 64, offset: 3904)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!125, !340, !340, !235, !235}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !347, file: !107, line: 86, baseType: !517, size: 64, offset: 3968)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!125, !340, !520, !353}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !481, line: 11, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !481, line: 11, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !347, file: !107, line: 87, baseType: !517, size: 64, offset: 4032)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !347, file: !107, line: 88, baseType: !525, size: 64, offset: 4096)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!125, !340, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !347, file: !107, line: 89, baseType: !525, size: 64, offset: 4160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !347, file: !107, line: 90, baseType: !531, size: 64, offset: 4224)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!125, !340, !100, !422, !422, !340, !424}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !347, file: !107, line: 91, baseType: !531, size: 64, offset: 4288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !347, file: !107, line: 92, baseType: !460, size: 64, offset: 4352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !347, file: !107, line: 93, baseType: !460, size: 64, offset: 4416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !347, file: !107, line: 94, baseType: !385, size: 64, offset: 4480)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !347, file: !107, line: 95, baseType: !385, size: 64, offset: 4544)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !347, file: !107, line: 96, baseType: !385, size: 64, offset: 4608)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !347, file: !107, line: 97, baseType: !385, size: 64, offset: 4672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !347, file: !107, line: 98, baseType: !542, size: 64, offset: 4736)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!125, !340, !288}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !347, file: !107, line: 99, baseType: !431, size: 64, offset: 4800)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !347, file: !107, line: 100, baseType: !431, size: 64, offset: 4864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !347, file: !107, line: 101, baseType: !548, size: 64, offset: 4928)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!125, !340, !238, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !347, file: !107, line: 102, baseType: !554, size: 64, offset: 4992)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!125, !340, !528, !551}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !347, file: !107, line: 103, baseType: !431, size: 64, offset: 5056)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !347, file: !107, line: 104, baseType: !525, size: 64, offset: 5120)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !347, file: !107, line: 105, baseType: !560, size: 64, offset: 5184)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!125, !100, !371, !353, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !342, file: !107, line: 144, baseType: !566, size: 64, offset: 9728)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !481, line: 60, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !569, line: 240, size: 640, elements: !570)
!569 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !568, file: !569, line: 241, baseType: !129, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !569, line: 242, baseType: !189, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !568, file: !569, line: 243, baseType: !100, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !568, file: !569, line: 243, baseType: !100, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !568, file: !569, line: 244, baseType: !100, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !568, file: !569, line: 244, baseType: !100, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !568, file: !569, line: 245, baseType: !218, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !568, file: !569, line: 246, baseType: !288, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !568, file: !569, line: 247, baseType: !100, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !568, file: !569, line: 251, baseType: !100, size: 32, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !568, file: !569, line: 252, baseType: !480, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !568, file: !569, line: 253, baseType: !288, size: 32, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !568, file: !569, line: 254, baseType: !100, size: 32, offset: 544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !568, file: !569, line: 254, baseType: !100, size: 32, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !568, file: !569, line: 255, baseType: !100, size: 32, offset: 608)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !107, line: 145, baseType: !209, size: 64, offset: 9792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !342, file: !107, line: 146, baseType: !288, size: 32, offset: 9856)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !342, file: !107, line: 147, baseType: !589, size: 1344, offset: 9920)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !107, line: 140, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 114, size: 1344, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !610, !611, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !590, file: !107, line: 115, baseType: !100, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !590, file: !107, line: 116, baseType: !100, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !590, file: !107, line: 117, baseType: !100, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !590, file: !107, line: 118, baseType: !100, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !590, file: !107, line: 119, baseType: !100, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !590, file: !107, line: 120, baseType: !100, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !590, file: !107, line: 121, baseType: !218, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !590, file: !107, line: 122, baseType: !235, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !590, file: !107, line: 124, baseType: !129, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !107, line: 125, baseType: !189, size: 32, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !590, file: !107, line: 125, baseType: !189, size: 32, offset: 416)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !590, file: !107, line: 126, baseType: !189, size: 32, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !590, file: !107, line: 126, baseType: !189, size: 32, offset: 480)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !590, file: !107, line: 127, baseType: !606, size: 64, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !130, line: 339, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !130, line: 339, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !590, file: !107, line: 128, baseType: !606, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !590, file: !107, line: 129, baseType: !612, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !130, line: 341, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !130, line: 351, size: 192, elements: !615)
!615 = !{!616, !617, !618, !619, !620}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !614, file: !130, line: 354, baseType: !101, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !614, file: !130, line: 355, baseType: !101, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !614, file: !130, line: 356, baseType: !101, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !614, file: !130, line: 361, baseType: !101, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !614, file: !130, line: 362, baseType: !284, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !590, file: !107, line: 130, baseType: !100, size: 32, offset: 704)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !590, file: !107, line: 130, baseType: !100, size: 32, offset: 736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !590, file: !107, line: 131, baseType: !235, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !590, file: !107, line: 131, baseType: !235, size: 64, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !590, file: !107, line: 132, baseType: !218, size: 64, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !590, file: !107, line: 132, baseType: !218, size: 64, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !590, file: !107, line: 133, baseType: !100, size: 32, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !590, file: !107, line: 134, baseType: !218, size: 64, offset: 1088)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !590, file: !107, line: 135, baseType: !100, size: 32, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !590, file: !107, line: 136, baseType: !288, size: 32, offset: 1184)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !590, file: !107, line: 137, baseType: !288, size: 32, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !590, file: !107, line: 138, baseType: !424, size: 32, offset: 1248)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !590, file: !107, line: 139, baseType: !218, size: 64, offset: 1280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !342, file: !107, line: 147, baseType: !589, size: 1344, offset: 11264)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !342, file: !107, line: 148, baseType: !288, size: 32, offset: 12608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !342, file: !107, line: 149, baseType: !100, size: 32, offset: 12640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !342, file: !107, line: 150, baseType: !638, size: 32, offset: 12672)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !342, file: !107, line: 157, baseType: !199, size: 64, offset: 12736)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !25, line: 768, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 765, size: 128, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !643, file: !25, line: 766, baseType: !236, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !643, file: !25, line: 767, baseType: !236, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !320, file: !107, line: 337, baseType: !648, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!125, !104, !340, !564}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !107, line: 341, baseType: !209, size: 64, offset: 4928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !106, file: !107, line: 342, baseType: !100, size: 32, offset: 4992)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !106, file: !107, line: 343, baseType: !288, size: 32, offset: 5024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !106, file: !107, line: 344, baseType: !288, size: 32, offset: 5056)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !97, file: !96, line: 8, baseType: !656, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !62)
!657 = !{i32 7, !"Dwarf Version", i32 4}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"wchar_size", i32 4}
!660 = !{i32 7, !"PIC Level", i32 2}
!661 = !{i32 7, !"uwtable", i32 1}
!662 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!663 = distinct !DISubprogram(name: "VecTaggerGetSubs_AndOr", scope: !664, file: !664, line: 21, type: !665, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !668)
!664 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/impls/andor.c", directory: "/home/users/ndemeye/xSDK")
!665 = !DISubroutineType(types: !666)
!666 = !{!125, !104, !218, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!668 = !{!669, !670, !671, !672}
!669 = !DILocalVariable(name: "tagger", arg: 1, scope: !663, file: !664, line: 21, type: !104)
!670 = !DILocalVariable(name: "nsubs", arg: 2, scope: !663, file: !664, line: 21, type: !218)
!671 = !DILocalVariable(name: "subs", arg: 3, scope: !663, file: !664, line: 21, type: !667)
!672 = !DILocalVariable(name: "andOr", scope: !663, file: !664, line: 23, type: !94)
!673 = !DILocation(line: 0, scope: !663)
!674 = !DILocation(line: 23, column: 56, scope: !663)
!675 = !{!676, !681, i64 616}
!676 = !{!"_p_VecTagger", !677, i64 0, !679, i64 560, !681, i64 616, !678, i64 624, !679, i64 628, !679, i64 632}
!677 = !{!"_p_PetscObject", !678, i64 0, !679, i64 8, !681, i64 64, !678, i64 72, !682, i64 80, !682, i64 88, !682, i64 96, !682, i64 104, !683, i64 112, !678, i64 120, !678, i64 124, !681, i64 128, !681, i64 136, !681, i64 144, !681, i64 152, !681, i64 160, !681, i64 168, !681, i64 176, !683, i64 184, !681, i64 192, !681, i64 200, !678, i64 208, !681, i64 216, !683, i64 224, !678, i64 232, !678, i64 236, !681, i64 240, !681, i64 248, !681, i64 256, !681, i64 264, !678, i64 272, !678, i64 276, !681, i64 280, !681, i64 288, !681, i64 296, !681, i64 304, !678, i64 312, !678, i64 316, !681, i64 320, !681, i64 328, !681, i64 336, !681, i64 344, !681, i64 352, !678, i64 360, !679, i64 368, !679, i64 384, !681, i64 392, !681, i64 400, !678, i64 408, !679, i64 416, !679, i64 456, !679, i64 496, !679, i64 536, !681, i64 544, !679, i64 552}
!678 = !{!"int", !679, i64 0}
!679 = !{!"omnipotent char", !680, i64 0}
!680 = !{!"Simple C/C++ TBAA"}
!681 = !{!"any pointer", !679, i64 0}
!682 = !{!"double", !679, i64 0}
!683 = !{!"long", !679, i64 0}
!684 = !DILocation(line: 25, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !664, line: 25, column: 3)
!686 = distinct !DILexicalBlock(scope: !687, file: !664, line: 25, column: 3)
!687 = distinct !DILexicalBlock(scope: !663, file: !664, line: 25, column: 3)
!688 = !{!681, !681, i64 0}
!689 = !DILocation(line: 25, column: 3, scope: !686)
!690 = !DILocation(line: 25, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !664, line: 25, column: 3)
!692 = distinct !DILexicalBlock(scope: !685, file: !664, line: 25, column: 3)
!693 = !{!694, !678, i64 1536}
!694 = !{!"", !679, i64 0, !679, i64 512, !679, i64 1024, !679, i64 1280, !678, i64 1536, !678, i64 1540, !679, i64 1544}
!695 = !DILocation(line: 25, column: 3, scope: !692)
!696 = !DILocation(line: 25, column: 3, scope: !697)
!697 = distinct !DILexicalBlock(scope: !691, file: !664, line: 25, column: 3)
!698 = !{!678, !678, i64 0}
!699 = !{!694, !678, i64 1540}
!700 = !DILocation(line: 26, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !664, line: 26, column: 3)
!702 = distinct !DILexicalBlock(scope: !663, file: !664, line: 26, column: 3)
!703 = !DILocation(line: 26, column: 3, scope: !702)
