; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 181, baseType: !64, size: 32, elements: !65)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!66 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!67 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!68 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!69 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!70 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!71 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!72 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!73 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!74 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!75 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!76 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!77 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!78 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 26, baseType: !5, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 115, baseType: !5, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "TAO_ALMM_CLASSIC", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "TAO_ALMM_PHR", value: 1, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 663, baseType: !5, size: 32, elements: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!90 = !{!91, !92, !93}
!91 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 30, baseType: !5, size: 32, elements: !95)
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !102)
!102 = !{!103}
!103 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!104 = !{!105, !108, !126, !207, !313, !147, !315, !905, !906}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !111, line: 73, size: 4480, elements: !112)
!111 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!112 = !{!113, !115, !168, !169, !171, !174, !175, !176, !177, !185, !186, !188, !192, !196, !198, !199, !200, !201, !202, !203, !204, !205, !206, !208, !210, !211, !212, !214, !215, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !231, !232, !235, !237, !238, !239, !249, !251, !252, !256, !257, !303, !308, !310, !311, !312}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !110, file: !111, line: 74, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !110, file: !111, line: 75, baseType: !116, size: 448, offset: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 448, elements: !166)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !111, line: 53, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 45, size: 448, elements: !119)
!119 = !{!120, !130, !138, !143, !150, !154, !161}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !118, file: !111, line: 46, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !108, !125}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !127, line: 330, baseType: !128)
!127 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !127, line: 330, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !118, file: !111, line: 47, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!124, !108, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !135, line: 16, baseType: !136)
!135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !135, line: 16, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !118, file: !111, line: 48, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!124, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !118, file: !111, line: 49, baseType: !144, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!124, !108, !147, !108}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !118, file: !111, line: 50, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!124, !108, !147, !142}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !118, file: !111, line: 51, baseType: !155, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!124, !108, !147, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !118, file: !111, line: 52, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!124, !108, !147, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!166 = !{!167}
!167 = !DISubrange(count: 1)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !110, file: !111, line: 76, baseType: !126, size: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !111, line: 77, baseType: !170, size: 32, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !110, file: !111, line: 78, baseType: !172, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !173)
!173 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !110, file: !111, line: 78, baseType: !172, size: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !110, file: !111, line: 78, baseType: !172, size: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !110, file: !111, line: 78, baseType: !172, size: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 79, baseType: !178, size: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !181, line: 27, baseType: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !183, line: 43, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!184 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !110, file: !111, line: 80, baseType: !170, size: 32, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !110, file: !111, line: 81, baseType: !187, size: 32, offset: 992)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !110, file: !111, line: 82, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !110, file: !111, line: 83, baseType: !193, size: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !110, file: !111, line: 84, baseType: !197, size: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !110, file: !111, line: 85, baseType: !197, size: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !110, file: !111, line: 86, baseType: !197, size: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !110, file: !111, line: 87, baseType: !197, size: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !110, file: !111, line: 88, baseType: !108, size: 64, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !110, file: !111, line: 89, baseType: !178, size: 64, offset: 1472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 90, baseType: !197, size: 64, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !110, file: !111, line: 91, baseType: !197, size: 64, offset: 1600)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !110, file: !111, line: 92, baseType: !170, size: 32, offset: 1664)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !110, file: !111, line: 93, baseType: !207, size: 64, offset: 1728)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !110, file: !111, line: 94, baseType: !209, size: 64, offset: 1792)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !179)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !110, file: !111, line: 95, baseType: !170, size: 32, offset: 1856)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !110, file: !111, line: 95, baseType: !170, size: 32, offset: 1888)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !110, file: !111, line: 96, baseType: !213, size: 64, offset: 1920)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !110, file: !111, line: 96, baseType: !213, size: 64, offset: 1984)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !110, file: !111, line: 97, baseType: !216, size: 64, offset: 2048)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !110, file: !111, line: 97, baseType: !218, size: 64, offset: 2112)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !110, file: !111, line: 98, baseType: !170, size: 32, offset: 2176)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !110, file: !111, line: 98, baseType: !170, size: 32, offset: 2208)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !110, file: !111, line: 99, baseType: !213, size: 64, offset: 2240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !110, file: !111, line: 99, baseType: !213, size: 64, offset: 2304)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !110, file: !111, line: 100, baseType: !224, size: 64, offset: 2368)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !173)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !110, file: !111, line: 100, baseType: !227, size: 64, offset: 2432)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !110, file: !111, line: 101, baseType: !170, size: 32, offset: 2496)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !110, file: !111, line: 101, baseType: !170, size: 32, offset: 2528)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !110, file: !111, line: 102, baseType: !213, size: 64, offset: 2560)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !110, file: !111, line: 102, baseType: !213, size: 64, offset: 2624)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !110, file: !111, line: 103, baseType: !233, size: 64, offset: 2688)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !225)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !110, file: !111, line: 103, baseType: !236, size: 64, offset: 2752)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !110, file: !111, line: 104, baseType: !165, size: 64, offset: 2816)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !110, file: !111, line: 105, baseType: !170, size: 32, offset: 2880)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !110, file: !111, line: 106, baseType: !240, size: 128, offset: 2944)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !247)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !111, line: 64, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 61, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !243, file: !111, line: 62, baseType: !158, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !243, file: !111, line: 63, baseType: !207, size: 64, offset: 64)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !110, file: !111, line: 107, baseType: !250, size: 64, offset: 3072)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !247)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !110, file: !111, line: 108, baseType: !207, size: 64, offset: 3136)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !110, file: !111, line: 109, baseType: !253, size: 64, offset: 3200)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!124, !207}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !110, file: !111, line: 111, baseType: !170, size: 32, offset: 3264)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !110, file: !111, line: 112, baseType: !258, size: 320, offset: 3328)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 320, elements: !301)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!124, !262, !108, !207}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !265)
!265 = !{!266, !267, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !264, file: !10, line: 100, baseType: !170, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 101, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !279, !280, !281, !282, !284, !286, !287, !288}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !270, file: !10, line: 84, baseType: !197, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !270, file: !10, line: 85, baseType: !197, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !10, line: 86, baseType: !207, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !270, file: !10, line: 87, baseType: !189, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !270, file: !10, line: 88, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !270, file: !10, line: 89, baseType: !149, size: 8, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !270, file: !10, line: 90, baseType: !197, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !270, file: !10, line: 91, baseType: !105, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !270, file: !10, line: 92, baseType: !283, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !10, line: 93, baseType: !285, size: 32, offset: 544)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !10, line: 94, baseType: !268, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !270, file: !10, line: 95, baseType: !197, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !270, file: !10, line: 96, baseType: !207, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !264, file: !10, line: 102, baseType: !197, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !264, file: !10, line: 102, baseType: !197, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !264, file: !10, line: 103, baseType: !197, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !264, file: !10, line: 104, baseType: !126, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !264, file: !10, line: 105, baseType: !283, size: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !264, file: !10, line: 105, baseType: !283, size: 32, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !264, file: !10, line: 105, baseType: !283, size: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !264, file: !10, line: 106, baseType: !108, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !264, file: !10, line: 107, baseType: !298, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!301 = !{!302}
!302 = !DISubrange(count: 5)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !110, file: !111, line: 113, baseType: !304, size: 320, offset: 3648)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 320, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!124, !108, !207}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !110, file: !111, line: 114, baseType: !309, size: 320, offset: 3968)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 320, elements: !301)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !110, file: !111, line: 115, baseType: !283, size: 32, offset: 4288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !110, file: !111, line: 120, baseType: !298, size: 64, offset: 4352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !110, file: !111, line: 121, baseType: !283, size: 32, offset: 4416)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !314, line: 1451, baseType: !158)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_ALMM", file: !317, line: 25, baseType: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/constrained/impls/almm/almm.h", directory: "/home/users/ndemeye/xSDK")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 5, size: 3328, elements: !319)
!319 = !{!320, !847, !848, !849, !851, !852, !853, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "subsolver", scope: !318, file: !317, line: 6, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !63, line: 118, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !324, line: 45, size: 14656, elements: !325)
!324 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!325 = !{!326, !328, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !718, !724, !726, !727, !728, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !799, !800, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !842, !843, !844, !845, !846}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !323, file: !324, line: 46, baseType: !327, size: 4480)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !111, line: 122, baseType: !110)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !323, file: !324, line: 46, baseType: !329, size: 1536, offset: 4480)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 1536, elements: !166)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !324, line: 13, size: 1536, elements: !331)
!331 = !{!332, !637, !641, !645, !653, !654, !655, !656, !657, !658, !659, !663, !667, !668, !669, !670, !674, !678, !679, !683, !687, !688, !692, !696}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !330, file: !324, line: 15, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!124, !321, !336, !224, !207}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !339, line: 142, size: 12800, elements: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!340 = !{!341, !342, !562, !583, !584, !585, !631, !632, !633, !634, !636}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !338, file: !339, line: 143, baseType: !327, size: 4480)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !338, file: !339, line: 143, baseType: !343, size: 5248, offset: 4480)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 5248, elements: !166)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !339, line: 23, size: 5248, elements: !345)
!345 = !{!346, !351, !356, !360, !364, !370, !375, !376, !377, !381, !385, !386, !387, !391, !395, !401, !402, !406, !410, !414, !415, !422, !426, !427, !431, !435, !436, !437, !441, !442, !449, !454, !455, !456, !460, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !481, !482, !483, !487, !491, !492, !493, !494, !498, !499, !500, !501, !502, !503, !504, !508, !509, !513, !520, !521, !526, !527, !531, !532, !533, !534, !535, !536, !537, !538, !542, !543, !544, !550, !554, !555, !556}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !344, file: !339, line: 24, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!124, !336, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !344, file: !339, line: 25, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!124, !336, !170, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !344, file: !339, line: 26, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!124, !170, !350}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !344, file: !339, line: 27, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!124, !336, !336, !233}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !344, file: !339, line: 28, baseType: !365, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!124, !336, !170, !368, !233}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !344, file: !339, line: 29, baseType: !371, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!124, !336, !374, !224}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !344, file: !339, line: 30, baseType: !361, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !344, file: !339, line: 31, baseType: !365, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !344, file: !339, line: 32, baseType: !378, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!124, !336, !234}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !344, file: !339, line: 33, baseType: !382, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!124, !336, !336}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !344, file: !339, line: 34, baseType: !378, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !344, file: !339, line: 35, baseType: !382, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !344, file: !339, line: 36, baseType: !388, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!124, !336, !234, !336}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !344, file: !339, line: 37, baseType: !392, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!124, !336, !234, !234, !336}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !344, file: !339, line: 38, baseType: !396, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!124, !336, !170, !399, !350}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !344, file: !339, line: 39, baseType: !388, size: 64, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !344, file: !339, line: 40, baseType: !403, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!124, !336, !234, !336, !336}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !344, file: !339, line: 41, baseType: !407, size: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!124, !336, !234, !234, !234, !336, !336}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !344, file: !339, line: 42, baseType: !411, size: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!124, !336, !336, !336}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !344, file: !339, line: 43, baseType: !411, size: 64, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !344, file: !339, line: 44, baseType: !416, size: 64, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!124, !336, !170, !419, !399, !421}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !344, file: !339, line: 45, baseType: !423, size: 64, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!124, !336}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !344, file: !339, line: 46, baseType: !423, size: 64, offset: 1408)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !344, file: !339, line: 47, baseType: !428, size: 64, offset: 1472)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!124, !336, !236}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !344, file: !339, line: 48, baseType: !432, size: 64, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!124, !336, !216}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !344, file: !339, line: 49, baseType: !432, size: 64, offset: 1600)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !344, file: !339, line: 50, baseType: !428, size: 64, offset: 1664)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !344, file: !339, line: 51, baseType: !438, size: 64, offset: 1728)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!124, !336, !216, !224}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !344, file: !339, line: 52, baseType: !438, size: 64, offset: 1792)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !344, file: !339, line: 53, baseType: !443, size: 64, offset: 1856)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!124, !336, !446}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !344, file: !339, line: 54, baseType: !450, size: 64, offset: 1920)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!124, !336, !453, !283}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !344, file: !339, line: 55, baseType: !416, size: 64, offset: 1984)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !344, file: !339, line: 56, baseType: !423, size: 64, offset: 2048)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !344, file: !339, line: 57, baseType: !457, size: 64, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!124, !336, !134}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !344, file: !339, line: 58, baseType: !461, size: 64, offset: 2176)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!124, !336, !399}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !344, file: !339, line: 59, baseType: !461, size: 64, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !344, file: !339, line: 60, baseType: !361, size: 64, offset: 2304)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !344, file: !339, line: 61, baseType: !361, size: 64, offset: 2368)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !344, file: !339, line: 62, baseType: !371, size: 64, offset: 2432)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !344, file: !339, line: 63, baseType: !365, size: 64, offset: 2496)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !344, file: !339, line: 64, baseType: !365, size: 64, offset: 2560)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !344, file: !339, line: 65, baseType: !457, size: 64, offset: 2624)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !344, file: !339, line: 66, baseType: !423, size: 64, offset: 2688)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !344, file: !339, line: 67, baseType: !423, size: 64, offset: 2752)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !344, file: !339, line: 68, baseType: !474, size: 64, offset: 2816)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!124, !336, !477}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !478, line: 30, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !478, line: 30, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !344, file: !339, line: 69, baseType: !416, size: 64, offset: 2880)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !344, file: !339, line: 70, baseType: !423, size: 64, offset: 2944)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !344, file: !339, line: 71, baseType: !484, size: 64, offset: 3008)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!124, !262, !336}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !344, file: !339, line: 72, baseType: !488, size: 64, offset: 3072)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!124, !336, !336, !224}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !344, file: !339, line: 73, baseType: !411, size: 64, offset: 3136)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !344, file: !339, line: 74, baseType: !411, size: 64, offset: 3200)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !344, file: !339, line: 75, baseType: !411, size: 64, offset: 3264)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !344, file: !339, line: 76, baseType: !495, size: 64, offset: 3328)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!124, !336, !170, !419, !233}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !344, file: !339, line: 77, baseType: !423, size: 64, offset: 3392)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !344, file: !339, line: 78, baseType: !423, size: 64, offset: 3456)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !344, file: !339, line: 79, baseType: !423, size: 64, offset: 3520)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !344, file: !339, line: 80, baseType: !423, size: 64, offset: 3584)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !344, file: !339, line: 81, baseType: !378, size: 64, offset: 3648)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !344, file: !339, line: 82, baseType: !423, size: 64, offset: 3712)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !344, file: !339, line: 83, baseType: !505, size: 64, offset: 3776)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!124, !336, !170, !336, !421}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !344, file: !339, line: 84, baseType: !505, size: 64, offset: 3840)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !344, file: !339, line: 85, baseType: !510, size: 64, offset: 3904)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!124, !336, !336, !233, !233}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !344, file: !339, line: 86, baseType: !514, size: 64, offset: 3968)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!124, !336, !517, !350}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !478, line: 11, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !478, line: 11, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !344, file: !339, line: 87, baseType: !514, size: 64, offset: 4032)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !344, file: !339, line: 88, baseType: !522, size: 64, offset: 4096)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!124, !336, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !344, file: !339, line: 89, baseType: !522, size: 64, offset: 4160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !344, file: !339, line: 90, baseType: !528, size: 64, offset: 4224)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!124, !336, !170, !419, !419, !336, !421}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !344, file: !339, line: 91, baseType: !528, size: 64, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !344, file: !339, line: 92, baseType: !457, size: 64, offset: 4352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !344, file: !339, line: 93, baseType: !457, size: 64, offset: 4416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !344, file: !339, line: 94, baseType: !382, size: 64, offset: 4480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !344, file: !339, line: 95, baseType: !382, size: 64, offset: 4544)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !344, file: !339, line: 96, baseType: !382, size: 64, offset: 4608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !344, file: !339, line: 97, baseType: !382, size: 64, offset: 4672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !344, file: !339, line: 98, baseType: !539, size: 64, offset: 4736)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!124, !336, !283}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !344, file: !339, line: 99, baseType: !428, size: 64, offset: 4800)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !344, file: !339, line: 100, baseType: !428, size: 64, offset: 4864)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !344, file: !339, line: 101, baseType: !545, size: 64, offset: 4928)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!124, !336, !236, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !344, file: !339, line: 102, baseType: !551, size: 64, offset: 4992)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!124, !336, !525, !548}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !344, file: !339, line: 103, baseType: !428, size: 64, offset: 5056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !344, file: !339, line: 104, baseType: !522, size: 64, offset: 5120)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !344, file: !339, line: 105, baseType: !557, size: 64, offset: 5184)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!124, !170, !368, !350, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !338, file: !339, line: 144, baseType: !563, size: 64, offset: 9728)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !478, line: 60, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !566, line: 240, size: 640, elements: !567)
!566 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !565, file: !566, line: 241, baseType: !126, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !566, line: 242, baseType: !187, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !565, file: !566, line: 243, baseType: !170, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !565, file: !566, line: 243, baseType: !170, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !565, file: !566, line: 244, baseType: !170, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !565, file: !566, line: 244, baseType: !170, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !565, file: !566, line: 245, baseType: !216, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !565, file: !566, line: 246, baseType: !283, size: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !565, file: !566, line: 247, baseType: !170, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !565, file: !566, line: 251, baseType: !170, size: 32, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !565, file: !566, line: 252, baseType: !477, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !565, file: !566, line: 253, baseType: !283, size: 32, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !565, file: !566, line: 254, baseType: !170, size: 32, offset: 544)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !565, file: !566, line: 254, baseType: !170, size: 32, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !565, file: !566, line: 255, baseType: !170, size: 32, offset: 608)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !339, line: 145, baseType: !207, size: 64, offset: 9792)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !338, file: !339, line: 146, baseType: !283, size: 32, offset: 9856)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !338, file: !339, line: 147, baseType: !586, size: 1344, offset: 9920)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !339, line: 140, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 114, size: 1344, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !607, !608, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !587, file: !339, line: 115, baseType: !170, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !587, file: !339, line: 116, baseType: !170, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !587, file: !339, line: 117, baseType: !170, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !587, file: !339, line: 118, baseType: !170, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !587, file: !339, line: 119, baseType: !170, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !587, file: !339, line: 120, baseType: !170, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !587, file: !339, line: 121, baseType: !216, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !587, file: !339, line: 122, baseType: !233, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !587, file: !339, line: 124, baseType: !126, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !339, line: 125, baseType: !187, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !587, file: !339, line: 125, baseType: !187, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !587, file: !339, line: 126, baseType: !187, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !587, file: !339, line: 126, baseType: !187, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !587, file: !339, line: 127, baseType: !603, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !127, line: 339, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !127, line: 339, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !587, file: !339, line: 128, baseType: !603, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !587, file: !339, line: 129, baseType: !609, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !127, line: 341, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !127, line: 351, size: 192, elements: !612)
!612 = !{!613, !614, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !611, file: !127, line: 354, baseType: !64, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !611, file: !127, line: 355, baseType: !64, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !611, file: !127, line: 356, baseType: !64, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !611, file: !127, line: 361, baseType: !64, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !611, file: !127, line: 362, baseType: !105, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !587, file: !339, line: 130, baseType: !170, size: 32, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !587, file: !339, line: 130, baseType: !170, size: 32, offset: 736)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !587, file: !339, line: 131, baseType: !233, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !587, file: !339, line: 131, baseType: !233, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !587, file: !339, line: 132, baseType: !216, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !587, file: !339, line: 132, baseType: !216, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !587, file: !339, line: 133, baseType: !170, size: 32, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !587, file: !339, line: 134, baseType: !216, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !587, file: !339, line: 135, baseType: !170, size: 32, offset: 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !587, file: !339, line: 136, baseType: !283, size: 32, offset: 1184)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !587, file: !339, line: 137, baseType: !283, size: 32, offset: 1216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !587, file: !339, line: 138, baseType: !421, size: 32, offset: 1248)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !587, file: !339, line: 139, baseType: !216, size: 64, offset: 1280)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !338, file: !339, line: 147, baseType: !586, size: 1344, offset: 11264)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !338, file: !339, line: 148, baseType: !283, size: 32, offset: 12608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !338, file: !339, line: 149, baseType: !170, size: 32, offset: 12640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !338, file: !339, line: 150, baseType: !635, size: 32, offset: 12672)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !338, file: !339, line: 157, baseType: !197, size: 64, offset: 12736)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !330, file: !324, line: 16, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!124, !321, !336, !224, !336, !207}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !330, file: !324, line: 17, baseType: !642, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!124, !321, !336, !336, !207}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !330, file: !324, line: 18, baseType: !646, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!124, !321, !336, !649, !649, !207}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !650, line: 16, baseType: !651)
!650 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !650, line: 16, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !330, file: !324, line: 19, baseType: !642, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !330, file: !324, line: 20, baseType: !646, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !330, file: !324, line: 21, baseType: !642, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !330, file: !324, line: 22, baseType: !642, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !330, file: !324, line: 23, baseType: !642, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !330, file: !324, line: 24, baseType: !646, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !330, file: !324, line: 25, baseType: !660, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!124, !321, !336, !649, !649, !649, !207}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !330, file: !324, line: 26, baseType: !664, size: 64, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!124, !321, !336, !649, !207}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !330, file: !324, line: 27, baseType: !646, size: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !330, file: !324, line: 28, baseType: !646, size: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !330, file: !324, line: 29, baseType: !642, size: 64, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !330, file: !324, line: 30, baseType: !671, size: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!124, !321, !170, !207}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !330, file: !324, line: 31, baseType: !675, size: 64, offset: 1024)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!124, !321, !207}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !330, file: !324, line: 32, baseType: !253, size: 64, offset: 1088)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !330, file: !324, line: 35, baseType: !680, size: 64, offset: 1152)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!124, !321, !336, !336}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !330, file: !324, line: 36, baseType: !684, size: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!124, !321}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !330, file: !324, line: 37, baseType: !684, size: 64, offset: 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !330, file: !324, line: 38, baseType: !689, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!124, !321, !134}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !330, file: !324, line: 39, baseType: !693, size: 64, offset: 1408)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!124, !262, !321}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !330, file: !324, line: 40, baseType: !684, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !323, file: !324, line: 47, baseType: !207, size: 64, offset: 6016)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !323, file: !324, line: 48, baseType: !207, size: 64, offset: 6080)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !323, file: !324, line: 49, baseType: !207, size: 64, offset: 6144)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !323, file: !324, line: 50, baseType: !207, size: 64, offset: 6208)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !323, file: !324, line: 51, baseType: !207, size: 64, offset: 6272)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !323, file: !324, line: 52, baseType: !207, size: 64, offset: 6336)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !323, file: !324, line: 53, baseType: !207, size: 64, offset: 6400)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !323, file: !324, line: 54, baseType: !207, size: 64, offset: 6464)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !323, file: !324, line: 55, baseType: !207, size: 64, offset: 6528)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !323, file: !324, line: 56, baseType: !207, size: 64, offset: 6592)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !323, file: !324, line: 57, baseType: !207, size: 64, offset: 6656)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !323, file: !324, line: 58, baseType: !207, size: 64, offset: 6720)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !323, file: !324, line: 59, baseType: !207, size: 64, offset: 6784)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !323, file: !324, line: 60, baseType: !207, size: 64, offset: 6848)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !323, file: !324, line: 61, baseType: !207, size: 64, offset: 6912)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !323, file: !324, line: 62, baseType: !207, size: 64, offset: 6976)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !323, file: !324, line: 63, baseType: !207, size: 64, offset: 7040)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !323, file: !324, line: 65, baseType: !715, size: 640, offset: 7104)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 640, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 10)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !323, file: !324, line: 66, baseType: !719, size: 640, offset: 7744)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 640, elements: !716)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!124, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !323, file: !324, line: 67, baseType: !725, size: 640, offset: 8384)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 640, elements: !716)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !323, file: !324, line: 68, baseType: !170, size: 32, offset: 9024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !323, file: !324, line: 69, baseType: !207, size: 64, offset: 9088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !323, file: !324, line: 70, baseType: !729, size: 32, offset: 9152)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !63, line: 196, baseType: !62)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !323, file: !324, line: 72, baseType: !283, size: 32, offset: 9184)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !324, line: 73, baseType: !207, size: 64, offset: 9216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !323, file: !324, line: 75, baseType: !336, size: 64, offset: 9280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !323, file: !324, line: 76, baseType: !336, size: 64, offset: 9344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !323, file: !324, line: 77, baseType: !336, size: 64, offset: 9408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !323, file: !324, line: 78, baseType: !336, size: 64, offset: 9472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !323, file: !324, line: 79, baseType: !336, size: 64, offset: 9536)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !323, file: !324, line: 80, baseType: !336, size: 64, offset: 9600)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !323, file: !324, line: 81, baseType: !336, size: 64, offset: 9664)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !323, file: !324, line: 82, baseType: !336, size: 64, offset: 9728)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !323, file: !324, line: 83, baseType: !336, size: 64, offset: 9792)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !323, file: !324, line: 84, baseType: !649, size: 64, offset: 9856)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !323, file: !324, line: 85, baseType: !649, size: 64, offset: 9920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !323, file: !324, line: 86, baseType: !649, size: 64, offset: 9984)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !323, file: !324, line: 87, baseType: !336, size: 64, offset: 10048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !323, file: !324, line: 88, baseType: !336, size: 64, offset: 10112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !323, file: !324, line: 89, baseType: !649, size: 64, offset: 10176)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !323, file: !324, line: 90, baseType: !649, size: 64, offset: 10240)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !323, file: !324, line: 91, baseType: !336, size: 64, offset: 10304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !323, file: !324, line: 92, baseType: !170, size: 32, offset: 10368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !323, file: !324, line: 93, baseType: !216, size: 64, offset: 10432)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !323, file: !324, line: 94, baseType: !216, size: 64, offset: 10496)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !323, file: !324, line: 95, baseType: !224, size: 64, offset: 10560)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !323, file: !324, line: 96, baseType: !336, size: 64, offset: 10624)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !323, file: !324, line: 97, baseType: !336, size: 64, offset: 10688)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !323, file: !324, line: 98, baseType: !336, size: 64, offset: 10752)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !323, file: !324, line: 99, baseType: !649, size: 64, offset: 10816)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !323, file: !324, line: 100, baseType: !649, size: 64, offset: 10880)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !323, file: !324, line: 101, baseType: !649, size: 64, offset: 10944)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !323, file: !324, line: 102, baseType: !649, size: 64, offset: 11008)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !323, file: !324, line: 103, baseType: !649, size: 64, offset: 11072)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !323, file: !324, line: 104, baseType: !649, size: 64, offset: 11136)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !323, file: !324, line: 105, baseType: !649, size: 64, offset: 11200)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !323, file: !324, line: 106, baseType: !649, size: 64, offset: 11264)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !323, file: !324, line: 107, baseType: !649, size: 64, offset: 11328)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !323, file: !324, line: 108, baseType: !649, size: 64, offset: 11392)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !323, file: !324, line: 109, baseType: !649, size: 64, offset: 11456)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !323, file: !324, line: 110, baseType: !517, size: 64, offset: 11520)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !323, file: !324, line: 111, baseType: !517, size: 64, offset: 11584)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !323, file: !324, line: 112, baseType: !225, size: 64, offset: 11648)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !323, file: !324, line: 113, baseType: !225, size: 64, offset: 11712)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !323, file: !324, line: 114, baseType: !225, size: 64, offset: 11776)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !323, file: !324, line: 115, baseType: !225, size: 64, offset: 11840)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !323, file: !324, line: 116, baseType: !225, size: 64, offset: 11904)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !323, file: !324, line: 117, baseType: !225, size: 64, offset: 11968)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !323, file: !324, line: 119, baseType: !170, size: 32, offset: 12032)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !323, file: !324, line: 120, baseType: !170, size: 32, offset: 12064)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !323, file: !324, line: 121, baseType: !170, size: 32, offset: 12096)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !323, file: !324, line: 122, baseType: !170, size: 32, offset: 12128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !323, file: !324, line: 123, baseType: !170, size: 32, offset: 12160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !323, file: !324, line: 124, baseType: !170, size: 32, offset: 12192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !323, file: !324, line: 125, baseType: !170, size: 32, offset: 12224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !323, file: !324, line: 126, baseType: !170, size: 32, offset: 12256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !323, file: !324, line: 127, baseType: !170, size: 32, offset: 12288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !323, file: !324, line: 128, baseType: !170, size: 32, offset: 12320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !323, file: !324, line: 129, baseType: !170, size: 32, offset: 12352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !323, file: !324, line: 130, baseType: !170, size: 32, offset: 12384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !323, file: !324, line: 131, baseType: !170, size: 32, offset: 12416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !323, file: !324, line: 132, baseType: !170, size: 32, offset: 12448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !323, file: !324, line: 133, baseType: !170, size: 32, offset: 12480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !323, file: !324, line: 134, baseType: !170, size: 32, offset: 12512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !323, file: !324, line: 135, baseType: !170, size: 32, offset: 12544)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !323, file: !324, line: 137, baseType: !170, size: 32, offset: 12576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !323, file: !324, line: 138, baseType: !170, size: 32, offset: 12608)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !323, file: !324, line: 140, baseType: !795, size: 64, offset: 12672)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !796, line: 5, baseType: !797)
!796 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !796, line: 5, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !323, file: !324, line: 141, baseType: !283, size: 32, offset: 12736)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !323, file: !324, line: 142, baseType: !801, size: 64, offset: 12800)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !802, line: 22, baseType: !803)
!802 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !802, line: 22, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !323, file: !324, line: 143, baseType: !225, size: 64, offset: 12864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !323, file: !324, line: 144, baseType: !225, size: 64, offset: 12928)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !323, file: !324, line: 146, baseType: !225, size: 64, offset: 12992)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !323, file: !324, line: 147, baseType: !225, size: 64, offset: 13056)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !323, file: !324, line: 148, baseType: !225, size: 64, offset: 13120)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !323, file: !324, line: 149, baseType: !225, size: 64, offset: 13184)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !323, file: !324, line: 150, baseType: !225, size: 64, offset: 13248)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !323, file: !324, line: 151, baseType: !225, size: 64, offset: 13312)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !323, file: !324, line: 152, baseType: !225, size: 64, offset: 13376)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !323, file: !324, line: 153, baseType: !283, size: 32, offset: 13440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !323, file: !324, line: 154, baseType: !283, size: 32, offset: 13472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !323, file: !324, line: 155, baseType: !283, size: 32, offset: 13504)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !323, file: !324, line: 156, baseType: !283, size: 32, offset: 13536)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !323, file: !324, line: 157, baseType: !283, size: 32, offset: 13568)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !323, file: !324, line: 158, baseType: !283, size: 32, offset: 13600)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !323, file: !324, line: 159, baseType: !283, size: 32, offset: 13632)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !323, file: !324, line: 160, baseType: !283, size: 32, offset: 13664)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !323, file: !324, line: 161, baseType: !283, size: 32, offset: 13696)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !323, file: !324, line: 162, baseType: !283, size: 32, offset: 13728)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !323, file: !324, line: 163, baseType: !283, size: 32, offset: 13760)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !323, file: !324, line: 164, baseType: !283, size: 32, offset: 13792)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !323, file: !324, line: 165, baseType: !283, size: 32, offset: 13824)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !323, file: !324, line: 166, baseType: !283, size: 32, offset: 13856)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !323, file: !324, line: 167, baseType: !283, size: 32, offset: 13888)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !323, file: !324, line: 168, baseType: !283, size: 32, offset: 13920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !323, file: !324, line: 169, baseType: !283, size: 32, offset: 13952)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !323, file: !324, line: 170, baseType: !283, size: 32, offset: 13984)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !323, file: !324, line: 171, baseType: !283, size: 32, offset: 14016)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !323, file: !324, line: 172, baseType: !283, size: 32, offset: 14048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !323, file: !324, line: 173, baseType: !283, size: 32, offset: 14080)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !323, file: !324, line: 174, baseType: !283, size: 32, offset: 14112)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !323, file: !324, line: 175, baseType: !283, size: 32, offset: 14144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !323, file: !324, line: 177, baseType: !838, size: 32, offset: 14176)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !63, line: 26, baseType: !79)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !323, file: !324, line: 178, baseType: !170, size: 32, offset: 14208)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !323, file: !324, line: 179, baseType: !224, size: 64, offset: 14272)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !323, file: !324, line: 180, baseType: !224, size: 64, offset: 14336)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !323, file: !324, line: 181, baseType: !224, size: 64, offset: 14400)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !323, file: !324, line: 182, baseType: !216, size: 64, offset: 14464)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !323, file: !324, line: 183, baseType: !170, size: 32, offset: 14528)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !323, file: !324, line: 184, baseType: !283, size: 32, offset: 14560)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !323, file: !324, line: 185, baseType: !283, size: 32, offset: 14592)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !318, file: !317, line: 6, baseType: !321, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sub_obj", scope: !318, file: !317, line: 7, baseType: !684, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !317, line: 8, baseType: !850, size: 32, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoALMMType", file: !63, line: 115, baseType: !84)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Pis", scope: !318, file: !317, line: 10, baseType: !561, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Yis", scope: !318, file: !317, line: 10, baseType: !561, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Pscatter", scope: !318, file: !317, line: 11, baseType: !854, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !856, line: 59, baseType: !857)
!856 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !856, line: 15, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !856, line: 15, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Yscatter", scope: !318, file: !317, line: 11, baseType: !854, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Ae", scope: !318, file: !317, line: 13, baseType: !649, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Ai", scope: !318, file: !317, line: 13, baseType: !649, size: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Px", scope: !318, file: !317, line: 14, baseType: !336, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "LgradX", scope: !318, file: !317, line: 14, baseType: !336, size: 64, offset: 704)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Ce", scope: !318, file: !317, line: 14, baseType: !336, size: 64, offset: 768)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Ci", scope: !318, file: !317, line: 14, baseType: !336, size: 64, offset: 832)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !318, file: !317, line: 14, baseType: !336, size: 64, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Ps", scope: !318, file: !317, line: 15, baseType: !336, size: 64, offset: 960)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "LgradS", scope: !318, file: !317, line: 15, baseType: !336, size: 64, offset: 1024)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Yi", scope: !318, file: !317, line: 15, baseType: !336, size: 64, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Ye", scope: !318, file: !317, line: 15, baseType: !336, size: 64, offset: 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Parr", scope: !318, file: !317, line: 16, baseType: !350, size: 64, offset: 1216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !318, file: !317, line: 16, baseType: !336, size: 64, offset: 1280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "PL", scope: !318, file: !317, line: 16, baseType: !336, size: 64, offset: 1344)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "PU", scope: !318, file: !317, line: 16, baseType: !336, size: 64, offset: 1408)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Yarr", scope: !318, file: !317, line: 16, baseType: !350, size: 64, offset: 1472)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !318, file: !317, line: 16, baseType: !336, size: 64, offset: 1536)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !318, file: !317, line: 16, baseType: !336, size: 64, offset: 1600)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !318, file: !317, line: 17, baseType: !336, size: 64, offset: 1664)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Cework", scope: !318, file: !317, line: 17, baseType: !336, size: 64, offset: 1728)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Ciwork", scope: !318, file: !317, line: 17, baseType: !336, size: 64, offset: 1792)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Cizero", scope: !318, file: !317, line: 17, baseType: !336, size: 64, offset: 1856)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Lval", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 1920)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fval", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 1984)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 2048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 2112)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cenorm", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 2176)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "cinorm", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 2240)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm_old", scope: !318, file: !317, line: 19, baseType: !225, size: 64, offset: 2304)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "mu0", scope: !318, file: !317, line: 20, baseType: !225, size: 64, offset: 2368)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !318, file: !317, line: 20, baseType: !225, size: 64, offset: 2432)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "mu_fac", scope: !318, file: !317, line: 20, baseType: !225, size: 64, offset: 2496)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mu_pow_good", scope: !318, file: !317, line: 20, baseType: !225, size: 64, offset: 2560)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mu_pow_bad", scope: !318, file: !317, line: 20, baseType: !225, size: 64, offset: 2624)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ytol0", scope: !318, file: !317, line: 21, baseType: !225, size: 64, offset: 2688)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ytol", scope: !318, file: !317, line: 21, baseType: !225, size: 64, offset: 2752)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gtol0", scope: !318, file: !317, line: 21, baseType: !225, size: 64, offset: 2816)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !318, file: !317, line: 21, baseType: !225, size: 64, offset: 2880)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mu_max", scope: !318, file: !317, line: 22, baseType: !225, size: 64, offset: 2944)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ye_min", scope: !318, file: !317, line: 22, baseType: !225, size: 64, offset: 3008)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "yi_min", scope: !318, file: !317, line: 22, baseType: !225, size: 64, offset: 3072)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ye_max", scope: !318, file: !317, line: 22, baseType: !225, size: 64, offset: 3136)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "yi_max", scope: !318, file: !317, line: 22, baseType: !225, size: 64, offset: 3200)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !318, file: !317, line: 24, baseType: !283, size: 32, offset: 3264)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !101)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!907 = !{i32 7, !"Dwarf Version", i32 4}
!908 = !{i32 2, !"Debug Info Version", i32 3}
!909 = !{i32 1, !"wchar_size", i32 4}
!910 = !{i32 7, !"PIC Level", i32 2}
!911 = !{i32 7, !"uwtable", i32 1}
!912 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!913 = distinct !DISubprogram(name: "TaoCreate_ALMM", scope: !914, file: !914, line: 446, type: !685, scopeLine: 447, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !915)
!914 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/almm/almm.c", directory: "/home/users/ndemeye/xSDK")
!915 = !{!916, !917, !918, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !943, !945, !947, !949, !951}
!916 = !DILocalVariable(name: "tao", arg: 1, scope: !913, file: !914, line: 446, type: !321)
!917 = !DILocalVariable(name: "auglag", scope: !913, file: !914, line: 448, type: !315)
!918 = !DILocalVariable(name: "ierr", scope: !913, file: !914, line: 449, type: !124)
!919 = !DILocalVariable(name: "ierr__", scope: !920, file: !914, line: 452, type: !124)
!920 = distinct !DILexicalBlock(scope: !913, file: !914, line: 452, column: 36)
!921 = !DILocalVariable(name: "ierr__", scope: !922, file: !914, line: 487, type: !124)
!922 = distinct !DILexicalBlock(scope: !913, file: !914, line: 487, column: 74)
!923 = !DILocalVariable(name: "ierr__", scope: !924, file: !914, line: 488, type: !124)
!924 = distinct !DILexicalBlock(scope: !913, file: !914, line: 488, column: 51)
!925 = !DILocalVariable(name: "ierr__", scope: !926, file: !914, line: 489, type: !124)
!926 = distinct !DILexicalBlock(scope: !913, file: !914, line: 489, column: 70)
!927 = !DILocalVariable(name: "ierr__", scope: !928, file: !914, line: 490, type: !124)
!928 = distinct !DILexicalBlock(scope: !913, file: !914, line: 490, column: 59)
!929 = !DILocalVariable(name: "ierr__", scope: !930, file: !914, line: 491, type: !124)
!930 = distinct !DILexicalBlock(scope: !913, file: !914, line: 491, column: 69)
!931 = !DILocalVariable(name: "ierr__", scope: !932, file: !914, line: 492, type: !124)
!932 = distinct !DILexicalBlock(scope: !913, file: !914, line: 492, column: 71)
!933 = !DILocalVariable(name: "ierr__", scope: !934, file: !914, line: 493, type: !124)
!934 = distinct !DILexicalBlock(scope: !913, file: !914, line: 493, column: 71)
!935 = !DILocalVariable(name: "ierr__", scope: !936, file: !914, line: 494, type: !124)
!936 = distinct !DILexicalBlock(scope: !913, file: !914, line: 494, column: 90)
!937 = !DILocalVariable(name: "ierr__", scope: !938, file: !914, line: 496, type: !124)
!938 = distinct !DILexicalBlock(scope: !913, file: !914, line: 496, column: 99)
!939 = !DILocalVariable(name: "ierr__", scope: !940, file: !914, line: 497, type: !124)
!940 = distinct !DILexicalBlock(scope: !913, file: !914, line: 497, column: 99)
!941 = !DILocalVariable(name: "ierr__", scope: !942, file: !914, line: 498, type: !124)
!942 = distinct !DILexicalBlock(scope: !913, file: !914, line: 498, column: 109)
!943 = !DILocalVariable(name: "ierr__", scope: !944, file: !914, line: 499, type: !124)
!944 = distinct !DILexicalBlock(scope: !913, file: !914, line: 499, column: 109)
!945 = !DILocalVariable(name: "ierr__", scope: !946, file: !914, line: 500, type: !124)
!946 = distinct !DILexicalBlock(scope: !913, file: !914, line: 500, column: 113)
!947 = !DILocalVariable(name: "ierr__", scope: !948, file: !914, line: 501, type: !124)
!948 = distinct !DILexicalBlock(scope: !913, file: !914, line: 501, column: 113)
!949 = !DILocalVariable(name: "ierr__", scope: !950, file: !914, line: 502, type: !124)
