; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zoptionsf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/ftn-custom/zoptionsf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscOptions = type opaque
%struct._p_PetscViewer = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!960 = !DILocalVariable(name: "ierr", arg: 3, scope: !949, file: !63, line: 246, type: !72)
!961 = !DILocalVariable(name: "v", scope: !949, file: !63, line: 248, type: !953)
!962 = !DILocation(line: 0, scope: !949)
!963 = !DILocation(line: 250, column: 3, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !63, line: 250, column: 3)
!965 = distinct !DILexicalBlock(scope: !949, file: !63, line: 250, column: 3)
!966 = !{!967, !967, i64 0}
!967 = !{!"long", !88, i64 0}
!968 = !DILocation(line: 250, column: 3, scope: !965)
!969 = !DILocation(line: 250, column: 3, scope: !970)
!970 = distinct !DILexicalBlock(scope: !964, file: !63, line: 250, column: 3)
!971 = !DILocation(line: 250, column: 3, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !63, line: 250, column: 3)
!973 = distinct !DILexicalBlock(scope: !964, file: !63, line: 250, column: 3)
!974 = !DILocation(line: 250, column: 3, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !63, line: 250, column: 3)
!976 = distinct !DILexicalBlock(scope: !973, file: !63, line: 250, column: 3)
!977 = !DILocation(line: 250, column: 3, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !63, line: 250, column: 3)
!979 = distinct !DILexicalBlock(scope: !976, file: !63, line: 250, column: 3)
!980 = !DILocation(line: 250, column: 3, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !63, line: 250, column: 3)
!982 = distinct !DILexicalBlock(scope: !979, file: !63, line: 250, column: 3)
!983 = !DILocation(line: 250, column: 3, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !63, line: 250, column: 3)
!985 = distinct !DILexicalBlock(scope: !982, file: !63, line: 250, column: 3)
!986 = !DILocation(line: 250, column: 3, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !63, line: 250, column: 3)
!988 = distinct !DILexicalBlock(scope: !985, file: !63, line: 250, column: 3)
!989 = !DILocation(line: 250, column: 3, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !63, line: 250, column: 3)
!991 = distinct !DILexicalBlock(scope: !988, file: !63, line: 250, column: 3)
!992 = !DILocation(line: 250, column: 3, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !63, line: 250, column: 3)
!994 = distinct !DILexicalBlock(scope: !991, file: !63, line: 250, column: 3)
!995 = !DILocation(line: 250, column: 3, scope: !996)
!996 = distinct !DILexicalBlock(scope: !997, file: !63, line: 250, column: 3)
!997 = distinct !DILexicalBlock(scope: !994, file: !63, line: 250, column: 3)
!998 = !DILocation(line: 250, column: 3, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !63, line: 250, column: 3)
!1000 = distinct !DILexicalBlock(scope: !997, file: !63, line: 250, column: 3)
!1001 = !DILocation(line: 250, column: 3, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !63, line: 250, column: 3)
!1003 = distinct !DILexicalBlock(scope: !1000, file: !63, line: 250, column: 3)
!1004 = !DILocation(line: 0, scope: !964)
!1005 = !DILocation(line: 251, column: 28, scope: !949)
!1006 = !DILocation(line: 251, column: 11, scope: !949)
!1007 = !DILocation(line: 251, column: 9, scope: !949)
!1008 = !DILocation(line: 252, column: 1, scope: !949)
!1009 = !DISubprogram(name: "PETSC_VIEWER_DRAW_", scope: !1010, file: !1010, line: 285, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1010 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!955, !50}
!1013 = !DISubprogram(name: "PETSC_VIEWER_STDOUT_", scope: !1010, file: !1010, line: 281, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1014 = !DISubprogram(name: "PETSC_VIEWER_STDERR_", scope: !1010, file: !1010, line: 283, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1015 = !DISubprogram(name: "PETSC_VIEWER_BINARY_", scope: !1010, file: !1010, line: 287, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1016 = !DISubprogram(name: "PETSC_VIEWER_SOCKET_", scope: !1010, file: !1010, line: 286, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1017 = !DISubprogram(name: "PetscOptionsView", scope: !13, file: !13, line: 47, type: !1018, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!74, !68, !955}
!1020 = distinct !DISubprogram(name: "petscobjectviewfromoptions_", scope: !63, file: !63, line: 254, type: !1021, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1198)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !1023, !1023, !70, !72, !39}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !1027, line: 73, size: 4480, elements: !1028)
!1027 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!1028 = !{!1029, !1031, !1068, !1069, !1070, !1072, !1073, !1074, !1075, !1083, !1084, !1086, !1090, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1107, !1108, !1110, !1111, !1112, !1114, !1115, !1116, !1117, !1118, !1119, !1121, !1122, !1123, !1124, !1125, !1126, !1128, !1129, !1130, !1140, !1142, !1143, !1147, !1148, !1188, !1193, !1195, !1196, !1197}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !1026, file: !1027, line: 74, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !74)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !1026, file: !1027, line: 75, baseType: !1032, size: 448, offset: 64)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 448, elements: !1066)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !1027, line: 53, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 45, size: 448, elements: !1035)
!1035 = !{!1036, !1041, !1045, !1049, !1053, !1057, !1061}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !1034, file: !1027, line: 46, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!73, !1024, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1034, file: !1027, line: 47, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!73, !1024, !953}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1034, file: !1027, line: 48, baseType: !1046, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!73, !1023}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !1034, file: !1027, line: 49, baseType: !1050, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!73, !1024, !118, !1024}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !1034, file: !1027, line: 50, baseType: !1054, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!73, !1024, !118, !1023}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !1034, file: !1027, line: 51, baseType: !1058, size: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!73, !1024, !118, !53}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !1034, file: !1027, line: 52, baseType: !1062, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!73, !1024, !118, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!1066 = !{!1067}
!1067 = !DISubrange(count: 1)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1026, file: !1027, line: 76, baseType: !48, size: 64, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1026, file: !1027, line: 77, baseType: !344, size: 32, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !1026, file: !1027, line: 78, baseType: !1071, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !557)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1026, file: !1027, line: 78, baseType: !1071, size: 64, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1026, file: !1027, line: 78, baseType: !1071, size: 64, offset: 768)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !1026, file: !1027, line: 78, baseType: !1071, size: 64, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1026, file: !1027, line: 79, baseType: !1076, size: 64, offset: 896)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1079, line: 27, baseType: !1080)
!1079 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !1081, line: 43, baseType: !1082)
!1081 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1082 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !1026, file: !1027, line: 80, baseType: !344, size: 32, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1026, file: !1027, line: 81, baseType: !1085, size: 32, offset: 992)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !74)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !1026, file: !1027, line: 82, baseType: !1087, size: 64, offset: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !1026, file: !1027, line: 83, baseType: !1091, size: 64, offset: 1088)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1026, file: !1027, line: 84, baseType: !70, size: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1026, file: !1027, line: 85, baseType: !70, size: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !1026, file: !1027, line: 86, baseType: !70, size: 64, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !1026, file: !1027, line: 87, baseType: !70, size: 64, offset: 1344)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1026, file: !1027, line: 88, baseType: !1024, size: 64, offset: 1408)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !1026, file: !1027, line: 89, baseType: !1076, size: 64, offset: 1472)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !1027, line: 90, baseType: !70, size: 64, offset: 1536)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1026, file: !1027, line: 91, baseType: !70, size: 64, offset: 1600)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !1026, file: !1027, line: 92, baseType: !344, size: 32, offset: 1664)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !1026, file: !1027, line: 93, baseType: !42, size: 64, offset: 1728)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1026, file: !1027, line: 94, baseType: !1105, size: 64, offset: 1792)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !1077)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !1026, file: !1027, line: 95, baseType: !344, size: 32, offset: 1856)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !1026, file: !1027, line: 95, baseType: !344, size: 32, offset: 1888)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !1026, file: !1027, line: 96, baseType: !1109, size: 64, offset: 1920)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !1026, file: !1027, line: 96, baseType: !1109, size: 64, offset: 1984)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !1026, file: !1027, line: 97, baseType: !343, size: 64, offset: 2048)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !1026, file: !1027, line: 97, baseType: !1113, size: 64, offset: 2112)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !1026, file: !1027, line: 98, baseType: !344, size: 32, offset: 2176)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !1026, file: !1027, line: 98, baseType: !344, size: 32, offset: 2208)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !1026, file: !1027, line: 99, baseType: !1109, size: 64, offset: 2240)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !1026, file: !1027, line: 99, baseType: !1109, size: 64, offset: 2304)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !1026, file: !1027, line: 100, baseType: !555, size: 64, offset: 2368)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !1026, file: !1027, line: 100, baseType: !1120, size: 64, offset: 2432)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !1026, file: !1027, line: 101, baseType: !344, size: 32, offset: 2496)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !1026, file: !1027, line: 101, baseType: !344, size: 32, offset: 2528)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !1026, file: !1027, line: 102, baseType: !1109, size: 64, offset: 2560)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !1026, file: !1027, line: 102, baseType: !1109, size: 64, offset: 2624)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !1026, file: !1027, line: 103, baseType: !627, size: 64, offset: 2688)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !1026, file: !1027, line: 103, baseType: !1127, size: 64, offset: 2752)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !1026, file: !1027, line: 104, baseType: !1065, size: 64, offset: 2816)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !1026, file: !1027, line: 105, baseType: !344, size: 32, offset: 2880)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !1026, file: !1027, line: 106, baseType: !1131, size: 128, offset: 2944)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 128, elements: !1138)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !1027, line: 64, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 61, size: 128, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1134, file: !1027, line: 62, baseType: !53, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1134, file: !1027, line: 63, baseType: !42, size: 64, offset: 64)
!1138 = !{!1139}
!1139 = !DISubrange(count: 2)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !1026, file: !1027, line: 107, baseType: !1141, size: 64, offset: 3072)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !1138)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !1026, file: !1027, line: 108, baseType: !42, size: 64, offset: 3136)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !1026, file: !1027, line: 109, baseType: !1144, size: 64, offset: 3200)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!73, !42}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !1026, file: !1027, line: 111, baseType: !344, size: 32, offset: 3264)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !1026, file: !1027, line: 112, baseType: !1149, size: 320, offset: 3328)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 320, elements: !1186)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!73, !1153, !1024, !42}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !13, line: 108, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !13, line: 99, size: 640, elements: !1156)
!1156 = !{!1157, !1158, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1155, file: !13, line: 100, baseType: !344, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !13, line: 101, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !13, line: 82, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !13, line: 83, size: 768, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1175, !1176}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1161, file: !13, line: 84, baseType: !70, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1161, file: !13, line: 85, baseType: !70, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !13, line: 86, baseType: !42, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !1161, file: !13, line: 87, baseType: !1087, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1161, file: !13, line: 88, baseType: !413, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !1161, file: !13, line: 89, baseType: !71, size: 8, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !1161, file: !13, line: 90, baseType: !70, size: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !1161, file: !13, line: 91, baseType: !39, size: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1161, file: !13, line: 92, baseType: !132, size: 32, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1161, file: !13, line: 93, baseType: !1173, size: 32, offset: 544)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !13, line: 81, baseType: !12)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1161, file: !13, line: 94, baseType: !1159, size: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !1161, file: !13, line: 95, baseType: !70, size: 64, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1161, file: !13, line: 96, baseType: !42, size: 64, offset: 704)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1155, file: !13, line: 102, baseType: !70, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !1155, file: !13, line: 102, baseType: !70, size: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !1155, file: !13, line: 103, baseType: !70, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1155, file: !13, line: 104, baseType: !48, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !1155, file: !13, line: 105, baseType: !132, size: 32, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !1155, file: !13, line: 105, baseType: !132, size: 32, offset: 416)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !1155, file: !13, line: 105, baseType: !132, size: 32, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1155, file: !13, line: 106, baseType: !1024, size: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1155, file: !13, line: 107, baseType: !67, size: 64, offset: 576)
!1186 = !{!1187}
!1187 = !DISubrange(count: 5)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !1026, file: !1027, line: 113, baseType: !1189, size: 320, offset: 3648)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1190, size: 320, elements: !1186)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!73, !1024, !42}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !1026, file: !1027, line: 114, baseType: !1194, size: 320, offset: 3968)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, elements: !1186)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !1026, file: !1027, line: 115, baseType: !132, size: 32, offset: 4288)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1026, file: !1027, line: 120, baseType: !67, size: 64, offset: 4352)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !1026, file: !1027, line: 121, baseType: !132, size: 32, offset: 4416)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204}
!1199 = !DILocalVariable(name: "obj", arg: 1, scope: !1020, file: !63, line: 254, type: !1023)
!1200 = !DILocalVariable(name: "bobj", arg: 2, scope: !1020, file: !63, line: 254, type: !1023)
!1201 = !DILocalVariable(name: "option", arg: 3, scope: !1020, file: !63, line: 254, type: !70)
!1202 = !DILocalVariable(name: "ierr", arg: 4, scope: !1020, file: !63, line: 254, type: !72)
!1203 = !DILocalVariable(name: "loption", arg: 5, scope: !1020, file: !63, line: 254, type: !39)
!1204 = !DILocalVariable(name: "o", scope: !1020, file: !63, line: 256, type: !70)
!1205 = !DILocation(line: 0, scope: !1020)
!1206 = !DILocation(line: 256, column: 3, scope: !1020)
!1207 = !DILocation(line: 258, column: 3, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !63, line: 258, column: 3)
!1209 = distinct !DILexicalBlock(scope: !1020, file: !63, line: 258, column: 3)
!1210 = !DILocation(line: 258, column: 3, scope: !1209)
!1211 = !DILocation(line: 258, column: 3, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !63, line: 258, column: 3)
!1213 = !DILocation(line: 258, column: 3, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1208, file: !63, line: 258, column: 3)
!1215 = distinct !{!1215, !1213, !1213, !97}
!1216 = !DILocation(line: 258, column: 3, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1214, file: !63, line: 258, column: 3)
!1218 = !DILocation(line: 258, column: 3, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !63, line: 258, column: 3)
!1220 = !DILocation(line: 259, column: 3, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !63, line: 259, column: 3)
!1222 = distinct !DILexicalBlock(scope: !1020, file: !63, line: 259, column: 3)
!1223 = !DILocation(line: 259, column: 3, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1221, file: !63, line: 259, column: 3)
!1225 = !DILocation(line: 260, column: 38, scope: !1020)
!1226 = !DILocation(line: 260, column: 44, scope: !1020)
!1227 = !DILocation(line: 260, column: 51, scope: !1020)
!1228 = !DILocation(line: 260, column: 11, scope: !1020)
!1229 = !DILocation(line: 260, column: 9, scope: !1020)
!1230 = !DILocation(line: 260, column: 58, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1020, file: !63, line: 260, column: 58)
!1232 = !DILocation(line: 260, column: 58, scope: !1020)
!1233 = !DILocation(line: 261, column: 3, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1020, file: !63, line: 261, column: 3)
!1235 = !DILocation(line: 262, column: 1, scope: !1020)
!1236 = !DISubprogram(name: "PetscError", scope: !28, file: !28, line: 668, type: !1237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!73, !50, !74, !118, !118, !74, !27, !118, null}
!1239 = !DISubprogram(name: "PetscObjectViewFromOptions", scope: !115, file: !115, line: 1503, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!74, !1025, !1025, !118}
!1242 = distinct !DISubprogram(name: "petscsubcommgetparent_", scope: !63, file: !63, line: 264, type: !1243, scopeLine: 265, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1260)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !1245, !130, !130}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcomm", file: !4, line: 656, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSubcomm", file: !115, line: 2653, size: 448, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1257, !1259}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1248, file: !115, line: 2654, baseType: !48, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "dupparent", scope: !1248, file: !115, line: 2655, baseType: !48, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !1248, file: !115, line: 2656, baseType: !48, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1248, file: !115, line: 2657, baseType: !1085, size: 32, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1248, file: !115, line: 2658, baseType: !1085, size: 32, offset: 224)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1248, file: !115, line: 2659, baseType: !1256, size: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1248, file: !115, line: 2660, baseType: !1258, size: 32, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcommType", file: !4, line: 657, baseType: !33)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "subcommprefix", scope: !1248, file: !115, line: 2661, baseType: !70, size: 64, offset: 384)
!1260 = !{!1261, !1262, !1263, !1264}
!1261 = !DILocalVariable(name: "scomm", arg: 1, scope: !1242, file: !63, line: 264, type: !1245)
!1262 = !DILocalVariable(name: "pcomm", arg: 2, scope: !1242, file: !63, line: 264, type: !130)
!1263 = !DILocalVariable(name: "ierr", arg: 3, scope: !1242, file: !63, line: 264, type: !130)
!1264 = !DILocalVariable(name: "tcomm", scope: !1242, file: !63, line: 266, type: !48)
!1265 = !DILocation(line: 0, scope: !1242)
!1266 = !DILocation(line: 266, column: 3, scope: !1242)
!1267 = !DILocation(line: 267, column: 33, scope: !1242)
!1268 = !DILocation(line: 267, column: 11, scope: !1242)
!1269 = !DILocation(line: 267, column: 9, scope: !1242)
!1270 = !DILocation(line: 268, column: 25, scope: !1242)
!1271 = !DILocation(line: 268, column: 12, scope: !1242)
!1272 = !DILocation(line: 268, column: 10, scope: !1242)
!1273 = !DILocation(line: 269, column: 1, scope: !1242)
!1274 = !DISubprogram(name: "PetscSubcommGetParent", scope: !115, file: !115, line: 2675, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!74, !1247, !1277}
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!1278 = !DISubprogram(name: "MPI_Comm_c2f", scope: !49, file: !49, line: 1275, type: !1279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!74, !50}
!1281 = distinct !DISubprogram(name: "petscsubcommgetcontiguousparent_", scope: !63, file: !63, line: 271, type: !1243, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1282)
!1282 = !{!1283, !1284, !1285, !1286}
!1283 = !DILocalVariable(name: "scomm", arg: 1, scope: !1281, file: !63, line: 271, type: !1245)
!1284 = !DILocalVariable(name: "pcomm", arg: 2, scope: !1281, file: !63, line: 271, type: !130)
!1285 = !DILocalVariable(name: "ierr", arg: 3, scope: !1281, file: !63, line: 271, type: !130)
!1286 = !DILocalVariable(name: "tcomm", scope: !1281, file: !63, line: 273, type: !48)
!1287 = !DILocation(line: 0, scope: !1281)
!1288 = !DILocation(line: 273, column: 3, scope: !1281)
!1289 = !DILocation(line: 274, column: 43, scope: !1281)
!1290 = !DILocation(line: 274, column: 11, scope: !1281)
!1291 = !DILocation(line: 274, column: 9, scope: !1281)
!1292 = !DILocation(line: 275, column: 25, scope: !1281)
!1293 = !DILocation(line: 275, column: 12, scope: !1281)
!1294 = !DILocation(line: 275, column: 10, scope: !1281)
!1295 = !DILocation(line: 276, column: 1, scope: !1281)
!1296 = !DISubprogram(name: "PetscSubcommGetContiguousParent", scope: !115, file: !115, line: 2676, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !120)
!1297 = distinct !DISubprogram(name: "petscsubcommgetchild_", scope: !63, file: !63, line: 278, type: !1243, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1298)
!1298 = !{!1299, !1300, !1301, !1302}
!1299 = !DILocalVariable(name: "scomm", arg: 1, scope: !1297, file: !63, line: 278, type: !1245)
!1300 = !DILocalVariable(name: "ccomm", arg: 2, scope: !1297, file: !63, line: 278, type: !130)
!1301 = !DILocalVariable(name: "ierr", arg: 3, scope: !1297, file: !63, line: 278, type: !130)
!1302 = !DILocalVariable(name: "tcomm", scope: !1297, file: !63, line: 280, type: !48)
!1303 = !DILocation(line: 0, scope: !1297)
!1304 = !DILocation(line: 280, column: 3, scope: !1297)
!1305 = !DILocation(line: 281, column: 32, scope: !1297)
!1306 = !DILocation(line: 281, column: 11, scope: !1297)
!1307 = !DILocation(line: 281, column: 9, scope: !1297)
!1308 = !DILocation(line: 282, column: 25, scope: !1297)
!1309 = !DILocation(line: 282, column: 12, scope: !1297)
