; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/bandwidth.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/bandwidth.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !325, !326, !401, !529, !532, !411, !72, !361, !5}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !322, line: 330, baseType: !323)
!322 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !322, line: 330, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !329, line: 73, size: 4480, elements: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!330 = !{!331, !333, !382, !383, !385, !388, !389, !390, !391, !399, !400, !402, !406, !410, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !423, !424, !425, !427, !428, !430, !432, !433, !434, !435, !436, !439, !441, !442, !443, !444, !445, !448, !450, !451, !452, !462, !464, !465, !469, !470, !519, !524, !526, !527, !528}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !328, file: !329, line: 74, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !328, file: !329, line: 75, baseType: !334, size: 448, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 448, elements: !380)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !329, line: 53, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 45, size: 448, elements: !337)
!337 = !{!338, !344, !352, !357, !364, !368, !375}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !336, file: !329, line: 46, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !326, !343}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !329, line: 47, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!342, !326, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !349, line: 16, baseType: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !349, line: 16, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !329, line: 48, baseType: !353, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!342, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !336, file: !329, line: 49, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!342, !326, !361, !326}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !336, file: !329, line: 50, baseType: !365, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!342, !326, !361, !356}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !336, file: !329, line: 51, baseType: !369, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!342, !326, !361, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !336, file: !329, line: 52, baseType: !376, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!342, !326, !361, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!380 = !{!381}
!381 = !DISubrange(count: 1)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !328, file: !329, line: 76, baseType: !321, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !329, line: 77, baseType: !384, size: 32, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !328, file: !329, line: 78, baseType: !386, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !387)
!387 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !328, file: !329, line: 78, baseType: !386, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !328, file: !329, line: 78, baseType: !386, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !328, file: !329, line: 78, baseType: !386, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !329, line: 79, baseType: !392, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !395, line: 27, baseType: !396)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !397, line: 43, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!398 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !328, file: !329, line: 80, baseType: !384, size: 32, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !328, file: !329, line: 81, baseType: !401, size: 32, offset: 992)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !328, file: !329, line: 82, baseType: !403, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !328, file: !329, line: 83, baseType: !407, size: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !328, file: !329, line: 84, baseType: !411, size: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !328, file: !329, line: 85, baseType: !411, size: 64, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !328, file: !329, line: 86, baseType: !411, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !328, file: !329, line: 87, baseType: !411, size: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !328, file: !329, line: 88, baseType: !326, size: 64, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !328, file: !329, line: 89, baseType: !392, size: 64, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 90, baseType: !411, size: 64, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !328, file: !329, line: 91, baseType: !411, size: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !328, file: !329, line: 92, baseType: !384, size: 32, offset: 1664)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !328, file: !329, line: 93, baseType: !325, size: 64, offset: 1728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !329, line: 94, baseType: !422, size: 64, offset: 1792)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !393)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !328, file: !329, line: 95, baseType: !384, size: 32, offset: 1856)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !328, file: !329, line: 95, baseType: !384, size: 32, offset: 1888)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !328, file: !329, line: 96, baseType: !426, size: 64, offset: 1920)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !328, file: !329, line: 96, baseType: !426, size: 64, offset: 1984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !328, file: !329, line: 97, baseType: !429, size: 64, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !328, file: !329, line: 97, baseType: !431, size: 64, offset: 2112)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !328, file: !329, line: 98, baseType: !384, size: 32, offset: 2176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !328, file: !329, line: 98, baseType: !384, size: 32, offset: 2208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !328, file: !329, line: 99, baseType: !426, size: 64, offset: 2240)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !328, file: !329, line: 99, baseType: !426, size: 64, offset: 2304)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !328, file: !329, line: 100, baseType: !437, size: 64, offset: 2368)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !387)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !328, file: !329, line: 100, baseType: !440, size: 64, offset: 2432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !328, file: !329, line: 101, baseType: !384, size: 32, offset: 2496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !328, file: !329, line: 101, baseType: !384, size: 32, offset: 2528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !328, file: !329, line: 102, baseType: !426, size: 64, offset: 2560)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !328, file: !329, line: 102, baseType: !426, size: 64, offset: 2624)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !328, file: !329, line: 103, baseType: !446, size: 64, offset: 2688)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !438)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !328, file: !329, line: 103, baseType: !449, size: 64, offset: 2752)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !328, file: !329, line: 104, baseType: !379, size: 64, offset: 2816)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !328, file: !329, line: 105, baseType: !384, size: 32, offset: 2880)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !328, file: !329, line: 106, baseType: !453, size: 128, offset: 2944)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !460)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !329, line: 64, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 61, size: 128, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !456, file: !329, line: 62, baseType: !372, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !456, file: !329, line: 63, baseType: !325, size: 64, offset: 64)
!460 = !{!461}
!461 = !DISubrange(count: 2)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !328, file: !329, line: 107, baseType: !463, size: 64, offset: 3072)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !460)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !328, file: !329, line: 108, baseType: !325, size: 64, offset: 3136)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !328, file: !329, line: 109, baseType: !466, size: 64, offset: 3200)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!342, !325}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !328, file: !329, line: 111, baseType: !384, size: 32, offset: 3264)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !328, file: !329, line: 112, baseType: !471, size: 320, offset: 3328)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 320, elements: !517)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!342, !475, !326, !325}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !478)
!478 = !{!479, !480, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !477, file: !10, line: 100, baseType: !384, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !10, line: 101, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !492, !493, !494, !498, !500, !502, !503, !504}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !483, file: !10, line: 84, baseType: !411, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !483, file: !10, line: 85, baseType: !411, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !10, line: 86, baseType: !325, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !483, file: !10, line: 87, baseType: !403, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !483, file: !10, line: 88, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !483, file: !10, line: 89, baseType: !363, size: 8, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !483, file: !10, line: 90, baseType: !411, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !483, file: !10, line: 91, baseType: !495, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !496, line: 46, baseType: !497)
!496 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!497 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !483, file: !10, line: 92, baseType: !499, size: 32, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !10, line: 93, baseType: !501, size: 32, offset: 544)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 94, baseType: !481, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !483, file: !10, line: 95, baseType: !411, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !483, file: !10, line: 96, baseType: !325, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !477, file: !10, line: 102, baseType: !411, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !477, file: !10, line: 102, baseType: !411, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !477, file: !10, line: 103, baseType: !411, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !477, file: !10, line: 104, baseType: !321, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !477, file: !10, line: 106, baseType: !326, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !477, file: !10, line: 107, baseType: !514, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!517 = !{!518}
!518 = !DISubrange(count: 5)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !328, file: !329, line: 113, baseType: !520, size: 320, offset: 3648)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !517)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!342, !326, !325}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !328, file: !329, line: 114, baseType: !525, size: 320, offset: 3968)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 320, elements: !517)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !328, file: !329, line: 115, baseType: !499, size: 32, offset: 4288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !328, file: !329, line: 120, baseType: !514, size: 64, offset: 4352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !328, file: !329, line: 121, baseType: !499, size: 32, offset: 4416)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !322, line: 331, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !322, line: 331, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !322, line: 338, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !322, line: 338, flags: DIFlagFwdDecl)
!535 = !{i32 7, !"Dwarf Version", i32 4}
!536 = !{i32 2, !"Debug Info Version", i32 3}
!537 = !{i32 1, !"wchar_size", i32 4}
!538 = !{i32 7, !"PIC Level", i32 2}
!539 = !{i32 7, !"uwtable", i32 1}
!540 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!541 = distinct !DISubprogram(name: "MatComputeBandwidth", scope: !542, file: !542, line: 19, type: !543, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1313)
!542 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/bandwidth.c", directory: "/home/users/ndemeye/xSDK")
!543 = !DISubroutineType(types: !544)
!544 = !{!342, !545, !438, !429}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !548, line: 436, size: 23424, elements: !549)
!548 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!549 = !{!550, !552, !1059, !1079, !1080, !1081, !1083, !1084, !1085, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1209, !1210, !1226, !1227, !1228, !1229, !1230, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1265, !1285, !1286, !1288, !1289, !1290, !1291, !1292, !1293, !1311, !1312}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !547, file: !548, line: 437, baseType: !551, size: 4480)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !329, line: 122, baseType: !328)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !547, file: !548, line: 437, baseType: !553, size: 9472, offset: 4480)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 9472, elements: !380)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !548, line: 32, size: 9472, elements: !555)
!555 = !{!556, !565, !569, !570, !577, !581, !582, !583, !584, !585, !586, !587, !611, !615, !620, !626, !645, !650, !654, !655, !660, !665, !666, !671, !675, !679, !683, !687, !691, !692, !693, !694, !695, !699, !700, !705, !706, !707, !708, !709, !714, !721, !726, !730, !734, !738, !742, !743, !747, !748, !755, !760, !761, !762, !763, !825, !833, !834, !838, !839, !843, !844, !848, !853, !854, !858, !862, !869, !870, !871, !872, !873, !874, !879, !880, !884, !888, !892, !893, !894, !898, !908, !909, !913, !914, !918, !919, !923, !924, !929, !930, !934, !938, !939, !940, !941, !942, !943, !944, !948, !949, !950, !951, !952, !953, !957, !958, !959, !960, !961, !962, !963, !964, !968, !972, !973, !974, !978, !979, !980, !981, !982, !983, !984, !988, !989, !990, !995, !999, !1000, !1004, !1005, !1006, !1007, !1033, !1037, !1038, !1039, !1040, !1041, !1045, !1046, !1047, !1048, !1049, !1053, !1057, !1058}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !554, file: !548, line: 34, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!342, !545, !384, !560, !384, !560, !562, !564}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !554, file: !548, line: 35, baseType: !566, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!342, !545, !384, !429, !431, !449}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !554, file: !548, line: 36, baseType: !566, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !554, file: !548, line: 37, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!342, !545, !574, !574}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !554, file: !548, line: 38, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!342, !545, !574, !574, !574}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !554, file: !548, line: 40, baseType: !571, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !554, file: !548, line: 41, baseType: !578, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !554, file: !548, line: 42, baseType: !571, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !554, file: !548, line: 43, baseType: !578, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !554, file: !548, line: 44, baseType: !571, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !554, file: !548, line: 46, baseType: !578, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !554, file: !548, line: 47, baseType: !588, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!342, !545, !591, !591, !595}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !592, line: 11, baseType: !593)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !592, line: 11, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !598, file: !36, line: 1227, baseType: !438, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !598, file: !36, line: 1228, baseType: !438, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !598, file: !36, line: 1229, baseType: !438, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !598, file: !36, line: 1230, baseType: !438, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !598, file: !36, line: 1231, baseType: !438, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !598, file: !36, line: 1232, baseType: !438, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !598, file: !36, line: 1233, baseType: !438, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !598, file: !36, line: 1234, baseType: !438, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !598, file: !36, line: 1236, baseType: !438, size: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !598, file: !36, line: 1237, baseType: !438, size: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !598, file: !36, line: 1238, baseType: !438, size: 64, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !554, file: !548, line: 48, baseType: !612, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!342, !545, !591, !595}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !554, file: !548, line: 49, baseType: !616, size: 64, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!342, !545, !574, !438, !619, !438, !384, !384, !574}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !554, file: !548, line: 50, baseType: !621, size: 64, offset: 896)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!342, !545, !624, !625}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !554, file: !548, line: 52, baseType: !627, size: 64, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!342, !545, !630, !631}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !633, file: !36, line: 593, baseType: !386, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !633, file: !36, line: 594, baseType: !386, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !633, file: !36, line: 594, baseType: !386, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !633, file: !36, line: 594, baseType: !386, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !633, file: !36, line: 595, baseType: !386, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !633, file: !36, line: 596, baseType: !386, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !633, file: !36, line: 597, baseType: !386, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !633, file: !36, line: 598, baseType: !386, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !633, file: !36, line: 598, baseType: !386, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !633, file: !36, line: 599, baseType: !386, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !554, file: !548, line: 53, baseType: !646, size: 64, offset: 1024)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!342, !545, !545, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !554, file: !548, line: 54, baseType: !651, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!342, !545, !574}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !554, file: !548, line: 55, baseType: !571, size: 64, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !554, file: !548, line: 56, baseType: !656, size: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!342, !545, !659, !437}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !554, file: !548, line: 58, baseType: !661, size: 64, offset: 1280)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!342, !545, !664}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !554, file: !548, line: 59, baseType: !661, size: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !554, file: !548, line: 60, baseType: !667, size: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!342, !545, !670, !499}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !554, file: !548, line: 61, baseType: !672, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!342, !545}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !554, file: !548, line: 63, baseType: !676, size: 64, offset: 1536)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!342, !545, !384, !560, !447, !574, !574}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !554, file: !548, line: 64, baseType: !680, size: 64, offset: 1600)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!342, !545, !545, !591, !591, !595}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !554, file: !548, line: 65, baseType: !684, size: 64, offset: 1664)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!342, !545, !545, !595}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !554, file: !548, line: 66, baseType: !688, size: 64, offset: 1728)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!342, !545, !545, !591, !595}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !554, file: !548, line: 67, baseType: !684, size: 64, offset: 1792)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !554, file: !548, line: 69, baseType: !672, size: 64, offset: 1856)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !554, file: !548, line: 70, baseType: !680, size: 64, offset: 1920)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !554, file: !548, line: 71, baseType: !688, size: 64, offset: 1984)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !554, file: !548, line: 72, baseType: !696, size: 64, offset: 2048)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!342, !545, !625}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !554, file: !548, line: 73, baseType: !672, size: 64, offset: 2112)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !554, file: !548, line: 75, baseType: !701, size: 64, offset: 2176)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!342, !545, !704, !625}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !554, file: !548, line: 76, baseType: !571, size: 64, offset: 2240)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !554, file: !548, line: 77, baseType: !571, size: 64, offset: 2304)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !554, file: !548, line: 78, baseType: !588, size: 64, offset: 2368)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !554, file: !548, line: 79, baseType: !612, size: 64, offset: 2432)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !554, file: !548, line: 81, baseType: !710, size: 64, offset: 2496)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!342, !545, !447, !545, !713}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !554, file: !548, line: 82, baseType: !715, size: 64, offset: 2560)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!342, !545, !384, !718, !718, !624, !720}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !554, file: !548, line: 83, baseType: !722, size: 64, offset: 2624)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!342, !545, !384, !725, !384}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !554, file: !548, line: 84, baseType: !727, size: 64, offset: 2688)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!342, !545, !384, !560, !384, !560, !446}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !554, file: !548, line: 85, baseType: !731, size: 64, offset: 2752)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!342, !545, !545, !713}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !554, file: !548, line: 87, baseType: !735, size: 64, offset: 2816)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!342, !545, !574, !429}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !554, file: !548, line: 88, baseType: !739, size: 64, offset: 2880)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!342, !545, !447}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !554, file: !548, line: 89, baseType: !739, size: 64, offset: 2944)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !554, file: !548, line: 90, baseType: !744, size: 64, offset: 3008)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!342, !545, !574, !564}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !554, file: !548, line: 91, baseType: !676, size: 64, offset: 3072)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !554, file: !548, line: 93, baseType: !749, size: 64, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!342, !545, !752}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !554, file: !548, line: 94, baseType: !756, size: 64, offset: 3200)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!342, !545, !384, !499, !499, !429, !759, !759, !649}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !554, file: !548, line: 95, baseType: !756, size: 64, offset: 3264)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !554, file: !548, line: 96, baseType: !756, size: 64, offset: 3328)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !554, file: !548, line: 97, baseType: !756, size: 64, offset: 3392)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !554, file: !548, line: 99, baseType: !764, size: 64, offset: 3456)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!342, !545, !767, !770}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !592, line: 51, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !592, line: 51, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !548, line: 609, size: 6208, elements: !773)
!773 = !{!774, !775, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !794, !801, !802, !803, !804, !805, !806, !807, !808, !812, !813, !814, !815, !816, !818, !819, !820, !821, !822, !823, !824}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !772, file: !548, line: 610, baseType: !551, size: 4480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !772, file: !548, line: 610, baseType: !776, size: 32, offset: 4480)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !380)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !772, file: !548, line: 611, baseType: !384, size: 32, offset: 4512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !772, file: !548, line: 611, baseType: !384, size: 32, offset: 4544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !772, file: !548, line: 611, baseType: !384, size: 32, offset: 4576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !772, file: !548, line: 612, baseType: !384, size: 32, offset: 4608)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !772, file: !548, line: 613, baseType: !384, size: 32, offset: 4640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !772, file: !548, line: 614, baseType: !429, size: 64, offset: 4672)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !772, file: !548, line: 615, baseType: !431, size: 64, offset: 4736)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !772, file: !548, line: 616, baseType: !725, size: 64, offset: 4800)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !772, file: !548, line: 617, baseType: !429, size: 64, offset: 4864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !772, file: !548, line: 618, baseType: !787, size: 64, offset: 4928)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !548, line: 602, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 598, size: 128, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !789, file: !548, line: 599, baseType: !384, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !789, file: !548, line: 600, baseType: !384, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !789, file: !548, line: 601, baseType: !446, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !772, file: !548, line: 619, baseType: !795, size: 64, offset: 4992)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !548, line: 607, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 604, size: 128, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !797, file: !548, line: 605, baseType: !384, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !797, file: !548, line: 606, baseType: !446, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !772, file: !548, line: 620, baseType: !446, size: 64, offset: 5056)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !772, file: !548, line: 621, baseType: !438, size: 64, offset: 5120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !772, file: !548, line: 622, baseType: !438, size: 64, offset: 5184)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !772, file: !548, line: 623, baseType: !574, size: 64, offset: 5248)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !772, file: !548, line: 623, baseType: !574, size: 64, offset: 5312)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !772, file: !548, line: 623, baseType: !574, size: 64, offset: 5376)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !772, file: !548, line: 624, baseType: !499, size: 32, offset: 5440)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !772, file: !548, line: 625, baseType: !809, size: 64, offset: 5504)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!342}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !772, file: !548, line: 626, baseType: !325, size: 64, offset: 5568)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !772, file: !548, line: 627, baseType: !574, size: 64, offset: 5632)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !772, file: !548, line: 628, baseType: !384, size: 32, offset: 5696)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !772, file: !548, line: 629, baseType: !361, size: 64, offset: 5760)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !772, file: !548, line: 630, baseType: !817, size: 32, offset: 5824)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !772, file: !548, line: 631, baseType: !384, size: 32, offset: 5856)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !772, file: !548, line: 631, baseType: !384, size: 32, offset: 5888)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !772, file: !548, line: 632, baseType: !499, size: 32, offset: 5920)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !772, file: !548, line: 633, baseType: !499, size: 32, offset: 5952)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !772, file: !548, line: 634, baseType: !372, size: 64, offset: 6016)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !772, file: !548, line: 634, baseType: !325, size: 64, offset: 6080)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !772, file: !548, line: 635, baseType: !392, size: 64, offset: 6144)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !554, file: !548, line: 100, baseType: !826, size: 64, offset: 3520)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!342, !545, !384, !384, !829, !832}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !831)
!831 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !554, file: !548, line: 101, baseType: !672, size: 64, offset: 3584)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !554, file: !548, line: 102, baseType: !835, size: 64, offset: 3648)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!342, !545, !591, !591, !625}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !554, file: !548, line: 103, baseType: !557, size: 64, offset: 3712)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !554, file: !548, line: 105, baseType: !840, size: 64, offset: 3776)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!342, !545, !591, !591, !624, !625}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !554, file: !548, line: 106, baseType: !672, size: 64, offset: 3840)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !554, file: !548, line: 107, baseType: !845, size: 64, offset: 3904)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!342, !545, !348}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !554, file: !548, line: 108, baseType: !849, size: 64, offset: 3968)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!342, !545, !852, !624, !625}
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !361)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !554, file: !548, line: 109, baseType: !809, size: 64, offset: 4032)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !554, file: !548, line: 111, baseType: !855, size: 64, offset: 4096)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!342, !545, !545, !545, !438, !545}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !554, file: !548, line: 112, baseType: !859, size: 64, offset: 4160)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!342, !545, !545, !545, !545}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !554, file: !548, line: 113, baseType: !863, size: 64, offset: 4224)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!342, !545, !866, !866}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !592, line: 30, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !592, line: 30, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !554, file: !548, line: 114, baseType: !557, size: 64, offset: 4288)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !554, file: !548, line: 115, baseType: !676, size: 64, offset: 4352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !554, file: !548, line: 117, baseType: !735, size: 64, offset: 4416)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !554, file: !548, line: 118, baseType: !735, size: 64, offset: 4480)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !554, file: !548, line: 119, baseType: !849, size: 64, offset: 4544)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !554, file: !548, line: 120, baseType: !875, size: 64, offset: 4608)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!342, !545, !878, !649}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !554, file: !548, line: 121, baseType: !809, size: 64, offset: 4672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !554, file: !548, line: 123, baseType: !881, size: 64, offset: 4736)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!342, !545, !384, !325}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !554, file: !548, line: 124, baseType: !885, size: 64, offset: 4800)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!342, !545, !770, !574, !325}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !554, file: !548, line: 125, baseType: !889, size: 64, offset: 4864)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!342, !475, !545}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !554, file: !548, line: 126, baseType: !571, size: 64, offset: 4928)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !554, file: !548, line: 127, baseType: !571, size: 64, offset: 4992)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !554, file: !548, line: 129, baseType: !895, size: 64, offset: 5056)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!342, !545, !725}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !554, file: !548, line: 130, baseType: !899, size: 64, offset: 5120)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!342, !545, !902, !902}
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !904, file: !60, line: 653, baseType: !384, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !904, file: !60, line: 653, baseType: !574, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !554, file: !548, line: 131, baseType: !899, size: 64, offset: 5184)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !554, file: !548, line: 132, baseType: !910, size: 64, offset: 5248)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!342, !545, !429, !429, !429}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !554, file: !548, line: 133, baseType: !845, size: 64, offset: 5312)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !554, file: !548, line: 135, baseType: !915, size: 64, offset: 5376)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!342, !545, !438, !649}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !554, file: !548, line: 136, baseType: !915, size: 64, offset: 5440)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !554, file: !548, line: 137, baseType: !920, size: 64, offset: 5504)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!342, !545, !649}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !554, file: !548, line: 138, baseType: !557, size: 64, offset: 5568)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !554, file: !548, line: 139, baseType: !925, size: 64, offset: 5632)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!342, !545, !928, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !554, file: !548, line: 141, baseType: !809, size: 64, offset: 5696)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !554, file: !548, line: 142, baseType: !931, size: 64, offset: 5760)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!342, !545, !545, !438, !545}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !554, file: !548, line: 143, baseType: !935, size: 64, offset: 5824)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!342, !545, !545, !545}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !554, file: !548, line: 144, baseType: !809, size: 64, offset: 5888)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !554, file: !548, line: 145, baseType: !931, size: 64, offset: 5952)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !554, file: !548, line: 147, baseType: !935, size: 64, offset: 6016)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !554, file: !548, line: 148, baseType: !809, size: 64, offset: 6080)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !554, file: !548, line: 149, baseType: !931, size: 64, offset: 6144)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !554, file: !548, line: 150, baseType: !935, size: 64, offset: 6208)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !554, file: !548, line: 151, baseType: !945, size: 64, offset: 6272)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!342, !545, !499}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !554, file: !548, line: 153, baseType: !672, size: 64, offset: 6336)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !554, file: !548, line: 154, baseType: !672, size: 64, offset: 6400)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !554, file: !548, line: 155, baseType: !672, size: 64, offset: 6464)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !554, file: !548, line: 156, baseType: !672, size: 64, offset: 6528)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !554, file: !548, line: 157, baseType: !845, size: 64, offset: 6592)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !554, file: !548, line: 159, baseType: !954, size: 64, offset: 6656)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!342, !545, !384, !562}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !554, file: !548, line: 160, baseType: !672, size: 64, offset: 6720)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !554, file: !548, line: 161, baseType: !672, size: 64, offset: 6784)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !554, file: !548, line: 162, baseType: !672, size: 64, offset: 6848)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !554, file: !548, line: 163, baseType: !672, size: 64, offset: 6912)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !554, file: !548, line: 165, baseType: !935, size: 64, offset: 6976)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !554, file: !548, line: 166, baseType: !935, size: 64, offset: 7040)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !554, file: !548, line: 167, baseType: !735, size: 64, offset: 7104)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !554, file: !548, line: 168, baseType: !965, size: 64, offset: 7168)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!342, !545, !574, !384}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !554, file: !548, line: 169, baseType: !969, size: 64, offset: 7232)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!342, !545, !649, !429}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !554, file: !548, line: 171, baseType: !696, size: 64, offset: 7296)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !554, file: !548, line: 172, baseType: !672, size: 64, offset: 7360)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !554, file: !548, line: 173, baseType: !975, size: 64, offset: 7424)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!342, !545, !429, !759}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !554, file: !548, line: 174, baseType: !835, size: 64, offset: 7488)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !554, file: !548, line: 175, baseType: !835, size: 64, offset: 7552)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !554, file: !548, line: 177, baseType: !571, size: 64, offset: 7616)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !554, file: !548, line: 178, baseType: !621, size: 64, offset: 7680)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !554, file: !548, line: 179, baseType: !571, size: 64, offset: 7744)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !554, file: !548, line: 180, baseType: !578, size: 64, offset: 7808)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !554, file: !548, line: 181, baseType: !985, size: 64, offset: 7872)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!342, !545, !321, !624, !625}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !554, file: !548, line: 183, baseType: !895, size: 64, offset: 7936)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !554, file: !548, line: 184, baseType: !656, size: 64, offset: 8000)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !554, file: !548, line: 185, baseType: !991, size: 64, offset: 8064)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!342, !545, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !554, file: !548, line: 186, baseType: !996, size: 64, offset: 8128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!342, !545, !384, !560, !446}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !554, file: !548, line: 187, baseType: !715, size: 64, offset: 8192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !554, file: !548, line: 189, baseType: !1001, size: 64, offset: 8256)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!342, !545, !384, !384, !429, !562}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !554, file: !548, line: 190, baseType: !809, size: 64, offset: 8320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !554, file: !548, line: 191, baseType: !931, size: 64, offset: 8384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !554, file: !548, line: 192, baseType: !935, size: 64, offset: 8448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !554, file: !548, line: 193, baseType: !1008, size: 64, offset: 8512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!342, !545, !767, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !548, line: 660, size: 5312, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1013, file: !548, line: 661, baseType: !551, size: 4480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1013, file: !548, line: 661, baseType: !776, size: 32, offset: 4480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1013, file: !548, line: 662, baseType: !384, size: 32, offset: 4512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1013, file: !548, line: 662, baseType: !384, size: 32, offset: 4544)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1013, file: !548, line: 662, baseType: !384, size: 32, offset: 4576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1013, file: !548, line: 663, baseType: !384, size: 32, offset: 4608)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1013, file: !548, line: 664, baseType: !384, size: 32, offset: 4640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1013, file: !548, line: 665, baseType: !429, size: 64, offset: 4672)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1013, file: !548, line: 666, baseType: !429, size: 64, offset: 4736)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1013, file: !548, line: 667, baseType: !384, size: 32, offset: 4800)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1013, file: !548, line: 668, baseType: !817, size: 32, offset: 4832)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1013, file: !548, line: 670, baseType: !429, size: 64, offset: 4864)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1013, file: !548, line: 670, baseType: !429, size: 64, offset: 4928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1013, file: !548, line: 671, baseType: !429, size: 64, offset: 4992)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1013, file: !548, line: 672, baseType: !429, size: 64, offset: 5056)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1013, file: !548, line: 673, baseType: !429, size: 64, offset: 5120)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1013, file: !548, line: 674, baseType: !384, size: 32, offset: 5184)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1013, file: !548, line: 675, baseType: !429, size: 64, offset: 5248)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !554, file: !548, line: 195, baseType: !1034, size: 64, offset: 8576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!342, !1011, !545, !545}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !554, file: !548, line: 196, baseType: !1034, size: 64, offset: 8640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !554, file: !548, line: 197, baseType: !809, size: 64, offset: 8704)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !554, file: !548, line: 198, baseType: !931, size: 64, offset: 8768)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !554, file: !548, line: 199, baseType: !935, size: 64, offset: 8832)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !554, file: !548, line: 201, baseType: !1042, size: 64, offset: 8896)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!342, !545, !384, !384}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !554, file: !548, line: 202, baseType: !710, size: 64, offset: 8960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !554, file: !548, line: 203, baseType: !578, size: 64, offset: 9024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !554, file: !548, line: 204, baseType: !764, size: 64, offset: 9088)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !554, file: !548, line: 205, baseType: !895, size: 64, offset: 9152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !554, file: !548, line: 206, baseType: !1050, size: 64, offset: 9216)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!342, !321, !545, !384, !624, !625}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !554, file: !548, line: 208, baseType: !1054, size: 64, offset: 9280)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!342, !384, !720}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !554, file: !548, line: 209, baseType: !935, size: 64, offset: 9344)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !554, file: !548, line: 210, baseType: !727, size: 64, offset: 9408)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !547, file: !548, line: 438, baseType: !1060, size: 64, offset: 13952)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !592, line: 60, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1062, file: !114, line: 241, baseType: !321, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !114, line: 242, baseType: !401, size: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1062, file: !114, line: 243, baseType: !384, size: 32, offset: 96)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1062, file: !114, line: 243, baseType: !384, size: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1062, file: !114, line: 244, baseType: !384, size: 32, offset: 160)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1062, file: !114, line: 244, baseType: !384, size: 32, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1062, file: !114, line: 245, baseType: !429, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1062, file: !114, line: 246, baseType: !499, size: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1062, file: !114, line: 247, baseType: !384, size: 32, offset: 352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1062, file: !114, line: 251, baseType: !384, size: 32, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1062, file: !114, line: 252, baseType: !866, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1062, file: !114, line: 253, baseType: !499, size: 32, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1062, file: !114, line: 254, baseType: !384, size: 32, offset: 544)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1062, file: !114, line: 254, baseType: !384, size: 32, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1062, file: !114, line: 255, baseType: !384, size: 32, offset: 608)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !547, file: !548, line: 438, baseType: !1060, size: 64, offset: 14016)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !547, file: !548, line: 439, baseType: !325, size: 64, offset: 14080)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !547, file: !548, line: 440, baseType: !1082, size: 32, offset: 14144)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !547, file: !548, line: 441, baseType: !499, size: 32, offset: 14176)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !547, file: !548, line: 442, baseType: !499, size: 32, offset: 14208)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !547, file: !548, line: 443, baseType: !1086, size: 448, offset: 14272)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 448, elements: !1088)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !361)
!1088 = !{!1089}
!1089 = !DISubrange(count: 7)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !547, file: !548, line: 444, baseType: !499, size: 32, offset: 14720)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !547, file: !548, line: 445, baseType: !499, size: 32, offset: 14752)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !547, file: !548, line: 446, baseType: !384, size: 32, offset: 14784)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !547, file: !548, line: 447, baseType: !422, size: 64, offset: 14848)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !547, file: !548, line: 448, baseType: !422, size: 64, offset: 14912)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !547, file: !548, line: 449, baseType: !632, size: 640, offset: 14976)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !547, file: !548, line: 450, baseType: !564, size: 32, offset: 15616)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !547, file: !548, line: 451, baseType: !1098, size: 2880, offset: 15680)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !548, line: 318, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !548, line: 319, size: 2880, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1120, !1121, !1126, !1131, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1146, !1147, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1179, !1180, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1203, !1204, !1205, !1206, !1207}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1099, file: !548, line: 320, baseType: !384, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1099, file: !548, line: 321, baseType: !384, size: 32, offset: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1099, file: !548, line: 322, baseType: !384, size: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1099, file: !548, line: 323, baseType: !384, size: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1099, file: !548, line: 324, baseType: !384, size: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1099, file: !548, line: 325, baseType: !384, size: 32, offset: 160)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1099, file: !548, line: 326, baseType: !1108, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !548, line: 293, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !548, line: 295, size: 448, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1110, file: !548, line: 296, baseType: !1108, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1110, file: !548, line: 297, baseType: !446, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1110, file: !548, line: 297, baseType: !446, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1110, file: !548, line: 298, baseType: !429, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1110, file: !548, line: 298, baseType: !429, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1110, file: !548, line: 299, baseType: !384, size: 32, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1110, file: !548, line: 300, baseType: !384, size: 32, offset: 352)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1110, file: !548, line: 301, baseType: !384, size: 32, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1099, file: !548, line: 326, baseType: !1108, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1099, file: !548, line: 328, baseType: !1122, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!342, !545, !1125, !429}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1099, file: !548, line: 329, baseType: !1127, size: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!342, !1125, !1130, !431, !431, !449, !429}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1099, file: !548, line: 330, baseType: !1132, size: 64, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!342, !1125}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1099, file: !548, line: 331, baseType: !1132, size: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1099, file: !548, line: 334, baseType: !321, size: 64, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !548, line: 335, baseType: !401, size: 32, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1099, file: !548, line: 335, baseType: !401, size: 32, offset: 672)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1099, file: !548, line: 336, baseType: !401, size: 32, offset: 704)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1099, file: !548, line: 336, baseType: !401, size: 32, offset: 736)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1099, file: !548, line: 337, baseType: !1142, size: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !322, line: 339, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !322, line: 339, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1099, file: !548, line: 338, baseType: !1142, size: 64, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1099, file: !548, line: 339, baseType: !1148, size: 64, offset: 896)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !322, line: 341, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !322, line: 351, size: 192, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1150, file: !322, line: 354, baseType: !72, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1150, file: !322, line: 355, baseType: !72, size: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1150, file: !322, line: 356, baseType: !72, size: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1150, file: !322, line: 361, baseType: !72, size: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1150, file: !322, line: 362, baseType: !495, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1099, file: !548, line: 340, baseType: !384, size: 32, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1099, file: !548, line: 340, baseType: !384, size: 32, offset: 992)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1099, file: !548, line: 341, baseType: !446, size: 64, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1099, file: !548, line: 342, baseType: !429, size: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1099, file: !548, line: 343, baseType: !449, size: 64, offset: 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1099, file: !548, line: 344, baseType: !431, size: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1099, file: !548, line: 345, baseType: !384, size: 32, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1099, file: !548, line: 346, baseType: !1130, size: 64, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1099, file: !548, line: 347, baseType: !499, size: 32, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1099, file: !548, line: 348, baseType: !384, size: 32, offset: 1440)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1099, file: !548, line: 351, baseType: !499, size: 32, offset: 1472)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1099, file: !548, line: 352, baseType: !499, size: 32, offset: 1504)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1099, file: !548, line: 353, baseType: !401, size: 32, offset: 1536)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1099, file: !548, line: 354, baseType: !401, size: 32, offset: 1568)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1099, file: !548, line: 355, baseType: !1130, size: 64, offset: 1600)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1099, file: !548, line: 356, baseType: !1130, size: 64, offset: 1664)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1099, file: !548, line: 357, baseType: !1174, size: 64, offset: 1728)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !548, line: 310, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 308, size: 32, elements: !1177)
!1177 = !{!1178}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1176, file: !548, line: 309, baseType: !384, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1099, file: !548, line: 357, baseType: !1174, size: 64, offset: 1792)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1099, file: !548, line: 358, baseType: !1181, size: 64, offset: 1856)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !548, line: 316, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 312, size: 128, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1183, file: !548, line: 313, baseType: !325, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1183, file: !548, line: 314, baseType: !384, size: 32, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1183, file: !548, line: 315, baseType: !363, size: 8, offset: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1099, file: !548, line: 359, baseType: !1181, size: 64, offset: 1920)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1099, file: !548, line: 360, baseType: !1181, size: 64, offset: 1984)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1099, file: !548, line: 361, baseType: !384, size: 32, offset: 2048)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1099, file: !548, line: 362, baseType: !401, size: 32, offset: 2080)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1099, file: !548, line: 363, baseType: !384, size: 32, offset: 2112)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1099, file: !548, line: 364, baseType: !1130, size: 64, offset: 2176)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1099, file: !548, line: 365, baseType: !1148, size: 64, offset: 2240)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1099, file: !548, line: 366, baseType: !401, size: 32, offset: 2304)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1099, file: !548, line: 367, baseType: !401, size: 32, offset: 2336)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1099, file: !548, line: 368, baseType: !1142, size: 64, offset: 2368)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1099, file: !548, line: 369, baseType: !1142, size: 64, offset: 2432)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1099, file: !548, line: 370, baseType: !1200, size: 64, offset: 2496)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1099, file: !548, line: 371, baseType: !1200, size: 64, offset: 2560)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1099, file: !548, line: 372, baseType: !1200, size: 64, offset: 2624)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1099, file: !548, line: 373, baseType: !529, size: 64, offset: 2688)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1099, file: !548, line: 374, baseType: !495, size: 64, offset: 2752)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1099, file: !548, line: 375, baseType: !1208, size: 64, offset: 2816)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !547, file: !548, line: 451, baseType: !1098, size: 2880, offset: 18560)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !547, file: !548, line: 452, baseType: !1211, size: 64, offset: 21440)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !548, line: 681, size: 4864, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1213, file: !548, line: 682, baseType: !551, size: 4480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1213, file: !548, line: 682, baseType: !776, size: 32, offset: 4480)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1213, file: !548, line: 683, baseType: !499, size: 32, offset: 4512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1213, file: !548, line: 684, baseType: !384, size: 32, offset: 4544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1213, file: !548, line: 685, baseType: !928, size: 64, offset: 4608)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1213, file: !548, line: 686, baseType: !446, size: 64, offset: 4672)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1213, file: !548, line: 687, baseType: !1222, size: 64, offset: 4736)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!342, !1211, !574, !325}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1213, file: !548, line: 688, baseType: !325, size: 64, offset: 4800)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !547, file: !548, line: 453, baseType: !1211, size: 64, offset: 21504)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !547, file: !548, line: 454, baseType: !1211, size: 64, offset: 21568)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !547, file: !548, line: 455, baseType: !384, size: 32, offset: 21632)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !547, file: !548, line: 456, baseType: !499, size: 32, offset: 21664)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !547, file: !548, line: 457, baseType: !1231, size: 320, offset: 21696)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !548, line: 399, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 394, size: 320, elements: !1233)
