; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/draw/drawv.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/draw/drawv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscViewer = type { %struct._p_PetscObject, [1 x %struct._PetscViewerOps], i32, [25 x i32], i32, i8*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 663, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 204, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108}
!100 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 141, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 624, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!117 = !{!118, !119, !120, !121}
!118 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!122 = !{!123, !126, !127, !292, !373, !376, !199, !134, !379, !215, !210, !568, !569, !7}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !116, line: 330, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !116, line: 330, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !130, line: 73, size: 4480, elements: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!131 = !{!132, !135, !274, !275, !276, !279, !280, !281, !282, !290, !291, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !310, !311, !312, !314, !315, !316, !318, !319, !320, !321, !322, !325, !327, !328, !329, !330, !331, !334, !336, !337, !338, !348, !350, !351, !355, !356, !363, !368, !370, !371, !372}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !129, file: !130, line: 74, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !134)
!134 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !129, file: !130, line: 75, baseType: !136, size: 448, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !238)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !130, line: 53, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 45, size: 448, elements: !139)
!139 = !{!140, !146, !249, !254, !258, !262, !269}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !138, file: !130, line: 46, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !127, !145}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !134)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !138, file: !130, line: 47, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!144, !127, !150}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !151, line: 16, baseType: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !154, line: 28, size: 6016, elements: !155)
!154 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/viewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!155 = !{!156, !158, !240, !242, !246, !247, !248}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !153, file: !154, line: 29, baseType: !157, size: 4480)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !130, line: 122, baseType: !129)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !153, file: !154, line: 29, baseType: !159, size: 512, offset: 4480)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 512, elements: !238)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscViewerOps", file: !154, line: 11, size: 512, elements: !161)
!161 = !{!162, !166, !170, !171, !176, !177, !184, !237}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !160, file: !154, line: 12, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!144, !150}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !160, file: !154, line: 13, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!144, !150, !150}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !160, file: !154, line: 14, baseType: !163, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "getsubviewer", scope: !160, file: !154, line: 15, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!144, !150, !123, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubviewer", scope: !160, file: !154, line: 16, baseType: !172, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !160, file: !154, line: 17, baseType: !178, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!144, !150, !126, !181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !134)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !6, line: 389, baseType: !26)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !160, file: !154, line: 18, baseType: !185, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!144, !188, !150}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !191)
!191 = !{!192, !193, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !190, file: !12, line: 100, baseType: !181, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !12, line: 101, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !197)
!197 = !{!198, !201, !202, !203, !207, !212, !213, !214, !218, !220, !222, !223, !224}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !196, file: !12, line: 84, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !196, file: !12, line: 85, baseType: !199, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !12, line: 86, baseType: !126, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !196, file: !12, line: 87, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !196, file: !12, line: 88, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !196, file: !12, line: 89, baseType: !200, size: 8, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !196, file: !12, line: 90, baseType: !199, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !196, file: !12, line: 91, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !216, line: 46, baseType: !217)
!216 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!217 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !196, file: !12, line: 92, baseType: !219, size: 32, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !12, line: 93, baseType: !221, size: 32, offset: 544)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !12, line: 94, baseType: !194, size: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !196, file: !12, line: 95, baseType: !199, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !196, file: !12, line: 96, baseType: !126, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !190, file: !12, line: 102, baseType: !199, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !190, file: !12, line: 102, baseType: !199, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !190, file: !12, line: 103, baseType: !199, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !190, file: !12, line: 104, baseType: !123, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !190, file: !12, line: 105, baseType: !219, size: 32, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !190, file: !12, line: 105, baseType: !219, size: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !190, file: !12, line: 105, baseType: !219, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !190, file: !12, line: 106, baseType: !127, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !190, file: !12, line: 107, baseType: !234, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !160, file: !154, line: 19, baseType: !163, size: 64, offset: 448)
!238 = !{!239}
!239 = !DISubrange(count: 1)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !153, file: !154, line: 30, baseType: !241, size: 32, offset: 4992)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !47, line: 162, baseType: !46)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !153, file: !154, line: 30, baseType: !243, size: 800, offset: 5024)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 800, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 25)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !153, file: !154, line: 31, baseType: !134, size: 32, offset: 5824)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 32, baseType: !126, size: 64, offset: 5888)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !153, file: !154, line: 33, baseType: !219, size: 32, offset: 5952)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !138, file: !130, line: 48, baseType: !250, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!144, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !138, file: !130, line: 49, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!144, !127, !210, !127}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !138, file: !130, line: 50, baseType: !259, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!144, !127, !210, !253}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !138, file: !130, line: 51, baseType: !263, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!144, !127, !210, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !138, file: !130, line: 52, baseType: !270, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!144, !127, !210, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !129, file: !130, line: 76, baseType: !123, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !130, line: 77, baseType: !181, size: 32, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !129, file: !130, line: 78, baseType: !277, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !278)
!278 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !129, file: !130, line: 78, baseType: !277, size: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !129, file: !130, line: 78, baseType: !277, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !129, file: !130, line: 78, baseType: !277, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !129, file: !130, line: 79, baseType: !283, size: 64, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !286, line: 27, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !288, line: 43, baseType: !289)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!289 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !129, file: !130, line: 80, baseType: !181, size: 32, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !129, file: !130, line: 81, baseType: !292, size: 32, offset: 992)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !134)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !129, file: !130, line: 82, baseType: !204, size: 64, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !129, file: !130, line: 83, baseType: !295, size: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !129, file: !130, line: 84, baseType: !199, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !129, file: !130, line: 85, baseType: !199, size: 64, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !129, file: !130, line: 86, baseType: !199, size: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !129, file: !130, line: 87, baseType: !199, size: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !129, file: !130, line: 88, baseType: !127, size: 64, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !129, file: !130, line: 89, baseType: !283, size: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 90, baseType: !199, size: 64, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !129, file: !130, line: 91, baseType: !199, size: 64, offset: 1600)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !129, file: !130, line: 92, baseType: !181, size: 32, offset: 1664)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !129, file: !130, line: 93, baseType: !126, size: 64, offset: 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !129, file: !130, line: 94, baseType: !309, size: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !284)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !129, file: !130, line: 95, baseType: !181, size: 32, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !129, file: !130, line: 95, baseType: !181, size: 32, offset: 1888)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !129, file: !130, line: 96, baseType: !313, size: 64, offset: 1920)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !129, file: !130, line: 96, baseType: !313, size: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !129, file: !130, line: 97, baseType: !182, size: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !129, file: !130, line: 97, baseType: !317, size: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !129, file: !130, line: 98, baseType: !181, size: 32, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !129, file: !130, line: 98, baseType: !181, size: 32, offset: 2208)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !129, file: !130, line: 99, baseType: !313, size: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !129, file: !130, line: 99, baseType: !313, size: 64, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !129, file: !130, line: 100, baseType: !323, size: 64, offset: 2368)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !278)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !129, file: !130, line: 100, baseType: !326, size: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !129, file: !130, line: 101, baseType: !181, size: 32, offset: 2496)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !129, file: !130, line: 101, baseType: !181, size: 32, offset: 2528)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !129, file: !130, line: 102, baseType: !313, size: 64, offset: 2560)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !129, file: !130, line: 102, baseType: !313, size: 64, offset: 2624)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !129, file: !130, line: 103, baseType: !332, size: 64, offset: 2688)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !324)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !129, file: !130, line: 103, baseType: !335, size: 64, offset: 2752)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !129, file: !130, line: 104, baseType: !273, size: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !129, file: !130, line: 105, baseType: !181, size: 32, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !129, file: !130, line: 106, baseType: !339, size: 128, offset: 2944)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 128, elements: !346)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !130, line: 64, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 61, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !342, file: !130, line: 62, baseType: !266, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !342, file: !130, line: 63, baseType: !126, size: 64, offset: 64)
!346 = !{!347}
!347 = !DISubrange(count: 2)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !129, file: !130, line: 107, baseType: !349, size: 64, offset: 3072)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !346)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !129, file: !130, line: 108, baseType: !126, size: 64, offset: 3136)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !129, file: !130, line: 109, baseType: !352, size: 64, offset: 3200)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!144, !126}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !129, file: !130, line: 111, baseType: !181, size: 32, offset: 3264)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !129, file: !130, line: 112, baseType: !357, size: 320, offset: 3328)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !361)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!144, !188, !127, !126}
!361 = !{!362}
!362 = !DISubrange(count: 5)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !129, file: !130, line: 113, baseType: !364, size: 320, offset: 3648)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 320, elements: !361)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!144, !127, !126}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !129, file: !130, line: 114, baseType: !369, size: 320, offset: 3968)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !361)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !129, file: !130, line: 115, baseType: !219, size: 32, offset: 4288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !129, file: !130, line: 120, baseType: !234, size: 64, offset: 4352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !129, file: !130, line: 121, baseType: !219, size: 32, offset: 4416)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !116, line: 331, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !116, line: 331, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !116, line: 338, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !116, line: 338, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer_Draw", file: !381, line: 25, baseType: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/viewer/impls/draw/vdraw.h", directory: "/home/users/ndemeye/xSDK")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 10, size: 768, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !549, !554, !559, !560, !561, !562, !563, !564, !565, !566}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "draw_max", scope: !382, file: !381, line: 11, baseType: !181, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "draw_base", scope: !382, file: !381, line: 12, baseType: !181, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nbounds", scope: !382, file: !381, line: 13, baseType: !181, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !382, file: !381, line: 14, baseType: !323, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !382, file: !381, line: 15, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !391, line: 25, baseType: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !394, line: 53, size: 11072, elements: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!395 = !{!396, !397, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !524, !525, !526, !527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !393, file: !394, line: 54, baseType: !157, size: 4480)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !393, file: !394, line: 54, baseType: !398, size: 2304, offset: 4480)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 2304, elements: !238)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !394, line: 14, size: 2304, elements: !400)
!400 = !{!401, !405, !406, !410, !414, !418, !422, !423, !427, !428, !432, !436, !440, !441, !445, !449, !450, !456, !457, !458, !459, !463, !467, !468, !472, !473, !477, !478, !479, !480, !492, !493, !494, !499, !503, !507}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !399, file: !394, line: 15, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!144, !390}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !399, file: !394, line: 16, baseType: !402, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !399, file: !394, line: 17, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!144, !390, !324, !324, !324, !324, !134}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !399, file: !394, line: 18, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!144, !390, !324}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !399, file: !394, line: 19, baseType: !415, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!144, !390, !323}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !399, file: !394, line: 20, baseType: !419, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!144, !390, !324, !324, !134}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !399, file: !394, line: 21, baseType: !411, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !399, file: !394, line: 22, baseType: !424, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!144, !390, !324, !324, !134, !210}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !399, file: !394, line: 23, baseType: !424, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !399, file: !394, line: 24, baseType: !429, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!144, !390, !324, !324}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !399, file: !394, line: 25, baseType: !433, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!144, !390, !323, !323}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !399, file: !394, line: 26, baseType: !437, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!144, !390, !324, !324, !324, !324}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !399, file: !394, line: 27, baseType: !402, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !399, file: !394, line: 28, baseType: !442, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!144, !390, !324, !324, !324, !324, !134, !134, !134, !134}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !399, file: !394, line: 29, baseType: !446, size: 64, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!144, !390, !324, !324, !324, !324, !324, !324, !134, !134, !134}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !399, file: !394, line: 30, baseType: !407, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !399, file: !394, line: 31, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!144, !390, !454, !323, !323, !323, !323}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !98, line: 207, baseType: !97)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !399, file: !394, line: 32, baseType: !402, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !399, file: !394, line: 33, baseType: !402, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !399, file: !394, line: 34, baseType: !402, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !399, file: !394, line: 35, baseType: !460, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!144, !390, !389}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !399, file: !394, line: 36, baseType: !464, size: 64, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!144, !390, !210}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !399, file: !394, line: 37, baseType: !402, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !399, file: !394, line: 38, baseType: !469, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!144, !390, !134, !134}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !399, file: !394, line: 39, baseType: !402, size: 64, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !399, file: !394, line: 40, baseType: !474, size: 64, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!144, !390, !150}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !399, file: !394, line: 41, baseType: !460, size: 64, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !399, file: !394, line: 42, baseType: !460, size: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !399, file: !394, line: 43, baseType: !402, size: 64, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !399, file: !394, line: 44, baseType: !481, size: 64, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!144, !390, !484, !489, !489, !490}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 24, elements: !487)
!486 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!487 = !{!488}
!488 = !DISubrange(count: 3)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !399, file: !394, line: 45, baseType: !437, size: 64, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !399, file: !394, line: 46, baseType: !407, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !399, file: !394, line: 47, baseType: !495, size: 64, offset: 2048)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!144, !390, !324, !324, !498, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !399, file: !394, line: 48, baseType: !500, size: 64, offset: 2112)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!144, !390, !134, !134, !323, !323}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !399, file: !394, line: 49, baseType: !504, size: 64, offset: 2176)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!144, !390, !134, !134, !134}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !399, file: !394, line: 50, baseType: !508, size: 64, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!144, !390, !324, !324, !134, !134, !210, !323, !323}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !393, file: !394, line: 55, baseType: !324, size: 64, offset: 6784)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !393, file: !394, line: 56, baseType: !324, size: 64, offset: 6848)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !393, file: !394, line: 56, baseType: !324, size: 64, offset: 6912)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !393, file: !394, line: 56, baseType: !324, size: 64, offset: 6976)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !393, file: !394, line: 56, baseType: !324, size: 64, offset: 7040)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !393, file: !394, line: 57, baseType: !324, size: 64, offset: 7104)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !393, file: !394, line: 57, baseType: !324, size: 64, offset: 7168)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !393, file: !394, line: 57, baseType: !324, size: 64, offset: 7232)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !393, file: !394, line: 57, baseType: !324, size: 64, offset: 7296)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !393, file: !394, line: 58, baseType: !521, size: 1280, offset: 7360)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 1280, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 20)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !393, file: !394, line: 58, baseType: !521, size: 1280, offset: 8640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !393, file: !394, line: 59, baseType: !324, size: 64, offset: 9920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !393, file: !394, line: 59, baseType: !324, size: 64, offset: 9984)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !393, file: !394, line: 59, baseType: !324, size: 64, offset: 10048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !393, file: !394, line: 59, baseType: !324, size: 64, offset: 10112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !393, file: !394, line: 60, baseType: !181, size: 32, offset: 10176)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !393, file: !394, line: 61, baseType: !531, size: 32, offset: 10208)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !98, line: 141, baseType: !109)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !393, file: !394, line: 62, baseType: !199, size: 64, offset: 10240)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !393, file: !394, line: 63, baseType: !199, size: 64, offset: 10304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !393, file: !394, line: 64, baseType: !390, size: 64, offset: 10368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !393, file: !394, line: 65, baseType: !134, size: 32, offset: 10432)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !393, file: !394, line: 65, baseType: !134, size: 32, offset: 10464)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !393, file: !394, line: 65, baseType: !134, size: 32, offset: 10496)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !393, file: !394, line: 65, baseType: !134, size: 32, offset: 10528)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !393, file: !394, line: 66, baseType: !199, size: 64, offset: 10560)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !393, file: !394, line: 67, baseType: !199, size: 64, offset: 10624)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !393, file: !394, line: 68, baseType: !199, size: 64, offset: 10688)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !393, file: !394, line: 69, baseType: !181, size: 32, offset: 10752)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !393, file: !394, line: 70, baseType: !219, size: 32, offset: 10784)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !393, file: !394, line: 71, baseType: !181, size: 32, offset: 10816)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !393, file: !394, line: 72, baseType: !199, size: 64, offset: 10880)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !393, file: !394, line: 73, baseType: !219, size: 32, offset: 10944)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !393, file: !394, line: 74, baseType: !219, size: 32, offset: 10976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !393, file: !394, line: 75, baseType: !126, size: 64, offset: 11008)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "drawlg", scope: !382, file: !381, line: 16, baseType: !550, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !391, line: 43, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !391, line: 43, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "drawaxis", scope: !382, file: !381, line: 17, baseType: !555, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawAxis", file: !391, line: 34, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawAxis", file: !391, line: 34, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !382, file: !381, line: 18, baseType: !134, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !382, file: !381, line: 18, baseType: !134, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !382, file: !381, line: 19, baseType: !199, size: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !382, file: !381, line: 20, baseType: !199, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "singleton_made", scope: !382, file: !381, line: 21, baseType: !219, size: 32, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !382, file: !381, line: 22, baseType: !219, size: 32, offset: 608)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !382, file: !381, line: 23, baseType: !324, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !382, file: !381, line: 24, baseType: !567, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawType", file: !391, line: 11, baseType: !210)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!570 = !{!0}
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/impls/draw/drawv.c", directory: "/home/users/ndemeye/xSDK")
!572 = !{i32 7, !"Dwarf Version", i32 4}
!573 = !{i32 2, !"Debug Info Version", i32 3}
!574 = !{i32 1, !"wchar_size", i32 4}
!575 = !{i32 7, !"PIC Level", i32 2}
!576 = !{i32 7, !"uwtable", i32 1}
!577 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!578 = distinct !DISubprogram(name: "PetscViewerDrawGetDraw", scope: !571, file: !571, line: 58, type: !579, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{!144, !150, !181, !389}
!581 = !{!582, !583, !584, !585, !586, !587, !588, !590, !591, !592, !593, !595, !599, !600, !602, !608, !609, !611, !614, !615, !617, !620, !621, !623, !626, !627, !628, !629, !631, !633, !635, !637, !639, !642, !646, !650, !652, !654, !658, !660, !662}
!582 = !DILocalVariable(name: "viewer", arg: 1, scope: !578, file: !571, line: 58, type: !150)
!583 = !DILocalVariable(name: "windownumber", arg: 2, scope: !578, file: !571, line: 58, type: !181)
!584 = !DILocalVariable(name: "draw", arg: 3, scope: !578, file: !571, line: 58, type: !389)
!585 = !DILocalVariable(name: "vdraw", scope: !578, file: !571, line: 60, type: !379)
!586 = !DILocalVariable(name: "ierr", scope: !578, file: !571, line: 61, type: !144)
!587 = !DILocalVariable(name: "isdraw", scope: !578, file: !571, line: 62, type: !219)
!588 = !DILocalVariable(name: "_7_ierr", scope: !589, file: !571, line: 66, type: !144)
!589 = distinct !DILexicalBlock(scope: !578, file: !571, line: 66, column: 3)
!590 = !DILocalVariable(name: "b0", scope: !589, file: !571, line: 66, type: !181)
!591 = !DILocalVariable(name: "b1", scope: !589, file: !571, line: 66, type: !349)
!592 = !DILocalVariable(name: "b2", scope: !589, file: !571, line: 66, type: !349)
!593 = !DILocalVariable(name: "_4_ierr", scope: !594, file: !571, line: 66, type: !144)
!594 = distinct !DILexicalBlock(scope: !589, file: !571, line: 66, column: 3)
!595 = !DILocalVariable(name: "a_b1", scope: !594, file: !571, line: 66, type: !596)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 192, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 6)
!599 = !DILocalVariable(name: "a_b2", scope: !594, file: !571, line: 66, type: !596)
!600 = !DILocalVariable(name: "_7_errorcode", scope: !601, file: !571, line: 66, type: !144)
!601 = distinct !DILexicalBlock(scope: !594, file: !571, line: 66, column: 3)
!602 = !DILocalVariable(name: "_7_errorstring", scope: !603, file: !571, line: 66, type: !605)
!603 = distinct !DILexicalBlock(scope: !604, file: !571, line: 66, column: 3)
!604 = distinct !DILexicalBlock(scope: !601, file: !571, line: 66, column: 3)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 2048, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 256)
!608 = !DILocalVariable(name: "_7_resultlen", scope: !603, file: !571, line: 66, type: !292)
!609 = !DILocalVariable(name: "_7_errorcode", scope: !610, file: !571, line: 66, type: !144)
!610 = distinct !DILexicalBlock(scope: !594, file: !571, line: 66, column: 3)
!611 = !DILocalVariable(name: "_7_errorstring", scope: !612, file: !571, line: 66, type: !605)
!612 = distinct !DILexicalBlock(scope: !613, file: !571, line: 66, column: 3)
!613 = distinct !DILexicalBlock(scope: !610, file: !571, line: 66, column: 3)
