; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/dfp/dfp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/dfp/dfp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1265, baseType: !5, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!295 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1203, baseType: !5, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 187, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 790, baseType: !5, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_NONE", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_SCALAR", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_DIAGONAL", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_USER", value: 3, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 663, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!322 = !{!323, !324, !325}
!323 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!328 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!346 = !{!347, !1621, !372, !453, !369, !393, !528, !1660}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !349, line: 52, baseType: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !349, line: 27, size: 6208, elements: !351)
!351 = !{!352, !562, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1613, !1617, !1618, !1619, !1620}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !350, file: !349, line: 29, baseType: !353, size: 4480)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !354, line: 122, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !354, line: 73, size: 4480, elements: !356)
!356 = !{!357, !359, !414, !415, !417, !420, !421, !422, !423, !431, !432, !434, !438, !442, !444, !445, !446, !447, !448, !449, !450, !451, !452, !454, !456, !457, !458, !460, !461, !463, !465, !466, !467, !468, !469, !472, !474, !475, !476, !477, !478, !481, !483, !484, !485, !495, !497, !498, !502, !503, !552, !557, !559, !560, !561}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !355, file: !354, line: 74, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !355, file: !354, line: 75, baseType: !360, size: 448, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 448, elements: !412)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !354, line: 53, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 45, size: 448, elements: !363)
!363 = !{!364, !376, !384, !389, !396, !400, !407}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !362, file: !354, line: 46, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!368, !369, !371}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !373, line: 330, baseType: !374)
!373 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !373, line: 330, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !362, file: !354, line: 47, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!368, !369, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !381, line: 16, baseType: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !381, line: 16, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !362, file: !354, line: 48, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!368, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !362, file: !354, line: 49, baseType: !390, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!368, !369, !393, !369}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !362, file: !354, line: 50, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!368, !369, !393, !388}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !362, file: !354, line: 51, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!368, !369, !393, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !362, file: !354, line: 52, baseType: !408, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!368, !369, !393, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!412 = !{!413}
!413 = !DISubrange(count: 1)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !355, file: !354, line: 76, baseType: !372, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !354, line: 77, baseType: !416, size: 32, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !355, file: !354, line: 78, baseType: !418, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !419)
!419 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !355, file: !354, line: 78, baseType: !418, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !355, file: !354, line: 78, baseType: !418, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !355, file: !354, line: 78, baseType: !418, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !355, file: !354, line: 79, baseType: !424, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !427, line: 27, baseType: !428)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !429, line: 43, baseType: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!430 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !355, file: !354, line: 80, baseType: !416, size: 32, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !355, file: !354, line: 81, baseType: !433, size: 32, offset: 992)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !355, file: !354, line: 82, baseType: !435, size: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !355, file: !354, line: 83, baseType: !439, size: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !355, file: !354, line: 84, baseType: !443, size: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !355, file: !354, line: 85, baseType: !443, size: 64, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !355, file: !354, line: 86, baseType: !443, size: 64, offset: 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !355, file: !354, line: 87, baseType: !443, size: 64, offset: 1344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !355, file: !354, line: 88, baseType: !369, size: 64, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !355, file: !354, line: 89, baseType: !424, size: 64, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !354, line: 90, baseType: !443, size: 64, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !355, file: !354, line: 91, baseType: !443, size: 64, offset: 1600)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !355, file: !354, line: 92, baseType: !416, size: 32, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !355, file: !354, line: 93, baseType: !453, size: 64, offset: 1728)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !354, line: 94, baseType: !455, size: 64, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !425)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !355, file: !354, line: 95, baseType: !416, size: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !355, file: !354, line: 95, baseType: !416, size: 32, offset: 1888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !355, file: !354, line: 96, baseType: !459, size: 64, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !355, file: !354, line: 96, baseType: !459, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !355, file: !354, line: 97, baseType: !462, size: 64, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !355, file: !354, line: 97, baseType: !464, size: 64, offset: 2112)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !355, file: !354, line: 98, baseType: !416, size: 32, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !355, file: !354, line: 98, baseType: !416, size: 32, offset: 2208)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !355, file: !354, line: 99, baseType: !459, size: 64, offset: 2240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !355, file: !354, line: 99, baseType: !459, size: 64, offset: 2304)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !355, file: !354, line: 100, baseType: !470, size: 64, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !419)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !355, file: !354, line: 100, baseType: !473, size: 64, offset: 2432)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !355, file: !354, line: 101, baseType: !416, size: 32, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !355, file: !354, line: 101, baseType: !416, size: 32, offset: 2528)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !355, file: !354, line: 102, baseType: !459, size: 64, offset: 2560)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !355, file: !354, line: 102, baseType: !459, size: 64, offset: 2624)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !355, file: !354, line: 103, baseType: !479, size: 64, offset: 2688)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !471)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !355, file: !354, line: 103, baseType: !482, size: 64, offset: 2752)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !355, file: !354, line: 104, baseType: !411, size: 64, offset: 2816)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !355, file: !354, line: 105, baseType: !416, size: 32, offset: 2880)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !355, file: !354, line: 106, baseType: !486, size: 128, offset: 2944)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 128, elements: !493)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !354, line: 64, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 61, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !489, file: !354, line: 62, baseType: !404, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !489, file: !354, line: 63, baseType: !453, size: 64, offset: 64)
!493 = !{!494}
!494 = !DISubrange(count: 2)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !355, file: !354, line: 107, baseType: !496, size: 64, offset: 3072)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 64, elements: !493)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !355, file: !354, line: 108, baseType: !453, size: 64, offset: 3136)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !355, file: !354, line: 109, baseType: !499, size: 64, offset: 3200)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!368, !453}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !355, file: !354, line: 111, baseType: !416, size: 32, offset: 3264)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !355, file: !354, line: 112, baseType: !504, size: 320, offset: 3328)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 320, elements: !550)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!368, !508, !369, !453}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !511)
!511 = !{!512, !513, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !510, file: !10, line: 100, baseType: !416, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !510, file: !10, line: 101, baseType: !514, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !525, !526, !527, !531, !533, !535, !536, !537}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !516, file: !10, line: 84, baseType: !443, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !516, file: !10, line: 85, baseType: !443, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !10, line: 86, baseType: !453, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !516, file: !10, line: 87, baseType: !435, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !516, file: !10, line: 88, baseType: !523, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !516, file: !10, line: 89, baseType: !395, size: 8, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !516, file: !10, line: 90, baseType: !443, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !516, file: !10, line: 91, baseType: !528, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !529, line: 46, baseType: !530)
!529 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!530 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !516, file: !10, line: 92, baseType: !532, size: 32, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !10, line: 93, baseType: !534, size: 32, offset: 544)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !10, line: 94, baseType: !514, size: 64, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !516, file: !10, line: 95, baseType: !443, size: 64, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !516, file: !10, line: 96, baseType: !453, size: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !510, file: !10, line: 102, baseType: !443, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !510, file: !10, line: 102, baseType: !443, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !510, file: !10, line: 103, baseType: !443, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !510, file: !10, line: 104, baseType: !372, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !510, file: !10, line: 105, baseType: !532, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !510, file: !10, line: 105, baseType: !532, size: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !510, file: !10, line: 105, baseType: !532, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !510, file: !10, line: 106, baseType: !369, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !510, file: !10, line: 107, baseType: !547, size: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!550 = !{!551}
!551 = !DISubrange(count: 5)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !355, file: !354, line: 113, baseType: !553, size: 320, offset: 3648)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 320, elements: !550)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!368, !369, !453}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !355, file: !354, line: 114, baseType: !558, size: 320, offset: 3968)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 320, elements: !550)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !355, file: !354, line: 115, baseType: !532, size: 32, offset: 4288)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !355, file: !354, line: 120, baseType: !547, size: 64, offset: 4352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !355, file: !354, line: 121, baseType: !532, size: 32, offset: 4416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !350, file: !349, line: 29, baseType: !563, size: 320, offset: 4480)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 320, elements: !412)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !349, line: 19, size: 320, elements: !565)
!565 = !{!566, !1583, !1584, !1585, !1586}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !564, file: !349, line: 20, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!368, !570, !599, !599}
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !573, line: 436, size: 23424, elements: !574)
!573 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!574 = !{!575, !576, !1358, !1359, !1360, !1361, !1363, !1364, !1365, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1479, !1480, !1496, !1497, !1498, !1499, !1500, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1535, !1555, !1556, !1558, !1559, !1560, !1561, !1562, !1563, !1581, !1582}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !572, file: !573, line: 437, baseType: !353, size: 4480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !572, file: !573, line: 437, baseType: !577, size: 9472, offset: 4480)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 9472, elements: !412)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !573, line: 32, size: 9472, elements: !579)
!579 = !{!580, !589, !593, !594, !595, !894, !895, !896, !897, !898, !899, !900, !920, !924, !929, !935, !954, !959, !963, !964, !968, !973, !974, !979, !983, !987, !991, !995, !999, !1000, !1001, !1002, !1003, !1007, !1008, !1013, !1014, !1015, !1016, !1017, !1022, !1029, !1033, !1037, !1041, !1045, !1049, !1050, !1054, !1055, !1059, !1064, !1065, !1066, !1067, !1129, !1137, !1138, !1142, !1143, !1147, !1148, !1152, !1157, !1158, !1162, !1166, !1170, !1171, !1172, !1173, !1174, !1175, !1180, !1181, !1185, !1189, !1193, !1194, !1195, !1199, !1209, !1210, !1214, !1215, !1219, !1220, !1224, !1225, !1229, !1230, !1234, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1250, !1251, !1252, !1253, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1272, !1273, !1274, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1294, !1298, !1299, !1303, !1304, !1305, !1306, !1332, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1347, !1348, !1352, !1356, !1357}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !578, file: !573, line: 34, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!368, !570, !416, !584, !416, !584, !586, !588}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !578, file: !573, line: 35, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!368, !570, !416, !462, !464, !482}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !578, file: !573, line: 36, baseType: !590, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !578, file: !573, line: 37, baseType: !567, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !578, file: !573, line: 38, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!368, !570, !599, !599, !599}
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !602, line: 142, size: 12800, elements: !603)
!602 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!603 = !{!604, !605, !820, !840, !841, !842, !888, !889, !890, !891, !893}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !601, file: !602, line: 143, baseType: !353, size: 4480)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !601, file: !602, line: 143, baseType: !606, size: 5248, offset: 4480)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 5248, elements: !412)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !602, line: 23, size: 5248, elements: !608)
!608 = !{!609, !614, !619, !623, !627, !633, !638, !639, !640, !644, !648, !649, !650, !654, !658, !662, !663, !667, !671, !675, !676, !680, !684, !685, !689, !693, !694, !695, !699, !700, !707, !712, !713, !714, !718, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !739, !740, !741, !745, !749, !750, !751, !752, !756, !757, !758, !759, !760, !761, !762, !766, !767, !771, !778, !779, !784, !785, !789, !790, !791, !792, !793, !794, !795, !796, !800, !801, !802, !808, !812, !813, !814}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !607, file: !602, line: 24, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!368, !599, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !607, file: !602, line: 25, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!368, !599, !416, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !607, file: !602, line: 26, baseType: !620, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!368, !416, !613}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !607, file: !602, line: 27, baseType: !624, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!368, !599, !599, !479}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !607, file: !602, line: 28, baseType: !628, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!368, !599, !416, !631, !479}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !607, file: !602, line: 29, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!368, !599, !637, !470}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !607, file: !602, line: 30, baseType: !624, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !607, file: !602, line: 31, baseType: !628, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !607, file: !602, line: 32, baseType: !641, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!368, !599, !480}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !607, file: !602, line: 33, baseType: !645, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!368, !599, !599}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !607, file: !602, line: 34, baseType: !641, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !607, file: !602, line: 35, baseType: !645, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !607, file: !602, line: 36, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!368, !599, !480, !599}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !607, file: !602, line: 37, baseType: !655, size: 64, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!368, !599, !480, !480, !599}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !607, file: !602, line: 38, baseType: !659, size: 64, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!368, !599, !416, !586, !613}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !607, file: !602, line: 39, baseType: !651, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !607, file: !602, line: 40, baseType: !664, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!368, !599, !480, !599, !599}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !607, file: !602, line: 41, baseType: !668, size: 64, offset: 1088)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!368, !599, !480, !480, !480, !599, !599}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !607, file: !602, line: 42, baseType: !672, size: 64, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!368, !599, !599, !599}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !607, file: !602, line: 43, baseType: !672, size: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !607, file: !602, line: 44, baseType: !677, size: 64, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!368, !599, !416, !584, !586, !588}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !607, file: !602, line: 45, baseType: !681, size: 64, offset: 1344)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!368, !599}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !607, file: !602, line: 46, baseType: !681, size: 64, offset: 1408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !607, file: !602, line: 47, baseType: !686, size: 64, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!368, !599, !482}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !607, file: !602, line: 48, baseType: !690, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!368, !599, !462}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !607, file: !602, line: 49, baseType: !690, size: 64, offset: 1600)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !607, file: !602, line: 50, baseType: !686, size: 64, offset: 1664)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !607, file: !602, line: 51, baseType: !696, size: 64, offset: 1728)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!368, !599, !462, !470}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !607, file: !602, line: 52, baseType: !696, size: 64, offset: 1792)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !607, file: !602, line: 53, baseType: !701, size: 64, offset: 1856)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!368, !599, !704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !607, file: !602, line: 54, baseType: !708, size: 64, offset: 1920)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!368, !599, !711, !532}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !607, file: !602, line: 55, baseType: !677, size: 64, offset: 1984)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !607, file: !602, line: 56, baseType: !681, size: 64, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !607, file: !602, line: 57, baseType: !715, size: 64, offset: 2112)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!368, !599, !380}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !607, file: !602, line: 58, baseType: !719, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!368, !599, !586}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !607, file: !602, line: 59, baseType: !719, size: 64, offset: 2240)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !607, file: !602, line: 60, baseType: !624, size: 64, offset: 2304)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !607, file: !602, line: 61, baseType: !624, size: 64, offset: 2368)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !607, file: !602, line: 62, baseType: !634, size: 64, offset: 2432)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !607, file: !602, line: 63, baseType: !628, size: 64, offset: 2496)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !607, file: !602, line: 64, baseType: !628, size: 64, offset: 2560)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !607, file: !602, line: 65, baseType: !715, size: 64, offset: 2624)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !607, file: !602, line: 66, baseType: !681, size: 64, offset: 2688)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !607, file: !602, line: 67, baseType: !681, size: 64, offset: 2752)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !607, file: !602, line: 68, baseType: !732, size: 64, offset: 2816)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!368, !599, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !736, line: 30, baseType: !737)
!736 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !736, line: 30, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !607, file: !602, line: 69, baseType: !677, size: 64, offset: 2880)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !607, file: !602, line: 70, baseType: !681, size: 64, offset: 2944)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !607, file: !602, line: 71, baseType: !742, size: 64, offset: 3008)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!368, !508, !599}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !607, file: !602, line: 72, baseType: !746, size: 64, offset: 3072)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!368, !599, !599, !470}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !607, file: !602, line: 73, baseType: !672, size: 64, offset: 3136)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !607, file: !602, line: 74, baseType: !672, size: 64, offset: 3200)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !607, file: !602, line: 75, baseType: !672, size: 64, offset: 3264)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !607, file: !602, line: 76, baseType: !753, size: 64, offset: 3328)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!368, !599, !416, !584, !479}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !607, file: !602, line: 77, baseType: !681, size: 64, offset: 3392)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !607, file: !602, line: 78, baseType: !681, size: 64, offset: 3456)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !607, file: !602, line: 79, baseType: !681, size: 64, offset: 3520)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !607, file: !602, line: 80, baseType: !681, size: 64, offset: 3584)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !607, file: !602, line: 81, baseType: !641, size: 64, offset: 3648)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !607, file: !602, line: 82, baseType: !681, size: 64, offset: 3712)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !607, file: !602, line: 83, baseType: !763, size: 64, offset: 3776)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!368, !599, !416, !599, !588}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !607, file: !602, line: 84, baseType: !763, size: 64, offset: 3840)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !607, file: !602, line: 85, baseType: !768, size: 64, offset: 3904)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!368, !599, !599, !479, !479}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !607, file: !602, line: 86, baseType: !772, size: 64, offset: 3968)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!368, !599, !775, !613}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !736, line: 11, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !736, line: 11, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !607, file: !602, line: 87, baseType: !772, size: 64, offset: 4032)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !607, file: !602, line: 88, baseType: !780, size: 64, offset: 4096)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!368, !599, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !607, file: !602, line: 89, baseType: !780, size: 64, offset: 4160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !607, file: !602, line: 90, baseType: !786, size: 64, offset: 4224)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!368, !599, !416, !584, !584, !599, !588}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !607, file: !602, line: 91, baseType: !786, size: 64, offset: 4288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !607, file: !602, line: 92, baseType: !715, size: 64, offset: 4352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !607, file: !602, line: 93, baseType: !715, size: 64, offset: 4416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !607, file: !602, line: 94, baseType: !645, size: 64, offset: 4480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !607, file: !602, line: 95, baseType: !645, size: 64, offset: 4544)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !607, file: !602, line: 96, baseType: !645, size: 64, offset: 4608)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !607, file: !602, line: 97, baseType: !645, size: 64, offset: 4672)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !607, file: !602, line: 98, baseType: !797, size: 64, offset: 4736)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!368, !599, !532}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !607, file: !602, line: 99, baseType: !686, size: 64, offset: 4800)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !607, file: !602, line: 100, baseType: !686, size: 64, offset: 4864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !607, file: !602, line: 101, baseType: !803, size: 64, offset: 4928)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!368, !599, !482, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !607, file: !602, line: 102, baseType: !809, size: 64, offset: 4992)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!368, !599, !783, !806}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !607, file: !602, line: 103, baseType: !686, size: 64, offset: 5056)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !607, file: !602, line: 104, baseType: !780, size: 64, offset: 5120)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !607, file: !602, line: 105, baseType: !815, size: 64, offset: 5184)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!368, !416, !631, !613, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !601, file: !602, line: 144, baseType: !821, size: 64, offset: 9728)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !736, line: 60, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !823, file: !133, line: 241, baseType: !372, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !823, file: !133, line: 242, baseType: !433, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !823, file: !133, line: 243, baseType: !416, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !823, file: !133, line: 243, baseType: !416, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !823, file: !133, line: 244, baseType: !416, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !823, file: !133, line: 244, baseType: !416, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !823, file: !133, line: 245, baseType: !462, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !823, file: !133, line: 246, baseType: !532, size: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !823, file: !133, line: 247, baseType: !416, size: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !823, file: !133, line: 251, baseType: !416, size: 32, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !823, file: !133, line: 252, baseType: !735, size: 64, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !823, file: !133, line: 253, baseType: !532, size: 32, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !823, file: !133, line: 254, baseType: !416, size: 32, offset: 544)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !823, file: !133, line: 254, baseType: !416, size: 32, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !823, file: !133, line: 255, baseType: !416, size: 32, offset: 608)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !602, line: 145, baseType: !453, size: 64, offset: 9792)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !601, file: !602, line: 146, baseType: !532, size: 32, offset: 9856)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !601, file: !602, line: 147, baseType: !843, size: 1344, offset: 9920)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !602, line: 140, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 114, size: 1344, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !864, !865, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !844, file: !602, line: 115, baseType: !416, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !844, file: !602, line: 116, baseType: !416, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !844, file: !602, line: 117, baseType: !416, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !844, file: !602, line: 118, baseType: !416, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !844, file: !602, line: 119, baseType: !416, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !844, file: !602, line: 120, baseType: !416, size: 32, offset: 160)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !844, file: !602, line: 121, baseType: !462, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !844, file: !602, line: 122, baseType: !479, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !844, file: !602, line: 124, baseType: !372, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !844, file: !602, line: 125, baseType: !433, size: 32, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !844, file: !602, line: 125, baseType: !433, size: 32, offset: 416)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !844, file: !602, line: 126, baseType: !433, size: 32, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !844, file: !602, line: 126, baseType: !433, size: 32, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !844, file: !602, line: 127, baseType: !860, size: 64, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !373, line: 339, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !373, line: 339, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !844, file: !602, line: 128, baseType: !860, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !844, file: !602, line: 129, baseType: !866, size: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !373, line: 341, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !373, line: 351, size: 192, elements: !869)
!869 = !{!870, !871, !872, !873, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !868, file: !373, line: 354, baseType: !91, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !868, file: !373, line: 355, baseType: !91, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !868, file: !373, line: 356, baseType: !91, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !868, file: !373, line: 361, baseType: !91, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !868, file: !373, line: 362, baseType: !528, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !844, file: !602, line: 130, baseType: !416, size: 32, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !844, file: !602, line: 130, baseType: !416, size: 32, offset: 736)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !844, file: !602, line: 131, baseType: !479, size: 64, offset: 768)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !844, file: !602, line: 131, baseType: !479, size: 64, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !844, file: !602, line: 132, baseType: !462, size: 64, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !844, file: !602, line: 132, baseType: !462, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !844, file: !602, line: 133, baseType: !416, size: 32, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !844, file: !602, line: 134, baseType: !462, size: 64, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !844, file: !602, line: 135, baseType: !416, size: 32, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !844, file: !602, line: 136, baseType: !532, size: 32, offset: 1184)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !844, file: !602, line: 137, baseType: !532, size: 32, offset: 1216)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !844, file: !602, line: 138, baseType: !588, size: 32, offset: 1248)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !844, file: !602, line: 139, baseType: !462, size: 64, offset: 1280)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !601, file: !602, line: 147, baseType: !843, size: 1344, offset: 11264)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !601, file: !602, line: 148, baseType: !532, size: 32, offset: 12608)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !601, file: !602, line: 149, baseType: !416, size: 32, offset: 12640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !601, file: !602, line: 150, baseType: !892, size: 32, offset: 12672)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !601, file: !602, line: 157, baseType: !443, size: 64, offset: 12736)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !578, file: !573, line: 40, baseType: !567, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !578, file: !573, line: 41, baseType: !596, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !578, file: !573, line: 42, baseType: !567, size: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !578, file: !573, line: 43, baseType: !596, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !578, file: !573, line: 44, baseType: !567, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !578, file: !573, line: 46, baseType: !596, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !578, file: !573, line: 47, baseType: !901, size: 64, offset: 704)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!368, !570, !775, !775, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !908)
!908 = !{!909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !907, file: !63, line: 1227, baseType: !471, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !907, file: !63, line: 1228, baseType: !471, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !907, file: !63, line: 1229, baseType: !471, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !907, file: !63, line: 1230, baseType: !471, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !907, file: !63, line: 1231, baseType: !471, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !907, file: !63, line: 1232, baseType: !471, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !907, file: !63, line: 1233, baseType: !471, size: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !907, file: !63, line: 1234, baseType: !471, size: 64, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !907, file: !63, line: 1236, baseType: !471, size: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !907, file: !63, line: 1237, baseType: !471, size: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !907, file: !63, line: 1238, baseType: !471, size: 64, offset: 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !578, file: !573, line: 48, baseType: !921, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!368, !570, !775, !904}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !578, file: !573, line: 49, baseType: !925, size: 64, offset: 832)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!368, !570, !599, !471, !928, !471, !416, !416, !599}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !578, file: !573, line: 50, baseType: !930, size: 64, offset: 896)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!368, !570, !933, !934}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !578, file: !573, line: 52, baseType: !936, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!368, !570, !939, !940}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !942, file: !63, line: 593, baseType: !418, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !942, file: !63, line: 594, baseType: !418, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !942, file: !63, line: 594, baseType: !418, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !942, file: !63, line: 594, baseType: !418, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !942, file: !63, line: 595, baseType: !418, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !942, file: !63, line: 596, baseType: !418, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !942, file: !63, line: 597, baseType: !418, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !942, file: !63, line: 598, baseType: !418, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !942, file: !63, line: 598, baseType: !418, size: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !942, file: !63, line: 599, baseType: !418, size: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !578, file: !573, line: 53, baseType: !955, size: 64, offset: 1024)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!368, !570, !570, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !578, file: !573, line: 54, baseType: !960, size: 64, offset: 1088)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!368, !570, !599}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !578, file: !573, line: 55, baseType: !567, size: 64, offset: 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !578, file: !573, line: 56, baseType: !965, size: 64, offset: 1216)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!368, !570, !637, !470}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !578, file: !573, line: 58, baseType: !969, size: 64, offset: 1280)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!368, !570, !972}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !578, file: !573, line: 59, baseType: !969, size: 64, offset: 1344)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !578, file: !573, line: 60, baseType: !975, size: 64, offset: 1408)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!368, !570, !978, !532}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !578, file: !573, line: 61, baseType: !980, size: 64, offset: 1472)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!368, !570}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !578, file: !573, line: 63, baseType: !984, size: 64, offset: 1536)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!368, !570, !416, !584, !480, !599, !599}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !578, file: !573, line: 64, baseType: !988, size: 64, offset: 1600)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!368, !570, !570, !775, !775, !904}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !578, file: !573, line: 65, baseType: !992, size: 64, offset: 1664)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!368, !570, !570, !904}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !578, file: !573, line: 66, baseType: !996, size: 64, offset: 1728)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!368, !570, !570, !775, !904}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !578, file: !573, line: 67, baseType: !992, size: 64, offset: 1792)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !578, file: !573, line: 69, baseType: !980, size: 64, offset: 1856)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !578, file: !573, line: 70, baseType: !988, size: 64, offset: 1920)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !578, file: !573, line: 71, baseType: !996, size: 64, offset: 1984)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !578, file: !573, line: 72, baseType: !1004, size: 64, offset: 2048)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!368, !570, !934}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !578, file: !573, line: 73, baseType: !980, size: 64, offset: 2112)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !578, file: !573, line: 75, baseType: !1009, size: 64, offset: 2176)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!368, !570, !1012, !934}
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !578, file: !573, line: 76, baseType: !567, size: 64, offset: 2240)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !578, file: !573, line: 77, baseType: !567, size: 64, offset: 2304)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !578, file: !573, line: 78, baseType: !901, size: 64, offset: 2368)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !578, file: !573, line: 79, baseType: !921, size: 64, offset: 2432)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !578, file: !573, line: 81, baseType: !1018, size: 64, offset: 2496)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!368, !570, !480, !570, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !578, file: !573, line: 82, baseType: !1023, size: 64, offset: 2560)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!368, !570, !416, !1026, !1026, !933, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !578, file: !573, line: 83, baseType: !1030, size: 64, offset: 2624)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!368, !570, !416, !819, !416}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !578, file: !573, line: 84, baseType: !1034, size: 64, offset: 2688)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!368, !570, !416, !584, !416, !584, !479}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !578, file: !573, line: 85, baseType: !1038, size: 64, offset: 2752)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!368, !570, !570, !1021}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !578, file: !573, line: 87, baseType: !1042, size: 64, offset: 2816)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!368, !570, !599, !462}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !578, file: !573, line: 88, baseType: !1046, size: 64, offset: 2880)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!368, !570, !480}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !578, file: !573, line: 89, baseType: !1046, size: 64, offset: 2944)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !578, file: !573, line: 90, baseType: !1051, size: 64, offset: 3008)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!368, !570, !599, !588}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !578, file: !573, line: 91, baseType: !984, size: 64, offset: 3072)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !578, file: !573, line: 93, baseType: !1056, size: 64, offset: 3136)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!368, !570, !704}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !578, file: !573, line: 94, baseType: !1060, size: 64, offset: 3200)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!368, !570, !416, !532, !532, !462, !1063, !1063, !958}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !578, file: !573, line: 95, baseType: !1060, size: 64, offset: 3264)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !578, file: !573, line: 96, baseType: !1060, size: 64, offset: 3328)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !578, file: !573, line: 97, baseType: !1060, size: 64, offset: 3392)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !578, file: !573, line: 99, baseType: !1068, size: 64, offset: 3456)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!368, !570, !1071, !1074}
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !736, line: 51, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !736, line: 51, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !573, line: 609, size: 6208, elements: !1077)
!1077 = !{!1078, !1079, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1098, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1116, !1117, !1118, !1119, !1120, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1076, file: !573, line: 610, baseType: !353, size: 4480)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1076, file: !573, line: 610, baseType: !1080, size: 32, offset: 4480)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !412)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1076, file: !573, line: 611, baseType: !416, size: 32, offset: 4512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1076, file: !573, line: 611, baseType: !416, size: 32, offset: 4544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1076, file: !573, line: 611, baseType: !416, size: 32, offset: 4576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1076, file: !573, line: 612, baseType: !416, size: 32, offset: 4608)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1076, file: !573, line: 613, baseType: !416, size: 32, offset: 4640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1076, file: !573, line: 614, baseType: !462, size: 64, offset: 4672)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1076, file: !573, line: 615, baseType: !464, size: 64, offset: 4736)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1076, file: !573, line: 616, baseType: !819, size: 64, offset: 4800)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1076, file: !573, line: 617, baseType: !462, size: 64, offset: 4864)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1076, file: !573, line: 618, baseType: !1091, size: 64, offset: 4928)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !573, line: 602, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 598, size: 128, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1093, file: !573, line: 599, baseType: !416, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1093, file: !573, line: 600, baseType: !416, size: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1093, file: !573, line: 601, baseType: !479, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1076, file: !573, line: 619, baseType: !1099, size: 64, offset: 4992)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !573, line: 607, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 604, size: 128, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1101, file: !573, line: 605, baseType: !416, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1101, file: !573, line: 606, baseType: !479, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1076, file: !573, line: 620, baseType: !479, size: 64, offset: 5056)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1076, file: !573, line: 621, baseType: !471, size: 64, offset: 5120)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1076, file: !573, line: 622, baseType: !471, size: 64, offset: 5184)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1076, file: !573, line: 623, baseType: !599, size: 64, offset: 5248)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1076, file: !573, line: 623, baseType: !599, size: 64, offset: 5312)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1076, file: !573, line: 623, baseType: !599, size: 64, offset: 5376)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1076, file: !573, line: 624, baseType: !532, size: 32, offset: 5440)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1076, file: !573, line: 625, baseType: !1113, size: 64, offset: 5504)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!368}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1076, file: !573, line: 626, baseType: !453, size: 64, offset: 5568)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1076, file: !573, line: 627, baseType: !599, size: 64, offset: 5632)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1076, file: !573, line: 628, baseType: !416, size: 32, offset: 5696)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1076, file: !573, line: 629, baseType: !393, size: 64, offset: 5760)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1076, file: !573, line: 630, baseType: !1121, size: 32, offset: 5824)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1076, file: !573, line: 631, baseType: !416, size: 32, offset: 5856)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1076, file: !573, line: 631, baseType: !416, size: 32, offset: 5888)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1076, file: !573, line: 632, baseType: !532, size: 32, offset: 5920)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1076, file: !573, line: 633, baseType: !532, size: 32, offset: 5952)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1076, file: !573, line: 634, baseType: !404, size: 64, offset: 6016)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1076, file: !573, line: 634, baseType: !453, size: 64, offset: 6080)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1076, file: !573, line: 635, baseType: !424, size: 64, offset: 6144)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !578, file: !573, line: 100, baseType: !1130, size: 64, offset: 3520)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!368, !570, !416, !416, !1133, !1136}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1135)
!1135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !578, file: !573, line: 101, baseType: !980, size: 64, offset: 3584)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !578, file: !573, line: 102, baseType: !1139, size: 64, offset: 3648)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!368, !570, !775, !775, !934}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !578, file: !573, line: 103, baseType: !581, size: 64, offset: 3712)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !578, file: !573, line: 105, baseType: !1144, size: 64, offset: 3776)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!368, !570, !775, !775, !933, !934}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !578, file: !573, line: 106, baseType: !980, size: 64, offset: 3840)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !578, file: !573, line: 107, baseType: !1149, size: 64, offset: 3904)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!368, !570, !380}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !578, file: !573, line: 108, baseType: !1153, size: 64, offset: 3968)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!368, !570, !1156, !933, !934}
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !393)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !578, file: !573, line: 109, baseType: !1113, size: 64, offset: 4032)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !578, file: !573, line: 111, baseType: !1159, size: 64, offset: 4096)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!368, !570, !570, !570, !471, !570}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !578, file: !573, line: 112, baseType: !1163, size: 64, offset: 4160)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!368, !570, !570, !570, !570}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !578, file: !573, line: 113, baseType: !1167, size: 64, offset: 4224)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!368, !570, !735, !735}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !578, file: !573, line: 114, baseType: !581, size: 64, offset: 4288)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !578, file: !573, line: 115, baseType: !984, size: 64, offset: 4352)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !578, file: !573, line: 117, baseType: !1042, size: 64, offset: 4416)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !578, file: !573, line: 118, baseType: !1042, size: 64, offset: 4480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !578, file: !573, line: 119, baseType: !1153, size: 64, offset: 4544)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !578, file: !573, line: 120, baseType: !1176, size: 64, offset: 4608)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!368, !570, !1179, !958}
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !578, file: !573, line: 121, baseType: !1113, size: 64, offset: 4672)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !578, file: !573, line: 123, baseType: !1182, size: 64, offset: 4736)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!368, !570, !416, !453}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !578, file: !573, line: 124, baseType: !1186, size: 64, offset: 4800)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!368, !570, !1074, !599, !453}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !578, file: !573, line: 125, baseType: !1190, size: 64, offset: 4864)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!368, !508, !570}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !578, file: !573, line: 126, baseType: !567, size: 64, offset: 4928)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !578, file: !573, line: 127, baseType: !567, size: 64, offset: 4992)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !578, file: !573, line: 129, baseType: !1196, size: 64, offset: 5056)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!368, !570, !819}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !578, file: !573, line: 130, baseType: !1200, size: 64, offset: 5120)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!368, !570, !1203, !1203}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1205, file: !36, line: 653, baseType: !416, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1205, file: !36, line: 653, baseType: !599, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !578, file: !573, line: 131, baseType: !1200, size: 64, offset: 5184)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !578, file: !573, line: 132, baseType: !1211, size: 64, offset: 5248)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!368, !570, !462, !462, !462}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !578, file: !573, line: 133, baseType: !1149, size: 64, offset: 5312)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !578, file: !573, line: 135, baseType: !1216, size: 64, offset: 5376)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!368, !570, !471, !958}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !578, file: !573, line: 136, baseType: !1216, size: 64, offset: 5440)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !578, file: !573, line: 137, baseType: !1221, size: 64, offset: 5504)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!368, !570, !958}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !578, file: !573, line: 138, baseType: !581, size: 64, offset: 5568)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !578, file: !573, line: 139, baseType: !1226, size: 64, offset: 5632)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!368, !570, !613, !613}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !578, file: !573, line: 141, baseType: !1113, size: 64, offset: 5696)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !578, file: !573, line: 142, baseType: !1231, size: 64, offset: 5760)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!368, !570, !570, !471, !570}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !578, file: !573, line: 143, baseType: !1235, size: 64, offset: 5824)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!368, !570, !570, !570}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !578, file: !573, line: 144, baseType: !1113, size: 64, offset: 5888)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !578, file: !573, line: 145, baseType: !1231, size: 64, offset: 5952)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !578, file: !573, line: 147, baseType: !1235, size: 64, offset: 6016)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !578, file: !573, line: 148, baseType: !1113, size: 64, offset: 6080)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !578, file: !573, line: 149, baseType: !1231, size: 64, offset: 6144)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !578, file: !573, line: 150, baseType: !1235, size: 64, offset: 6208)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !578, file: !573, line: 151, baseType: !1245, size: 64, offset: 6272)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!368, !570, !532}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !578, file: !573, line: 153, baseType: !980, size: 64, offset: 6336)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !578, file: !573, line: 154, baseType: !980, size: 64, offset: 6400)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !578, file: !573, line: 155, baseType: !980, size: 64, offset: 6464)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !578, file: !573, line: 156, baseType: !980, size: 64, offset: 6528)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !578, file: !573, line: 157, baseType: !1149, size: 64, offset: 6592)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !578, file: !573, line: 159, baseType: !1254, size: 64, offset: 6656)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!368, !570, !416, !586}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !578, file: !573, line: 160, baseType: !980, size: 64, offset: 6720)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !578, file: !573, line: 161, baseType: !980, size: 64, offset: 6784)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !578, file: !573, line: 162, baseType: !980, size: 64, offset: 6848)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !578, file: !573, line: 163, baseType: !980, size: 64, offset: 6912)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !578, file: !573, line: 165, baseType: !1235, size: 64, offset: 6976)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !578, file: !573, line: 166, baseType: !1235, size: 64, offset: 7040)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !578, file: !573, line: 167, baseType: !1042, size: 64, offset: 7104)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !578, file: !573, line: 168, baseType: !1265, size: 64, offset: 7168)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!368, !570, !599, !416}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !578, file: !573, line: 169, baseType: !1269, size: 64, offset: 7232)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!368, !570, !958, !462}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !578, file: !573, line: 171, baseType: !1004, size: 64, offset: 7296)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !578, file: !573, line: 172, baseType: !980, size: 64, offset: 7360)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !578, file: !573, line: 173, baseType: !1275, size: 64, offset: 7424)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!368, !570, !462, !1063}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !578, file: !573, line: 174, baseType: !1139, size: 64, offset: 7488)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !578, file: !573, line: 175, baseType: !1139, size: 64, offset: 7552)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !578, file: !573, line: 177, baseType: !567, size: 64, offset: 7616)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !578, file: !573, line: 178, baseType: !930, size: 64, offset: 7680)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !578, file: !573, line: 179, baseType: !567, size: 64, offset: 7744)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !578, file: !573, line: 180, baseType: !596, size: 64, offset: 7808)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !578, file: !573, line: 181, baseType: !1285, size: 64, offset: 7872)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!368, !570, !372, !933, !934}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !578, file: !573, line: 183, baseType: !1196, size: 64, offset: 7936)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !578, file: !573, line: 184, baseType: !965, size: 64, offset: 8000)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !578, file: !573, line: 185, baseType: !1291, size: 64, offset: 8064)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!368, !570, !783}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !578, file: !573, line: 186, baseType: !1295, size: 64, offset: 8128)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!368, !570, !416, !584, !479}
