; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtone.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtone.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.PetscDraw_X = type { %struct._XDisplay*, i32, %struct.Visual*, i32, %struct.PetscDrawXiGC, %struct.PetscDrawXiFont*, i64, i64, i64, i32, i64, i64, [256 x i64], [256 x [3 x i8]], i32, i32, i32, i32 }
%struct._XDisplay = type opaque
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.PetscDrawXiGC = type { %struct._XGC*, i64 }
%struct._XGC = type opaque
%struct.PetscDrawXiFont = type { i64, i32, i32, i32, i64 }
%struct.ompi_communicator_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscDrawInterpolatedTriangle_X = private unnamed_addr constant [32 x i8] c"PetscDrawInterpolatedTriangle_X\00", align 1
@.str = private unnamed_addr constant [90 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtone.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtone.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !{!11, !14, !15, !16, !20, !21}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !17, line: 330, baseType: !18)
!17 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !17, line: 330, flags: DIFlagFwdDecl)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !22, line: 102, baseType: !15)
!22 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!23 = !{i32 7, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{i32 7, !"PIC Level", i32 2}
!27 = !{i32 7, !"uwtable", i32 1}
!28 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!29 = distinct !DISubprogram(name: "PetscDrawInterpolatedTriangle_X", scope: !30, file: !30, line: 11, type: !31, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !120)
!30 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtone.c", directory: "/home/users/ndemeye/xSDK")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !34, !15, !15, !15, !15, !15, !15, !15, !15, !15}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !22, line: 14, baseType: !15)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_X", file: !36, line: 43, baseType: !37)
!36 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/x/ximpl.h", directory: "/home/users/ndemeye/xSDK")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 27, size: 23488, elements: !38)
!38 = !{!39, !44, !45, !75, !76, !86, !98, !100, !102, !104, !105, !106, !107, !111, !116, !117, !118, !119}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !37, file: !36, line: 28, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !42, line: 487, baseType: !43)
!42 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !42, line: 255, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !37, file: !36, line: 29, baseType: !15, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !37, file: !36, line: 30, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !42, line: 238, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 227, size: 448, elements: !49)
!49 = !{!50, !65, !69, !70, !71, !72, !73, !74}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !48, file: !42, line: 228, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !42, line: 155, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !42, line: 148, size: 256, elements: !54)
!54 = !{!55, !56, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !53, file: !42, line: 149, baseType: !15, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !42, line: 150, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !53, file: !42, line: 151, baseType: !59, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!15, !57}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !53, file: !42, line: 154, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !42, line: 80, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !48, file: !42, line: 229, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !67, line: 76, baseType: !68)
!67 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !48, file: !42, line: 233, baseType: !15, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !48, file: !42, line: 235, baseType: !68, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !48, file: !42, line: 235, baseType: !68, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !48, file: !42, line: 235, baseType: !68, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !48, file: !42, line: 236, baseType: !15, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !48, file: !42, line: 237, baseType: !15, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !37, file: !36, line: 31, baseType: !15, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !37, file: !36, line: 32, baseType: !77, size: 128, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiGC", file: !36, line: 18, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 15, size: 128, elements: !79)
!79 = !{!80, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !78, file: !36, line: 16, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !42, line: 222, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !42, line: 214, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pix", scope: !78, file: !36, line: 17, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiPixVal", file: !36, line: 13, baseType: !68)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !37, file: !36, line: 33, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiFont", file: !36, line: 25, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 20, size: 256, elements: !90)
!90 = !{!91, !94, !95, !96, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fnt", scope: !89, file: !36, line: 21, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "Font", file: !67, line: 100, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !67, line: 66, baseType: !68)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "font_w", scope: !89, file: !36, line: 22, baseType: !15, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "font_h", scope: !89, file: !36, line: 22, baseType: !15, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "font_descent", scope: !89, file: !36, line: 23, baseType: !15, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "font_pix", scope: !89, file: !36, line: 24, baseType: !85, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !37, file: !36, line: 34, baseType: !99, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !67, line: 96, baseType: !93)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "drw", scope: !37, file: !36, line: 35, baseType: !101, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !67, line: 97, baseType: !93)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !37, file: !36, line: 36, baseType: !103, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !67, line: 104, baseType: !93)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cmapsize", scope: !37, file: !36, line: 37, baseType: !15, size: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !37, file: !36, line: 38, baseType: !85, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !37, file: !36, line: 39, baseType: !85, size: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cmapping", scope: !37, file: !36, line: 40, baseType: !108, size: 16384, offset: 832)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 16384, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cpalette", scope: !37, file: !36, line: 41, baseType: !112, size: 6144, offset: 17216)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 6144, elements: !114)
!113 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!110, !115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !36, line: 42, baseType: !15, size: 32, offset: 23360)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !36, line: 42, baseType: !15, size: 32, offset: 23392)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !37, file: !36, line: 42, baseType: !15, size: 32, offset: 23424)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !37, file: !36, line: 42, baseType: !15, size: 32, offset: 23456)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !156, !158, !160, !164, !166, !168, !172, !174}
!121 = !DILocalVariable(name: "win", arg: 1, scope: !29, file: !30, line: 11, type: !34)
!122 = !DILocalVariable(name: "x1", arg: 2, scope: !29, file: !30, line: 11, type: !15)
!123 = !DILocalVariable(name: "y_1", arg: 3, scope: !29, file: !30, line: 11, type: !15)
!124 = !DILocalVariable(name: "t1", arg: 4, scope: !29, file: !30, line: 11, type: !15)
!125 = !DILocalVariable(name: "x2", arg: 5, scope: !29, file: !30, line: 11, type: !15)
!126 = !DILocalVariable(name: "y2", arg: 6, scope: !29, file: !30, line: 11, type: !15)
!127 = !DILocalVariable(name: "t2", arg: 7, scope: !29, file: !30, line: 11, type: !15)
!128 = !DILocalVariable(name: "x3", arg: 8, scope: !29, file: !30, line: 11, type: !15)
!129 = !DILocalVariable(name: "y3", arg: 9, scope: !29, file: !30, line: 11, type: !15)
!130 = !DILocalVariable(name: "t3", arg: 10, scope: !29, file: !30, line: 11, type: !15)
!131 = !DILocalVariable(name: "rfrac", scope: !29, file: !30, line: 13, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !22, line: 189, baseType: !14)
!133 = !DILocalVariable(name: "lfrac", scope: !29, file: !30, line: 13, type: !132)
!134 = !DILocalVariable(name: "R_y2_y_1", scope: !29, file: !30, line: 14, type: !132)
!135 = !DILocalVariable(name: "R_y3_y_1", scope: !29, file: !30, line: 14, type: !132)
!136 = !DILocalVariable(name: "R_y3_y2", scope: !29, file: !30, line: 14, type: !132)
!137 = !DILocalVariable(name: "lc", scope: !29, file: !30, line: 15, type: !15)
!138 = !DILocalVariable(name: "rc", scope: !29, file: !30, line: 15, type: !15)
!139 = !DILocalVariable(name: "lx", scope: !29, file: !30, line: 15, type: !15)
!140 = !DILocalVariable(name: "rx", scope: !29, file: !30, line: 15, type: !15)
!141 = !DILocalVariable(name: "xx", scope: !29, file: !30, line: 15, type: !15)
!142 = !DILocalVariable(name: "y", scope: !29, file: !30, line: 15, type: !15)
!143 = !DILocalVariable(name: "c", scope: !29, file: !30, line: 15, type: !15)
!144 = !DILocalVariable(name: "rc_lc", scope: !29, file: !30, line: 16, type: !15)
!145 = !DILocalVariable(name: "rx_lx", scope: !29, file: !30, line: 16, type: !15)
!146 = !DILocalVariable(name: "t2_t1", scope: !29, file: !30, line: 16, type: !15)
!147 = !DILocalVariable(name: "x2_x1", scope: !29, file: !30, line: 16, type: !15)
!148 = !DILocalVariable(name: "t3_t1", scope: !29, file: !30, line: 16, type: !15)
!149 = !DILocalVariable(name: "x3_x1", scope: !29, file: !30, line: 16, type: !15)
!150 = !DILocalVariable(name: "t3_t2", scope: !29, file: !30, line: 16, type: !15)
!151 = !DILocalVariable(name: "x3_x2", scope: !29, file: !30, line: 16, type: !15)
!152 = !DILocalVariable(name: "_a", scope: !153, file: !30, line: 34, type: !15)
!153 = distinct !DILexicalBlock(scope: !154, file: !30, line: 34, column: 5)
!154 = distinct !DILexicalBlock(scope: !155, file: !30, line: 33, column: 17)
!155 = distinct !DILexicalBlock(scope: !29, file: !30, line: 33, column: 7)
!156 = !DILocalVariable(name: "_a", scope: !157, file: !30, line: 34, type: !15)
!157 = distinct !DILexicalBlock(scope: !154, file: !30, line: 34, column: 18)
!158 = !DILocalVariable(name: "_a", scope: !159, file: !30, line: 34, type: !15)
!159 = distinct !DILexicalBlock(scope: !154, file: !30, line: 34, column: 31)
!160 = !DILocalVariable(name: "_a", scope: !161, file: !30, line: 37, type: !15)
!161 = distinct !DILexicalBlock(scope: !162, file: !30, line: 37, column: 5)
!162 = distinct !DILexicalBlock(scope: !163, file: !30, line: 36, column: 17)
!163 = distinct !DILexicalBlock(scope: !29, file: !30, line: 36, column: 7)
!164 = !DILocalVariable(name: "_a", scope: !165, file: !30, line: 37, type: !15)
