; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/shell/snesshell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/shell/snesshell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!35 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!36 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!37 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!38 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!39 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!40 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!41 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!42 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!43 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!44 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 85, baseType: !26, size: 32, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!49 = !DIEnumerator(name: "PC_LEFT", value: 0)
!50 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !{!99, !103, !104, !307, !139, !310, !273, !308}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !100, line: 330, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !100, line: 330, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !107, line: 73, size: 4480, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !111, !160, !161, !163, !166, !167, !168, !169, !177, !178, !180, !184, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !201, !202, !203, !205, !206, !208, !210, !211, !212, !213, !214, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !240, !242, !243, !247, !248, !297, !302, !304, !305, !306}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !106, file: !107, line: 74, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !106, file: !107, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !158)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !107, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 45, size: 448, elements: !115)
!115 = !{!116, !122, !130, !135, !142, !146, !153}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !107, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !104, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !107, line: 47, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!120, !104, !126}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !127, line: 16, baseType: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !127, line: 16, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !107, line: 48, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!120, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !107, line: 49, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!120, !104, !139, !104}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !107, line: 50, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!120, !104, !139, !134}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !107, line: 51, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !104, !139, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !107, line: 52, baseType: !154, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!120, !104, !139, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!158 = !{!159}
!159 = !DISubrange(count: 1)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !106, file: !107, line: 76, baseType: !99, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !107, line: 77, baseType: !162, size: 32, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !106, file: !107, line: 78, baseType: !164, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !165)
!165 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !106, file: !107, line: 78, baseType: !164, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !106, file: !107, line: 78, baseType: !164, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !106, file: !107, line: 78, baseType: !164, size: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !107, line: 79, baseType: !170, size: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !173, line: 27, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !175, line: 43, baseType: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !106, file: !107, line: 80, baseType: !162, size: 32, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !106, file: !107, line: 81, baseType: !179, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !106, file: !107, line: 82, baseType: !181, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !106, file: !107, line: 83, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !106, file: !107, line: 84, baseType: !189, size: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !106, file: !107, line: 85, baseType: !189, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !106, file: !107, line: 86, baseType: !189, size: 64, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !106, file: !107, line: 87, baseType: !189, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !106, file: !107, line: 88, baseType: !104, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !106, file: !107, line: 89, baseType: !170, size: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !107, line: 90, baseType: !189, size: 64, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !106, file: !107, line: 91, baseType: !189, size: 64, offset: 1600)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !106, file: !107, line: 92, baseType: !162, size: 32, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !106, file: !107, line: 93, baseType: !103, size: 64, offset: 1728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !106, file: !107, line: 94, baseType: !200, size: 64, offset: 1792)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !171)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !106, file: !107, line: 95, baseType: !162, size: 32, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !106, file: !107, line: 95, baseType: !162, size: 32, offset: 1888)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !106, file: !107, line: 96, baseType: !204, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !106, file: !107, line: 96, baseType: !204, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !106, file: !107, line: 97, baseType: !207, size: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !106, file: !107, line: 97, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !106, file: !107, line: 98, baseType: !162, size: 32, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !106, file: !107, line: 98, baseType: !162, size: 32, offset: 2208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !106, file: !107, line: 99, baseType: !204, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !106, file: !107, line: 99, baseType: !204, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !106, file: !107, line: 100, baseType: !215, size: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !165)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !106, file: !107, line: 100, baseType: !218, size: 64, offset: 2432)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !106, file: !107, line: 101, baseType: !162, size: 32, offset: 2496)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !106, file: !107, line: 101, baseType: !162, size: 32, offset: 2528)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !106, file: !107, line: 102, baseType: !204, size: 64, offset: 2560)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !106, file: !107, line: 102, baseType: !204, size: 64, offset: 2624)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !106, file: !107, line: 103, baseType: !224, size: 64, offset: 2688)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !106, file: !107, line: 103, baseType: !227, size: 64, offset: 2752)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !106, file: !107, line: 104, baseType: !157, size: 64, offset: 2816)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !106, file: !107, line: 105, baseType: !162, size: 32, offset: 2880)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !106, file: !107, line: 106, baseType: !231, size: 128, offset: 2944)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !238)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !107, line: 64, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 61, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !107, line: 62, baseType: !150, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !234, file: !107, line: 63, baseType: !103, size: 64, offset: 64)
!238 = !{!239}
!239 = !DISubrange(count: 2)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !106, file: !107, line: 107, baseType: !241, size: 64, offset: 3072)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, elements: !238)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !106, file: !107, line: 108, baseType: !103, size: 64, offset: 3136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !106, file: !107, line: 109, baseType: !244, size: 64, offset: 3200)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!120, !103}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !106, file: !107, line: 111, baseType: !162, size: 32, offset: 3264)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !106, file: !107, line: 112, baseType: !249, size: 320, offset: 3328)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !295)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!120, !253, !104, !103}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !256)
!256 = !{!257, !258, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !255, file: !10, line: 100, baseType: !162, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !10, line: 101, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !270, !271, !272, !276, !278, !280, !281, !282}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !261, file: !10, line: 84, baseType: !189, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !10, line: 85, baseType: !189, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !10, line: 86, baseType: !103, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !261, file: !10, line: 87, baseType: !181, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !261, file: !10, line: 88, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !261, file: !10, line: 89, baseType: !141, size: 8, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !261, file: !10, line: 90, baseType: !189, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !261, file: !10, line: 91, baseType: !273, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 46, baseType: !275)
!274 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!275 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !261, file: !10, line: 92, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !10, line: 93, baseType: !279, size: 32, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !10, line: 94, baseType: !259, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !261, file: !10, line: 95, baseType: !189, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !261, file: !10, line: 96, baseType: !103, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !255, file: !10, line: 103, baseType: !189, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !255, file: !10, line: 104, baseType: !99, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !255, file: !10, line: 106, baseType: !104, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !255, file: !10, line: 107, baseType: !292, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!295 = !{!296}
!296 = !DISubrange(count: 5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !106, file: !107, line: 113, baseType: !298, size: 320, offset: 3648)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!120, !104, !103}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !106, file: !107, line: 114, baseType: !303, size: 320, offset: 3968)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !295)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !106, file: !107, line: 115, baseType: !277, size: 32, offset: 4288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !106, file: !107, line: 120, baseType: !292, size: 64, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !106, file: !107, line: 121, baseType: !277, size: 32, offset: 4416)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !309, line: 1451, baseType: !150)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_Shell", file: !312, line: 3, baseType: !313)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/shell/snesshell.c", directory: "/home/users/ndemeye/xSDK")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 3, size: 128, elements: !314)
!314 = !{!315, !509}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !313, file: !312, line: 3, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!120, !319, !334}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !322, line: 38, size: 11648, elements: !323)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!323 = !{!324, !326, !393, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !416, !420, !421, !423, !424, !425, !426, !427, !432, !434, !435, !436, !437, !438, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !474, !476, !477, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !321, file: !322, line: 39, baseType: !325, size: 4480)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !107, line: 122, baseType: !106)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !321, file: !322, line: 39, baseType: !327, size: 1088, offset: 4480)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1088, elements: !158)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !322, line: 12, size: 1088, elements: !329)
!329 = !{!330, !338, !342, !346, !352, !353, !357, !358, !362, !366, !367, !368, !373, !377, !381, !385, !392}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !328, file: !322, line: 13, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!120, !319, !334, !103}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !335, line: 21, baseType: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !335, line: 21, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !328, file: !322, line: 14, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!120, !334, !334, !103}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !328, file: !322, line: 15, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!120, !319, !162}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !328, file: !322, line: 16, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!120, !319, !162, !216, !216, !216, !350, !103}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !328, file: !322, line: 17, baseType: !244, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !328, file: !322, line: 18, baseType: !354, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!120, !319}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !328, file: !322, line: 19, baseType: !354, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !328, file: !322, line: 20, baseType: !359, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!120, !319, !126}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !328, file: !322, line: 21, baseType: !363, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!120, !253, !319}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !328, file: !322, line: 22, baseType: !354, size: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !328, file: !322, line: 23, baseType: !354, size: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !328, file: !322, line: 24, baseType: !369, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!120, !319, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !328, file: !322, line: 25, baseType: !374, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!120, !372}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !328, file: !322, line: 26, baseType: !378, size: 64, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!120, !319, !334, !334}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !328, file: !322, line: 27, baseType: !382, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!120, !319, !334, !334, !103}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !328, file: !322, line: 28, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!120, !319, !334, !389, !389, !103}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !328, file: !322, line: 29, baseType: !359, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !321, file: !322, line: 40, baseType: !394, size: 64, offset: 5568)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !395, line: 14, baseType: !396)
!395 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !395, line: 14, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !321, file: !322, line: 41, baseType: !277, size: 32, offset: 5632)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !321, file: !322, line: 42, baseType: !319, size: 64, offset: 5696)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !321, file: !322, line: 43, baseType: !401, size: 32, offset: 5760)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !321, file: !322, line: 44, baseType: !277, size: 32, offset: 5792)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !321, file: !322, line: 47, baseType: !103, size: 64, offset: 5824)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !321, file: !322, line: 49, baseType: !334, size: 64, offset: 5888)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !321, file: !322, line: 50, baseType: !334, size: 64, offset: 5952)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !321, file: !322, line: 52, baseType: !334, size: 64, offset: 6016)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !321, file: !322, line: 54, baseType: !389, size: 64, offset: 6080)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !321, file: !322, line: 55, baseType: !389, size: 64, offset: 6144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !321, file: !322, line: 56, baseType: !389, size: 64, offset: 6208)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !321, file: !322, line: 57, baseType: !103, size: 64, offset: 6272)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !321, file: !322, line: 58, baseType: !412, size: 64, offset: 6336)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !413, line: 22, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !413, line: 22, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !321, file: !322, line: 59, baseType: !417, size: 64, offset: 6400)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !321, file: !322, line: 60, baseType: !277, size: 32, offset: 6464)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !321, file: !322, line: 61, baseType: !422, size: 32, offset: 6496)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !321, file: !322, line: 63, baseType: !334, size: 64, offset: 6528)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !321, file: !322, line: 65, baseType: !334, size: 64, offset: 6592)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !321, file: !322, line: 66, baseType: !103, size: 64, offset: 6656)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !321, file: !322, line: 68, baseType: !216, size: 64, offset: 6720)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !321, file: !322, line: 74, baseType: !428, size: 320, offset: 6784)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 320, elements: !295)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!120, !319, !162, !216, !103}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !321, file: !322, line: 75, baseType: !433, size: 320, offset: 7104)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 320, elements: !295)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !321, file: !322, line: 76, baseType: !303, size: 320, offset: 7424)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !321, file: !322, line: 77, baseType: !162, size: 32, offset: 7744)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !321, file: !322, line: 78, baseType: !103, size: 64, offset: 7808)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !321, file: !322, line: 79, baseType: !351, size: 32, offset: 7872)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !321, file: !322, line: 80, baseType: !439, size: 320, offset: 7936)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 320, elements: !295)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!120, !319, !103}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !321, file: !322, line: 81, baseType: !433, size: 320, offset: 8256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !321, file: !322, line: 82, baseType: !303, size: 320, offset: 8576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !321, file: !322, line: 83, baseType: !162, size: 32, offset: 8896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !321, file: !322, line: 84, baseType: !277, size: 32, offset: 8928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !321, file: !322, line: 88, baseType: !277, size: 32, offset: 8960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !322, line: 89, baseType: !103, size: 64, offset: 9024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !321, file: !322, line: 93, baseType: !162, size: 32, offset: 9088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !321, file: !322, line: 94, baseType: !162, size: 32, offset: 9120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !321, file: !322, line: 95, baseType: !162, size: 32, offset: 9152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !321, file: !322, line: 96, baseType: !162, size: 32, offset: 9184)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !321, file: !322, line: 97, baseType: !162, size: 32, offset: 9216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !321, file: !322, line: 98, baseType: !216, size: 64, offset: 9280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !321, file: !322, line: 99, baseType: !216, size: 64, offset: 9344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !321, file: !322, line: 100, baseType: !216, size: 64, offset: 9408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !321, file: !322, line: 101, baseType: !216, size: 64, offset: 9472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !321, file: !322, line: 102, baseType: !216, size: 64, offset: 9536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !321, file: !322, line: 103, baseType: !216, size: 64, offset: 9600)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !321, file: !322, line: 104, baseType: !216, size: 64, offset: 9664)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !321, file: !322, line: 105, baseType: !216, size: 64, offset: 9728)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !321, file: !322, line: 106, baseType: !277, size: 32, offset: 9792)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !321, file: !322, line: 107, baseType: !162, size: 32, offset: 9824)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !321, file: !322, line: 108, baseType: !162, size: 32, offset: 9856)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !321, file: !322, line: 109, baseType: !162, size: 32, offset: 9888)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !321, file: !322, line: 110, baseType: !277, size: 32, offset: 9920)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !321, file: !322, line: 111, baseType: !162, size: 32, offset: 9952)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !321, file: !322, line: 112, baseType: !277, size: 32, offset: 9984)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !321, file: !322, line: 113, baseType: !162, size: 32, offset: 10016)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !321, file: !322, line: 115, baseType: !277, size: 32, offset: 10048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !321, file: !322, line: 117, baseType: !277, size: 32, offset: 10080)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !321, file: !322, line: 119, baseType: !473, size: 32, offset: 10112)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !321, file: !322, line: 120, baseType: !475, size: 32, offset: 10144)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !321, file: !322, line: 124, baseType: !162, size: 32, offset: 10176)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !321, file: !322, line: 125, baseType: !478, size: 64, offset: 10240)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !321, file: !322, line: 129, baseType: !162, size: 32, offset: 10304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !321, file: !322, line: 130, baseType: !215, size: 64, offset: 10368)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !321, file: !322, line: 132, baseType: !207, size: 64, offset: 10432)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !321, file: !322, line: 133, baseType: !162, size: 32, offset: 10496)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !321, file: !322, line: 134, baseType: !162, size: 32, offset: 10528)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !321, file: !322, line: 135, baseType: !277, size: 32, offset: 10560)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !321, file: !322, line: 136, baseType: !277, size: 32, offset: 10592)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !321, file: !322, line: 137, baseType: !277, size: 32, offset: 10624)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !321, file: !322, line: 140, baseType: !162, size: 32, offset: 10656)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !321, file: !322, line: 141, baseType: !162, size: 32, offset: 10688)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !321, file: !322, line: 143, baseType: !162, size: 32, offset: 10720)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !321, file: !322, line: 144, baseType: !162, size: 32, offset: 10752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !321, file: !322, line: 146, baseType: !277, size: 32, offset: 10784)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !321, file: !322, line: 147, baseType: !277, size: 32, offset: 10816)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !321, file: !322, line: 148, baseType: !277, size: 32, offset: 10848)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !321, file: !322, line: 150, baseType: !277, size: 32, offset: 10880)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !321, file: !322, line: 151, baseType: !103, size: 64, offset: 10944)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !321, file: !322, line: 154, baseType: !216, size: 64, offset: 11008)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !321, file: !322, line: 155, baseType: !216, size: 64, offset: 11072)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !321, file: !322, line: 157, baseType: !478, size: 64, offset: 11136)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !321, file: !322, line: 158, baseType: !162, size: 32, offset: 11200)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !321, file: !322, line: 160, baseType: !277, size: 32, offset: 11232)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !321, file: !322, line: 161, baseType: !277, size: 32, offset: 11264)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !321, file: !322, line: 162, baseType: !162, size: 32, offset: 11296)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !321, file: !322, line: 164, baseType: !216, size: 64, offset: 11328)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !321, file: !322, line: 165, baseType: !334, size: 64, offset: 11392)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !321, file: !322, line: 165, baseType: !334, size: 64, offset: 11456)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !321, file: !322, line: 166, baseType: !162, size: 32, offset: 11520)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !321, file: !322, line: 167, baseType: !277, size: 32, offset: 11552)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !321, file: !322, line: 169, baseType: !277, size: 32, offset: 11584)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !313, file: !312, line: 3, baseType: !103, size: 64, offset: 64)
!510 = !{i32 7, !"Dwarf Version", i32 4}
!511 = !{i32 2, !"Debug Info Version", i32 3}
!512 = !{i32 1, !"wchar_size", i32 4}
!513 = !{i32 7, !"PIC Level", i32 2}
!514 = !{i32 7, !"uwtable", i32 1}
!515 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!516 = distinct !DISubprogram(name: "SNESShellSetSolve", scope: !312, file: !312, line: 29, type: !517, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!120, !319, !316}
!519 = !{!520, !521, !522, !523, !526, !527, !529, !533}
!520 = !DILocalVariable(name: "snes", arg: 1, scope: !516, file: !312, line: 29, type: !319)
!521 = !DILocalVariable(name: "solve", arg: 2, scope: !516, file: !312, line: 29, type: !316)
!522 = !DILocalVariable(name: "ierr", scope: !516, file: !312, line: 31, type: !120)
!523 = !DILocalVariable(name: "_7_f", scope: !524, file: !312, line: 35, type: !525)
!524 = distinct !DILexicalBlock(scope: !516, file: !312, line: 35, column: 10)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!526 = !DILocalVariable(name: "_7_ierr", scope: !524, file: !312, line: 35, type: !120)
!527 = !DILocalVariable(name: "ierr__", scope: !528, file: !312, line: 35, type: !120)
!528 = distinct !DILexicalBlock(scope: !524, file: !312, line: 35, column: 10)
!529 = !DILocalVariable(name: "ierr__", scope: !530, file: !312, line: 35, type: !120)
!530 = distinct !DILexicalBlock(scope: !531, file: !312, line: 35, column: 10)
!531 = distinct !DILexicalBlock(scope: !532, file: !312, line: 35, column: 10)
!532 = distinct !DILexicalBlock(scope: !524, file: !312, line: 35, column: 10)
!533 = !DILocalVariable(name: "ierr__", scope: !534, file: !312, line: 35, type: !120)
!534 = distinct !DILexicalBlock(scope: !516, file: !312, line: 35, column: 102)
!535 = !DILocation(line: 0, scope: !516)
!536 = !DILocation(line: 33, column: 3, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !312, line: 33, column: 3)
!538 = distinct !DILexicalBlock(scope: !539, file: !312, line: 33, column: 3)
!539 = distinct !DILexicalBlock(scope: !516, file: !312, line: 33, column: 3)
!540 = !{!541, !541, i64 0}
!541 = !{!"any pointer", !542, i64 0}
!542 = !{!"omnipotent char", !543, i64 0}
!543 = !{!"Simple C/C++ TBAA"}
!544 = !DILocation(line: 33, column: 3, scope: !538)
!545 = !DILocation(line: 33, column: 3, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !312, line: 33, column: 3)
!547 = distinct !DILexicalBlock(scope: !537, file: !312, line: 33, column: 3)
!548 = !{!549, !550, i64 1536}
!549 = !{!"", !542, i64 0, !542, i64 512, !542, i64 1024, !542, i64 1280, !550, i64 1536, !550, i64 1540, !542, i64 1544}
!550 = !{!"int", !542, i64 0}
!551 = !DILocation(line: 33, column: 3, scope: !547)
!552 = !DILocation(line: 33, column: 3, scope: !553)
!553 = distinct !DILexicalBlock(scope: !546, file: !312, line: 33, column: 3)
!554 = !{!550, !550, i64 0}
!555 = !{!549, !550, i64 1540}
!556 = !DILocation(line: 34, column: 3, scope: !557)
!557 = distinct !DILexicalBlock(scope: !558, file: !312, line: 34, column: 3)
!558 = distinct !DILexicalBlock(scope: !516, file: !312, line: 34, column: 3)
!559 = !DILocation(line: 34, column: 3, scope: !558)
!560 = !DILocation(line: 34, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !558, file: !312, line: 34, column: 3)
!562 = !DILocation(line: 34, column: 3, scope: !563)
!563 = distinct !DILexicalBlock(scope: !558, file: !312, line: 34, column: 3)
!564 = !{!565, !550, i64 0}
