; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagutils.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 75, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmstag.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "DMSTAG_STENCIL_NONE", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "DMSTAG_STENCIL_STAR", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "DMSTAG_STENCIL_BOX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 16, baseType: !5, size: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!100 = !DIEnumerator(name: "DMSTAG_NULL_LOCATION", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_LEFT", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "DMSTAG_BACK_DOWN", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_RIGHT", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "DMSTAG_BACK_LEFT", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "DMSTAG_BACK", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "DMSTAG_BACK_RIGHT", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "DMSTAG_BACK_UP_LEFT", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "DMSTAG_BACK_UP", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "DMSTAG_BACK_UP_RIGHT", value: 9, isUnsigned: true)
!110 = !DIEnumerator(name: "DMSTAG_DOWN_LEFT", value: 10, isUnsigned: true)
!111 = !DIEnumerator(name: "DMSTAG_DOWN", value: 11, isUnsigned: true)
!112 = !DIEnumerator(name: "DMSTAG_DOWN_RIGHT", value: 12, isUnsigned: true)
!113 = !DIEnumerator(name: "DMSTAG_LEFT", value: 13, isUnsigned: true)
!114 = !DIEnumerator(name: "DMSTAG_ELEMENT", value: 14, isUnsigned: true)
!115 = !DIEnumerator(name: "DMSTAG_RIGHT", value: 15, isUnsigned: true)
!116 = !DIEnumerator(name: "DMSTAG_UP_LEFT", value: 16, isUnsigned: true)
!117 = !DIEnumerator(name: "DMSTAG_UP", value: 17, isUnsigned: true)
!118 = !DIEnumerator(name: "DMSTAG_UP_RIGHT", value: 18, isUnsigned: true)
!119 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_LEFT", value: 19, isUnsigned: true)
!120 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN", value: 20, isUnsigned: true)
!121 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_RIGHT", value: 21, isUnsigned: true)
!122 = !DIEnumerator(name: "DMSTAG_FRONT_LEFT", value: 22, isUnsigned: true)
!123 = !DIEnumerator(name: "DMSTAG_FRONT", value: 23, isUnsigned: true)
!124 = !DIEnumerator(name: "DMSTAG_FRONT_RIGHT", value: 24, isUnsigned: true)
!125 = !DIEnumerator(name: "DMSTAG_FRONT_UP_LEFT", value: 25, isUnsigned: true)
!126 = !DIEnumerator(name: "DMSTAG_FRONT_UP", value: 26, isUnsigned: true)
!127 = !DIEnumerator(name: "DMSTAG_FRONT_UP_RIGHT", value: 27, isUnsigned: true)
!128 = !{!129, !184, !188, !189, !158, !166, !385, !388, !269, !137, !391, !352, !392, !393, !394, !5}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Stag", file: !131, line: 47, baseType: !132)
!131 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmstagimpl.h", directory: "/home/users/ndemeye/xSDK")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 13, size: 1792, elements: !133)
!133 = !{!134, !140, !141, !144, !148, !150, !151, !154, !155, !161, !162, !163, !164, !167, !169, !175, !176, !177, !178, !179, !180, !183}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !132, file: !131, line: 16, baseType: !135, size: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 96, elements: !138)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !137)
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !132, file: !131, line: 17, baseType: !135, size: 96, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !132, file: !131, line: 18, baseType: !142, size: 192, offset: 192)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 192, elements: !138)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !132, file: !131, line: 19, baseType: !145, size: 128, offset: 384)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 4)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stencilType", scope: !132, file: !131, line: 20, baseType: !149, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMStagStencilType", file: !67, line: 75, baseType: !66)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "stencilWidth", scope: !132, file: !131, line: 21, baseType: !136, size: 32, offset: 544)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "boundaryType", scope: !132, file: !131, line: 22, baseType: !152, size: 96, offset: 576)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, elements: !138)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nRanks", scope: !132, file: !131, line: 23, baseType: !135, size: 96, offset: 672)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDMType", scope: !132, file: !131, line: 26, baseType: !156, size: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMType", file: !157, line: 26, baseType: !158)
!157 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nGhost", scope: !132, file: !131, line: 31, baseType: !135, size: 96, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !132, file: !131, line: 32, baseType: !135, size: 96, offset: 928)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "startGhost", scope: !132, file: !131, line: 33, baseType: !135, size: 96, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !132, file: !131, line: 34, baseType: !165, size: 96, offset: 1120)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 96, elements: !138)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !137)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !132, file: !131, line: 35, baseType: !168, size: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !132, file: !131, line: 36, baseType: !170, size: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !171, line: 59, baseType: !172)
!171 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !171, line: 15, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !171, line: 15, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ltog_injective", scope: !132, file: !131, line: 37, baseType: !170, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "locationOffsets", scope: !132, file: !131, line: 38, baseType: !143, size: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "entriesPerElement", scope: !132, file: !131, line: 41, baseType: !136, size: 32, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !132, file: !131, line: 42, baseType: !136, size: 32, offset: 1504)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "entriesGhost", scope: !132, file: !131, line: 43, baseType: !136, size: 32, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "firstRank", scope: !132, file: !131, line: 44, baseType: !181, size: 96, offset: 1568)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96, elements: !138)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lastRank", scope: !132, file: !131, line: 45, baseType: !181, size: 96, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !185, line: 330, baseType: !186)
!185 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !185, line: 330, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !192, line: 73, size: 4480, elements: !193)
!192 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!193 = !{!194, !196, !242, !243, !244, !247, !248, !249, !250, !258, !259, !260, !264, !268, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !281, !282, !283, !285, !286, !287, !289, !290, !291, !292, !293, !296, !298, !299, !300, !301, !302, !305, !307, !308, !309, !319, !321, !322, !326, !327, !375, !380, !382, !383, !384}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !191, file: !192, line: 74, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !137)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !191, file: !192, line: 75, baseType: !197, size: 448, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 448, elements: !240)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !192, line: 53, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 45, size: 448, elements: !200)
!200 = !{!201, !207, !215, !220, !224, !228, !235}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !199, file: !192, line: 46, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !189, !206}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !137)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !199, file: !192, line: 47, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!205, !189, !211}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !212, line: 16, baseType: !213)
!212 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !212, line: 16, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !199, file: !192, line: 48, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!205, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !199, file: !192, line: 49, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!205, !189, !158, !189}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !199, file: !192, line: 50, baseType: !225, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!205, !189, !158, !219}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !199, file: !192, line: 51, baseType: !229, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!205, !189, !158, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !199, file: !192, line: 52, baseType: !236, size: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!205, !189, !158, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!240 = !{!241}
!241 = !DISubrange(count: 1)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !191, file: !192, line: 76, baseType: !184, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !192, line: 77, baseType: !136, size: 32, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !191, file: !192, line: 78, baseType: !245, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !246)
!246 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !191, file: !192, line: 78, baseType: !245, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !191, file: !192, line: 78, baseType: !245, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !191, file: !192, line: 78, baseType: !245, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !191, file: !192, line: 79, baseType: !251, size: 64, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !254, line: 27, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !256, line: 43, baseType: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!257 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !191, file: !192, line: 80, baseType: !136, size: 32, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !191, file: !192, line: 81, baseType: !166, size: 32, offset: 992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !191, file: !192, line: 82, baseType: !261, size: 64, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !191, file: !192, line: 83, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !191, file: !192, line: 84, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !191, file: !192, line: 85, baseType: !269, size: 64, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !191, file: !192, line: 86, baseType: !269, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !191, file: !192, line: 87, baseType: !269, size: 64, offset: 1344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !191, file: !192, line: 88, baseType: !189, size: 64, offset: 1408)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !191, file: !192, line: 89, baseType: !251, size: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !192, line: 90, baseType: !269, size: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !191, file: !192, line: 91, baseType: !269, size: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !191, file: !192, line: 92, baseType: !136, size: 32, offset: 1664)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !191, file: !192, line: 93, baseType: !188, size: 64, offset: 1728)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !191, file: !192, line: 94, baseType: !280, size: 64, offset: 1792)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !252)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !191, file: !192, line: 95, baseType: !136, size: 32, offset: 1856)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !191, file: !192, line: 95, baseType: !136, size: 32, offset: 1888)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !191, file: !192, line: 96, baseType: !284, size: 64, offset: 1920)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !191, file: !192, line: 96, baseType: !284, size: 64, offset: 1984)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !191, file: !192, line: 97, baseType: !143, size: 64, offset: 2048)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !191, file: !192, line: 97, baseType: !288, size: 64, offset: 2112)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !191, file: !192, line: 98, baseType: !136, size: 32, offset: 2176)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !191, file: !192, line: 98, baseType: !136, size: 32, offset: 2208)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !191, file: !192, line: 99, baseType: !284, size: 64, offset: 2240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !191, file: !192, line: 99, baseType: !284, size: 64, offset: 2304)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !191, file: !192, line: 100, baseType: !294, size: 64, offset: 2368)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !246)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !191, file: !192, line: 100, baseType: !297, size: 64, offset: 2432)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !191, file: !192, line: 101, baseType: !136, size: 32, offset: 2496)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !191, file: !192, line: 101, baseType: !136, size: 32, offset: 2528)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !191, file: !192, line: 102, baseType: !284, size: 64, offset: 2560)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !191, file: !192, line: 102, baseType: !284, size: 64, offset: 2624)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !191, file: !192, line: 103, baseType: !303, size: 64, offset: 2688)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !295)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !191, file: !192, line: 103, baseType: !306, size: 64, offset: 2752)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !191, file: !192, line: 104, baseType: !239, size: 64, offset: 2816)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !191, file: !192, line: 105, baseType: !136, size: 32, offset: 2880)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !191, file: !192, line: 106, baseType: !310, size: 128, offset: 2944)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 128, elements: !317)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !192, line: 64, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 61, size: 128, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !313, file: !192, line: 62, baseType: !232, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !313, file: !192, line: 63, baseType: !188, size: 64, offset: 64)
!317 = !{!318}
!318 = !DISubrange(count: 2)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !191, file: !192, line: 107, baseType: !320, size: 64, offset: 3072)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !191, file: !192, line: 108, baseType: !188, size: 64, offset: 3136)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !191, file: !192, line: 109, baseType: !323, size: 64, offset: 3200)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!205, !188}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !191, file: !192, line: 111, baseType: !136, size: 32, offset: 3264)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !191, file: !192, line: 112, baseType: !328, size: 320, offset: 3328)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !373)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!205, !332, !189, !188}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !335)
!335 = !{!336, !337, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !334, file: !10, line: 100, baseType: !136, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !10, line: 101, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !349, !350, !351, !355, !356, !358, !359, !360}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !340, file: !10, line: 84, baseType: !269, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !340, file: !10, line: 85, baseType: !269, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !10, line: 86, baseType: !188, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !340, file: !10, line: 87, baseType: !261, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !340, file: !10, line: 88, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !340, file: !10, line: 89, baseType: !160, size: 8, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !340, file: !10, line: 90, baseType: !269, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !340, file: !10, line: 91, baseType: !352, size: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !353, line: 46, baseType: !354)
!353 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!354 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !340, file: !10, line: 92, baseType: !182, size: 32, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !10, line: 93, baseType: !357, size: 32, offset: 544)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !10, line: 94, baseType: !338, size: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !340, file: !10, line: 95, baseType: !269, size: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !340, file: !10, line: 96, baseType: !188, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !334, file: !10, line: 102, baseType: !269, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !334, file: !10, line: 102, baseType: !269, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !334, file: !10, line: 103, baseType: !269, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !334, file: !10, line: 104, baseType: !184, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !334, file: !10, line: 105, baseType: !182, size: 32, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !334, file: !10, line: 105, baseType: !182, size: 32, offset: 416)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !334, file: !10, line: 105, baseType: !182, size: 32, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !334, file: !10, line: 106, baseType: !189, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !334, file: !10, line: 107, baseType: !370, size: 64, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!373 = !{!374}
!374 = !DISubrange(count: 5)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !191, file: !192, line: 113, baseType: !376, size: 320, offset: 3648)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 320, elements: !373)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!205, !189, !188}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !191, file: !192, line: 114, baseType: !381, size: 320, offset: 3968)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 320, elements: !373)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !191, file: !192, line: 115, baseType: !182, size: 32, offset: 4288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !191, file: !192, line: 120, baseType: !370, size: 64, offset: 4352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !191, file: !192, line: 121, baseType: !182, size: 32, offset: 4416)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !185, line: 331, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !185, line: 331, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !185, line: 338, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !185, line: 338, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!395 = !{i32 7, !"Dwarf Version", i32 4}
!396 = !{i32 2, !"Debug Info Version", i32 3}
!397 = !{i32 1, !"wchar_size", i32 4}
!398 = !{i32 7, !"PIC Level", i32 2}
!399 = !{i32 7, !"uwtable", i32 1}
!400 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!401 = distinct !DISubprogram(name: "DMStagGetBoundaryTypes", scope: !402, file: !402, line: 19, type: !403, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1145)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stagutils.c", directory: "/home/users/ndemeye/xSDK")
!403 = !DISubroutineType(types: !404)
!404 = !{!205, !405, !932, !932, !932}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !408)
!408 = !{!409, !411, !641, !645, !646, !647, !648, !658, !659, !667, !668, !676, !677, !678, !679, !683, !684, !688, !690, !692, !693, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !721, !733, !745, !757, !766, !767, !790, !791, !792, !793, !794, !795, !797, !888, !889, !909, !910, !911, !912, !913, !914, !918, !919, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933, !945, !946, !947, !956, !1044, !1045, !1133, !1134, !1135, !1136, !1138, !1140, !1141, !1142, !1143, !1144}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !407, file: !47, line: 203, baseType: !410, size: 4480)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !192, line: 122, baseType: !191)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !407, file: !47, line: 203, baseType: !412, size: 3456, offset: 4480)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 3456, elements: !240)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !414)
!414 = !{!415, !419, !420, !425, !429, !433, !434, !435, !444, !445, !446, !457, !458, !466, !475, !484, !488, !492, !493, !498, !499, !503, !504, !508, !509, !517, !521, !526, !527, !528, !529, !530, !531, !532, !536, !542, !546, !551, !555, !561, !565, !570, !577, !581, !582, !587, !598, !602, !612, !616, !624, !628, !636, !637}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !413, file: !47, line: 31, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!205, !405, !211}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !413, file: !47, line: 32, baseType: !416, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !413, file: !47, line: 33, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!205, !405, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !413, file: !47, line: 34, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!205, !332, !405}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !413, file: !47, line: 35, baseType: !430, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!205, !405}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !413, file: !47, line: 36, baseType: !430, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !413, file: !47, line: 37, baseType: !430, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !413, file: !47, line: 38, baseType: !436, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!205, !405, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !441, line: 21, baseType: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !441, line: 21, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !413, file: !47, line: 39, baseType: !436, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !413, file: !47, line: 40, baseType: !430, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !413, file: !47, line: 41, baseType: !447, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!205, !405, !143, !450, !451}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !454, line: 11, baseType: !455)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !454, line: 11, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !413, file: !47, line: 42, baseType: !421, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !413, file: !47, line: 43, baseType: !459, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!205, !405, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !413, file: !47, line: 45, baseType: !467, size: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!205, !405, !470, !471}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !454, line: 51, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !454, line: 51, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !413, file: !47, line: 46, baseType: !476, size: 64, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!205, !405, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !481, line: 16, baseType: !482)
!481 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !481, line: 16, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !413, file: !47, line: 47, baseType: !485, size: 64, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!205, !405, !405, !479, !439}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !413, file: !47, line: 48, baseType: !489, size: 64, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!205, !405, !405, !479}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !413, file: !47, line: 49, baseType: !489, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !413, file: !47, line: 50, baseType: !494, size: 64, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!205, !405, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !413, file: !47, line: 51, baseType: !489, size: 64, offset: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !413, file: !47, line: 53, baseType: !500, size: 64, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!205, !405, !184, !424}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !413, file: !47, line: 54, baseType: !500, size: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !413, file: !47, line: 55, baseType: !505, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!205, !405, !136, !424}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !413, file: !47, line: 56, baseType: !505, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !413, file: !47, line: 57, baseType: !510, size: 64, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!205, !405, !513, !424}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !514, line: 12, baseType: !515)
!514 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !514, line: 12, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !413, file: !47, line: 58, baseType: !518, size: 64, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!205, !405, !440, !513, !424}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !413, file: !47, line: 60, baseType: !522, size: 64, offset: 1664)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!205, !405, !440, !525, !440}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !413, file: !47, line: 61, baseType: !522, size: 64, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !413, file: !47, line: 62, baseType: !522, size: 64, offset: 1792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !413, file: !47, line: 63, baseType: !522, size: 64, offset: 1856)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !413, file: !47, line: 64, baseType: !522, size: 64, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !413, file: !47, line: 65, baseType: !522, size: 64, offset: 1984)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !413, file: !47, line: 67, baseType: !430, size: 64, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !413, file: !47, line: 69, baseType: !533, size: 64, offset: 2112)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!205, !405, !440, !440}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !413, file: !47, line: 71, baseType: !537, size: 64, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!205, !405, !136, !540, !452, !424}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !413, file: !47, line: 72, baseType: !543, size: 64, offset: 2240)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!205, !424, !136, !451, !424}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !413, file: !47, line: 73, baseType: !547, size: 64, offset: 2304)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!205, !405, !143, !450, !451, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !413, file: !47, line: 74, baseType: !552, size: 64, offset: 2368)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!205, !405, !143, !450, !451, !451, !550}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !413, file: !47, line: 75, baseType: !556, size: 64, offset: 2432)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!205, !405, !136, !424, !559, !559, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !413, file: !47, line: 77, baseType: !562, size: 64, offset: 2496)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!205, !405, !136, !143, !143}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !413, file: !47, line: 78, baseType: !566, size: 64, offset: 2560)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!205, !405, !440, !569, !172}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !413, file: !47, line: 79, baseType: !571, size: 64, offset: 2624)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!205, !405, !143, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !413, file: !47, line: 80, baseType: !578, size: 64, offset: 2688)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!205, !405, !294, !294}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !413, file: !47, line: 81, baseType: !578, size: 64, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !413, file: !47, line: 82, baseType: !583, size: 64, offset: 2816)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!205, !405, !440, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !413, file: !47, line: 84, baseType: !588, size: 64, offset: 2880)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!205, !405, !295, !591, !597, !525, !440}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!205, !136, !295, !595, !136, !303, !188}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !413, file: !47, line: 85, baseType: !599, size: 64, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!205, !405, !295, !513, !136, !540, !136, !540, !591, !597, !525, !440}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !413, file: !47, line: 86, baseType: !603, size: 64, offset: 3008)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!205, !405, !295, !440, !606, !525, !440}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !136, !136, !136, !540, !540, !610, !610, !610, !540, !540, !610, !610, !610, !295, !595, !136, !610, !303}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !413, file: !47, line: 87, baseType: !613, size: 64, offset: 3072)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!205, !405, !295, !513, !136, !540, !136, !540, !440, !606, !525, !440}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !413, file: !47, line: 88, baseType: !617, size: 64, offset: 3136)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!205, !405, !295, !513, !136, !540, !136, !540, !440, !620, !525, !440}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !136, !136, !136, !540, !540, !610, !610, !610, !540, !540, !610, !610, !610, !295, !595, !595, !136, !610, !303}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !413, file: !47, line: 89, baseType: !625, size: 64, offset: 3200)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!205, !405, !295, !591, !597, !440, !294}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !413, file: !47, line: 90, baseType: !629, size: 64, offset: 3264)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!205, !405, !295, !632, !597, !440, !595, !294}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!205, !136, !295, !595, !595, !136, !303, !188}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !413, file: !47, line: 91, baseType: !625, size: 64, offset: 3328)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !413, file: !47, line: 93, baseType: !638, size: 64, offset: 3392)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!205, !405, !405, !497, !497}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !407, file: !47, line: 204, baseType: !642, size: 6400, offset: 7936)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 6400, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 100)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !407, file: !47, line: 204, baseType: !642, size: 6400, offset: 14336)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !407, file: !47, line: 205, baseType: !642, size: 6400, offset: 20736)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !407, file: !47, line: 205, baseType: !642, size: 6400, offset: 27136)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !407, file: !47, line: 206, baseType: !649, size: 64, offset: 33536)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !652)
!652 = !{!653, !654, !655, !657}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !651, file: !47, line: 143, baseType: !440, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !47, line: 144, baseType: !269, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !651, file: !47, line: 145, baseType: !656, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !651, file: !47, line: 146, baseType: !649, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !407, file: !47, line: 207, baseType: !649, size: 64, offset: 33600)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !407, file: !47, line: 208, baseType: !660, size: 64, offset: 33664)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !662, file: !47, line: 151, baseType: !352, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !662, file: !47, line: 152, baseType: !188, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !662, file: !47, line: 153, baseType: !660, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !407, file: !47, line: 208, baseType: !660, size: 64, offset: 33728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !407, file: !47, line: 209, baseType: !669, size: 64, offset: 33792)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !671, file: !47, line: 159, baseType: !513, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !671, file: !47, line: 160, baseType: !182, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !47, line: 161, baseType: !670, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !407, file: !47, line: 210, baseType: !513, size: 64, offset: 33856)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !407, file: !47, line: 211, baseType: !513, size: 64, offset: 33920)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !407, file: !47, line: 212, baseType: !188, size: 64, offset: 33984)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !407, file: !47, line: 213, baseType: !680, size: 64, offset: 34048)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!205, !597}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !407, file: !47, line: 214, baseType: !470, size: 32, offset: 34112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !407, file: !47, line: 215, baseType: !685, size: 64, offset: 34176)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !481, line: 1378, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !481, line: 1378, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !407, file: !47, line: 216, baseType: !689, size: 64, offset: 34240)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !441, line: 83, baseType: !158)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !407, file: !47, line: 217, baseType: !691, size: 64, offset: 34304)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !481, line: 25, baseType: !158)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !407, file: !47, line: 218, baseType: !136, size: 32, offset: 34368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !407, file: !47, line: 219, baseType: !694, size: 64, offset: 34432)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !454, line: 30, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !454, line: 30, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !407, file: !47, line: 220, baseType: !182, size: 32, offset: 34496)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !407, file: !47, line: 221, baseType: !182, size: 32, offset: 34528)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !407, file: !47, line: 222, baseType: !136, size: 32, offset: 34560)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !407, file: !47, line: 222, baseType: !136, size: 32, offset: 34592)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !407, file: !47, line: 223, baseType: !182, size: 32, offset: 34624)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !407, file: !47, line: 224, baseType: !182, size: 32, offset: 34656)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !407, file: !47, line: 225, baseType: !188, size: 64, offset: 34688)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !407, file: !47, line: 227, baseType: !405, size: 64, offset: 34752)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !407, file: !47, line: 228, baseType: !405, size: 64, offset: 34816)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !407, file: !47, line: 229, baseType: !707, size: 64, offset: 34880)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !710)
!710 = !{!711, !715, !719, !720}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !709, file: !47, line: 102, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!205, !405, !405, !188}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !709, file: !47, line: 103, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!205, !405, !480, !440, !480, !405, !188}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !709, file: !47, line: 104, baseType: !188, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !47, line: 105, baseType: !707, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !407, file: !47, line: 230, baseType: !722, size: 64, offset: 34944)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !725)
!725 = !{!726, !727, !731, !732}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !724, file: !47, line: 110, baseType: !712, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !724, file: !47, line: 111, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!205, !405, !480, !405, !188}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !724, file: !47, line: 112, baseType: !188, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !47, line: 113, baseType: !722, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !407, file: !47, line: 231, baseType: !734, size: 64, offset: 35008)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !737)
!737 = !{!738, !739, !743, !744}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !736, file: !47, line: 118, baseType: !712, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !736, file: !47, line: 119, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!205, !405, !170, !170, !405, !188}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !736, file: !47, line: 120, baseType: !188, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !47, line: 121, baseType: !734, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !407, file: !47, line: 232, baseType: !746, size: 64, offset: 35072)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !749)
!749 = !{!750, !754, !755, !756}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !748, file: !47, line: 126, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!205, !405, !440, !525, !440, !188}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !748, file: !47, line: 127, baseType: !751, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !748, file: !47, line: 128, baseType: !188, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !748, file: !47, line: 129, baseType: !746, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !407, file: !47, line: 233, baseType: !758, size: 64, offset: 35136)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !760, file: !47, line: 134, baseType: !751, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !760, file: !47, line: 135, baseType: !751, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !760, file: !47, line: 136, baseType: !188, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !47, line: 137, baseType: !758, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !407, file: !47, line: 235, baseType: !136, size: 32, offset: 35200)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !407, file: !47, line: 237, baseType: !768, size: 64, offset: 35264)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !772)
!772 = !{!773, !777, !778, !779, !780, !782, !789}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !771, file: !47, line: 27, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !775, line: 166, baseType: !776)
!775 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !775, line: 139, baseType: !5)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !771, file: !47, line: 27, baseType: !774, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !771, file: !47, line: 27, baseType: !774, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !771, file: !47, line: 27, baseType: !774, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !771, file: !47, line: 27, baseType: !781, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !771, file: !47, line: 27, baseType: !783, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !785, file: !47, line: 19, baseType: !513, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !785, file: !47, line: 20, baseType: !136, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !771, file: !47, line: 27, baseType: !439, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !407, file: !47, line: 239, baseType: !172, size: 64, offset: 35328)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !407, file: !47, line: 240, baseType: !172, size: 64, offset: 35392)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !407, file: !47, line: 241, baseType: !172, size: 64, offset: 35456)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !407, file: !47, line: 242, baseType: !172, size: 64, offset: 35520)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !407, file: !47, line: 243, baseType: !182, size: 32, offset: 35584)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !407, file: !47, line: 245, baseType: !796, size: 64, offset: 35616)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !317)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !407, file: !47, line: 246, baseType: !798, size: 64, offset: 35712)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !799, line: 18, baseType: !800)
!799 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !802, line: 29, size: 5760, elements: !803)
!802 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!803 = !{!804, !805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !823, !824, !825, !826, !851, !852, !853}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !801, file: !802, line: 30, baseType: !410, size: 4480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !801, file: !802, line: 30, baseType: !806, size: 32, offset: 4480)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !240)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !801, file: !802, line: 31, baseType: !136, size: 32, offset: 4512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !801, file: !802, line: 31, baseType: !136, size: 32, offset: 4544)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !801, file: !802, line: 32, baseType: !453, size: 64, offset: 4608)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !801, file: !802, line: 33, baseType: !182, size: 32, offset: 4672)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !801, file: !802, line: 34, baseType: !182, size: 32, offset: 4704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !801, file: !802, line: 35, baseType: !143, size: 64, offset: 4736)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !801, file: !802, line: 36, baseType: !143, size: 64, offset: 4800)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !801, file: !802, line: 37, baseType: !136, size: 32, offset: 4864)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !801, file: !802, line: 38, baseType: !798, size: 64, offset: 4928)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !801, file: !802, line: 39, baseType: !143, size: 64, offset: 4992)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !801, file: !802, line: 40, baseType: !182, size: 32, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !801, file: !802, line: 42, baseType: !136, size: 32, offset: 5088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !801, file: !802, line: 43, baseType: !391, size: 64, offset: 5120)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !801, file: !802, line: 44, baseType: !143, size: 64, offset: 5184)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !801, file: !802, line: 45, baseType: !822, size: 64, offset: 5248)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !801, file: !802, line: 46, baseType: !182, size: 32, offset: 5312)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !801, file: !802, line: 47, baseType: !450, size: 64, offset: 5376)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !801, file: !802, line: 49, baseType: !189, size: 64, offset: 5440)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !801, file: !802, line: 50, baseType: !827, size: 64, offset: 5504)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !802, line: 27, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !802, line: 27, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !802, line: 27, size: 320, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !844}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !830, file: !802, line: 27, baseType: !774, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !802, line: 27, baseType: !774, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !830, file: !802, line: 27, baseType: !774, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !830, file: !802, line: 27, baseType: !774, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !830, file: !802, line: 27, baseType: !781, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !830, file: !802, line: 27, baseType: !838, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !802, line: 10, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !802, line: 8, size: 64, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !840, file: !802, line: 9, baseType: !136, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !840, file: !802, line: 9, baseType: !136, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !830, file: !802, line: 27, baseType: !845, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !802, line: 14, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !802, line: 12, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !847, file: !802, line: 13, baseType: !143, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !847, file: !802, line: 13, baseType: !143, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !801, file: !802, line: 51, baseType: !798, size: 64, offset: 5568)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !801, file: !802, line: 52, baseType: !453, size: 64, offset: 5632)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !801, file: !802, line: 53, baseType: !854, size: 64, offset: 5696)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !799, line: 33, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !802, line: 72, size: 4864, elements: !857)
!857 = !{!858, !859, !877, !878, !887}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !856, file: !802, line: 73, baseType: !410, size: 4480)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !856, file: !802, line: 73, baseType: !860, size: 192, offset: 4480)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 192, elements: !240)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !802, line: 56, size: 192, elements: !862)
!862 = !{!863, !869, !873}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !861, file: !802, line: 57, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!205, !854, !798, !136, !540, !867, !868}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !861, file: !802, line: 58, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!205, !854}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !861, file: !802, line: 59, baseType: !874, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!205, !854, !211}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !856, file: !802, line: 74, baseType: !188, size: 64, offset: 4672)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !856, file: !802, line: 75, baseType: !879, size: 64, offset: 4736)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !802, line: 62, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !802, line: 64, size: 256, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !802, line: 66, baseType: !879, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !881, file: !802, line: 67, baseType: !867, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !881, file: !802, line: 68, baseType: !868, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !881, file: !802, line: 69, baseType: !136, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !856, file: !802, line: 76, baseType: !879, size: 64, offset: 4800)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !407, file: !47, line: 247, baseType: !798, size: 64, offset: 35776)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !407, file: !47, line: 248, baseType: !890, size: 64, offset: 35840)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !454, line: 60, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !892, file: !25, line: 241, baseType: !184, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !892, file: !25, line: 242, baseType: !166, size: 32, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !892, file: !25, line: 243, baseType: !136, size: 32, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !892, file: !25, line: 243, baseType: !136, size: 32, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !892, file: !25, line: 244, baseType: !136, size: 32, offset: 160)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !892, file: !25, line: 244, baseType: !136, size: 32, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !892, file: !25, line: 245, baseType: !143, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !892, file: !25, line: 246, baseType: !182, size: 32, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !892, file: !25, line: 247, baseType: !136, size: 32, offset: 352)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !892, file: !25, line: 251, baseType: !136, size: 32, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !892, file: !25, line: 252, baseType: !694, size: 64, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !892, file: !25, line: 253, baseType: !182, size: 32, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !892, file: !25, line: 254, baseType: !136, size: 32, offset: 544)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !892, file: !25, line: 254, baseType: !136, size: 32, offset: 576)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !892, file: !25, line: 255, baseType: !136, size: 32, offset: 608)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !407, file: !47, line: 250, baseType: !798, size: 64, offset: 35904)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !407, file: !47, line: 251, baseType: !480, size: 64, offset: 35968)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !407, file: !47, line: 253, baseType: !405, size: 64, offset: 36032)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !407, file: !47, line: 254, baseType: !440, size: 64, offset: 36096)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !407, file: !47, line: 255, baseType: !188, size: 64, offset: 36160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !407, file: !47, line: 256, baseType: !915, size: 64, offset: 36224)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!205, !405, !188}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !407, file: !47, line: 257, baseType: !915, size: 64, offset: 36288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !407, file: !47, line: 258, baseType: !920, size: 64, offset: 36352)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!205, !405, !595, !182, !868, !188}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !407, file: !47, line: 260, baseType: !136, size: 32, offset: 36416)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !407, file: !47, line: 261, baseType: !405, size: 64, offset: 36480)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !407, file: !47, line: 262, baseType: !440, size: 64, offset: 36544)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !407, file: !47, line: 263, baseType: !440, size: 64, offset: 36608)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !407, file: !47, line: 264, baseType: !182, size: 32, offset: 36672)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !407, file: !47, line: 265, baseType: !463, size: 64, offset: 36736)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !407, file: !47, line: 266, baseType: !294, size: 64, offset: 36800)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !407, file: !47, line: 266, baseType: !294, size: 64, offset: 36864)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !407, file: !47, line: 267, baseType: !932, size: 64, offset: 36928)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !407, file: !47, line: 269, baseType: !934, size: 640, offset: 36992)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 640, elements: !943)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!205, !405, !136, !136, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !481, line: 1723, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !481, line: 1723, flags: DIFlagFwdDecl)
!943 = !{!944}
!944 = !DISubrange(count: 10)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !407, file: !47, line: 270, baseType: !934, size: 640, offset: 37632)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !407, file: !47, line: 272, baseType: !136, size: 32, offset: 38272)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !407, file: !47, line: 273, baseType: !948, size: 64, offset: 38336)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !950, file: !47, line: 174, baseType: !189, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !950, file: !47, line: 175, baseType: !513, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !950, file: !47, line: 176, baseType: !796, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !950, file: !47, line: 177, baseType: !182, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !407, file: !47, line: 274, baseType: !957, size: 64, offset: 38400)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !960)
!960 = !{!961, !1042, !1043}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !959, file: !47, line: 168, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !963, line: 11, baseType: !964)
!963 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !963, line: 13, size: 832, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !1033, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !965, file: !963, line: 14, baseType: !158, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !965, file: !963, line: 15, baseType: !513, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !965, file: !963, line: 16, baseType: !158, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !965, file: !963, line: 17, baseType: !136, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !965, file: !963, line: 18, baseType: !143, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !965, file: !963, line: 19, baseType: !973, size: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !974, line: 22, baseType: !975)
!974 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !963, line: 81, size: 4992, elements: !977)
!977 = !{!978, !979, !993, !994, !995, !1004}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !976, file: !963, line: 82, baseType: !410, size: 4480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !976, file: !963, line: 82, baseType: !980, size: 256, offset: 4480)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 256, elements: !240)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !963, line: 74, size: 256, elements: !982)
!982 = !{!983, !987, !988, !992}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !981, file: !963, line: 75, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!205, !973}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !981, file: !963, line: 76, baseType: !984, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !981, file: !963, line: 77, baseType: !989, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!205, !973, !211}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !981, file: !963, line: 78, baseType: !984, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !963, line: 83, baseType: !188, size: 64, offset: 4736)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !976, file: !963, line: 85, baseType: !136, size: 32, offset: 4800)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !976, file: !963, line: 86, baseType: !996, size: 64, offset: 4864)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !963, line: 41, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 36, size: 256, elements: !999)
!999 = !{!1000, !1001, !1002, !1003}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !998, file: !963, line: 37, baseType: !352, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !998, file: !963, line: 38, baseType: !352, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !998, file: !963, line: 39, baseType: !352, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !998, file: !963, line: 40, baseType: !269, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !976, file: !963, line: 87, baseType: !1005, size: 64, offset: 4928)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !963, line: 54, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !963, line: 54, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !963, line: 54, size: 320, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1025}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1009, file: !963, line: 54, baseType: !774, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1009, file: !963, line: 54, baseType: !774, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1009, file: !963, line: 54, baseType: !774, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1009, file: !963, line: 54, baseType: !774, size: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1009, file: !963, line: 54, baseType: !781, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1009, file: !963, line: 54, baseType: !1017, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !974, line: 41, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !974, line: 35, size: 192, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1019, file: !974, line: 37, baseType: !513, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1019, file: !974, line: 38, baseType: !136, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1019, file: !974, line: 39, baseType: !136, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1019, file: !974, line: 40, baseType: !136, size: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1009, file: !963, line: 54, baseType: !1026, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !963, line: 34, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 30, size: 96, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1028, file: !963, line: 31, baseType: !136, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1028, file: !963, line: 32, baseType: !136, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1028, file: !963, line: 33, baseType: !136, size: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !965, file: !963, line: 20, baseType: !1034, size: 32, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !965, file: !963, line: 21, baseType: !136, size: 32, offset: 416)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !965, file: !963, line: 22, baseType: !136, size: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !965, file: !963, line: 23, baseType: !143, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !965, file: !963, line: 24, baseType: !232, size: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !965, file: !963, line: 25, baseType: !232, size: 64, offset: 640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !965, file: !963, line: 26, baseType: !188, size: 64, offset: 704)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !963, line: 27, baseType: !962, size: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !959, file: !47, line: 169, baseType: !513, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !47, line: 170, baseType: !957, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !407, file: !47, line: 275, baseType: !136, size: 32, offset: 38464)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !407, file: !47, line: 276, baseType: !1046, size: 64, offset: 38528)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !1049)
!1049 = !{!1050, !1131, !1132}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1048, file: !47, line: 181, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !974, line: 13, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !963, line: 98, size: 7232, elements: !1054)
!1054 = !{!1055, !1056, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1087, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1053, file: !963, line: 99, baseType: !410, size: 4480)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1053, file: !963, line: 99, baseType: !1057, size: 256, offset: 4480)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 256, elements: !240)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !963, line: 91, size: 256, elements: !1059)
!1059 = !{!1060, !1064, !1065, !1069}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1058, file: !963, line: 92, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!205, !1051}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1058, file: !963, line: 93, baseType: !1061, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1058, file: !963, line: 94, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!205, !1051, !211}
