; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/glee/adaptglee.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/glee/adaptglee.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TSAdapt = type { %struct._p_PetscObject, [1 x %struct._TSAdaptOps], i8*, i32 (%struct._p_TSAdapt*, %struct._p_TS*, double, %struct._p_Vec*, i32*)*, %struct.anon.5, i32, double, double, [2 x double], double, double, double, i32, double, [2 x double], i32, %struct._p_PetscViewer*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 57, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscts.h", directory: "/home/users/ndemeye/xSDK")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "TS_LINEAR", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "TS_NONLINEAR", value: 1, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 74, baseType: !38, size: 32, elements: !39)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!40 = !DIEnumerator(name: "TS_EQ_UNSPECIFIED", value: -1)
!41 = !DIEnumerator(name: "TS_EQ_EXPLICIT", value: 0)
!42 = !DIEnumerator(name: "TS_EQ_ODE_EXPLICIT", value: 1)
!43 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX1", value: 100)
!44 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX2", value: 200)
!45 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEX3", value: 300)
!46 = !DIEnumerator(name: "TS_EQ_DAE_SEMI_EXPLICIT_INDEXHI", value: 500)
!47 = !DIEnumerator(name: "TS_EQ_IMPLICIT", value: 1000)
!48 = !DIEnumerator(name: "TS_EQ_ODE_IMPLICIT", value: 1001)
!49 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX1", value: 1100)
!50 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX2", value: 1200)
!51 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEX3", value: 1300)
!52 = !DIEnumerator(name: "TS_EQ_DAE_IMPLICIT_INDEXHI", value: 1500)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 408, baseType: !5, size: 32, elements: !55)
!54 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/tsimpl.h", directory: "/home/users/ndemeye/xSDK")
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "TSEVENT_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "TSEVENT_LOCATED_INTERVAL", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "TSEVENT_PROCESSING", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "TSEVENT_ZERO", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "TSEVENT_RESET_NEXTSTEP", value: 4, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 285, baseType: !5, size: 32, elements: !63)
!62 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 103, baseType: !38, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!70 = !DIEnumerator(name: "TS_CONVERGED_ITERATING", value: 0)
!71 = !DIEnumerator(name: "TS_CONVERGED_TIME", value: 1)
!72 = !DIEnumerator(name: "TS_CONVERGED_ITS", value: 2)
!73 = !DIEnumerator(name: "TS_CONVERGED_USER", value: 3)
!74 = !DIEnumerator(name: "TS_CONVERGED_EVENT", value: 4)
!75 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FATOL", value: 5)
!76 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FRTOL", value: 6)
!77 = !DIEnumerator(name: "TS_DIVERGED_NONLINEAR_SOLVE", value: -1)
!78 = !DIEnumerator(name: "TS_DIVERGED_STEP_REJECTED", value: -2)
!79 = !DIEnumerator(name: "TSFORWARD_DIVERGED_LINEAR_SOLVE", value: -3)
!80 = !DIEnumerator(name: "TSADJOINT_DIVERGED_LINEAR_SOLVE", value: -4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 217, baseType: !5, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 663, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!93 = !{!94, !97, !115, !196, !136, !302, !162, !214}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!96 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !100, line: 73, size: 4480, elements: !101)
!100 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!101 = !{!102, !104, !157, !158, !160, !163, !164, !165, !166, !174, !175, !177, !181, !185, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !199, !200, !201, !203, !204, !206, !208, !209, !210, !211, !212, !215, !217, !218, !219, !220, !221, !224, !226, !227, !228, !238, !240, !241, !245, !246, !292, !297, !299, !300, !301}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !99, file: !100, line: 74, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !38)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !99, file: !100, line: 75, baseType: !105, size: 448, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 448, elements: !155)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !100, line: 53, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 45, size: 448, elements: !108)
!108 = !{!109, !119, !127, !132, !139, !143, !150}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !107, file: !100, line: 46, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !97, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !38)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !116, line: 330, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !116, line: 330, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !107, file: !100, line: 47, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!113, !97, !123}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !124, line: 16, baseType: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !124, line: 16, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !107, file: !100, line: 48, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!113, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !107, file: !100, line: 49, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!113, !97, !136, !97}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !107, file: !100, line: 50, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!113, !97, !136, !131}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !107, file: !100, line: 51, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!113, !97, !136, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !107, file: !100, line: 52, baseType: !151, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!113, !97, !136, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !99, file: !100, line: 76, baseType: !115, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !100, line: 77, baseType: !159, size: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !38)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !99, file: !100, line: 78, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !162)
!162 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !99, file: !100, line: 78, baseType: !161, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !99, file: !100, line: 78, baseType: !161, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !99, file: !100, line: 78, baseType: !161, size: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !100, line: 79, baseType: !167, size: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !170, line: 27, baseType: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !172, line: 43, baseType: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!173 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !99, file: !100, line: 80, baseType: !159, size: 32, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !100, line: 81, baseType: !176, size: 32, offset: 992)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !38)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !99, file: !100, line: 82, baseType: !178, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !99, file: !100, line: 83, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !99, file: !100, line: 84, baseType: !186, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !99, file: !100, line: 85, baseType: !186, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !99, file: !100, line: 86, baseType: !186, size: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !99, file: !100, line: 87, baseType: !186, size: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !100, line: 88, baseType: !97, size: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !99, file: !100, line: 89, baseType: !167, size: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !100, line: 90, baseType: !186, size: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !99, file: !100, line: 91, baseType: !186, size: 64, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !99, file: !100, line: 92, baseType: !159, size: 32, offset: 1664)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !99, file: !100, line: 93, baseType: !196, size: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !100, line: 94, baseType: !198, size: 64, offset: 1792)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !168)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !99, file: !100, line: 95, baseType: !159, size: 32, offset: 1856)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !99, file: !100, line: 95, baseType: !159, size: 32, offset: 1888)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !99, file: !100, line: 96, baseType: !202, size: 64, offset: 1920)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !99, file: !100, line: 96, baseType: !202, size: 64, offset: 1984)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !99, file: !100, line: 97, baseType: !205, size: 64, offset: 2048)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !99, file: !100, line: 97, baseType: !207, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !99, file: !100, line: 98, baseType: !159, size: 32, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !99, file: !100, line: 98, baseType: !159, size: 32, offset: 2208)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !99, file: !100, line: 99, baseType: !202, size: 64, offset: 2240)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !99, file: !100, line: 99, baseType: !202, size: 64, offset: 2304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !99, file: !100, line: 100, baseType: !213, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !162)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !99, file: !100, line: 100, baseType: !216, size: 64, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !99, file: !100, line: 101, baseType: !159, size: 32, offset: 2496)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !99, file: !100, line: 101, baseType: !159, size: 32, offset: 2528)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !99, file: !100, line: 102, baseType: !202, size: 64, offset: 2560)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !99, file: !100, line: 102, baseType: !202, size: 64, offset: 2624)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !99, file: !100, line: 103, baseType: !222, size: 64, offset: 2688)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !214)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !99, file: !100, line: 103, baseType: !225, size: 64, offset: 2752)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !99, file: !100, line: 104, baseType: !154, size: 64, offset: 2816)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !99, file: !100, line: 105, baseType: !159, size: 32, offset: 2880)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !99, file: !100, line: 106, baseType: !229, size: 128, offset: 2944)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 128, elements: !236)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !100, line: 64, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 61, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !232, file: !100, line: 62, baseType: !147, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !232, file: !100, line: 63, baseType: !196, size: 64, offset: 64)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !99, file: !100, line: 107, baseType: !239, size: 64, offset: 3072)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, elements: !236)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !99, file: !100, line: 108, baseType: !196, size: 64, offset: 3136)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !99, file: !100, line: 109, baseType: !242, size: 64, offset: 3200)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!113, !196}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !99, file: !100, line: 111, baseType: !159, size: 32, offset: 3264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !99, file: !100, line: 112, baseType: !247, size: 320, offset: 3328)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 320, elements: !290)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!113, !251, !97, !196}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !254)
!254 = !{!255, !256, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !253, file: !10, line: 100, baseType: !159, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !10, line: 101, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !268, !269, !270, !271, !273, !275, !276, !277}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !259, file: !10, line: 84, baseType: !186, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !259, file: !10, line: 85, baseType: !186, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !10, line: 86, baseType: !196, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !259, file: !10, line: 87, baseType: !178, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !259, file: !10, line: 88, baseType: !266, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !259, file: !10, line: 89, baseType: !138, size: 8, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !259, file: !10, line: 90, baseType: !186, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !259, file: !10, line: 91, baseType: !94, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !259, file: !10, line: 92, baseType: !272, size: 32, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !10, line: 93, baseType: !274, size: 32, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !10, line: 94, baseType: !257, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !259, file: !10, line: 95, baseType: !186, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !259, file: !10, line: 96, baseType: !196, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !253, file: !10, line: 102, baseType: !186, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !253, file: !10, line: 102, baseType: !186, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !253, file: !10, line: 103, baseType: !186, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !253, file: !10, line: 104, baseType: !115, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !253, file: !10, line: 105, baseType: !272, size: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !253, file: !10, line: 105, baseType: !272, size: 32, offset: 416)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !253, file: !10, line: 105, baseType: !272, size: 32, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !253, file: !10, line: 106, baseType: !97, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !253, file: !10, line: 107, baseType: !287, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!290 = !{!291}
!291 = !DISubrange(count: 5)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !99, file: !100, line: 113, baseType: !293, size: 320, offset: 3648)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!113, !97, !196}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !99, file: !100, line: 114, baseType: !298, size: 320, offset: 3968)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !290)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !99, file: !100, line: 115, baseType: !272, size: 32, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !99, file: !100, line: 120, baseType: !287, size: 64, offset: 4352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !99, file: !100, line: 121, baseType: !272, size: 32, offset: 4416)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt_GLEE", file: !304, line: 6, baseType: !305)
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/glee/adaptglee.c", directory: "/home/users/ndemeye/xSDK")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 4, size: 64, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !305, file: !304, line: 5, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !25, line: 21, flags: DIFlagFwdDecl)
!311 = !{i32 7, !"Dwarf Version", i32 4}
!312 = !{i32 2, !"Debug Info Version", i32 3}
!313 = !{i32 1, !"wchar_size", i32 4}
!314 = !{i32 7, !"PIC Level", i32 2}
!315 = !{i32 7, !"uwtable", i32 1}
!316 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!317 = distinct !DISubprogram(name: "TSAdaptCreate_GLEE", scope: !304, file: !304, line: 143, type: !318, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !817)
!318 = !DISubroutineType(types: !319)
!319 = !{!113, !320}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !33, line: 686, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !54, line: 319, size: 10112, elements: !323)
!323 = !{!324, !326, !782, !783, !787, !802, !803, !804, !805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !322, file: !54, line: 320, baseType: !325, size: 4480)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !100, line: 122, baseType: !99)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !322, file: !54, line: 320, baseType: !327, size: 384, offset: 4480)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 384, elements: !155)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !54, line: 310, size: 384, elements: !329)
!329 = !{!330, !770, !772, !773, !777, !781}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !328, file: !54, line: 311, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!113, !320, !334, !214, !205, !213, !377, !213, !213, !213}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !33, line: 17, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !54, line: 144, size: 17408, elements: !337)
!337 = !{!338, !339, !436, !438, !440, !445, !446, !447, !448, !450, !496, !503, !509, !511, !512, !517, !518, !519, !520, !521, !522, !526, !530, !531, !532, !536, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !646, !650, !654, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !706, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !737, !738, !739, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !768, !769}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !336, file: !54, line: 145, baseType: !325, size: 4480)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !336, file: !54, line: 145, baseType: !340, size: 2048, offset: 4480)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 2048, elements: !155)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !54, line: 33, size: 2048, elements: !342)
!342 = !{!343, !351, !358, !362, !363, !364, !368, !373, !378, !382, !383, !387, !388, !392, !393, !394, !400, !401, !402, !403, !404, !405, !406, !407, !408, !414, !418, !422, !426, !430, !431, !432}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !341, file: !54, line: 34, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!113, !347, !308, !308, !334}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !348, line: 18, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !348, line: 18, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !341, file: !54, line: 35, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!113, !347, !308, !355, !355, !334}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !62, line: 16, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !62, line: 16, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !341, file: !54, line: 36, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!113, !334}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !341, file: !54, line: 37, baseType: !359, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !341, file: !54, line: 38, baseType: !359, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !341, file: !54, line: 39, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!113, !334, !214, !308}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !341, file: !54, line: 40, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!113, !334, !372, !205, !213}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !341, file: !54, line: 41, baseType: !374, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!113, !334, !159, !308, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !341, file: !54, line: 42, baseType: !379, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!113, !251, !334}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !341, file: !54, line: 43, baseType: !359, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !341, file: !54, line: 44, baseType: !384, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!113, !334, !123}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !341, file: !54, line: 45, baseType: !359, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !341, file: !54, line: 46, baseType: !389, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!113, !334, !214, !214, !213, !213}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !341, file: !54, line: 47, baseType: !384, size: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !341, file: !54, line: 48, baseType: !359, size: 64, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !341, file: !54, line: 49, baseType: !395, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!113, !334, !205, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !341, file: !54, line: 50, baseType: !359, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !341, file: !54, line: 51, baseType: !359, size: 64, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !341, file: !54, line: 52, baseType: !359, size: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !341, file: !54, line: 53, baseType: !359, size: 64, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !341, file: !54, line: 54, baseType: !359, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !341, file: !54, line: 55, baseType: !359, size: 64, offset: 1344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !341, file: !54, line: 56, baseType: !359, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !341, file: !54, line: 57, baseType: !359, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !341, file: !54, line: 58, baseType: !409, size: 64, offset: 1536)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!113, !334, !205, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !341, file: !54, line: 59, baseType: !415, size: 64, offset: 1600)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!113, !334, !205, !399}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !341, file: !54, line: 60, baseType: !419, size: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!113, !334, !399}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !341, file: !54, line: 61, baseType: !423, size: 64, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!113, !334, !159, !399}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !341, file: !54, line: 62, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!113, !334, !308}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !341, file: !54, line: 63, baseType: !359, size: 64, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !341, file: !54, line: 64, baseType: !427, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !341, file: !54, line: 65, baseType: !433, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!113, !334, !308, !308}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !336, file: !54, line: 146, baseType: !437, size: 32, offset: 6528)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !33, line: 57, baseType: !32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !336, file: !54, line: 147, baseType: !439, size: 32, offset: 6560)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !33, line: 88, baseType: !37)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !336, file: !54, line: 149, baseType: !441, size: 64, offset: 6592)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !442, line: 14, baseType: !443)
!442 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !442, line: 14, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !336, file: !54, line: 150, baseType: !308, size: 64, offset: 6656)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !336, file: !54, line: 151, baseType: !308, size: 64, offset: 6720)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !336, file: !54, line: 152, baseType: !320, size: 64, offset: 6784)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !336, file: !54, line: 153, baseType: !449, size: 64, offset: 6848)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !33, line: 695, baseType: !136)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !336, file: !54, line: 154, baseType: !451, size: 64, offset: 6912)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !54, line: 71, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !54, line: 410, size: 1792, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !471, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485, !486, !494, !495}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !453, file: !54, line: 411, baseType: !222, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !453, file: !54, line: 412, baseType: !222, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !453, file: !54, line: 413, baseType: !214, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !453, file: !54, line: 414, baseType: !214, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !453, file: !54, line: 415, baseType: !214, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !453, file: !54, line: 416, baseType: !222, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !453, file: !54, line: 417, baseType: !205, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !453, file: !54, line: 418, baseType: !214, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !453, file: !54, line: 419, baseType: !214, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !453, file: !54, line: 420, baseType: !214, size: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !453, file: !54, line: 421, baseType: !214, size: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !453, file: !54, line: 422, baseType: !377, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !453, file: !54, line: 423, baseType: !468, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!113, !334, !214, !308, !222, !196}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !453, file: !54, line: 424, baseType: !472, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!113, !334, !159, !205, !214, !308, !272, !196}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !453, file: !54, line: 425, baseType: !196, size: 64, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !453, file: !54, line: 426, baseType: !205, size: 64, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !453, file: !54, line: 427, baseType: !377, size: 64, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !453, file: !54, line: 428, baseType: !159, size: 32, offset: 1088)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !453, file: !54, line: 429, baseType: !159, size: 32, offset: 1120)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !453, file: !54, line: 430, baseType: !205, size: 64, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !453, file: !54, line: 431, baseType: !213, size: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !453, file: !54, line: 432, baseType: !483, size: 32, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !54, line: 408, baseType: !53)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !453, file: !54, line: 433, baseType: !159, size: 32, offset: 1312)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !453, file: !54, line: 434, baseType: !123, size: 64, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !453, file: !54, line: 442, baseType: !487, size: 320, offset: 1408)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !54, line: 436, size: 320, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !487, file: !54, line: 437, baseType: !159, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !487, file: !54, line: 438, baseType: !213, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !487, file: !54, line: 439, baseType: !205, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !487, file: !54, line: 440, baseType: !205, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !487, file: !54, line: 441, baseType: !207, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !453, file: !54, line: 443, baseType: !159, size: 32, offset: 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !453, file: !54, line: 444, baseType: !159, size: 32, offset: 1760)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !336, file: !54, line: 157, baseType: !497, size: 640, offset: 6976)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 640, elements: !501)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!113, !334, !159, !214, !308, !196}
!501 = !{!502}
!502 = !DISubrange(count: 10)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !336, file: !54, line: 158, baseType: !504, size: 640, offset: 7616)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 640, elements: !501)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!113, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !336, file: !54, line: 159, baseType: !510, size: 640, offset: 8256)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 640, elements: !501)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !336, file: !54, line: 160, baseType: !159, size: 32, offset: 8896)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !336, file: !54, line: 161, baseType: !513, size: 640, offset: 8960)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 640, elements: !501)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!113, !334, !159, !214, !308, !159, !399, !399, !196}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !336, file: !54, line: 162, baseType: !504, size: 640, offset: 9600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !336, file: !54, line: 163, baseType: !510, size: 640, offset: 10240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !336, file: !54, line: 164, baseType: !159, size: 32, offset: 10880)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !336, file: !54, line: 165, baseType: !159, size: 32, offset: 10912)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !336, file: !54, line: 167, baseType: !359, size: 64, offset: 10944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !336, file: !54, line: 168, baseType: !523, size: 64, offset: 11008)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!113, !334, !214}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !336, file: !54, line: 169, baseType: !527, size: 64, offset: 11072)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!113, !334, !214, !159, !399}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !336, file: !54, line: 170, baseType: !359, size: 64, offset: 11136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !336, file: !54, line: 171, baseType: !359, size: 64, offset: 11200)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !336, file: !54, line: 172, baseType: !533, size: 64, offset: 11264)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!113, !334, !214, !308, !377}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !336, file: !54, line: 175, baseType: !537, size: 64, offset: 11328)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !33, line: 293, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !54, line: 89, size: 7040, elements: !540)
!540 = !{!541, !542, !571, !575, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !612, !613, !614, !615, !616, !620, !621, !622}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !539, file: !54, line: 90, baseType: !325, size: 4480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !539, file: !54, line: 90, baseType: !543, size: 448, offset: 4480)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 448, elements: !155)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !54, line: 75, size: 448, elements: !545)
!545 = !{!546, !550, !554, !555, !559, !563, !567}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !544, file: !54, line: 76, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!113, !537, !123}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !544, file: !54, line: 77, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!113, !537}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !544, file: !54, line: 78, baseType: !551, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !544, file: !54, line: 79, baseType: !556, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!113, !537, !334, !159, !214, !308}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !544, file: !54, line: 80, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!113, !537, !334, !159, !213}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !544, file: !54, line: 81, baseType: !564, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!113, !251, !537}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !544, file: !54, line: 82, baseType: !568, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!113, !537, !334}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !539, file: !54, line: 91, baseType: !572, size: 64, offset: 4928)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !54, line: 87, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !54, line: 87, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !539, file: !54, line: 116, baseType: !576, size: 1024, offset: 4992)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !54, line: 93, size: 1024, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !593}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !576, file: !54, line: 94, baseType: !159, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !576, file: !54, line: 95, baseType: !399, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !576, file: !54, line: 96, baseType: !222, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !576, file: !54, line: 97, baseType: !213, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !576, file: !54, line: 98, baseType: !399, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !576, file: !54, line: 99, baseType: !377, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !576, file: !54, line: 100, baseType: !213, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !576, file: !54, line: 103, baseType: !272, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !576, file: !54, line: 109, baseType: !587, size: 256, offset: 512)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !54, line: 104, size: 256, elements: !588)
!588 = !{!589, !590, !591, !592}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !587, file: !54, line: 105, baseType: !167, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !587, file: !54, line: 106, baseType: !198, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !587, file: !54, line: 107, baseType: !214, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !587, file: !54, line: 108, baseType: !159, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !576, file: !54, line: 115, baseType: !594, size: 256, offset: 768)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !54, line: 110, size: 256, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !594, file: !54, line: 111, baseType: !167, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !594, file: !54, line: 112, baseType: !198, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !594, file: !54, line: 113, baseType: !214, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !594, file: !54, line: 114, baseType: !159, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !539, file: !54, line: 117, baseType: !308, size: 64, offset: 6016)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !539, file: !54, line: 117, baseType: !308, size: 64, offset: 6080)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !539, file: !54, line: 118, baseType: !272, size: 32, offset: 6144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !539, file: !54, line: 119, baseType: !272, size: 32, offset: 6176)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !539, file: !54, line: 120, baseType: !272, size: 32, offset: 6208)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !539, file: !54, line: 121, baseType: !123, size: 64, offset: 6272)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !539, file: !54, line: 122, baseType: !159, size: 32, offset: 6336)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !539, file: !54, line: 123, baseType: !159, size: 32, offset: 6368)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !539, file: !54, line: 124, baseType: !159, size: 32, offset: 6400)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !539, file: !54, line: 124, baseType: !159, size: 32, offset: 6432)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !539, file: !54, line: 125, baseType: !611, size: 64, offset: 6464)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !539, file: !54, line: 126, baseType: !272, size: 32, offset: 6528)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !539, file: !54, line: 127, baseType: !186, size: 64, offset: 6592)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !539, file: !54, line: 127, baseType: !186, size: 64, offset: 6656)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !539, file: !54, line: 128, baseType: !186, size: 64, offset: 6720)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !539, file: !54, line: 129, baseType: !617, size: 64, offset: 6784)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!113, !196, !308, !399}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !539, file: !54, line: 130, baseType: !242, size: 64, offset: 6848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !539, file: !54, line: 131, baseType: !196, size: 64, offset: 6912)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !54, line: 132, baseType: !196, size: 64, offset: 6976)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !336, file: !54, line: 176, baseType: !399, size: 64, offset: 11392)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !336, file: !54, line: 177, baseType: !399, size: 64, offset: 11456)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !336, file: !54, line: 178, baseType: !159, size: 32, offset: 11520)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !336, file: !54, line: 179, baseType: !308, size: 64, offset: 11584)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !336, file: !54, line: 180, baseType: !159, size: 32, offset: 11648)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !336, file: !54, line: 181, baseType: !159, size: 32, offset: 11680)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !336, file: !54, line: 182, baseType: !159, size: 32, offset: 11712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !336, file: !54, line: 183, baseType: !272, size: 32, offset: 11744)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !336, file: !54, line: 184, baseType: !272, size: 32, offset: 11776)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !336, file: !54, line: 185, baseType: !308, size: 64, offset: 11840)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !336, file: !54, line: 186, baseType: !355, size: 64, offset: 11904)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !336, file: !54, line: 186, baseType: !355, size: 64, offset: 11968)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !336, file: !54, line: 187, baseType: !196, size: 64, offset: 12032)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !336, file: !54, line: 187, baseType: !196, size: 64, offset: 12096)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !336, file: !54, line: 188, baseType: !196, size: 64, offset: 12160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !336, file: !54, line: 189, baseType: !399, size: 64, offset: 12224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !336, file: !54, line: 190, baseType: !399, size: 64, offset: 12288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !336, file: !54, line: 191, baseType: !308, size: 64, offset: 12352)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !336, file: !54, line: 191, baseType: !308, size: 64, offset: 12416)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !336, file: !54, line: 194, baseType: !643, size: 64, offset: 12480)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!113, !334, !214, !308, !355, !196}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !336, file: !54, line: 195, baseType: !647, size: 64, offset: 12544)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!113, !334, !214, !308, !308, !214, !355, !196}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !336, file: !54, line: 196, baseType: !651, size: 64, offset: 12608)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!113, !334, !214, !308, !308, !196}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !336, file: !54, line: 197, baseType: !655, size: 64, offset: 12672)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!113, !334, !214, !308, !399, !196}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !336, file: !54, line: 198, baseType: !655, size: 64, offset: 12736)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !336, file: !54, line: 201, baseType: !399, size: 64, offset: 12800)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !336, file: !54, line: 202, baseType: !399, size: 64, offset: 12864)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !336, file: !54, line: 203, baseType: !308, size: 64, offset: 12928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !336, file: !54, line: 204, baseType: !399, size: 64, offset: 12992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !336, file: !54, line: 204, baseType: !399, size: 64, offset: 13056)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !336, file: !54, line: 205, baseType: !399, size: 64, offset: 13120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !336, file: !54, line: 205, baseType: !399, size: 64, offset: 13184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !336, file: !54, line: 206, baseType: !399, size: 64, offset: 13248)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !336, file: !54, line: 206, baseType: !399, size: 64, offset: 13312)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !336, file: !54, line: 207, baseType: !399, size: 64, offset: 13376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !336, file: !54, line: 207, baseType: !399, size: 64, offset: 13440)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !336, file: !54, line: 208, baseType: !196, size: 64, offset: 13504)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !336, file: !54, line: 208, baseType: !196, size: 64, offset: 13568)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !336, file: !54, line: 209, baseType: !673, size: 64, offset: 13632)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!113, !334, !214, !308, !399, !308, !399, !196}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !336, file: !54, line: 210, baseType: !673, size: 64, offset: 13696)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !336, file: !54, line: 211, baseType: !673, size: 64, offset: 13760)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !336, file: !54, line: 212, baseType: !673, size: 64, offset: 13824)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !336, file: !54, line: 213, baseType: !673, size: 64, offset: 13888)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !336, file: !54, line: 214, baseType: !673, size: 64, offset: 13952)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !336, file: !54, line: 215, baseType: !673, size: 64, offset: 14016)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !336, file: !54, line: 216, baseType: !673, size: 64, offset: 14080)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !336, file: !54, line: 219, baseType: !355, size: 64, offset: 14144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !336, file: !54, line: 220, baseType: !308, size: 64, offset: 14208)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !336, file: !54, line: 221, baseType: !399, size: 64, offset: 14272)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !336, file: !54, line: 222, baseType: !159, size: 32, offset: 14336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !336, file: !54, line: 223, baseType: !159, size: 32, offset: 14368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !336, file: !54, line: 224, baseType: !196, size: 64, offset: 14400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !336, file: !54, line: 225, baseType: !159, size: 32, offset: 14464)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !336, file: !54, line: 226, baseType: !272, size: 32, offset: 14496)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !336, file: !54, line: 227, baseType: !655, size: 64, offset: 14528)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !336, file: !54, line: 231, baseType: !355, size: 64, offset: 14592)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !336, file: !54, line: 232, baseType: !355, size: 64, offset: 14656)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !336, file: !54, line: 233, baseType: !308, size: 64, offset: 14720)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !336, file: !54, line: 247, baseType: !696, size: 384, offset: 14784)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !336, file: !54, line: 238, size: 384, elements: !697)
!697 = !{!698, !699, !700, !701, !703, !704, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !696, file: !54, line: 239, baseType: !214, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !696, file: !54, line: 240, baseType: !167, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !696, file: !54, line: 241, baseType: !198, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !696, file: !54, line: 242, baseType: !702, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !62, line: 285, baseType: !61)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !696, file: !54, line: 245, baseType: !272, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !696, file: !54, line: 246, baseType: !214, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !696, file: !54, line: 246, baseType: !214, size: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !336, file: !54, line: 251, baseType: !707, size: 64, offset: 15168)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !336, file: !54, line: 249, size: 64, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !707, file: !54, line: 250, baseType: !214, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !336, file: !54, line: 253, baseType: !702, size: 32, offset: 15232)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !336, file: !54, line: 255, baseType: !347, size: 64, offset: 15296)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !336, file: !54, line: 256, baseType: !272, size: 32, offset: 15360)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !336, file: !54, line: 258, baseType: !159, size: 32, offset: 15392)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !336, file: !54, line: 259, baseType: !159, size: 32, offset: 15424)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !336, file: !54, line: 260, baseType: !159, size: 32, offset: 15456)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !336, file: !54, line: 261, baseType: !159, size: 32, offset: 15488)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !336, file: !54, line: 264, baseType: !159, size: 32, offset: 15520)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !336, file: !54, line: 264, baseType: !159, size: 32, offset: 15552)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !336, file: !54, line: 264, baseType: !159, size: 32, offset: 15584)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !336, file: !54, line: 264, baseType: !159, size: 32, offset: 15616)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !336, file: !54, line: 267, baseType: !159, size: 32, offset: 15648)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !54, line: 268, baseType: !196, size: 64, offset: 15680)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !336, file: !54, line: 269, baseType: !196, size: 64, offset: 15744)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !336, file: !54, line: 272, baseType: !159, size: 32, offset: 15808)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !336, file: !54, line: 273, baseType: !214, size: 64, offset: 15872)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !336, file: !54, line: 277, baseType: !272, size: 32, offset: 15936)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !336, file: !54, line: 278, baseType: !272, size: 32, offset: 15968)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !336, file: !54, line: 279, baseType: !159, size: 32, offset: 16000)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !336, file: !54, line: 280, baseType: !214, size: 64, offset: 16064)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !336, file: !54, line: 281, baseType: !214, size: 64, offset: 16128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !336, file: !54, line: 282, baseType: !214, size: 64, offset: 16192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !336, file: !54, line: 283, baseType: !214, size: 64, offset: 16256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !336, file: !54, line: 284, baseType: !214, size: 64, offset: 16320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !336, file: !54, line: 286, baseType: !735, size: 32, offset: 16384)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !33, line: 115, baseType: !68)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !336, file: !54, line: 287, baseType: !272, size: 32, offset: 16416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !336, file: !54, line: 288, baseType: !159, size: 32, offset: 16448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !336, file: !54, line: 288, baseType: !159, size: 32, offset: 16480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !336, file: !54, line: 289, baseType: !740, size: 32, offset: 16512)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !33, line: 217, baseType: !81)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !336, file: !54, line: 291, baseType: !214, size: 64, offset: 16576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !336, file: !54, line: 291, baseType: !214, size: 64, offset: 16640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !336, file: !54, line: 292, baseType: !308, size: 64, offset: 16704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !336, file: !54, line: 292, baseType: !308, size: 64, offset: 16768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !336, file: !54, line: 293, baseType: !214, size: 64, offset: 16832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !336, file: !54, line: 293, baseType: !214, size: 64, offset: 16896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !336, file: !54, line: 295, baseType: !272, size: 32, offset: 16960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !336, file: !54, line: 296, baseType: !272, size: 32, offset: 16992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !336, file: !54, line: 298, baseType: !159, size: 32, offset: 17024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !336, file: !54, line: 299, baseType: !399, size: 64, offset: 17088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !336, file: !54, line: 302, baseType: !159, size: 32, offset: 17152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !336, file: !54, line: 303, baseType: !753, size: 64, offset: 17216)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !54, line: 135, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !54, line: 136, size: 320, elements: !756)
!756 = !{!757, !758, !759, !764, !765}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !755, file: !54, line: 137, baseType: !334, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !755, file: !54, line: 138, baseType: !186, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !755, file: !54, line: 139, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !761, line: 11, baseType: !762)
!761 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !761, line: 11, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !54, line: 140, baseType: !753, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !755, file: !54, line: 141, baseType: !766, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !767, line: 80, baseType: !38)
!767 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!768 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !336, file: !54, line: 304, baseType: !272, size: 32, offset: 17280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !336, file: !54, line: 307, baseType: !334, size: 64, offset: 17344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !328, file: !54, line: 312, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !328, file: !54, line: 313, baseType: !771, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !328, file: !54, line: 314, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!113, !320, !123}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !328, file: !54, line: 315, baseType: !778, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!113, !251, !320}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !328, file: !54, line: 316, baseType: !774, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !54, line: 321, baseType: !196, size: 64, offset: 4864)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !322, file: !54, line: 322, baseType: !784, size: 64, offset: 4928)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!113, !320, !334, !214, !308, !377}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !322, file: !54, line: 331, baseType: !788, size: 4160, offset: 4992)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !322, file: !54, line: 323, size: 4160, elements: !789)
!789 = !{!790, !791, !792, !796, !798, !799, !801}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !788, file: !54, line: 324, baseType: !159, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !788, file: !54, line: 325, baseType: !272, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !788, file: !54, line: 326, baseType: !793, size: 1024, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 16)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !788, file: !54, line: 327, baseType: !797, size: 512, offset: 1088)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 512, elements: !794)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !788, file: !54, line: 328, baseType: !797, size: 512, offset: 1600)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !788, file: !54, line: 329, baseType: !800, size: 1024, offset: 2112)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1024, elements: !794)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !788, file: !54, line: 330, baseType: !800, size: 1024, offset: 3136)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !322, file: !54, line: 332, baseType: !272, size: 32, offset: 9152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !322, file: !54, line: 333, baseType: !214, size: 64, offset: 9216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !322, file: !54, line: 334, baseType: !214, size: 64, offset: 9280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !322, file: !54, line: 335, baseType: !806, size: 128, offset: 9344)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !236)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !322, file: !54, line: 336, baseType: !214, size: 64, offset: 9472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !322, file: !54, line: 336, baseType: !214, size: 64, offset: 9536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !322, file: !54, line: 337, baseType: !214, size: 64, offset: 9600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !322, file: !54, line: 338, baseType: !272, size: 32, offset: 9664)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !322, file: !54, line: 339, baseType: !214, size: 64, offset: 9728)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !322, file: !54, line: 340, baseType: !806, size: 128, offset: 9792)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !322, file: !54, line: 341, baseType: !372, size: 32, offset: 9920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !322, file: !54, line: 342, baseType: !123, size: 64, offset: 9984)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !322, file: !54, line: 343, baseType: !159, size: 32, offset: 10048)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !322, file: !54, line: 344, baseType: !159, size: 32, offset: 10080)
!817 = !{!818, !819, !820, !821}
!818 = !DILocalVariable(name: "adapt", arg: 1, scope: !317, file: !304, line: 143, type: !320)
!819 = !DILocalVariable(name: "ierr", scope: !317, file: !304, line: 145, type: !113)
!820 = !DILocalVariable(name: "glee", scope: !317, file: !304, line: 146, type: !302)
!821 = !DILocalVariable(name: "ierr__", scope: !822, file: !304, line: 149, type: !113)
!822 = distinct !DILexicalBlock(scope: !317, file: !304, line: 149, column: 35)
!823 = !DILocation(line: 0, scope: !317)
!824 = !DILocation(line: 146, column: 3, scope: !317)
!825 = !DILocation(line: 148, column: 3, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !304, line: 148, column: 3)
!827 = distinct !DILexicalBlock(scope: !828, file: !304, line: 148, column: 3)
!828 = distinct !DILexicalBlock(scope: !317, file: !304, line: 148, column: 3)
!829 = !{!830, !830, i64 0}
!830 = !{!"any pointer", !831, i64 0}
!831 = !{!"omnipotent char", !832, i64 0}
!832 = !{!"Simple C/C++ TBAA"}
!833 = !DILocation(line: 148, column: 3, scope: !827)
!834 = !DILocation(line: 148, column: 3, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !304, line: 148, column: 3)
!836 = distinct !DILexicalBlock(scope: !826, file: !304, line: 148, column: 3)
!837 = !{!838, !839, i64 1536}
!838 = !{!"", !831, i64 0, !831, i64 512, !831, i64 1024, !831, i64 1280, !839, i64 1536, !839, i64 1540, !831, i64 1544}
!839 = !{!"int", !831, i64 0}
!840 = !DILocation(line: 148, column: 3, scope: !836)
!841 = !DILocation(line: 148, column: 3, scope: !842)
!842 = distinct !DILexicalBlock(scope: !835, file: !304, line: 148, column: 3)
!843 = !{!839, !839, i64 0}
!844 = !{!838, !839, i64 1540}
!845 = !DILocation(line: 149, column: 10, scope: !317)
!846 = !{!"branch_weights", i32 2146410443, i32 1073205}
!847 = !DILocation(line: 0, scope: !822)
!848 = !DILocation(line: 149, column: 35, scope: !822)
!849 = !{!"branch_weights", i32 2000, i32 1}
!850 = !DILocation(line: 149, column: 35, scope: !851)
!851 = distinct !DILexicalBlock(scope: !822, file: !304, line: 149, column: 35)
!852 = !DILocation(line: 150, column: 32, scope: !317)
!853 = !DILocation(line: 150, column: 10, scope: !317)
!854 = !DILocation(line: 150, column: 23, scope: !317)
!855 = !{!856, !830, i64 608}
!856 = !{!"_p_TSAdapt", !857, i64 0, !831, i64 560, !830, i64 608, !830, i64 616, !860, i64 624, !831, i64 1144, !858, i64 1152, !858, i64 1160, !831, i64 1168, !858, i64 1184, !858, i64 1192, !858, i64 1200, !831, i64 1208, !858, i64 1216, !831, i64 1224, !831, i64 1240, !830, i64 1248, !839, i64 1256, !839, i64 1260}
!857 = !{!"_p_PetscObject", !839, i64 0, !831, i64 8, !830, i64 64, !839, i64 72, !858, i64 80, !858, i64 88, !858, i64 96, !858, i64 104, !859, i64 112, !839, i64 120, !839, i64 124, !830, i64 128, !830, i64 136, !830, i64 144, !830, i64 152, !830, i64 160, !830, i64 168, !830, i64 176, !859, i64 184, !830, i64 192, !830, i64 200, !839, i64 208, !830, i64 216, !859, i64 224, !839, i64 232, !839, i64 236, !830, i64 240, !830, i64 248, !830, i64 256, !830, i64 264, !839, i64 272, !839, i64 276, !830, i64 280, !830, i64 288, !830, i64 296, !830, i64 304, !839, i64 312, !839, i64 316, !830, i64 320, !830, i64 328, !830, i64 336, !830, i64 344, !830, i64 352, !839, i64 360, !831, i64 368, !831, i64 384, !830, i64 392, !830, i64 400, !839, i64 408, !831, i64 416, !831, i64 456, !831, i64 496, !831, i64 536, !830, i64 544, !831, i64 552}
!858 = !{!"double", !831, i64 0}
!859 = !{!"long", !831, i64 0}
!860 = !{!"", !839, i64 0, !831, i64 4, !831, i64 8, !831, i64 136, !831, i64 200, !831, i64 264, !831, i64 392}
!861 = !DILocation(line: 151, column: 15, scope: !317)
!862 = !DILocation(line: 151, column: 23, scope: !317)
!863 = !{!864, !830, i64 0}
!864 = !{!"_TSAdaptOps", !830, i64 0, !830, i64 8, !830, i64 16, !830, i64 24, !830, i64 32, !830, i64 40}
