; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/impls/hierarchical/hierarchical.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/impls/hierarchical/hierarchical.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!325 = !{!326, !330, !331, !416, !72, !500, !534, !537, !366, !540, !443}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !327, line: 330, baseType: !328)
!327 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !327, line: 330, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !334, line: 73, size: 4480, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !338, !387, !388, !390, !393, !394, !395, !396, !404, !405, !407, !411, !415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !428, !429, !430, !432, !433, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !449, !450, !453, !455, !456, !457, !467, !469, !470, !474, !475, !524, !529, !531, !532, !533}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !333, file: !334, line: 74, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !333, file: !334, line: 75, baseType: !339, size: 448, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 448, elements: !385)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !334, line: 53, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 45, size: 448, elements: !342)
!342 = !{!343, !349, !357, !362, !369, !373, !380}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !341, file: !334, line: 46, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !331, !348}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !341, file: !334, line: 47, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!347, !331, !353}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !354, line: 16, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !354, line: 16, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !341, file: !334, line: 48, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!347, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !341, file: !334, line: 49, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!347, !331, !366, !331}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !341, file: !334, line: 50, baseType: !370, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!347, !331, !366, !361}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !341, file: !334, line: 51, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!347, !331, !366, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !341, file: !334, line: 52, baseType: !381, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!347, !331, !366, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!385 = !{!386}
!386 = !DISubrange(count: 1)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !333, file: !334, line: 76, baseType: !326, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !334, line: 77, baseType: !389, size: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !392)
!392 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !334, line: 79, baseType: !397, size: 64, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !400, line: 27, baseType: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !402, line: 43, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!403 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !333, file: !334, line: 80, baseType: !389, size: 32, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !333, file: !334, line: 81, baseType: !406, size: 32, offset: 992)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !333, file: !334, line: 82, baseType: !408, size: 64, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !333, file: !334, line: 83, baseType: !412, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !333, file: !334, line: 84, baseType: !416, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !333, file: !334, line: 85, baseType: !416, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !333, file: !334, line: 86, baseType: !416, size: 64, offset: 1280)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !333, file: !334, line: 87, baseType: !416, size: 64, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !333, file: !334, line: 88, baseType: !331, size: 64, offset: 1408)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !333, file: !334, line: 89, baseType: !397, size: 64, offset: 1472)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !334, line: 90, baseType: !416, size: 64, offset: 1536)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !333, file: !334, line: 91, baseType: !416, size: 64, offset: 1600)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !333, file: !334, line: 92, baseType: !389, size: 32, offset: 1664)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !333, file: !334, line: 93, baseType: !330, size: 64, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !334, line: 94, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !398)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !333, file: !334, line: 95, baseType: !389, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !333, file: !334, line: 95, baseType: !389, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !333, file: !334, line: 96, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !333, file: !334, line: 96, baseType: !431, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !333, file: !334, line: 97, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !333, file: !334, line: 97, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !333, file: !334, line: 98, baseType: !389, size: 32, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !333, file: !334, line: 98, baseType: !389, size: 32, offset: 2208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !333, file: !334, line: 99, baseType: !431, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !333, file: !334, line: 99, baseType: !431, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !333, file: !334, line: 100, baseType: !442, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !392)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !333, file: !334, line: 100, baseType: !445, size: 64, offset: 2432)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !333, file: !334, line: 101, baseType: !389, size: 32, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !333, file: !334, line: 101, baseType: !389, size: 32, offset: 2528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !333, file: !334, line: 102, baseType: !431, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !333, file: !334, line: 102, baseType: !431, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !333, file: !334, line: 103, baseType: !451, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !443)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !333, file: !334, line: 103, baseType: !454, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !333, file: !334, line: 104, baseType: !384, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !333, file: !334, line: 105, baseType: !389, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !333, file: !334, line: 106, baseType: !458, size: 128, offset: 2944)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !465)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !334, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 61, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !334, line: 62, baseType: !377, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !461, file: !334, line: 63, baseType: !330, size: 64, offset: 64)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !333, file: !334, line: 107, baseType: !468, size: 64, offset: 3072)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !465)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !333, file: !334, line: 108, baseType: !330, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !333, file: !334, line: 109, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!347, !330}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !333, file: !334, line: 111, baseType: !389, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !333, file: !334, line: 112, baseType: !476, size: 320, offset: 3328)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !522)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!347, !480, !331, !330}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !483)
!483 = !{!484, !485, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !10, line: 100, baseType: !389, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 101, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !497, !498, !499, !503, !505, !507, !508, !509}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !488, file: !10, line: 84, baseType: !416, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !488, file: !10, line: 85, baseType: !416, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !10, line: 86, baseType: !330, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !488, file: !10, line: 87, baseType: !408, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !488, file: !10, line: 88, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !488, file: !10, line: 89, baseType: !368, size: 8, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !488, file: !10, line: 90, baseType: !416, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !488, file: !10, line: 91, baseType: !500, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !501, line: 46, baseType: !502)
!501 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!502 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !10, line: 92, baseType: !504, size: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !10, line: 93, baseType: !506, size: 32, offset: 544)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 94, baseType: !486, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !488, file: !10, line: 95, baseType: !416, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !488, file: !10, line: 96, baseType: !330, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !482, file: !10, line: 102, baseType: !416, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !482, file: !10, line: 102, baseType: !416, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !482, file: !10, line: 103, baseType: !416, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !482, file: !10, line: 104, baseType: !326, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !482, file: !10, line: 106, baseType: !331, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !482, file: !10, line: 107, baseType: !519, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!522 = !{!523}
!523 = !DISubrange(count: 5)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !333, file: !334, line: 113, baseType: !525, size: 320, offset: 3648)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!347, !331, !330}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !333, file: !334, line: 114, baseType: !530, size: 320, offset: 3968)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 320, elements: !522)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !333, file: !334, line: 115, baseType: !504, size: 32, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !333, file: !334, line: 120, baseType: !519, size: 64, offset: 4352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !333, file: !334, line: 121, baseType: !504, size: 32, offset: 4416)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !327, line: 331, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !327, line: 331, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !327, line: 338, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !327, line: 338, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning_Hierarchical", file: !542, line: 29, baseType: !543)
!542 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/partition/impls/hierarchical/hierarchical.c", directory: "/home/users/ndemeye/xSDK")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 19, size: 512, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !554, !555, !1354, !1355}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fineparttype", scope: !543, file: !542, line: 20, baseType: !416, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "coarseparttype", scope: !543, file: !542, line: 21, baseType: !416, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nfineparts", scope: !543, file: !542, line: 22, baseType: !389, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ncoarseparts", scope: !543, file: !542, line: 23, baseType: !389, size: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "coarseparts", scope: !543, file: !542, line: 24, baseType: !550, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !551, line: 11, baseType: !552)
!551 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !551, line: 11, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fineparts", scope: !543, file: !542, line: 25, baseType: !550, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMatPart", scope: !543, file: !542, line: 26, baseType: !556, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !36, line: 1427, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !559, line: 527, size: 5248, elements: !560)
!559 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!560 = !{!561, !563, !586, !1348, !1349, !1350, !1351, !1352, !1353}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !558, file: !559, line: 528, baseType: !562, size: 4480)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !334, line: 122, baseType: !333)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !558, file: !559, line: 528, baseType: !564, size: 384, offset: 4480)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 384, elements: !385)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatPartitioningOps", file: !559, line: 518, size: 384, elements: !566)
!566 = !{!567, !572, !573, !577, !581, !585}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !565, file: !559, line: 519, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!347, !556, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "applynd", scope: !565, file: !559, line: 520, baseType: !568, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !565, file: !559, line: 521, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!347, !480, !556}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !565, file: !559, line: 522, baseType: !578, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!347, !556}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !565, file: !559, line: 523, baseType: !582, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!347, !556, !353}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !565, file: !559, line: 524, baseType: !568, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !558, file: !559, line: 529, baseType: !587, size: 64, offset: 4864)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !559, line: 436, size: 23424, elements: !590)
!590 = !{!591, !592, !1094, !1114, !1115, !1116, !1118, !1119, !1120, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1244, !1245, !1261, !1262, !1263, !1264, !1265, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1300, !1320, !1321, !1323, !1324, !1325, !1326, !1327, !1328, !1346, !1347}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !589, file: !559, line: 437, baseType: !562, size: 4480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !589, file: !559, line: 437, baseType: !593, size: 9472, offset: 4480)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 9472, elements: !385)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !559, line: 32, size: 9472, elements: !595)
!595 = !{!596, !605, !609, !610, !617, !621, !622, !623, !624, !625, !626, !627, !647, !651, !656, !662, !681, !686, !690, !691, !696, !701, !702, !707, !711, !715, !719, !723, !727, !728, !729, !730, !731, !735, !736, !741, !742, !743, !744, !745, !750, !757, !761, !765, !769, !773, !777, !778, !782, !783, !790, !795, !796, !797, !798, !860, !868, !869, !873, !874, !878, !879, !883, !888, !889, !893, !897, !904, !905, !906, !907, !908, !909, !914, !915, !919, !923, !927, !928, !929, !933, !943, !944, !948, !949, !953, !954, !958, !959, !964, !965, !969, !973, !974, !975, !976, !977, !978, !979, !983, !984, !985, !986, !987, !988, !992, !993, !994, !995, !996, !997, !998, !999, !1003, !1007, !1008, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1023, !1024, !1025, !1030, !1034, !1035, !1039, !1040, !1041, !1042, !1068, !1072, !1073, !1074, !1075, !1076, !1080, !1081, !1082, !1083, !1084, !1088, !1092, !1093}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !594, file: !559, line: 34, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!347, !587, !389, !600, !389, !600, !602, !604}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !594, file: !559, line: 35, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!347, !587, !389, !434, !436, !454}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !594, file: !559, line: 36, baseType: !606, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !594, file: !559, line: 37, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!347, !587, !614, !614}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !594, file: !559, line: 38, baseType: !618, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!347, !587, !614, !614, !614}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !594, file: !559, line: 40, baseType: !611, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !594, file: !559, line: 41, baseType: !618, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !594, file: !559, line: 42, baseType: !611, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !594, file: !559, line: 43, baseType: !618, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !594, file: !559, line: 44, baseType: !611, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !594, file: !559, line: 46, baseType: !618, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !594, file: !559, line: 47, baseType: !628, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!347, !587, !550, !550, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !634, file: !36, line: 1227, baseType: !443, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !634, file: !36, line: 1228, baseType: !443, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !634, file: !36, line: 1229, baseType: !443, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !634, file: !36, line: 1230, baseType: !443, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !634, file: !36, line: 1231, baseType: !443, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !634, file: !36, line: 1232, baseType: !443, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !634, file: !36, line: 1233, baseType: !443, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !634, file: !36, line: 1234, baseType: !443, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !634, file: !36, line: 1236, baseType: !443, size: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !634, file: !36, line: 1237, baseType: !443, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !634, file: !36, line: 1238, baseType: !443, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !594, file: !559, line: 48, baseType: !648, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!347, !587, !550, !631}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !594, file: !559, line: 49, baseType: !652, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!347, !587, !614, !443, !655, !443, !389, !389, !614}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !594, file: !559, line: 50, baseType: !657, size: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!347, !587, !660, !661}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !594, file: !559, line: 52, baseType: !663, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!347, !587, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !669, file: !36, line: 593, baseType: !391, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !669, file: !36, line: 594, baseType: !391, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !669, file: !36, line: 594, baseType: !391, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !669, file: !36, line: 594, baseType: !391, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !669, file: !36, line: 595, baseType: !391, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !669, file: !36, line: 596, baseType: !391, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !669, file: !36, line: 597, baseType: !391, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !669, file: !36, line: 598, baseType: !391, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !669, file: !36, line: 598, baseType: !391, size: 64, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !669, file: !36, line: 599, baseType: !391, size: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !594, file: !559, line: 53, baseType: !682, size: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!347, !587, !587, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !594, file: !559, line: 54, baseType: !687, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!347, !587, !614}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !594, file: !559, line: 55, baseType: !611, size: 64, offset: 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !594, file: !559, line: 56, baseType: !692, size: 64, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!347, !587, !695, !442}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !594, file: !559, line: 58, baseType: !697, size: 64, offset: 1280)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!347, !587, !700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !594, file: !559, line: 59, baseType: !697, size: 64, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !594, file: !559, line: 60, baseType: !703, size: 64, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!347, !587, !706, !504}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !594, file: !559, line: 61, baseType: !708, size: 64, offset: 1472)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!347, !587}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !594, file: !559, line: 63, baseType: !712, size: 64, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!347, !587, !389, !600, !452, !614, !614}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !594, file: !559, line: 64, baseType: !716, size: 64, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!347, !587, !587, !550, !550, !631}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !594, file: !559, line: 65, baseType: !720, size: 64, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!347, !587, !587, !631}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !594, file: !559, line: 66, baseType: !724, size: 64, offset: 1728)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!347, !587, !587, !550, !631}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !594, file: !559, line: 67, baseType: !720, size: 64, offset: 1792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !594, file: !559, line: 69, baseType: !708, size: 64, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !594, file: !559, line: 70, baseType: !716, size: 64, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !594, file: !559, line: 71, baseType: !724, size: 64, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !594, file: !559, line: 72, baseType: !732, size: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!347, !587, !661}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !594, file: !559, line: 73, baseType: !708, size: 64, offset: 2112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !594, file: !559, line: 75, baseType: !737, size: 64, offset: 2176)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!347, !587, !740, !661}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !594, file: !559, line: 76, baseType: !611, size: 64, offset: 2240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !594, file: !559, line: 77, baseType: !611, size: 64, offset: 2304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !594, file: !559, line: 78, baseType: !628, size: 64, offset: 2368)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !594, file: !559, line: 79, baseType: !648, size: 64, offset: 2432)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !594, file: !559, line: 81, baseType: !746, size: 64, offset: 2496)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!347, !587, !452, !587, !749}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !594, file: !559, line: 82, baseType: !751, size: 64, offset: 2560)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!347, !587, !389, !754, !754, !660, !756}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !594, file: !559, line: 83, baseType: !758, size: 64, offset: 2624)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!347, !587, !389, !571, !389}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !594, file: !559, line: 84, baseType: !762, size: 64, offset: 2688)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!347, !587, !389, !600, !389, !600, !451}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !594, file: !559, line: 85, baseType: !766, size: 64, offset: 2752)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!347, !587, !587, !749}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !594, file: !559, line: 87, baseType: !770, size: 64, offset: 2816)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!347, !587, !614, !434}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !594, file: !559, line: 88, baseType: !774, size: 64, offset: 2880)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!347, !587, !452}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !594, file: !559, line: 89, baseType: !774, size: 64, offset: 2944)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !594, file: !559, line: 90, baseType: !779, size: 64, offset: 3008)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!347, !587, !614, !604}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !594, file: !559, line: 91, baseType: !712, size: 64, offset: 3072)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !594, file: !559, line: 93, baseType: !784, size: 64, offset: 3136)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!347, !587, !787}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !594, file: !559, line: 94, baseType: !791, size: 64, offset: 3200)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!347, !587, !389, !504, !504, !434, !794, !794, !685}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !594, file: !559, line: 95, baseType: !791, size: 64, offset: 3264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !594, file: !559, line: 96, baseType: !791, size: 64, offset: 3328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !594, file: !559, line: 97, baseType: !791, size: 64, offset: 3392)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !594, file: !559, line: 99, baseType: !799, size: 64, offset: 3456)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!347, !587, !802, !805}
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !551, line: 51, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !551, line: 51, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !559, line: 609, size: 6208, elements: !808)
!808 = !{!809, !810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !829, !836, !837, !838, !839, !840, !841, !842, !843, !847, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !807, file: !559, line: 610, baseType: !562, size: 4480)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !807, file: !559, line: 610, baseType: !811, size: 32, offset: 4480)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !385)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !807, file: !559, line: 611, baseType: !389, size: 32, offset: 4512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !807, file: !559, line: 611, baseType: !389, size: 32, offset: 4544)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !807, file: !559, line: 611, baseType: !389, size: 32, offset: 4576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !807, file: !559, line: 612, baseType: !389, size: 32, offset: 4608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !807, file: !559, line: 613, baseType: !389, size: 32, offset: 4640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !807, file: !559, line: 614, baseType: !434, size: 64, offset: 4672)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !807, file: !559, line: 615, baseType: !436, size: 64, offset: 4736)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !807, file: !559, line: 616, baseType: !571, size: 64, offset: 4800)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !807, file: !559, line: 617, baseType: !434, size: 64, offset: 4864)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !807, file: !559, line: 618, baseType: !822, size: 64, offset: 4928)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !559, line: 602, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 598, size: 128, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !824, file: !559, line: 599, baseType: !389, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !824, file: !559, line: 600, baseType: !389, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !824, file: !559, line: 601, baseType: !451, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !807, file: !559, line: 619, baseType: !830, size: 64, offset: 4992)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !559, line: 607, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 604, size: 128, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !832, file: !559, line: 605, baseType: !389, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !832, file: !559, line: 606, baseType: !451, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !807, file: !559, line: 620, baseType: !451, size: 64, offset: 5056)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !807, file: !559, line: 621, baseType: !443, size: 64, offset: 5120)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !807, file: !559, line: 622, baseType: !443, size: 64, offset: 5184)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !807, file: !559, line: 623, baseType: !614, size: 64, offset: 5248)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !807, file: !559, line: 623, baseType: !614, size: 64, offset: 5312)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !807, file: !559, line: 623, baseType: !614, size: 64, offset: 5376)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !807, file: !559, line: 624, baseType: !504, size: 32, offset: 5440)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !807, file: !559, line: 625, baseType: !844, size: 64, offset: 5504)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!347}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !807, file: !559, line: 626, baseType: !330, size: 64, offset: 5568)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !807, file: !559, line: 627, baseType: !614, size: 64, offset: 5632)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !807, file: !559, line: 628, baseType: !389, size: 32, offset: 5696)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !807, file: !559, line: 629, baseType: !366, size: 64, offset: 5760)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !807, file: !559, line: 630, baseType: !852, size: 32, offset: 5824)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !807, file: !559, line: 631, baseType: !389, size: 32, offset: 5856)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !807, file: !559, line: 631, baseType: !389, size: 32, offset: 5888)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !807, file: !559, line: 632, baseType: !504, size: 32, offset: 5920)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !807, file: !559, line: 633, baseType: !504, size: 32, offset: 5952)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !807, file: !559, line: 634, baseType: !377, size: 64, offset: 6016)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !807, file: !559, line: 634, baseType: !330, size: 64, offset: 6080)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !807, file: !559, line: 635, baseType: !397, size: 64, offset: 6144)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !594, file: !559, line: 100, baseType: !861, size: 64, offset: 3520)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!347, !587, !389, !389, !864, !867}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !866)
!866 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !594, file: !559, line: 101, baseType: !708, size: 64, offset: 3584)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !594, file: !559, line: 102, baseType: !870, size: 64, offset: 3648)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!347, !587, !550, !550, !661}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !594, file: !559, line: 103, baseType: !597, size: 64, offset: 3712)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !594, file: !559, line: 105, baseType: !875, size: 64, offset: 3776)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!347, !587, !550, !550, !660, !661}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !594, file: !559, line: 106, baseType: !708, size: 64, offset: 3840)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !594, file: !559, line: 107, baseType: !880, size: 64, offset: 3904)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!347, !587, !353}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !594, file: !559, line: 108, baseType: !884, size: 64, offset: 3968)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!347, !587, !887, !660, !661}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !366)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !594, file: !559, line: 109, baseType: !844, size: 64, offset: 4032)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !594, file: !559, line: 111, baseType: !890, size: 64, offset: 4096)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!347, !587, !587, !587, !443, !587}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !594, file: !559, line: 112, baseType: !894, size: 64, offset: 4160)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!347, !587, !587, !587, !587}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !594, file: !559, line: 113, baseType: !898, size: 64, offset: 4224)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!347, !587, !901, !901}
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !551, line: 30, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !551, line: 30, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !594, file: !559, line: 114, baseType: !597, size: 64, offset: 4288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !594, file: !559, line: 115, baseType: !712, size: 64, offset: 4352)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !594, file: !559, line: 117, baseType: !770, size: 64, offset: 4416)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !594, file: !559, line: 118, baseType: !770, size: 64, offset: 4480)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !594, file: !559, line: 119, baseType: !884, size: 64, offset: 4544)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !594, file: !559, line: 120, baseType: !910, size: 64, offset: 4608)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!347, !587, !913, !685}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !594, file: !559, line: 121, baseType: !844, size: 64, offset: 4672)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !594, file: !559, line: 123, baseType: !916, size: 64, offset: 4736)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!347, !587, !389, !330}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !594, file: !559, line: 124, baseType: !920, size: 64, offset: 4800)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!347, !587, !805, !614, !330}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !594, file: !559, line: 125, baseType: !924, size: 64, offset: 4864)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!347, !480, !587}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !594, file: !559, line: 126, baseType: !611, size: 64, offset: 4928)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !594, file: !559, line: 127, baseType: !611, size: 64, offset: 4992)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !594, file: !559, line: 129, baseType: !930, size: 64, offset: 5056)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!347, !587, !571}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !594, file: !559, line: 130, baseType: !934, size: 64, offset: 5120)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!347, !587, !937, !937}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !939, file: !60, line: 653, baseType: !389, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !939, file: !60, line: 653, baseType: !614, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !594, file: !559, line: 131, baseType: !934, size: 64, offset: 5184)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !594, file: !559, line: 132, baseType: !945, size: 64, offset: 5248)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!347, !587, !434, !434, !434}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !594, file: !559, line: 133, baseType: !880, size: 64, offset: 5312)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !594, file: !559, line: 135, baseType: !950, size: 64, offset: 5376)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!347, !587, !443, !685}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !594, file: !559, line: 136, baseType: !950, size: 64, offset: 5440)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !594, file: !559, line: 137, baseType: !955, size: 64, offset: 5504)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!347, !587, !685}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !594, file: !559, line: 138, baseType: !597, size: 64, offset: 5568)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !594, file: !559, line: 139, baseType: !960, size: 64, offset: 5632)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!347, !587, !963, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !594, file: !559, line: 141, baseType: !844, size: 64, offset: 5696)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !594, file: !559, line: 142, baseType: !966, size: 64, offset: 5760)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!347, !587, !587, !443, !587}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !594, file: !559, line: 143, baseType: !970, size: 64, offset: 5824)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!347, !587, !587, !587}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !594, file: !559, line: 144, baseType: !844, size: 64, offset: 5888)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !594, file: !559, line: 145, baseType: !966, size: 64, offset: 5952)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !594, file: !559, line: 147, baseType: !970, size: 64, offset: 6016)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !594, file: !559, line: 148, baseType: !844, size: 64, offset: 6080)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !594, file: !559, line: 149, baseType: !966, size: 64, offset: 6144)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !594, file: !559, line: 150, baseType: !970, size: 64, offset: 6208)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !594, file: !559, line: 151, baseType: !980, size: 64, offset: 6272)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!347, !587, !504}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !594, file: !559, line: 153, baseType: !708, size: 64, offset: 6336)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !594, file: !559, line: 154, baseType: !708, size: 64, offset: 6400)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !594, file: !559, line: 155, baseType: !708, size: 64, offset: 6464)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !594, file: !559, line: 156, baseType: !708, size: 64, offset: 6528)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !594, file: !559, line: 157, baseType: !880, size: 64, offset: 6592)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !594, file: !559, line: 159, baseType: !989, size: 64, offset: 6656)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!347, !587, !389, !602}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !594, file: !559, line: 160, baseType: !708, size: 64, offset: 6720)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !594, file: !559, line: 161, baseType: !708, size: 64, offset: 6784)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !594, file: !559, line: 162, baseType: !708, size: 64, offset: 6848)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !594, file: !559, line: 163, baseType: !708, size: 64, offset: 6912)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !594, file: !559, line: 165, baseType: !970, size: 64, offset: 6976)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !594, file: !559, line: 166, baseType: !970, size: 64, offset: 7040)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !594, file: !559, line: 167, baseType: !770, size: 64, offset: 7104)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !594, file: !559, line: 168, baseType: !1000, size: 64, offset: 7168)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!347, !587, !614, !389}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !594, file: !559, line: 169, baseType: !1004, size: 64, offset: 7232)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!347, !587, !685, !434}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !594, file: !559, line: 171, baseType: !732, size: 64, offset: 7296)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !594, file: !559, line: 172, baseType: !708, size: 64, offset: 7360)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !594, file: !559, line: 173, baseType: !1010, size: 64, offset: 7424)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!347, !587, !434, !794}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !594, file: !559, line: 174, baseType: !870, size: 64, offset: 7488)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !594, file: !559, line: 175, baseType: !870, size: 64, offset: 7552)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !594, file: !559, line: 177, baseType: !611, size: 64, offset: 7616)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !594, file: !559, line: 178, baseType: !657, size: 64, offset: 7680)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !594, file: !559, line: 179, baseType: !611, size: 64, offset: 7744)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !594, file: !559, line: 180, baseType: !618, size: 64, offset: 7808)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !594, file: !559, line: 181, baseType: !1020, size: 64, offset: 7872)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!347, !587, !326, !660, !661}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !594, file: !559, line: 183, baseType: !930, size: 64, offset: 7936)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !594, file: !559, line: 184, baseType: !692, size: 64, offset: 8000)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !594, file: !559, line: 185, baseType: !1026, size: 64, offset: 8064)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!347, !587, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !594, file: !559, line: 186, baseType: !1031, size: 64, offset: 8128)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!347, !587, !389, !600, !451}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !594, file: !559, line: 187, baseType: !751, size: 64, offset: 8192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !594, file: !559, line: 189, baseType: !1036, size: 64, offset: 8256)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!347, !587, !389, !389, !434, !602}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !594, file: !559, line: 190, baseType: !844, size: 64, offset: 8320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !594, file: !559, line: 191, baseType: !966, size: 64, offset: 8384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !594, file: !559, line: 192, baseType: !970, size: 64, offset: 8448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !594, file: !559, line: 193, baseType: !1043, size: 64, offset: 8512)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!347, !587, !802, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !559, line: 660, size: 5312, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1048, file: !559, line: 661, baseType: !562, size: 4480)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1048, file: !559, line: 661, baseType: !811, size: 32, offset: 4480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1048, file: !559, line: 662, baseType: !389, size: 32, offset: 4512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1048, file: !559, line: 662, baseType: !389, size: 32, offset: 4544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1048, file: !559, line: 662, baseType: !389, size: 32, offset: 4576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1048, file: !559, line: 663, baseType: !389, size: 32, offset: 4608)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1048, file: !559, line: 664, baseType: !389, size: 32, offset: 4640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1048, file: !559, line: 665, baseType: !434, size: 64, offset: 4672)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1048, file: !559, line: 666, baseType: !434, size: 64, offset: 4736)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1048, file: !559, line: 667, baseType: !389, size: 32, offset: 4800)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1048, file: !559, line: 668, baseType: !852, size: 32, offset: 4832)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1048, file: !559, line: 670, baseType: !434, size: 64, offset: 4864)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1048, file: !559, line: 670, baseType: !434, size: 64, offset: 4928)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1048, file: !559, line: 671, baseType: !434, size: 64, offset: 4992)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1048, file: !559, line: 672, baseType: !434, size: 64, offset: 5056)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1048, file: !559, line: 673, baseType: !434, size: 64, offset: 5120)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1048, file: !559, line: 674, baseType: !389, size: 32, offset: 5184)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1048, file: !559, line: 675, baseType: !434, size: 64, offset: 5248)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !594, file: !559, line: 195, baseType: !1069, size: 64, offset: 8576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!347, !1046, !587, !587}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !594, file: !559, line: 196, baseType: !1069, size: 64, offset: 8640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !594, file: !559, line: 197, baseType: !844, size: 64, offset: 8704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !594, file: !559, line: 198, baseType: !966, size: 64, offset: 8768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !594, file: !559, line: 199, baseType: !970, size: 64, offset: 8832)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !594, file: !559, line: 201, baseType: !1077, size: 64, offset: 8896)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!347, !587, !389, !389}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !594, file: !559, line: 202, baseType: !746, size: 64, offset: 8960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !594, file: !559, line: 203, baseType: !618, size: 64, offset: 9024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !594, file: !559, line: 204, baseType: !799, size: 64, offset: 9088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !594, file: !559, line: 205, baseType: !930, size: 64, offset: 9152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !594, file: !559, line: 206, baseType: !1085, size: 64, offset: 9216)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!347, !326, !587, !389, !660, !661}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !594, file: !559, line: 208, baseType: !1089, size: 64, offset: 9280)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!347, !389, !756}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !594, file: !559, line: 209, baseType: !970, size: 64, offset: 9344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !594, file: !559, line: 210, baseType: !762, size: 64, offset: 9408)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !589, file: !559, line: 438, baseType: !1095, size: 64, offset: 13952)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !551, line: 60, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1097, file: !114, line: 241, baseType: !326, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1097, file: !114, line: 242, baseType: !406, size: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1097, file: !114, line: 243, baseType: !389, size: 32, offset: 96)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1097, file: !114, line: 243, baseType: !389, size: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1097, file: !114, line: 244, baseType: !389, size: 32, offset: 160)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1097, file: !114, line: 244, baseType: !389, size: 32, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1097, file: !114, line: 245, baseType: !434, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1097, file: !114, line: 246, baseType: !504, size: 32, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1097, file: !114, line: 247, baseType: !389, size: 32, offset: 352)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1097, file: !114, line: 251, baseType: !389, size: 32, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1097, file: !114, line: 252, baseType: !901, size: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1097, file: !114, line: 253, baseType: !504, size: 32, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1097, file: !114, line: 254, baseType: !389, size: 32, offset: 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1097, file: !114, line: 254, baseType: !389, size: 32, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1097, file: !114, line: 255, baseType: !389, size: 32, offset: 608)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !589, file: !559, line: 438, baseType: !1095, size: 64, offset: 14016)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !589, file: !559, line: 439, baseType: !330, size: 64, offset: 14080)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !589, file: !559, line: 440, baseType: !1117, size: 32, offset: 14144)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !589, file: !559, line: 441, baseType: !504, size: 32, offset: 14176)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !589, file: !559, line: 442, baseType: !504, size: 32, offset: 14208)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !589, file: !559, line: 443, baseType: !1121, size: 448, offset: 14272)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 448, elements: !1123)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !366)
!1123 = !{!1124}
!1124 = !DISubrange(count: 7)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !589, file: !559, line: 444, baseType: !504, size: 32, offset: 14720)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !589, file: !559, line: 445, baseType: !504, size: 32, offset: 14752)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !589, file: !559, line: 446, baseType: !389, size: 32, offset: 14784)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !589, file: !559, line: 447, baseType: !427, size: 64, offset: 14848)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !589, file: !559, line: 448, baseType: !427, size: 64, offset: 14912)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !589, file: !559, line: 449, baseType: !668, size: 640, offset: 14976)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !589, file: !559, line: 450, baseType: !604, size: 32, offset: 15616)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !589, file: !559, line: 451, baseType: !1133, size: 2880, offset: 15680)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !559, line: 318, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !559, line: 319, size: 2880, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1141, !1142, !1155, !1156, !1161, !1166, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1181, !1182, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1214, !1215, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1238, !1239, !1240, !1241, !1242}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1134, file: !559, line: 320, baseType: !389, size: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1134, file: !559, line: 321, baseType: !389, size: 32, offset: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1134, file: !559, line: 322, baseType: !389, size: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1134, file: !559, line: 323, baseType: !389, size: 32, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1134, file: !559, line: 324, baseType: !389, size: 32, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1134, file: !559, line: 325, baseType: !389, size: 32, offset: 160)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1134, file: !559, line: 326, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !559, line: 293, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !559, line: 295, size: 448, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1145, file: !559, line: 296, baseType: !1143, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1145, file: !559, line: 297, baseType: !451, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1145, file: !559, line: 297, baseType: !451, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1145, file: !559, line: 298, baseType: !434, size: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1145, file: !559, line: 298, baseType: !434, size: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1145, file: !559, line: 299, baseType: !389, size: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1145, file: !559, line: 300, baseType: !389, size: 32, offset: 352)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1145, file: !559, line: 301, baseType: !389, size: 32, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1134, file: !559, line: 326, baseType: !1143, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1134, file: !559, line: 328, baseType: !1157, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!347, !587, !1160, !434}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1134, file: !559, line: 329, baseType: !1162, size: 64, offset: 384)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!347, !1160, !1165, !436, !436, !454, !434}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1134, file: !559, line: 330, baseType: !1167, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!347, !1160}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1134, file: !559, line: 331, baseType: !1167, size: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1134, file: !559, line: 334, baseType: !326, size: 64, offset: 576)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !559, line: 335, baseType: !406, size: 32, offset: 640)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1134, file: !559, line: 335, baseType: !406, size: 32, offset: 672)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1134, file: !559, line: 336, baseType: !406, size: 32, offset: 704)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1134, file: !559, line: 336, baseType: !406, size: 32, offset: 736)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1134, file: !559, line: 337, baseType: !1177, size: 64, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !327, line: 339, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !327, line: 339, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1134, file: !559, line: 338, baseType: !1177, size: 64, offset: 832)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1134, file: !559, line: 339, baseType: !1183, size: 64, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !327, line: 341, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !327, line: 351, size: 192, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1185, file: !327, line: 354, baseType: !72, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1185, file: !327, line: 355, baseType: !72, size: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1185, file: !327, line: 356, baseType: !72, size: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1185, file: !327, line: 361, baseType: !72, size: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1185, file: !327, line: 362, baseType: !500, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1134, file: !559, line: 340, baseType: !389, size: 32, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1134, file: !559, line: 340, baseType: !389, size: 32, offset: 992)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1134, file: !559, line: 341, baseType: !451, size: 64, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1134, file: !559, line: 342, baseType: !434, size: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1134, file: !559, line: 343, baseType: !454, size: 64, offset: 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1134, file: !559, line: 344, baseType: !436, size: 64, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1134, file: !559, line: 345, baseType: !389, size: 32, offset: 1280)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1134, file: !559, line: 346, baseType: !1165, size: 64, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1134, file: !559, line: 347, baseType: !504, size: 32, offset: 1408)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1134, file: !559, line: 348, baseType: !389, size: 32, offset: 1440)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1134, file: !559, line: 351, baseType: !504, size: 32, offset: 1472)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1134, file: !559, line: 352, baseType: !504, size: 32, offset: 1504)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1134, file: !559, line: 353, baseType: !406, size: 32, offset: 1536)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1134, file: !559, line: 354, baseType: !406, size: 32, offset: 1568)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1134, file: !559, line: 355, baseType: !1165, size: 64, offset: 1600)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1134, file: !559, line: 356, baseType: !1165, size: 64, offset: 1664)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1134, file: !559, line: 357, baseType: !1209, size: 64, offset: 1728)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !559, line: 310, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 308, size: 32, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1211, file: !559, line: 309, baseType: !389, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1134, file: !559, line: 357, baseType: !1209, size: 64, offset: 1792)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1134, file: !559, line: 358, baseType: !1216, size: 64, offset: 1856)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !559, line: 316, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 312, size: 128, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1218, file: !559, line: 313, baseType: !330, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1218, file: !559, line: 314, baseType: !389, size: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1218, file: !559, line: 315, baseType: !368, size: 8, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1134, file: !559, line: 359, baseType: !1216, size: 64, offset: 1920)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1134, file: !559, line: 360, baseType: !1216, size: 64, offset: 1984)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1134, file: !559, line: 361, baseType: !389, size: 32, offset: 2048)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1134, file: !559, line: 362, baseType: !406, size: 32, offset: 2080)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1134, file: !559, line: 363, baseType: !389, size: 32, offset: 2112)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1134, file: !559, line: 364, baseType: !1165, size: 64, offset: 2176)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1134, file: !559, line: 365, baseType: !1183, size: 64, offset: 2240)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1134, file: !559, line: 366, baseType: !406, size: 32, offset: 2304)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1134, file: !559, line: 367, baseType: !406, size: 32, offset: 2336)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1134, file: !559, line: 368, baseType: !1177, size: 64, offset: 2368)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1134, file: !559, line: 369, baseType: !1177, size: 64, offset: 2432)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1134, file: !559, line: 370, baseType: !1235, size: 64, offset: 2496)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1134, file: !559, line: 371, baseType: !1235, size: 64, offset: 2560)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1134, file: !559, line: 372, baseType: !1235, size: 64, offset: 2624)
