; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/swarm/swarm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/swarm/swarm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!128 = !DIEnumerator(name: "DM_POLYTOPE_HEXAHEDRON", value: 7, isUnsigned: true)
!129 = !DIEnumerator(name: "DM_POLYTOPE_TRI_PRISM", value: 8, isUnsigned: true)
!130 = !DIEnumerator(name: "DM_POLYTOPE_TRI_PRISM_TENSOR", value: 9, isUnsigned: true)
!131 = !DIEnumerator(name: "DM_POLYTOPE_QUAD_PRISM_TENSOR", value: 10, isUnsigned: true)
!132 = !DIEnumerator(name: "DM_POLYTOPE_PYRAMID", value: 11, isUnsigned: true)
!133 = !DIEnumerator(name: "DM_POLYTOPE_FV_GHOST", value: 12, isUnsigned: true)
!134 = !DIEnumerator(name: "DM_POLYTOPE_INTERIOR_GHOST", value: 13, isUnsigned: true)
!135 = !DIEnumerator(name: "DM_POLYTOPE_UNKNOWN", value: 14, isUnsigned: true)
!136 = !DIEnumerator(name: "DM_NUM_POLYTOPES", value: 15, isUnsigned: true)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !138, line: 12, baseType: !7, size: 32, elements: !139)
!138 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/dm/impls/swarm/data_bucket.h", directory: "/home/users/ndemeye/xSDK")
!139 = !{!140, !141, !142, !143}
!140 = !DIEnumerator(name: "DATABUCKET_VIEW_STDOUT", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "DATABUCKET_VIEW_ASCII", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "DATABUCKET_VIEW_BINARY", value: 2, isUnsigned: true)
!143 = !DIEnumerator(name: "DATABUCKET_VIEW_HDF5", value: 3, isUnsigned: true)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 442, baseType: !146, size: 32, elements: !147)
!145 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!146 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!148 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!149 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!150 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!151 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!152 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!153 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!154 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!155 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!156 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!157 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!158 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!159 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!160 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!161 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!162 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!163 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!164 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!165 = !DIEnumerator(name: "MAT_SPD", value: 15)
!166 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!167 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!168 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!169 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!170 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!171 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!172 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!173 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!174 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!175 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !177, line: 85, baseType: !7, size: 32, elements: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfetypes.h", directory: "/home/users/ndemeye/xSDK")
!178 = !{!179, !180, !181}
!179 = !DIEnumerator(name: "PETSCFE_JACOBIAN", value: 0, isUnsigned: true)
!180 = !DIEnumerator(name: "PETSCFE_JACOBIAN_PRE", value: 1, isUnsigned: true)
!181 = !DIEnumerator(name: "PETSCFE_JACOBIAN_DYN", value: 2, isUnsigned: true)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 424, baseType: !7, size: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!186 = !{!187, !191, !192, !227, !395, !640, !238, !1208, !1211, !277, !146, !361, !250, !1214, !1440, !1458, !1459, !1461, !817, !824, !1451, !1462}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !188, line: 330, baseType: !189)
!188 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !188, line: 330, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !195, line: 73, size: 4480, elements: !196)
!195 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!196 = !{!197, !199, !248, !249, !251, !254, !255, !256, !257, !265, !266, !268, !272, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !289, !290, !291, !293, !294, !296, !298, !299, !300, !301, !302, !305, !307, !308, !309, !310, !311, !314, !316, !317, !318, !328, !330, !331, !335, !336, !385, !390, !392, !393, !394}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !194, file: !195, line: 74, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !146)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !194, file: !195, line: 75, baseType: !200, size: 448, offset: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 448, elements: !246)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !195, line: 53, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 45, size: 448, elements: !203)
!203 = !{!204, !210, !218, !223, !230, !234, !241}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !202, file: !195, line: 46, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !192, !209}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !146)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !202, file: !195, line: 47, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!208, !192, !214}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !215, line: 16, baseType: !216)
!215 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !215, line: 16, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !202, file: !195, line: 48, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!208, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !202, file: !195, line: 49, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!208, !192, !227, !192}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !202, file: !195, line: 50, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!208, !192, !227, !222}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !202, file: !195, line: 51, baseType: !235, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!208, !192, !227, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !202, file: !195, line: 52, baseType: !242, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!208, !192, !227, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !194, file: !195, line: 76, baseType: !187, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !195, line: 77, baseType: !250, size: 32, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !146)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !194, file: !195, line: 78, baseType: !252, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !253)
!253 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !194, file: !195, line: 78, baseType: !252, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !194, file: !195, line: 78, baseType: !252, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !194, file: !195, line: 78, baseType: !252, size: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !195, line: 79, baseType: !258, size: 64, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !261, line: 27, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !263, line: 43, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!264 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !194, file: !195, line: 80, baseType: !250, size: 32, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !194, file: !195, line: 81, baseType: !267, size: 32, offset: 992)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !146)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !194, file: !195, line: 82, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !194, file: !195, line: 83, baseType: !273, size: 64, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !194, file: !195, line: 84, baseType: !277, size: 64, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !194, file: !195, line: 85, baseType: !277, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !194, file: !195, line: 86, baseType: !277, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !194, file: !195, line: 87, baseType: !277, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !195, line: 88, baseType: !192, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !194, file: !195, line: 89, baseType: !258, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !195, line: 90, baseType: !277, size: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !194, file: !195, line: 91, baseType: !277, size: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !194, file: !195, line: 92, baseType: !250, size: 32, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !194, file: !195, line: 93, baseType: !191, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !195, line: 94, baseType: !288, size: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !259)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !194, file: !195, line: 95, baseType: !250, size: 32, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !194, file: !195, line: 95, baseType: !250, size: 32, offset: 1888)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !194, file: !195, line: 96, baseType: !292, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !194, file: !195, line: 96, baseType: !292, size: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !194, file: !195, line: 97, baseType: !295, size: 64, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !194, file: !195, line: 97, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !194, file: !195, line: 98, baseType: !250, size: 32, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !194, file: !195, line: 98, baseType: !250, size: 32, offset: 2208)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !194, file: !195, line: 99, baseType: !292, size: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !194, file: !195, line: 99, baseType: !292, size: 64, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !194, file: !195, line: 100, baseType: !303, size: 64, offset: 2368)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !253)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !194, file: !195, line: 100, baseType: !306, size: 64, offset: 2432)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !194, file: !195, line: 101, baseType: !250, size: 32, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !194, file: !195, line: 101, baseType: !250, size: 32, offset: 2528)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !194, file: !195, line: 102, baseType: !292, size: 64, offset: 2560)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !194, file: !195, line: 102, baseType: !292, size: 64, offset: 2624)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !194, file: !195, line: 103, baseType: !312, size: 64, offset: 2688)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !304)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !194, file: !195, line: 103, baseType: !315, size: 64, offset: 2752)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !194, file: !195, line: 104, baseType: !245, size: 64, offset: 2816)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !194, file: !195, line: 105, baseType: !250, size: 32, offset: 2880)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !194, file: !195, line: 106, baseType: !319, size: 128, offset: 2944)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 128, elements: !326)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !195, line: 64, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 61, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !322, file: !195, line: 62, baseType: !238, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !322, file: !195, line: 63, baseType: !191, size: 64, offset: 64)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !194, file: !195, line: 107, baseType: !329, size: 64, offset: 3072)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !326)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !194, file: !195, line: 108, baseType: !191, size: 64, offset: 3136)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !194, file: !195, line: 109, baseType: !332, size: 64, offset: 3200)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!208, !191}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !194, file: !195, line: 111, baseType: !250, size: 32, offset: 3264)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !194, file: !195, line: 112, baseType: !337, size: 320, offset: 3328)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 320, elements: !383)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!208, !341, !192, !191}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !344)
!344 = !{!345, !346, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !343, file: !12, line: 100, baseType: !250, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !12, line: 101, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !358, !359, !360, !364, !366, !368, !369, !370}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !349, file: !12, line: 84, baseType: !277, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !349, file: !12, line: 85, baseType: !277, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !12, line: 86, baseType: !191, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !349, file: !12, line: 87, baseType: !269, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !349, file: !12, line: 88, baseType: !356, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !349, file: !12, line: 89, baseType: !229, size: 8, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !349, file: !12, line: 90, baseType: !277, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !349, file: !12, line: 91, baseType: !361, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !362, line: 46, baseType: !363)
!362 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!363 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !349, file: !12, line: 92, baseType: !365, size: 32, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !12, line: 93, baseType: !367, size: 32, offset: 544)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !12, line: 94, baseType: !347, size: 64, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !349, file: !12, line: 95, baseType: !277, size: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !349, file: !12, line: 96, baseType: !191, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !343, file: !12, line: 102, baseType: !277, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !343, file: !12, line: 102, baseType: !277, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !343, file: !12, line: 103, baseType: !277, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !343, file: !12, line: 104, baseType: !187, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !343, file: !12, line: 105, baseType: !365, size: 32, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !343, file: !12, line: 105, baseType: !365, size: 32, offset: 416)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !343, file: !12, line: 105, baseType: !365, size: 32, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !343, file: !12, line: 106, baseType: !192, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !343, file: !12, line: 107, baseType: !380, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!383 = !{!384}
!384 = !DISubrange(count: 5)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !194, file: !195, line: 113, baseType: !386, size: 320, offset: 3648)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 320, elements: !383)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!208, !192, !191}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !194, file: !195, line: 114, baseType: !391, size: 320, offset: 3968)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 320, elements: !383)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !194, file: !195, line: 115, baseType: !365, size: 32, offset: 4288)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !195, line: 120, baseType: !380, size: 64, offset: 4352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !194, file: !195, line: 121, baseType: !365, size: 32, offset: 4416)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Swarm", file: !397, line: 51, baseType: !398)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmswarmimpl.h", directory: "/home/users/ndemeye/xSDK")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 25, size: 33408, elements: !399)
!399 = !{!400, !425, !426, !427, !428, !432, !433, !434, !435, !436, !438, !440, !442, !1189, !1190, !1191, !1192}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !398, file: !397, line: 26, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmDataBucket", file: !397, line: 22, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSwarmDataBucket", file: !138, line: 24, size: 256, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !403, file: !138, line: 25, baseType: !250, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !403, file: !138, line: 26, baseType: !250, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !403, file: !138, line: 27, baseType: !250, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "finalised", scope: !403, file: !138, line: 28, baseType: !365, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !403, file: !138, line: 29, baseType: !250, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !403, file: !138, line: 30, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmDataField", file: !397, line: 21, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSwarmDataField", file: !138, line: 14, size: 448, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "registration_function", scope: !414, file: !138, line: 15, baseType: !277, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !414, file: !138, line: 16, baseType: !250, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !414, file: !138, line: 16, baseType: !250, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !414, file: !138, line: 17, baseType: !365, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_size", scope: !414, file: !138, line: 18, baseType: !361, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !138, line: 19, baseType: !277, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !138, line: 20, baseType: !191, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "petsc_type", scope: !414, file: !138, line: 21, baseType: !424, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !6, line: 389, baseType: !74)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !398, file: !397, line: 27, baseType: !250, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "field_registration_initialized", scope: !398, file: !397, line: 28, baseType: !365, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "field_registration_finalized", scope: !398, file: !397, line: 29, baseType: !365, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_name", scope: !398, file: !397, line: 35, baseType: !429, size: 32768, offset: 160)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 32768, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 4096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_set", scope: !398, file: !397, line: 36, baseType: !365, size: 32, offset: 32928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_bs", scope: !398, file: !397, line: 37, baseType: !250, size: 32, offset: 32960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_nlocal", scope: !398, file: !397, line: 37, baseType: !250, size: 32, offset: 32992)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "issetup", scope: !398, file: !397, line: 39, baseType: !365, size: 32, offset: 33024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "swarm_type", scope: !398, file: !397, line: 40, baseType: !437, size: 32, offset: 33056)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmType", file: !95, line: 20, baseType: !94)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_type", scope: !398, file: !397, line: 41, baseType: !439, size: 32, offset: 33088)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmMigrateType", file: !95, line: 27, baseType: !99)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "collect_type", scope: !398, file: !397, line: 42, baseType: !441, size: 32, offset: 33120)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmCollectType", file: !95, line: 34, baseType: !105)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dmcell", scope: !398, file: !397, line: 44, baseType: !443, size: 64, offset: 33152)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !43, line: 14, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !49, line: 202, size: 40000, elements: !446)
!446 = !{!447, !449, !684, !688, !689, !690, !691, !701, !702, !710, !711, !719, !720, !721, !722, !726, !727, !731, !733, !735, !736, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !764, !776, !788, !800, !809, !810, !833, !834, !835, !836, !837, !838, !840, !931, !932, !952, !953, !954, !955, !956, !957, !961, !962, !966, !967, !968, !969, !970, !971, !972, !973, !974, !977, !989, !990, !991, !1000, !1088, !1089, !1177, !1178, !1179, !1180, !1182, !1184, !1185, !1186, !1187, !1188}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !445, file: !49, line: 203, baseType: !448, size: 4480)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !195, line: 122, baseType: !194)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !445, file: !49, line: 203, baseType: !450, size: 3456, offset: 4480)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 3456, elements: !246)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !49, line: 30, size: 3456, elements: !452)
!452 = !{!453, !457, !458, !463, !467, !471, !472, !473, !481, !482, !483, !495, !496, !504, !513, !521, !525, !529, !530, !535, !536, !540, !541, !545, !546, !554, !558, !563, !564, !565, !566, !567, !568, !569, !573, !579, !583, !588, !592, !603, !607, !612, !619, !623, !624, !630, !641, !645, !655, !659, !667, !671, !679, !680}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !451, file: !49, line: 31, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!208, !443, !214}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !451, file: !49, line: 32, baseType: !454, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !451, file: !49, line: 33, baseType: !459, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!208, !443, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !451, file: !49, line: 34, baseType: !464, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!208, !341, !443}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !451, file: !49, line: 35, baseType: !468, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!208, !443}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !451, file: !49, line: 36, baseType: !468, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !451, file: !49, line: 37, baseType: !468, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !451, file: !49, line: 38, baseType: !474, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!208, !443, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !112, line: 21, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !112, line: 21, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !451, file: !49, line: 39, baseType: !474, size: 64, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !451, file: !49, line: 40, baseType: !468, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !451, file: !49, line: 41, baseType: !484, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!208, !443, !295, !487, !489}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !492, line: 11, baseType: !493)
!492 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !492, line: 11, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !451, file: !49, line: 42, baseType: !459, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !451, file: !49, line: 43, baseType: !497, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!208, !443, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !43, line: 165, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !43, line: 165, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !451, file: !49, line: 45, baseType: !505, size: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!208, !443, !508, !509}
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !27, line: 213, baseType: !26)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !492, line: 51, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !492, line: 51, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !451, file: !49, line: 46, baseType: !514, size: 64, offset: 896)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!208, !443, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !145, line: 16, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !145, line: 16, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !451, file: !49, line: 47, baseType: !522, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!208, !443, !443, !517, !477}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !451, file: !49, line: 48, baseType: !526, size: 64, offset: 1024)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!208, !443, !443, !517}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !451, file: !49, line: 49, baseType: !526, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !451, file: !49, line: 50, baseType: !531, size: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!208, !443, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !451, file: !49, line: 51, baseType: !526, size: 64, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !451, file: !49, line: 53, baseType: !537, size: 64, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!208, !443, !187, !462}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !451, file: !49, line: 54, baseType: !537, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !451, file: !49, line: 55, baseType: !542, size: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!208, !443, !250, !462}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !451, file: !49, line: 56, baseType: !542, size: 64, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !451, file: !49, line: 57, baseType: !547, size: 64, offset: 1536)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!208, !443, !550, !462}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !551, line: 12, baseType: !552)
!551 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !551, line: 12, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !451, file: !49, line: 58, baseType: !555, size: 64, offset: 1600)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!208, !443, !478, !550, !462}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !451, file: !49, line: 60, baseType: !559, size: 64, offset: 1664)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!208, !443, !478, !562, !478}
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !31)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !451, file: !49, line: 61, baseType: !559, size: 64, offset: 1728)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !451, file: !49, line: 62, baseType: !559, size: 64, offset: 1792)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !451, file: !49, line: 63, baseType: !559, size: 64, offset: 1856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !451, file: !49, line: 64, baseType: !559, size: 64, offset: 1920)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !451, file: !49, line: 65, baseType: !559, size: 64, offset: 1984)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !451, file: !49, line: 67, baseType: !468, size: 64, offset: 2048)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !451, file: !49, line: 69, baseType: !570, size: 64, offset: 2112)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!208, !443, !478, !478}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !451, file: !49, line: 71, baseType: !574, size: 64, offset: 2176)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!208, !443, !250, !577, !490, !462}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !451, file: !49, line: 72, baseType: !580, size: 64, offset: 2240)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!208, !462, !250, !489, !462}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !451, file: !49, line: 73, baseType: !584, size: 64, offset: 2304)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!208, !443, !295, !487, !489, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !451, file: !49, line: 74, baseType: !589, size: 64, offset: 2368)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!208, !443, !295, !487, !489, !489, !587}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !451, file: !49, line: 75, baseType: !593, size: 64, offset: 2432)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!208, !443, !250, !462, !596, !596, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !599, line: 59, baseType: !600)
!599 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !599, line: 15, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !599, line: 15, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !451, file: !49, line: 77, baseType: !604, size: 64, offset: 2496)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!208, !443, !250, !295, !295}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !451, file: !49, line: 78, baseType: !608, size: 64, offset: 2560)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!208, !443, !478, !611, !600}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !43, line: 74, baseType: !42)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !451, file: !49, line: 79, baseType: !613, size: 64, offset: 2624)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!208, !443, !295, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !451, file: !49, line: 80, baseType: !620, size: 64, offset: 2688)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!208, !443, !303, !303}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !451, file: !49, line: 81, baseType: !620, size: 64, offset: 2752)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !451, file: !49, line: 82, baseType: !625, size: 64, offset: 2816)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!208, !443, !478, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !451, file: !49, line: 84, baseType: !631, size: 64, offset: 2880)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!208, !443, !304, !634, !640, !562, !478}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!208, !250, !304, !638, !250, !312, !191}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !451, file: !49, line: 85, baseType: !642, size: 64, offset: 2944)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!208, !443, !304, !550, !250, !577, !250, !577, !634, !640, !562, !478}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !451, file: !49, line: 86, baseType: !646, size: 64, offset: 3008)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!208, !443, !304, !478, !649, !562, !478}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !250, !250, !250, !577, !577, !653, !653, !653, !577, !577, !653, !653, !653, !304, !638, !250, !653, !312}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !451, file: !49, line: 87, baseType: !656, size: 64, offset: 3072)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!208, !443, !304, !550, !250, !577, !250, !577, !478, !649, !562, !478}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !451, file: !49, line: 88, baseType: !660, size: 64, offset: 3136)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!208, !443, !304, !550, !250, !577, !250, !577, !478, !663, !562, !478}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !250, !250, !250, !577, !577, !653, !653, !653, !577, !577, !653, !653, !653, !304, !638, !638, !250, !653, !312}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !451, file: !49, line: 89, baseType: !668, size: 64, offset: 3200)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!208, !443, !304, !634, !640, !478, !303}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !451, file: !49, line: 90, baseType: !672, size: 64, offset: 3264)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!208, !443, !304, !675, !640, !478, !638, !303}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!208, !250, !304, !638, !638, !250, !312, !191}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !451, file: !49, line: 91, baseType: !668, size: 64, offset: 3328)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !451, file: !49, line: 93, baseType: !681, size: 64, offset: 3392)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!208, !443, !443, !534, !534}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !445, file: !49, line: 204, baseType: !685, size: 6400, offset: 7936)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 6400, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 100)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !445, file: !49, line: 204, baseType: !685, size: 6400, offset: 14336)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !445, file: !49, line: 205, baseType: !685, size: 6400, offset: 20736)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !445, file: !49, line: 205, baseType: !685, size: 6400, offset: 27136)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !445, file: !49, line: 206, baseType: !692, size: 64, offset: 33536)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !49, line: 141, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !49, line: 142, size: 256, elements: !695)
!695 = !{!696, !697, !698, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !694, file: !49, line: 143, baseType: !478, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !49, line: 144, baseType: !277, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !694, file: !49, line: 145, baseType: !699, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !49, line: 140, baseType: !48)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !49, line: 146, baseType: !692, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !445, file: !49, line: 207, baseType: !692, size: 64, offset: 33600)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !445, file: !49, line: 208, baseType: !703, size: 64, offset: 33664)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !49, line: 149, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !49, line: 150, size: 192, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !705, file: !49, line: 151, baseType: !361, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !705, file: !49, line: 152, baseType: !191, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !49, line: 153, baseType: !703, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !445, file: !49, line: 208, baseType: !703, size: 64, offset: 33728)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !445, file: !49, line: 209, baseType: !712, size: 64, offset: 33792)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !49, line: 163, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !49, line: 158, size: 192, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !714, file: !49, line: 159, baseType: !550, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !714, file: !49, line: 160, baseType: !365, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !49, line: 161, baseType: !713, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !445, file: !49, line: 210, baseType: !550, size: 64, offset: 33856)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !445, file: !49, line: 211, baseType: !550, size: 64, offset: 33920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !445, file: !49, line: 212, baseType: !191, size: 64, offset: 33984)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !445, file: !49, line: 213, baseType: !723, size: 64, offset: 34048)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!208, !640}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !445, file: !49, line: 214, baseType: !508, size: 32, offset: 34112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !445, file: !49, line: 215, baseType: !728, size: 64, offset: 34176)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !145, line: 1378, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !145, line: 1378, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !445, file: !49, line: 216, baseType: !732, size: 64, offset: 34240)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !112, line: 83, baseType: !227)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !445, file: !49, line: 217, baseType: !734, size: 64, offset: 34304)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !145, line: 25, baseType: !227)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !445, file: !49, line: 218, baseType: !250, size: 32, offset: 34368)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !445, file: !49, line: 219, baseType: !737, size: 64, offset: 34432)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !492, line: 30, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !492, line: 30, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !445, file: !49, line: 220, baseType: !365, size: 32, offset: 34496)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !445, file: !49, line: 221, baseType: !365, size: 32, offset: 34528)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !445, file: !49, line: 222, baseType: !250, size: 32, offset: 34560)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !445, file: !49, line: 222, baseType: !250, size: 32, offset: 34592)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !445, file: !49, line: 223, baseType: !365, size: 32, offset: 34624)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !445, file: !49, line: 224, baseType: !365, size: 32, offset: 34656)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !445, file: !49, line: 225, baseType: !191, size: 64, offset: 34688)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !445, file: !49, line: 227, baseType: !443, size: 64, offset: 34752)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !445, file: !49, line: 228, baseType: !443, size: 64, offset: 34816)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !445, file: !49, line: 229, baseType: !750, size: 64, offset: 34880)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !49, line: 100, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !49, line: 101, size: 256, elements: !753)
!753 = !{!754, !758, !762, !763}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !752, file: !49, line: 102, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!208, !443, !443, !191}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !752, file: !49, line: 103, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!208, !443, !518, !478, !518, !443, !191}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !752, file: !49, line: 104, baseType: !191, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !49, line: 105, baseType: !750, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !445, file: !49, line: 230, baseType: !765, size: 64, offset: 34944)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !49, line: 108, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !49, line: 109, size: 256, elements: !768)
!768 = !{!769, !770, !774, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !767, file: !49, line: 110, baseType: !755, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !767, file: !49, line: 111, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!208, !443, !518, !443, !191}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !767, file: !49, line: 112, baseType: !191, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !49, line: 113, baseType: !765, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !445, file: !49, line: 231, baseType: !777, size: 64, offset: 35008)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !49, line: 116, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !49, line: 117, size: 256, elements: !780)
!780 = !{!781, !782, !786, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !779, file: !49, line: 118, baseType: !755, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !779, file: !49, line: 119, baseType: !783, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!208, !443, !598, !598, !443, !191}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !779, file: !49, line: 120, baseType: !191, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !49, line: 121, baseType: !777, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !445, file: !49, line: 232, baseType: !789, size: 64, offset: 35072)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !49, line: 124, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !49, line: 125, size: 256, elements: !792)
!792 = !{!793, !797, !798, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !791, file: !49, line: 126, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!208, !443, !478, !562, !478, !191}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !791, file: !49, line: 127, baseType: !794, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !791, file: !49, line: 128, baseType: !191, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !791, file: !49, line: 129, baseType: !789, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !445, file: !49, line: 233, baseType: !801, size: 64, offset: 35136)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !49, line: 132, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !49, line: 133, size: 256, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !803, file: !49, line: 134, baseType: !794, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !803, file: !49, line: 135, baseType: !794, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !803, file: !49, line: 136, baseType: !191, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !49, line: 137, baseType: !801, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !445, file: !49, line: 235, baseType: !250, size: 32, offset: 35200)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !445, file: !49, line: 237, baseType: !811, size: 64, offset: 35264)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !49, line: 27, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !49, line: 27, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !49, line: 27, size: 320, elements: !815)
!815 = !{!816, !820, !821, !822, !823, !825, !832}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !814, file: !49, line: 27, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !818, line: 166, baseType: !819)
!818 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !818, line: 139, baseType: !7)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !49, line: 27, baseType: !817, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !814, file: !49, line: 27, baseType: !817, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !814, file: !49, line: 27, baseType: !817, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !814, file: !49, line: 27, baseType: !824, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !814, file: !49, line: 27, baseType: !826, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !49, line: 21, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !49, line: 17, size: 128, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !828, file: !49, line: 19, baseType: !550, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !828, file: !49, line: 20, baseType: !250, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !814, file: !49, line: 27, baseType: !477, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !445, file: !49, line: 239, baseType: !600, size: 64, offset: 35328)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !445, file: !49, line: 240, baseType: !600, size: 64, offset: 35392)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !445, file: !49, line: 241, baseType: !600, size: 64, offset: 35456)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !445, file: !49, line: 242, baseType: !600, size: 64, offset: 35520)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !445, file: !49, line: 243, baseType: !365, size: 32, offset: 35584)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !445, file: !49, line: 245, baseType: !839, size: 64, offset: 35616)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 64, elements: !326)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !445, file: !49, line: 246, baseType: !841, size: 64, offset: 35712)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !842, line: 18, baseType: !843)
!842 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !845, line: 29, size: 5760, elements: !846)
!845 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!846 = !{!847, !848, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !866, !867, !868, !869, !894, !895, !896}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !844, file: !845, line: 30, baseType: !448, size: 4480)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !844, file: !845, line: 30, baseType: !849, size: 32, offset: 4480)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !246)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !844, file: !845, line: 31, baseType: !250, size: 32, offset: 4512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !844, file: !845, line: 31, baseType: !250, size: 32, offset: 4544)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !844, file: !845, line: 32, baseType: !491, size: 64, offset: 4608)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !844, file: !845, line: 33, baseType: !365, size: 32, offset: 4672)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !844, file: !845, line: 34, baseType: !365, size: 32, offset: 4704)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !844, file: !845, line: 35, baseType: !295, size: 64, offset: 4736)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !844, file: !845, line: 36, baseType: !295, size: 64, offset: 4800)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !844, file: !845, line: 37, baseType: !250, size: 32, offset: 4864)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !844, file: !845, line: 38, baseType: !841, size: 64, offset: 4928)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !844, file: !845, line: 39, baseType: !295, size: 64, offset: 4992)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !844, file: !845, line: 40, baseType: !365, size: 32, offset: 5056)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !844, file: !845, line: 42, baseType: !250, size: 32, offset: 5088)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !844, file: !845, line: 43, baseType: !488, size: 64, offset: 5120)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !844, file: !845, line: 44, baseType: !295, size: 64, offset: 5184)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !844, file: !845, line: 45, baseType: !865, size: 64, offset: 5248)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !844, file: !845, line: 46, baseType: !365, size: 32, offset: 5312)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !844, file: !845, line: 47, baseType: !487, size: 64, offset: 5376)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !844, file: !845, line: 49, baseType: !192, size: 64, offset: 5440)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !844, file: !845, line: 50, baseType: !870, size: 64, offset: 5504)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !845, line: 27, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !845, line: 27, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !845, line: 27, size: 320, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !887}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !873, file: !845, line: 27, baseType: !817, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !873, file: !845, line: 27, baseType: !817, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !873, file: !845, line: 27, baseType: !817, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !873, file: !845, line: 27, baseType: !817, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !873, file: !845, line: 27, baseType: !824, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !873, file: !845, line: 27, baseType: !881, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !845, line: 10, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !845, line: 8, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !883, file: !845, line: 9, baseType: !250, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !883, file: !845, line: 9, baseType: !250, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !873, file: !845, line: 27, baseType: !888, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !845, line: 14, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !845, line: 12, size: 128, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !890, file: !845, line: 13, baseType: !295, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !890, file: !845, line: 13, baseType: !295, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !844, file: !845, line: 51, baseType: !841, size: 64, offset: 5568)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !844, file: !845, line: 52, baseType: !491, size: 64, offset: 5632)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !844, file: !845, line: 53, baseType: !897, size: 64, offset: 5696)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !842, line: 33, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !845, line: 72, size: 4864, elements: !900)
!900 = !{!901, !902, !920, !921, !930}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !899, file: !845, line: 73, baseType: !448, size: 4480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !899, file: !845, line: 73, baseType: !903, size: 192, offset: 4480)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 192, elements: !246)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !845, line: 56, size: 192, elements: !905)
!905 = !{!906, !912, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !904, file: !845, line: 57, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!208, !897, !841, !250, !577, !910, !911}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !904, file: !845, line: 58, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!208, !897}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !904, file: !845, line: 59, baseType: !917, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!208, !897, !214}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !845, line: 74, baseType: !191, size: 64, offset: 4672)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !899, file: !845, line: 75, baseType: !922, size: 64, offset: 4736)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !845, line: 62, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !845, line: 64, size: 256, elements: !925)
!925 = !{!926, !927, !928, !929}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !845, line: 66, baseType: !922, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !924, file: !845, line: 67, baseType: !910, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !924, file: !845, line: 68, baseType: !911, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !924, file: !845, line: 69, baseType: !250, size: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !899, file: !845, line: 76, baseType: !922, size: 64, offset: 4800)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !445, file: !49, line: 247, baseType: !841, size: 64, offset: 35776)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !445, file: !49, line: 248, baseType: !933, size: 64, offset: 35840)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !492, line: 60, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !27, line: 240, size: 640, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !935, file: !27, line: 241, baseType: !187, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !935, file: !27, line: 242, baseType: !267, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !935, file: !27, line: 243, baseType: !250, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !935, file: !27, line: 243, baseType: !250, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !935, file: !27, line: 244, baseType: !250, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !935, file: !27, line: 244, baseType: !250, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !935, file: !27, line: 245, baseType: !295, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !935, file: !27, line: 246, baseType: !365, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !935, file: !27, line: 247, baseType: !250, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !935, file: !27, line: 251, baseType: !250, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !935, file: !27, line: 252, baseType: !737, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !935, file: !27, line: 253, baseType: !365, size: 32, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !935, file: !27, line: 254, baseType: !250, size: 32, offset: 544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !935, file: !27, line: 254, baseType: !250, size: 32, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !935, file: !27, line: 255, baseType: !250, size: 32, offset: 608)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !445, file: !49, line: 250, baseType: !841, size: 64, offset: 35904)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !445, file: !49, line: 251, baseType: !518, size: 64, offset: 35968)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !445, file: !49, line: 253, baseType: !443, size: 64, offset: 36032)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !445, file: !49, line: 254, baseType: !478, size: 64, offset: 36096)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !445, file: !49, line: 255, baseType: !191, size: 64, offset: 36160)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !445, file: !49, line: 256, baseType: !958, size: 64, offset: 36224)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!208, !443, !191}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !445, file: !49, line: 257, baseType: !958, size: 64, offset: 36288)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !445, file: !49, line: 258, baseType: !963, size: 64, offset: 36352)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!208, !443, !638, !365, !911, !191}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !445, file: !49, line: 260, baseType: !250, size: 32, offset: 36416)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !445, file: !49, line: 261, baseType: !443, size: 64, offset: 36480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !445, file: !49, line: 262, baseType: !478, size: 64, offset: 36544)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !445, file: !49, line: 263, baseType: !478, size: 64, offset: 36608)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !445, file: !49, line: 264, baseType: !365, size: 32, offset: 36672)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !445, file: !49, line: 265, baseType: !501, size: 64, offset: 36736)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !445, file: !49, line: 266, baseType: !303, size: 64, offset: 36800)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !445, file: !49, line: 266, baseType: !303, size: 64, offset: 36864)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !445, file: !49, line: 267, baseType: !975, size: 64, offset: 36928)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !43, line: 42, baseType: !53)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !445, file: !49, line: 269, baseType: !978, size: 640, offset: 36992)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 640, elements: !987)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !49, line: 15, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!208, !443, !250, !250, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !145, line: 1723, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !145, line: 1723, flags: DIFlagFwdDecl)
!987 = !{!988}
!988 = !DISubrange(count: 10)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !445, file: !49, line: 270, baseType: !978, size: 640, offset: 37632)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !445, file: !49, line: 272, baseType: !250, size: 32, offset: 38272)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !445, file: !49, line: 273, baseType: !992, size: 64, offset: 38336)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !49, line: 178, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !49, line: 173, size: 256, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !994, file: !49, line: 174, baseType: !192, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !994, file: !49, line: 175, baseType: !550, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !994, file: !49, line: 176, baseType: !839, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !994, file: !49, line: 177, baseType: !365, size: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !445, file: !49, line: 274, baseType: !1001, size: 64, offset: 38400)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !49, line: 165, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !49, line: 167, size: 192, elements: !1004)
!1004 = !{!1005, !1086, !1087}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !1003, file: !49, line: 168, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !1007, line: 11, baseType: !1008)
!1007 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !1007, line: 13, size: 832, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !1007, line: 14, baseType: !227, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1009, file: !1007, line: 15, baseType: !550, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !1009, file: !1007, line: 16, baseType: !227, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !1009, file: !1007, line: 17, baseType: !250, size: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1009, file: !1007, line: 18, baseType: !295, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !1009, file: !1007, line: 19, baseType: !1017, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !1018, line: 22, baseType: !1019)
!1018 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !1007, line: 81, size: 4992, elements: !1021)
!1021 = !{!1022, !1023, !1037, !1038, !1039, !1048}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1020, file: !1007, line: 82, baseType: !448, size: 4480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1020, file: !1007, line: 82, baseType: !1024, size: 256, offset: 4480)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 256, elements: !246)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !1007, line: 74, size: 256, elements: !1026)
!1026 = !{!1027, !1031, !1032, !1036}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1025, file: !1007, line: 75, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!208, !1017}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1025, file: !1007, line: 76, baseType: !1028, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1025, file: !1007, line: 77, baseType: !1033, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!208, !1017, !214}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1025, file: !1007, line: 78, baseType: !1028, size: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1020, file: !1007, line: 83, baseType: !191, size: 64, offset: 4736)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1020, file: !1007, line: 85, baseType: !250, size: 32, offset: 4800)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !1020, file: !1007, line: 86, baseType: !1040, size: 64, offset: 4864)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !1007, line: 41, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1007, line: 36, size: 256, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !1007, line: 37, baseType: !361, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1042, file: !1007, line: 38, baseType: !361, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !1042, file: !1007, line: 39, baseType: !361, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1042, file: !1007, line: 40, baseType: !277, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !1020, file: !1007, line: 87, baseType: !1049, size: 64, offset: 4928)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !1007, line: 54, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !1007, line: 54, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !1007, line: 54, size: 320, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1069}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1053, file: !1007, line: 54, baseType: !817, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1053, file: !1007, line: 54, baseType: !817, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1053, file: !1007, line: 54, baseType: !817, size: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1053, file: !1007, line: 54, baseType: !817, size: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !1007, line: 54, baseType: !824, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1053, file: !1007, line: 54, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !1018, line: 41, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !1018, line: 35, size: 192, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1063, file: !1018, line: 37, baseType: !550, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1063, file: !1018, line: 38, baseType: !250, size: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1063, file: !1018, line: 39, baseType: !250, size: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1063, file: !1018, line: 40, baseType: !250, size: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1053, file: !1007, line: 54, baseType: !1070, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !1007, line: 34, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1007, line: 30, size: 96, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1072, file: !1007, line: 31, baseType: !250, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !1007, line: 32, baseType: !250, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1072, file: !1007, line: 33, baseType: !250, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1009, file: !1007, line: 20, baseType: !1078, size: 32, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !43, line: 60, baseType: !60)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1009, file: !1007, line: 21, baseType: !250, size: 32, offset: 416)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1009, file: !1007, line: 22, baseType: !250, size: 32, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !1009, file: !1007, line: 23, baseType: !295, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1009, file: !1007, line: 24, baseType: !238, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !1009, file: !1007, line: 25, baseType: !238, size: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1009, file: !1007, line: 26, baseType: !191, size: 64, offset: 704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !1007, line: 27, baseType: !1006, size: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1003, file: !49, line: 169, baseType: !550, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !49, line: 170, baseType: !1001, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !445, file: !49, line: 275, baseType: !250, size: 32, offset: 38464)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !445, file: !49, line: 276, baseType: !1090, size: 64, offset: 38528)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !49, line: 184, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !49, line: 180, size: 192, elements: !1093)
!1093 = !{!1094, !1175, !1176}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1092, file: !49, line: 181, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !1018, line: 13, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !1007, line: 98, size: 7232, elements: !1098)
!1098 = !{!1099, !1100, !1114, !1115, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1131, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1097, file: !1007, line: 99, baseType: !448, size: 4480)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1097, file: !1007, line: 99, baseType: !1101, size: 256, offset: 4480)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 256, elements: !246)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !1007, line: 91, size: 256, elements: !1103)
!1103 = !{!1104, !1108, !1109, !1113}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1102, file: !1007, line: 92, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!208, !1095}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1102, file: !1007, line: 93, baseType: !1105, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1102, file: !1007, line: 94, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!208, !1095, !214}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1102, file: !1007, line: 95, baseType: !1105, size: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !1007, line: 100, baseType: !191, size: 64, offset: 4736)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1097, file: !1007, line: 101, baseType: !1116, size: 64, offset: 4800)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
