; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/bvec2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/bvec2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stateId", scope: !2, file: !3, line: 312, type: !78, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "VecView_Seq_ASCII", scope: !3, file: !3, line: 268, type: !4, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !574, retainedNodes: !642)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/bvec2.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !42}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !10, line: 21, baseType: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !13, line: 142, size: 12800, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !244, !492, !513, !514, !515, !561, !562, !563, !564, !573}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !12, file: !13, line: 143, baseType: !16, size: 4480)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !17, line: 122, baseType: !18)
!17 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !17, line: 73, size: 4480, elements: !19)
!19 = !{!20, !22, !76, !77, !79, !82, !83, !84, !85, !93, !94, !96, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !118, !119, !120, !122, !123, !125, !127, !128, !129, !130, !131, !134, !136, !137, !138, !139, !140, !143, !145, !146, !147, !157, !159, !160, !164, !165, !234, !239, !241, !242, !243}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !18, file: !17, line: 74, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !18, file: !17, line: 75, baseType: !23, size: 448, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 448, elements: !74)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !17, line: 53, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 448, elements: !26)
!26 = !{!27, !38, !46, !51, !58, !62, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !25, file: !17, line: 46, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!6, !31, !33}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !35, line: 330, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !35, line: 330, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !25, file: !17, line: 47, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !31, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !43, line: 16, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !25, file: !17, line: 48, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !25, file: !17, line: 49, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !31, !55, !31}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !25, file: !17, line: 50, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !31, !55, !50}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !25, file: !17, line: 51, baseType: !63, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !31, !55, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !25, file: !17, line: 52, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !31, !55, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !17, line: 76, baseType: !34, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 77, baseType: !78, size: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !81)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !17, line: 79, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 27, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !18, file: !17, line: 80, baseType: !78, size: 32, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !18, file: !17, line: 81, baseType: !95, size: 32, offset: 992)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !18, file: !17, line: 82, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !18, file: !17, line: 83, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !18, file: !17, line: 84, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !18, file: !17, line: 85, baseType: !105, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !18, file: !17, line: 86, baseType: !105, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !18, file: !17, line: 87, baseType: !105, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !17, line: 88, baseType: !31, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !18, file: !17, line: 89, baseType: !86, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 90, baseType: !105, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !18, file: !17, line: 91, baseType: !105, size: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !18, file: !17, line: 92, baseType: !78, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !18, file: !17, line: 93, baseType: !115, size: 64, offset: 1728)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !17, line: 94, baseType: !117, size: 64, offset: 1792)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !87)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1856)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1888)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !18, file: !17, line: 97, baseType: !124, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !18, file: !17, line: 97, baseType: !126, size: 64, offset: 2112)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !18, file: !17, line: 100, baseType: !132, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !18, file: !17, line: 100, baseType: !135, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2496)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2528)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2560)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2624)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !18, file: !17, line: 103, baseType: !141, size: 64, offset: 2688)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !133)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !18, file: !17, line: 103, baseType: !144, size: 64, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !18, file: !17, line: 104, baseType: !73, size: 64, offset: 2816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !18, file: !17, line: 105, baseType: !78, size: 32, offset: 2880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !18, file: !17, line: 106, baseType: !148, size: 128, offset: 2944)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !17, line: 64, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 61, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !151, file: !17, line: 62, baseType: !66, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !151, file: !17, line: 63, baseType: !115, size: 64, offset: 64)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !18, file: !17, line: 107, baseType: !158, size: 64, offset: 3072)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !18, file: !17, line: 108, baseType: !115, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !18, file: !17, line: 109, baseType: !161, size: 64, offset: 3200)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!6, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !18, file: !17, line: 111, baseType: !78, size: 32, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !18, file: !17, line: 112, baseType: !166, size: 320, offset: 3328)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !232)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !170, !31, !115}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !172, line: 108, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !172, line: 99, size: 640, elements: !174)
!174 = !{!175, !176, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !173, file: !172, line: 100, baseType: !78, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 101, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !172, line: 82, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !172, line: 83, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !188, !189, !190, !194, !201, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !179, file: !172, line: 84, baseType: !105, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !179, file: !172, line: 85, baseType: !105, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !172, line: 86, baseType: !115, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !179, file: !172, line: 87, baseType: !97, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !172, line: 88, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !179, file: !172, line: 89, baseType: !57, size: 8, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !179, file: !172, line: 90, baseType: !105, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !179, file: !172, line: 91, baseType: !191, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !179, file: !172, line: 92, baseType: !195, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !197, size: 32, elements: !198)
!197 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !172, line: 93, baseType: !202, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !172, line: 81, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 81, baseType: !197, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!209 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!210 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!211 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!212 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!213 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!215 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!216 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !172, line: 94, baseType: !177, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !179, file: !172, line: 95, baseType: !105, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !172, line: 96, baseType: !115, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !173, file: !172, line: 103, baseType: !105, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !173, file: !172, line: 104, baseType: !34, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !173, file: !172, line: 106, baseType: !31, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !173, file: !172, line: 107, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !172, line: 10, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !172, line: 10, flags: DIFlagFwdDecl)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !18, file: !17, line: 113, baseType: !235, size: 320, offset: 3648)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!6, !31, !115}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !18, file: !17, line: 114, baseType: !240, size: 320, offset: 3968)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !232)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !18, file: !17, line: 115, baseType: !195, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !18, file: !17, line: 120, baseType: !229, size: 64, offset: 4352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !18, file: !17, line: 121, baseType: !195, size: 32, offset: 4416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !12, file: !13, line: 143, baseType: !245, size: 5248, offset: 4480)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 5248, elements: !74)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !13, line: 23, size: 5248, elements: !247)
!247 = !{!248, !253, !258, !262, !266, !272, !284, !285, !286, !290, !294, !295, !296, !300, !304, !310, !311, !315, !319, !323, !324, !342, !346, !347, !351, !355, !356, !357, !361, !362, !369, !379, !380, !381, !383, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !404, !405, !406, !410, !414, !415, !416, !417, !421, !422, !423, !424, !425, !426, !427, !431, !432, !436, !443, !444, !449, !450, !454, !455, !456, !457, !458, !459, !460, !461, !465, !466, !467, !480, !484, !485, !486}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !246, file: !13, line: 24, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!6, !9, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !246, file: !13, line: 25, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!6, !9, !78, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !246, file: !13, line: 26, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!6, !78, !252}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !246, file: !13, line: 27, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!6, !9, !9, !141}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !246, file: !13, line: 28, baseType: !267, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!6, !9, !78, !270, !141}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !246, file: !13, line: 29, baseType: !273, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!6, !9, !276, !132}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !10, line: 155, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 155, baseType: !197, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282, !283}
!279 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!280 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!281 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!282 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!283 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !246, file: !13, line: 30, baseType: !263, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !246, file: !13, line: 31, baseType: !267, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !246, file: !13, line: 32, baseType: !287, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!6, !9, !142}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !246, file: !13, line: 33, baseType: !291, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!6, !9, !9}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !13, line: 34, baseType: !287, size: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !246, file: !13, line: 35, baseType: !291, size: 64, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !246, file: !13, line: 36, baseType: !297, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!6, !9, !142, !9}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !246, file: !13, line: 37, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!6, !9, !142, !142, !9}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !246, file: !13, line: 38, baseType: !305, size: 64, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!6, !9, !78, !308, !252}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !246, file: !13, line: 39, baseType: !297, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !246, file: !13, line: 40, baseType: !312, size: 64, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!6, !9, !142, !9, !9}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !246, file: !13, line: 41, baseType: !316, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!6, !9, !142, !142, !142, !9, !9}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !246, file: !13, line: 42, baseType: !320, size: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!6, !9, !9, !9}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !246, file: !13, line: 43, baseType: !320, size: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !246, file: !13, line: 44, baseType: !325, size: 64, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!6, !9, !78, !328, !308, !330}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !7, line: 580, baseType: !331)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 580, baseType: !197, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341}
!333 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!334 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!337 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!338 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!339 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!340 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!341 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !246, file: !13, line: 45, baseType: !343, size: 64, offset: 1344)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!6, !9}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !246, file: !13, line: 46, baseType: !343, size: 64, offset: 1408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !246, file: !13, line: 47, baseType: !348, size: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!6, !9, !144}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !246, file: !13, line: 48, baseType: !352, size: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!6, !9, !124}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !246, file: !13, line: 49, baseType: !352, size: 64, offset: 1600)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !246, file: !13, line: 50, baseType: !348, size: 64, offset: 1664)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !246, file: !13, line: 51, baseType: !358, size: 64, offset: 1728)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!6, !9, !124, !132}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !246, file: !13, line: 52, baseType: !358, size: 64, offset: 1792)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !246, file: !13, line: 53, baseType: !363, size: 64, offset: 1856)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!6, !9, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !7, line: 523, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !7, line: 523, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !246, file: !13, line: 54, baseType: !370, size: 64, offset: 1920)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!6, !9, !373, !195}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !10, line: 475, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 475, baseType: !197, size: 32, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!377 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!378 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !246, file: !13, line: 55, baseType: !325, size: 64, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !246, file: !13, line: 56, baseType: !343, size: 64, offset: 2048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !246, file: !13, line: 57, baseType: !382, size: 64, offset: 2112)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !246, file: !13, line: 58, baseType: !384, size: 64, offset: 2176)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!6, !9, !308}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !246, file: !13, line: 59, baseType: !384, size: 64, offset: 2240)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !246, file: !13, line: 60, baseType: !263, size: 64, offset: 2304)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !246, file: !13, line: 61, baseType: !263, size: 64, offset: 2368)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !246, file: !13, line: 62, baseType: !273, size: 64, offset: 2432)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !246, file: !13, line: 63, baseType: !267, size: 64, offset: 2496)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !246, file: !13, line: 64, baseType: !267, size: 64, offset: 2560)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !246, file: !13, line: 65, baseType: !382, size: 64, offset: 2624)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !246, file: !13, line: 66, baseType: !343, size: 64, offset: 2688)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !246, file: !13, line: 67, baseType: !343, size: 64, offset: 2752)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !246, file: !13, line: 68, baseType: !397, size: 64, offset: 2816)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!6, !9, !400}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !401, line: 30, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !401, line: 30, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !246, file: !13, line: 69, baseType: !325, size: 64, offset: 2880)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !246, file: !13, line: 70, baseType: !343, size: 64, offset: 2944)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !246, file: !13, line: 71, baseType: !407, size: 64, offset: 3008)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!6, !170, !9}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !246, file: !13, line: 72, baseType: !411, size: 64, offset: 3072)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!6, !9, !9, !132}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !246, file: !13, line: 73, baseType: !320, size: 64, offset: 3136)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !246, file: !13, line: 74, baseType: !320, size: 64, offset: 3200)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !246, file: !13, line: 75, baseType: !320, size: 64, offset: 3264)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !246, file: !13, line: 76, baseType: !418, size: 64, offset: 3328)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!6, !9, !78, !328, !141}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !246, file: !13, line: 77, baseType: !343, size: 64, offset: 3392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !246, file: !13, line: 78, baseType: !343, size: 64, offset: 3456)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !246, file: !13, line: 79, baseType: !343, size: 64, offset: 3520)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !246, file: !13, line: 80, baseType: !343, size: 64, offset: 3584)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !246, file: !13, line: 81, baseType: !287, size: 64, offset: 3648)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !246, file: !13, line: 82, baseType: !343, size: 64, offset: 3712)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !246, file: !13, line: 83, baseType: !428, size: 64, offset: 3776)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!6, !9, !78, !9, !330}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !246, file: !13, line: 84, baseType: !428, size: 64, offset: 3840)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !246, file: !13, line: 85, baseType: !433, size: 64, offset: 3904)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!6, !9, !9, !141, !141}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !246, file: !13, line: 86, baseType: !437, size: 64, offset: 3968)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!6, !9, !440, !252}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !401, line: 11, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !401, line: 11, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !246, file: !13, line: 87, baseType: !437, size: 64, offset: 4032)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !246, file: !13, line: 88, baseType: !445, size: 64, offset: 4096)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!6, !9, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !246, file: !13, line: 89, baseType: !445, size: 64, offset: 4160)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !246, file: !13, line: 90, baseType: !451, size: 64, offset: 4224)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!6, !9, !78, !328, !328, !9, !330}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !246, file: !13, line: 91, baseType: !451, size: 64, offset: 4288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !246, file: !13, line: 92, baseType: !382, size: 64, offset: 4352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !246, file: !13, line: 93, baseType: !382, size: 64, offset: 4416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !246, file: !13, line: 94, baseType: !291, size: 64, offset: 4480)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !246, file: !13, line: 95, baseType: !291, size: 64, offset: 4544)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !246, file: !13, line: 96, baseType: !291, size: 64, offset: 4608)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !246, file: !13, line: 97, baseType: !291, size: 64, offset: 4672)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !246, file: !13, line: 98, baseType: !462, size: 64, offset: 4736)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!6, !9, !195}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !246, file: !13, line: 99, baseType: !348, size: 64, offset: 4800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !246, file: !13, line: 100, baseType: !348, size: 64, offset: 4864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !246, file: !13, line: 101, baseType: !468, size: 64, offset: 4928)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!6, !9, !144, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !7, line: 701, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 701, baseType: !197, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479}
!475 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!478 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!479 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !246, file: !13, line: 102, baseType: !481, size: 64, offset: 4992)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!6, !9, !448, !471}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !246, file: !13, line: 103, baseType: !348, size: 64, offset: 5056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !246, file: !13, line: 104, baseType: !445, size: 64, offset: 5120)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !246, file: !13, line: 105, baseType: !487, size: 64, offset: 5184)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!6, !78, !270, !252, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !12, file: !13, line: 144, baseType: !493, size: 64, offset: 9728)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !401, line: 60, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !496, line: 240, size: 640, elements: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !495, file: !496, line: 241, baseType: !34, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !496, line: 242, baseType: !95, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !495, file: !496, line: 243, baseType: !78, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !495, file: !496, line: 243, baseType: !78, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !495, file: !496, line: 244, baseType: !78, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !495, file: !496, line: 244, baseType: !78, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !495, file: !496, line: 245, baseType: !124, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !495, file: !496, line: 246, baseType: !195, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !495, file: !496, line: 247, baseType: !78, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !495, file: !496, line: 251, baseType: !78, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !495, file: !496, line: 252, baseType: !400, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !495, file: !496, line: 253, baseType: !195, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !495, file: !496, line: 254, baseType: !78, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !495, file: !496, line: 254, baseType: !78, size: 32, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !495, file: !496, line: 255, baseType: !78, size: 32, offset: 608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 145, baseType: !115, size: 64, offset: 9792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !12, file: !13, line: 146, baseType: !195, size: 32, offset: 9856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !12, file: !13, line: 147, baseType: !516, size: 1344, offset: 9920)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !13, line: 140, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 114, size: 1344, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !537, !538, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !517, file: !13, line: 115, baseType: !78, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !517, file: !13, line: 116, baseType: !78, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !517, file: !13, line: 117, baseType: !78, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !517, file: !13, line: 118, baseType: !78, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !517, file: !13, line: 119, baseType: !78, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !517, file: !13, line: 120, baseType: !78, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !517, file: !13, line: 121, baseType: !124, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !517, file: !13, line: 122, baseType: !141, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !517, file: !13, line: 124, baseType: !34, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !13, line: 125, baseType: !95, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !517, file: !13, line: 125, baseType: !95, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !517, file: !13, line: 126, baseType: !95, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !517, file: !13, line: 126, baseType: !95, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !517, file: !13, line: 127, baseType: !533, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !35, line: 339, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !35, line: 339, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !517, file: !13, line: 128, baseType: !533, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !517, file: !13, line: 129, baseType: !539, size: 64, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !35, line: 341, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !35, line: 351, size: 192, elements: !542)
!542 = !{!543, !544, !545, !546, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !541, file: !35, line: 354, baseType: !8, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !541, file: !35, line: 355, baseType: !8, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !541, file: !35, line: 356, baseType: !8, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !541, file: !35, line: 361, baseType: !8, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !541, file: !35, line: 362, baseType: !191, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !517, file: !13, line: 130, baseType: !78, size: 32, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !517, file: !13, line: 130, baseType: !78, size: 32, offset: 736)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !517, file: !13, line: 131, baseType: !141, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !517, file: !13, line: 131, baseType: !141, size: 64, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !517, file: !13, line: 132, baseType: !124, size: 64, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !517, file: !13, line: 132, baseType: !124, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !517, file: !13, line: 133, baseType: !78, size: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !517, file: !13, line: 134, baseType: !124, size: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !517, file: !13, line: 135, baseType: !78, size: 32, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !517, file: !13, line: 136, baseType: !195, size: 32, offset: 1184)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !517, file: !13, line: 137, baseType: !195, size: 32, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !517, file: !13, line: 138, baseType: !330, size: 32, offset: 1248)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !517, file: !13, line: 139, baseType: !124, size: 64, offset: 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !12, file: !13, line: 147, baseType: !516, size: 1344, offset: 11264)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !12, file: !13, line: 148, baseType: !195, size: 32, offset: 12608)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !12, file: !13, line: 149, baseType: !78, size: 32, offset: 12640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !12, file: !13, line: 150, baseType: !565, size: 32, offset: 12672)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !10, line: 472, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 472, baseType: !197, size: 32, elements: !567)
!567 = !{!568, !569, !570, !571, !572}
!568 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!569 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!570 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!571 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!572 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !12, file: !13, line: 157, baseType: !105, size: 64, offset: 12736)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !628, globals: !639, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/bvec2.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!576 = !{!196, !203, !277, !331, !374, !473, !566, !577, !583}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !578, line: 663, baseType: !197, size: 32, elements: !579)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!579 = !{!580, !581, !582}
!580 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!581 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!582 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 119, baseType: !197, size: 32, elements: !585)
!584 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!586 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!587 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!588 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!589 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!590 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!591 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!592 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!593 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!594 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!595 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!596 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!597 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!598 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!599 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!600 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!601 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!602 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!603 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!604 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!605 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!606 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!607 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!608 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!609 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!610 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!611 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!612 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!613 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!614 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!615 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!616 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!617 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!618 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!619 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!620 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!621 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!622 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!623 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!624 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!625 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!626 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!627 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!628 = !{!448, !34, !115, !55, !629, !191, !31, !81, !50, !637, !133, !141, !105, !8, !638}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_Seq", file: !631, line: 16, baseType: !632)
!631 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/impls/dvecimpl.h", directory: "/home/users/ndemeye/xSDK")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 14, size: 192, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !632, file: !631, line: 15, baseType: !141, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "array_allocated", scope: !632, file: !631, line: 15, baseType: !141, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "unplacedarray", scope: !632, file: !631, line: 15, baseType: !141, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !7, line: 140, baseType: !8)
!639 = !{!0, !640}
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "DvOps", scope: !574, file: !3, line: 743, type: !246, isLocal: true, isDefinition: true)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !651, !652, !654, !656, !660, !662, !667, !669, !676, !679, !680, !681, !682, !683, !687, !689, !691, !693, !699, !704, !706, !712, !715, !718, !722, !732, !734, !736, !739, !740, !742, !752, !754, !759, !761, !764, !765, !767, !769, !774, !781, !783, !785, !788, !789, !790, !791, !792, !796, !803, !813, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !838, !840, !845, !847, !849, !858, !860, !862}
!643 = !DILocalVariable(name: "xin", arg: 1, scope: !2, file: !3, line: 268, type: !9)
!644 = !DILocalVariable(name: "viewer", arg: 2, scope: !2, file: !3, line: 268, type: !42)
!645 = !DILocalVariable(name: "ierr", scope: !2, file: !3, line: 270, type: !6)
!646 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 271, type: !78)
!647 = !DILocalVariable(name: "n", scope: !2, file: !3, line: 271, type: !78)
!648 = !DILocalVariable(name: "name", scope: !2, file: !3, line: 272, type: !55)
!649 = !DILocalVariable(name: "format", scope: !2, file: !3, line: 273, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !584, line: 162, baseType: !583)
!651 = !DILocalVariable(name: "xv", scope: !2, file: !3, line: 274, type: !308)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !3, line: 277, type: !6)
!653 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 35)
!654 = !DILocalVariable(name: "ierr__", scope: !655, file: !3, line: 278, type: !6)
!655 = distinct !DILexicalBlock(scope: !2, file: !3, line: 278, column: 47)
!656 = !DILocalVariable(name: "ierr__", scope: !657, file: !3, line: 280, type: !6)
!657 = distinct !DILexicalBlock(scope: !658, file: !3, line: 280, column: 55)
!658 = distinct !DILexicalBlock(scope: !659, file: !3, line: 279, column: 44)
!659 = distinct !DILexicalBlock(scope: !2, file: !3, line: 279, column: 7)
!660 = !DILocalVariable(name: "ierr__", scope: !661, file: !3, line: 281, type: !6)
!661 = distinct !DILexicalBlock(scope: !658, file: !3, line: 281, column: 59)
!662 = !DILocalVariable(name: "ierr__", scope: !663, file: !3, line: 292, type: !6)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 292, column: 72)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 282, column: 25)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 282, column: 5)
!666 = distinct !DILexicalBlock(scope: !658, file: !3, line: 282, column: 5)
!667 = !DILocalVariable(name: "ierr__", scope: !668, file: !3, line: 295, type: !6)
!668 = distinct !DILexicalBlock(scope: !658, file: !3, line: 295, column: 50)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !3, line: 301, type: !6)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 301, column: 71)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 297, column: 25)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 297, column: 5)
!673 = distinct !DILexicalBlock(scope: !674, file: !3, line: 297, column: 5)
!674 = distinct !DILexicalBlock(scope: !675, file: !3, line: 296, column: 52)
!675 = distinct !DILexicalBlock(scope: !659, file: !3, line: 296, column: 14)
!676 = !DILocalVariable(name: "outputState", scope: !677, file: !3, line: 313, type: !8)
!677 = distinct !DILexicalBlock(scope: !678, file: !3, line: 304, column: 111)
!678 = distinct !DILexicalBlock(scope: !675, file: !3, line: 304, column: 14)
!679 = !DILocalVariable(name: "hasState", scope: !677, file: !3, line: 314, type: !195)
!680 = !DILocalVariable(name: "doOutput", scope: !677, file: !3, line: 315, type: !8)
!681 = !DILocalVariable(name: "bs", scope: !677, file: !3, line: 316, type: !78)
!682 = !DILocalVariable(name: "b", scope: !677, file: !3, line: 316, type: !78)
!683 = !DILocalVariable(name: "ierr__", scope: !684, file: !3, line: 319, type: !6)
!684 = distinct !DILexicalBlock(scope: !685, file: !3, line: 319, column: 56)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 318, column: 22)
!686 = distinct !DILexicalBlock(scope: !677, file: !3, line: 318, column: 9)
!687 = !DILocalVariable(name: "ierr__", scope: !688, file: !3, line: 321, type: !6)
!688 = distinct !DILexicalBlock(scope: !677, file: !3, line: 321, column: 96)
!689 = !DILocalVariable(name: "ierr__", scope: !690, file: !3, line: 323, type: !6)
!690 = distinct !DILexicalBlock(scope: !677, file: !3, line: 323, column: 57)
!691 = !DILocalVariable(name: "ierr__", scope: !692, file: !3, line: 324, type: !6)
!692 = distinct !DILexicalBlock(scope: !677, file: !3, line: 324, column: 38)
!693 = !DILocalVariable(name: "ierr__", scope: !694, file: !3, line: 338, type: !6)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 338, column: 72)
!695 = distinct !DILexicalBlock(scope: !696, file: !3, line: 337, column: 21)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 337, column: 11)
!697 = distinct !DILexicalBlock(scope: !698, file: !3, line: 326, column: 54)
!698 = distinct !DILexicalBlock(scope: !677, file: !3, line: 326, column: 9)
!699 = !DILocalVariable(name: "ierr__", scope: !700, file: !3, line: 352, type: !6)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 352, column: 68)
!701 = distinct !DILexicalBlock(scope: !702, file: !3, line: 351, column: 21)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 351, column: 11)
!703 = distinct !DILexicalBlock(scope: !698, file: !3, line: 340, column: 12)
!704 = !DILocalVariable(name: "ierr__", scope: !705, file: !3, line: 355, type: !6)
!705 = distinct !DILexicalBlock(scope: !677, file: !3, line: 355, column: 86)
!706 = !DILocalVariable(name: "ierr__", scope: !707, file: !3, line: 358, type: !6)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 358, column: 76)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 357, column: 20)
!709 = distinct !DILexicalBlock(scope: !710, file: !3, line: 357, column: 11)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 356, column: 15)
!711 = distinct !DILexicalBlock(scope: !677, file: !3, line: 356, column: 9)
!712 = !DILocalVariable(name: "ierr__", scope: !713, file: !3, line: 360, type: !6)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 360, column: 83)
!714 = distinct !DILexicalBlock(scope: !709, file: !3, line: 359, column: 14)
!715 = !DILocalVariable(name: "ierr__", scope: !716, file: !3, line: 363, type: !6)
!716 = distinct !DILexicalBlock(scope: !717, file: !3, line: 363, column: 80)
!717 = distinct !DILexicalBlock(scope: !711, file: !3, line: 362, column: 12)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !3, line: 366, type: !6)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 366, column: 71)
!720 = distinct !DILexicalBlock(scope: !721, file: !3, line: 365, column: 18)
!721 = distinct !DILexicalBlock(scope: !677, file: !3, line: 365, column: 9)
!722 = !DILocalVariable(name: "ierr__", scope: !723, file: !3, line: 371, type: !6)
!723 = distinct !DILexicalBlock(scope: !724, file: !3, line: 371, column: 53)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 370, column: 20)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 370, column: 13)
!726 = distinct !DILexicalBlock(scope: !727, file: !3, line: 369, column: 28)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 369, column: 7)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 369, column: 7)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 368, column: 28)
!730 = distinct !DILexicalBlock(scope: !731, file: !3, line: 368, column: 5)
!731 = distinct !DILexicalBlock(scope: !677, file: !3, line: 368, column: 5)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !3, line: 374, type: !6)
!733 = distinct !DILexicalBlock(scope: !726, file: !3, line: 374, column: 71)
!734 = !DILocalVariable(name: "ierr__", scope: !735, file: !3, line: 377, type: !6)
!735 = distinct !DILexicalBlock(scope: !729, file: !3, line: 377, column: 50)
!736 = !DILocalVariable(name: "bs", scope: !737, file: !3, line: 380, type: !78)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 379, column: 66)
!738 = distinct !DILexicalBlock(scope: !678, file: !3, line: 379, column: 14)
!739 = !DILocalVariable(name: "b", scope: !737, file: !3, line: 380, type: !78)
!740 = !DILocalVariable(name: "ierr__", scope: !741, file: !3, line: 382, type: !6)
!741 = distinct !DILexicalBlock(scope: !737, file: !3, line: 382, column: 38)
!742 = !DILocalVariable(name: "ierr__", scope: !743, file: !3, line: 387, type: !6)
!743 = distinct !DILexicalBlock(scope: !744, file: !3, line: 387, column: 53)
!744 = distinct !DILexicalBlock(scope: !745, file: !3, line: 386, column: 20)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 386, column: 13)
!746 = distinct !DILexicalBlock(scope: !747, file: !3, line: 385, column: 28)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 385, column: 7)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 385, column: 7)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 384, column: 28)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 384, column: 5)
!751 = distinct !DILexicalBlock(scope: !737, file: !3, line: 384, column: 5)
!752 = !DILocalVariable(name: "ierr__", scope: !753, file: !3, line: 390, type: !6)
!753 = distinct !DILexicalBlock(scope: !746, file: !3, line: 390, column: 71)
!754 = !DILocalVariable(name: "ierr__", scope: !755, file: !3, line: 394, type: !6)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 394, column: 54)
!756 = distinct !DILexicalBlock(scope: !757, file: !3, line: 393, column: 28)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 393, column: 7)
!758 = distinct !DILexicalBlock(scope: !749, file: !3, line: 393, column: 7)
!759 = !DILocalVariable(name: "ierr__", scope: !760, file: !3, line: 396, type: !6)
!760 = distinct !DILexicalBlock(scope: !749, file: !3, line: 396, column: 50)
!761 = !DILocalVariable(name: "bs", scope: !762, file: !3, line: 399, type: !78)
!762 = distinct !DILexicalBlock(scope: !763, file: !3, line: 398, column: 50)
!763 = distinct !DILexicalBlock(scope: !738, file: !3, line: 398, column: 14)
!764 = !DILocalVariable(name: "b", scope: !762, file: !3, line: 399, type: !78)
!765 = !DILocalVariable(name: "ierr__", scope: !766, file: !3, line: 401, type: !6)
!766 = distinct !DILexicalBlock(scope: !762, file: !3, line: 401, column: 38)
!767 = !DILocalVariable(name: "ierr__", scope: !768, file: !3, line: 403, type: !6)
!768 = distinct !DILexicalBlock(scope: !762, file: !3, line: 403, column: 66)
!769 = !DILocalVariable(name: "ierr__", scope: !770, file: !3, line: 405, type: !6)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 405, column: 59)
!771 = distinct !DILexicalBlock(scope: !772, file: !3, line: 404, column: 28)
!772 = distinct !DILexicalBlock(scope: !773, file: !3, line: 404, column: 5)
!773 = distinct !DILexicalBlock(scope: !762, file: !3, line: 404, column: 5)
!774 = !DILocalVariable(name: "ierr__", scope: !775, file: !3, line: 408, type: !6)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 408, column: 53)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 407, column: 20)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 407, column: 13)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 406, column: 28)
!779 = distinct !DILexicalBlock(scope: !780, file: !3, line: 406, column: 7)
!780 = distinct !DILexicalBlock(scope: !771, file: !3, line: 406, column: 7)
!781 = !DILocalVariable(name: "ierr__", scope: !782, file: !3, line: 411, type: !6)
!782 = distinct !DILexicalBlock(scope: !778, file: !3, line: 411, column: 76)
!783 = !DILocalVariable(name: "ierr__", scope: !784, file: !3, line: 414, type: !6)
!784 = distinct !DILexicalBlock(scope: !771, file: !3, line: 414, column: 50)
!785 = !DILocalVariable(name: "array", scope: !786, file: !3, line: 418, type: !308)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 416, column: 50)
!787 = distinct !DILexicalBlock(scope: !763, file: !3, line: 416, column: 14)
!788 = !DILocalVariable(name: "i", scope: !786, file: !3, line: 419, type: !78)
!789 = !DILocalVariable(name: "n", scope: !786, file: !3, line: 419, type: !78)
!790 = !DILocalVariable(name: "vdim", scope: !786, file: !3, line: 419, type: !78)
!791 = !DILocalVariable(name: "ordering", scope: !786, file: !3, line: 419, type: !78)
!792 = !DILocalVariable(name: "glvis_container", scope: !786, file: !3, line: 420, type: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscContainer", file: !7, line: 514, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscContainer", file: !7, line: 514, flags: DIFlagFwdDecl)
!796 = !DILocalVariable(name: "glvis_vec_info", scope: !786, file: !3, line: 421, type: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerGLVisVecInfo", file: !798, line: 10, baseType: !799)
!798 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/glvisviewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscViewerGLVisVecInfo", file: !798, line: 7, size: 64, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fec_type", scope: !800, file: !798, line: 8, baseType: !105, size: 64)
!803 = !DILocalVariable(name: "glvis_info", scope: !786, file: !3, line: 422, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerGLVisInfo", file: !798, line: 19, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscViewerGLVisInfo", file: !798, line: 12, size: 256, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !806, file: !798, line: 13, baseType: !195, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !806, file: !798, line: 14, baseType: !195, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !798, line: 15, baseType: !158, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !806, file: !798, line: 16, baseType: !133, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !806, file: !798, line: 17, baseType: !105, size: 64, offset: 192)
!813 = !DILocalVariable(name: "ierr", scope: !786, file: !3, line: 423, type: !6)
!814 = !DILocalVariable(name: "ierr__", scope: !815, file: !3, line: 426, type: !6)
!815 = distinct !DILexicalBlock(scope: !786, file: !3, line: 426, column: 39)
!816 = !DILocalVariable(name: "ierr__", scope: !817, file: !3, line: 427, type: !6)
!817 = distinct !DILexicalBlock(scope: !786, file: !3, line: 427, column: 66)
!818 = !DILocalVariable(name: "ierr__", scope: !819, file: !3, line: 428, type: !6)
!819 = distinct !DILexicalBlock(scope: !786, file: !3, line: 428, column: 102)
!820 = !DILocalVariable(name: "ierr__", scope: !821, file: !3, line: 430, type: !6)
!821 = distinct !DILexicalBlock(scope: !786, file: !3, line: 430, column: 78)
!822 = !DILocalVariable(name: "ierr__", scope: !823, file: !3, line: 431, type: !6)
!823 = distinct !DILexicalBlock(scope: !786, file: !3, line: 431, column: 75)
!824 = !DILocalVariable(name: "ierr__", scope: !825, file: !3, line: 432, type: !6)
!825 = distinct !DILexicalBlock(scope: !786, file: !3, line: 432, column: 61)
!826 = !DILocalVariable(name: "ierr__", scope: !827, file: !3, line: 433, type: !6)
!827 = distinct !DILexicalBlock(scope: !786, file: !3, line: 433, column: 69)
!828 = !DILocalVariable(name: "ierr__", scope: !829, file: !3, line: 434, type: !6)
!829 = distinct !DILexicalBlock(scope: !786, file: !3, line: 434, column: 48)
!830 = !DILocalVariable(name: "ierr__", scope: !831, file: !3, line: 436, type: !6)
!831 = distinct !DILexicalBlock(scope: !786, file: !3, line: 436, column: 105)
!832 = !DILocalVariable(name: "ierr__", scope: !833, file: !3, line: 438, type: !6)
!833 = distinct !DILexicalBlock(scope: !786, file: !3, line: 438, column: 74)
!834 = !DILocalVariable(name: "ierr__", scope: !835, file: !3, line: 440, type: !6)
!835 = distinct !DILexicalBlock(scope: !836, file: !3, line: 440, column: 38)
!836 = distinct !DILexicalBlock(scope: !837, file: !3, line: 439, column: 30)
!837 = distinct !DILexicalBlock(scope: !786, file: !3, line: 439, column: 9)
!838 = !DILocalVariable(name: "ierr__", scope: !839, file: !3, line: 441, type: !6)
!839 = distinct !DILexicalBlock(scope: !836, file: !3, line: 441, column: 42)
!840 = !DILocalVariable(name: "ierr__", scope: !841, file: !3, line: 443, type: !6)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 443, column: 95)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 442, column: 25)
!843 = distinct !DILexicalBlock(scope: !844, file: !3, line: 442, column: 7)
!844 = distinct !DILexicalBlock(scope: !836, file: !3, line: 442, column: 7)
!845 = !DILocalVariable(name: "ierr__", scope: !846, file: !3, line: 444, type: !6)
!846 = distinct !DILexicalBlock(scope: !842, file: !3, line: 444, column: 52)
!847 = !DILocalVariable(name: "ierr__", scope: !848, file: !3, line: 446, type: !6)
!848 = distinct !DILexicalBlock(scope: !836, file: !3, line: 446, column: 46)
!849 = !DILocalVariable(name: "ierr__", scope: !850, file: !3, line: 453, type: !6)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 453, column: 56)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 452, column: 47)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 452, column: 11)
!853 = distinct !DILexicalBlock(scope: !854, file: !3, line: 451, column: 25)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 451, column: 5)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 451, column: 5)
!856 = distinct !DILexicalBlock(scope: !857, file: !3, line: 450, column: 10)
!857 = distinct !DILexicalBlock(scope: !787, file: !3, line: 448, column: 14)
!858 = !DILocalVariable(name: "ierr__", scope: !859, file: !3, line: 464, type: !6)
!859 = distinct !DILexicalBlock(scope: !853, file: !3, line: 464, column: 66)
!860 = !DILocalVariable(name: "ierr__", scope: !861, file: !3, line: 468, type: !6)
