; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/stride/stride.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/stride/stride.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_IS = type { %struct._p_PetscObject, [1 x %struct._ISOps], %struct._n_PetscLayout*, i32, i32, i8*, i32*, i32*, i32, %struct._p_IS*, [2 x [5 x i32]], [2 x [5 x i32]] }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!64 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 119, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!85 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!127 = !{!128, !136, !154, !234, !175, !343, !245, !309, !345, !224, !49, !313, !346}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS_Stride", file: !130, line: 11, baseType: !131)
!130 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/impls/stride/stride.c", directory: "/home/users/ndemeye/xSDK")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 9, size: 64, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !131, file: !130, line: 10, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !49)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !131, file: !130, line: 10, baseType: !134, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !139, line: 73, size: 4480, elements: !140)
!139 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!140 = !{!141, !143, !196, !197, !198, !201, !202, !203, !204, !212, !213, !215, !219, !223, !225, !226, !227, !228, !229, !230, !231, !232, !233, !235, !237, !238, !239, !241, !242, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !258, !259, !262, !264, !265, !266, !276, !278, !279, !283, !284, !333, !338, !340, !341, !342}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !138, file: !139, line: 74, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !49)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !138, file: !139, line: 75, baseType: !144, size: 448, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 448, elements: !194)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !139, line: 53, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 45, size: 448, elements: !147)
!147 = !{!148, !158, !166, !171, !178, !182, !189}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !146, file: !139, line: 46, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !136, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !49)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !155, line: 330, baseType: !156)
!155 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !155, line: 330, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !146, file: !139, line: 47, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!152, !136, !162}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !163, line: 16, baseType: !164)
!163 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !163, line: 16, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !146, file: !139, line: 48, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!152, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !146, file: !139, line: 49, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!152, !136, !175, !136}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !146, file: !139, line: 50, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!152, !136, !175, !170}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !146, file: !139, line: 51, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!152, !136, !175, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !146, file: !139, line: 52, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!152, !136, !175, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !138, file: !139, line: 76, baseType: !154, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !139, line: 77, baseType: !134, size: 32, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !138, file: !139, line: 78, baseType: !199, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !200)
!200 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !138, file: !139, line: 78, baseType: !199, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !138, file: !139, line: 78, baseType: !199, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !138, file: !139, line: 78, baseType: !199, size: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !139, line: 79, baseType: !205, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !208, line: 27, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !210, line: 43, baseType: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!211 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !138, file: !139, line: 80, baseType: !134, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !138, file: !139, line: 81, baseType: !214, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !49)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !138, file: !139, line: 82, baseType: !216, size: 64, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !138, file: !139, line: 83, baseType: !220, size: 64, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !138, file: !139, line: 84, baseType: !224, size: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !138, file: !139, line: 85, baseType: !224, size: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !138, file: !139, line: 86, baseType: !224, size: 64, offset: 1280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !138, file: !139, line: 87, baseType: !224, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !138, file: !139, line: 88, baseType: !136, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !138, file: !139, line: 89, baseType: !205, size: 64, offset: 1472)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 90, baseType: !224, size: 64, offset: 1536)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !138, file: !139, line: 91, baseType: !224, size: 64, offset: 1600)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !138, file: !139, line: 92, baseType: !134, size: 32, offset: 1664)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !138, file: !139, line: 93, baseType: !234, size: 64, offset: 1728)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !138, file: !139, line: 94, baseType: !236, size: 64, offset: 1792)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !206)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !138, file: !139, line: 95, baseType: !134, size: 32, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !138, file: !139, line: 95, baseType: !134, size: 32, offset: 1888)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !138, file: !139, line: 96, baseType: !240, size: 64, offset: 1920)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !138, file: !139, line: 96, baseType: !240, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !138, file: !139, line: 97, baseType: !243, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !138, file: !139, line: 97, baseType: !245, size: 64, offset: 2112)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !138, file: !139, line: 98, baseType: !134, size: 32, offset: 2176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !138, file: !139, line: 98, baseType: !134, size: 32, offset: 2208)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !138, file: !139, line: 99, baseType: !240, size: 64, offset: 2240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !138, file: !139, line: 99, baseType: !240, size: 64, offset: 2304)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !138, file: !139, line: 100, baseType: !251, size: 64, offset: 2368)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !200)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !138, file: !139, line: 100, baseType: !254, size: 64, offset: 2432)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !138, file: !139, line: 101, baseType: !134, size: 32, offset: 2496)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !138, file: !139, line: 101, baseType: !134, size: 32, offset: 2528)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !138, file: !139, line: 102, baseType: !240, size: 64, offset: 2560)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !138, file: !139, line: 102, baseType: !240, size: 64, offset: 2624)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !138, file: !139, line: 103, baseType: !260, size: 64, offset: 2688)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !252)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !138, file: !139, line: 103, baseType: !263, size: 64, offset: 2752)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !138, file: !139, line: 104, baseType: !193, size: 64, offset: 2816)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !138, file: !139, line: 105, baseType: !134, size: 32, offset: 2880)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !138, file: !139, line: 106, baseType: !267, size: 128, offset: 2944)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !274)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !139, line: 64, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 61, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !270, file: !139, line: 62, baseType: !186, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !270, file: !139, line: 63, baseType: !234, size: 64, offset: 64)
!274 = !{!275}
!275 = !DISubrange(count: 2)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !138, file: !139, line: 107, baseType: !277, size: 64, offset: 3072)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !138, file: !139, line: 108, baseType: !234, size: 64, offset: 3136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !138, file: !139, line: 109, baseType: !280, size: 64, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!152, !234}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !138, file: !139, line: 111, baseType: !134, size: 32, offset: 3264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !138, file: !139, line: 112, baseType: !285, size: 320, offset: 3328)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !331)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!152, !289, !136, !234}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !292)
!292 = !{!293, !294, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !291, file: !12, line: 100, baseType: !134, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !12, line: 101, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !306, !307, !308, !312, !314, !316, !317, !318}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !297, file: !12, line: 84, baseType: !224, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !297, file: !12, line: 85, baseType: !224, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !12, line: 86, baseType: !234, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !297, file: !12, line: 87, baseType: !216, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !12, line: 88, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !297, file: !12, line: 89, baseType: !177, size: 8, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !297, file: !12, line: 90, baseType: !224, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !297, file: !12, line: 91, baseType: !309, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 46, baseType: !311)
!310 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!311 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !297, file: !12, line: 92, baseType: !313, size: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !12, line: 93, baseType: !315, size: 32, offset: 544)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !12, line: 94, baseType: !295, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !297, file: !12, line: 95, baseType: !224, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !297, file: !12, line: 96, baseType: !234, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !12, line: 102, baseType: !224, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !291, file: !12, line: 102, baseType: !224, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !291, file: !12, line: 103, baseType: !224, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !291, file: !12, line: 104, baseType: !154, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !291, file: !12, line: 105, baseType: !313, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !291, file: !12, line: 105, baseType: !313, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !291, file: !12, line: 105, baseType: !313, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !291, file: !12, line: 106, baseType: !136, size: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !291, file: !12, line: 107, baseType: !328, size: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!331 = !{!332}
!332 = !DISubrange(count: 5)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !138, file: !139, line: 113, baseType: !334, size: 320, offset: 3648)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !331)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!152, !136, !234}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !138, file: !139, line: 114, baseType: !339, size: 320, offset: 3968)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !331)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !138, file: !139, line: 115, baseType: !313, size: 32, offset: 4288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !138, file: !139, line: 120, baseType: !328, size: 64, offset: 4352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !138, file: !139, line: 121, baseType: !313, size: 32, offset: 4416)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !344, line: 1451, baseType: !186)
!344 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !{!0}
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !37, line: 21, size: 1536, elements: !349)
!349 = !{!350, !433, !434, !439, !443, !444, !449, !453, !454, !458, !459, !463, !464, !469, !473, !477, !481, !482, !483, !484, !485, !486, !487, !488}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !348, file: !37, line: 22, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!152, !354, !432}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !355, line: 11, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !37, line: 50, size: 7104, elements: !358)
!358 = !{!359, !361, !363, !419, !420, !421, !422, !423, !424, !425, !426, !429}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !357, file: !37, line: 51, baseType: !360, size: 4480)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !139, line: 122, baseType: !138)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !357, file: !37, line: 51, baseType: !362, size: 1536, offset: 4480)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 1536, elements: !194)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !357, file: !37, line: 52, baseType: !364, size: 64, offset: 6016)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !355, line: 60, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !32, line: 240, size: 640, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !415, !416, !417, !418}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !366, file: !32, line: 241, baseType: !154, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !32, line: 242, baseType: !214, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !366, file: !32, line: 243, baseType: !134, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !366, file: !32, line: 243, baseType: !134, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !366, file: !32, line: 244, baseType: !134, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !366, file: !32, line: 244, baseType: !134, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !366, file: !32, line: 245, baseType: !243, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !366, file: !32, line: 246, baseType: !313, size: 32, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !366, file: !32, line: 247, baseType: !134, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !366, file: !32, line: 251, baseType: !134, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !366, file: !32, line: 252, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !355, line: 30, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !37, line: 73, size: 5440, elements: !382)
!382 = !{!383, !384, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !381, file: !37, line: 74, baseType: !360, size: 4480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !381, file: !37, line: 74, baseType: !385, size: 256, offset: 4480)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 256, elements: !194)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !37, line: 66, size: 256, elements: !387)
!387 = !{!388, !392, !399, !400}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !386, file: !37, line: 67, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!152, !379}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !386, file: !37, line: 68, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!152, !379, !396, !134, !397, !243, !243}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !32, line: 149, baseType: !31)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !386, file: !37, line: 69, baseType: !393, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !386, file: !37, line: 70, baseType: !389, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !381, file: !37, line: 75, baseType: !134, size: 32, offset: 4736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !381, file: !37, line: 76, baseType: !134, size: 32, offset: 4768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !381, file: !37, line: 77, baseType: !243, size: 64, offset: 4800)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !381, file: !37, line: 78, baseType: !134, size: 32, offset: 4864)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !381, file: !37, line: 79, baseType: !134, size: 32, offset: 4896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !381, file: !37, line: 80, baseType: !313, size: 32, offset: 4928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !381, file: !37, line: 81, baseType: !313, size: 32, offset: 4960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !381, file: !37, line: 82, baseType: !134, size: 32, offset: 4992)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !381, file: !37, line: 83, baseType: !243, size: 64, offset: 5056)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !381, file: !37, line: 84, baseType: !243, size: 64, offset: 5120)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !381, file: !37, line: 85, baseType: !245, size: 64, offset: 5184)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !381, file: !37, line: 86, baseType: !243, size: 64, offset: 5248)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !381, file: !37, line: 87, baseType: !245, size: 64, offset: 5312)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !37, line: 88, baseType: !234, size: 64, offset: 5376)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !366, file: !32, line: 253, baseType: !313, size: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !366, file: !32, line: 254, baseType: !134, size: 32, offset: 544)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !366, file: !32, line: 254, baseType: !134, size: 32, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !366, file: !32, line: 255, baseType: !134, size: 32, offset: 608)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !357, file: !37, line: 53, baseType: !134, size: 32, offset: 6080)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !357, file: !37, line: 53, baseType: !134, size: 32, offset: 6112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !357, file: !37, line: 54, baseType: !234, size: 64, offset: 6144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !357, file: !37, line: 55, baseType: !243, size: 64, offset: 6208)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !357, file: !37, line: 55, baseType: !243, size: 64, offset: 6272)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !357, file: !37, line: 56, baseType: !134, size: 32, offset: 6336)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !357, file: !37, line: 57, baseType: !354, size: 64, offset: 6400)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !357, file: !37, line: 58, baseType: !427, size: 320, offset: 6464)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !428)
!428 = !{!275, !332}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !357, file: !37, line: 59, baseType: !430, size: 320, offset: 6784)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 320, elements: !428)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !37, line: 48, baseType: !36)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !348, file: !37, line: 23, baseType: !351, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !348, file: !37, line: 24, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!152, !354, !134, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !348, file: !37, line: 25, baseType: !440, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!152, !354}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !348, file: !37, line: 26, baseType: !440, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !348, file: !37, line: 27, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!152, !354, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !348, file: !37, line: 28, baseType: !450, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!152, !354, !438}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !348, file: !37, line: 29, baseType: !440, size: 64, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !348, file: !37, line: 30, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!152, !354, !162}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !348, file: !37, line: 31, baseType: !455, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !348, file: !37, line: 32, baseType: !460, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!152, !354, !354}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !348, file: !37, line: 33, baseType: !440, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !348, file: !37, line: 34, baseType: !465, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!152, !354, !154, !468, !438}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !26)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !348, file: !37, line: 35, baseType: !470, size: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!152, !354, !134}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !348, file: !37, line: 36, baseType: !474, size: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!152, !354, !134, !134, !243, !448}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !348, file: !37, line: 37, baseType: !478, size: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!152, !354, !134, !243}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !348, file: !37, line: 38, baseType: !445, size: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !348, file: !37, line: 39, baseType: !445, size: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !348, file: !37, line: 40, baseType: !445, size: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !348, file: !37, line: 41, baseType: !445, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !348, file: !37, line: 42, baseType: !445, size: 64, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !348, file: !37, line: 43, baseType: !445, size: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !348, file: !37, line: 44, baseType: !445, size: 64, offset: 1408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !348, file: !37, line: 45, baseType: !445, size: 64, offset: 1472)
!489 = !{i32 7, !"Dwarf Version", i32 4}
!490 = !{i32 2, !"Debug Info Version", i32 3}
!491 = !{i32 1, !"wchar_size", i32 4}
!492 = !{i32 7, !"PIC Level", i32 2}
!493 = !{i32 7, !"uwtable", i32 1}
!494 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!495 = distinct !DISubprogram(name: "ISDuplicate_Stride", scope: !130, file: !130, line: 23, type: !451, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DILocalVariable(name: "is", arg: 1, scope: !495, file: !130, line: 23, type: !354)
!498 = !DILocalVariable(name: "newIS", arg: 2, scope: !495, file: !130, line: 23, type: !438)
!499 = !DILocalVariable(name: "ierr", scope: !495, file: !130, line: 25, type: !152)
!500 = !DILocalVariable(name: "sub", scope: !495, file: !130, line: 26, type: !128)
!501 = !DILocalVariable(name: "ierr__", scope: !502, file: !130, line: 29, type: !152)
!502 = distinct !DILexicalBlock(scope: !495, file: !130, line: 29, column: 97)
!503 = !DILocation(line: 0, scope: !495)
!504 = !DILocation(line: 26, column: 41, scope: !495)
!505 = !{!506, !511, i64 768}
!506 = !{!"_p_IS", !507, i64 0, !509, i64 560, !511, i64 752, !508, i64 760, !508, i64 764, !511, i64 768, !511, i64 776, !511, i64 784, !508, i64 792, !511, i64 800, !509, i64 808, !509, i64 848}
!507 = !{!"_p_PetscObject", !508, i64 0, !509, i64 8, !511, i64 64, !508, i64 72, !512, i64 80, !512, i64 88, !512, i64 96, !512, i64 104, !513, i64 112, !508, i64 120, !508, i64 124, !511, i64 128, !511, i64 136, !511, i64 144, !511, i64 152, !511, i64 160, !511, i64 168, !511, i64 176, !513, i64 184, !511, i64 192, !511, i64 200, !508, i64 208, !511, i64 216, !513, i64 224, !508, i64 232, !508, i64 236, !511, i64 240, !511, i64 248, !511, i64 256, !511, i64 264, !508, i64 272, !508, i64 276, !511, i64 280, !511, i64 288, !511, i64 296, !511, i64 304, !508, i64 312, !508, i64 316, !511, i64 320, !511, i64 328, !511, i64 336, !511, i64 344, !511, i64 352, !508, i64 360, !509, i64 368, !509, i64 384, !511, i64 392, !511, i64 400, !508, i64 408, !509, i64 416, !509, i64 456, !509, i64 496, !509, i64 536, !511, i64 544, !509, i64 552}
!508 = !{!"int", !509, i64 0}
!509 = !{!"omnipotent char", !510, i64 0}
!510 = !{!"Simple C/C++ TBAA"}
!511 = !{!"any pointer", !509, i64 0}
!512 = !{!"double", !509, i64 0}
!513 = !{!"long", !509, i64 0}
!514 = !DILocation(line: 28, column: 3, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !130, line: 28, column: 3)
!516 = distinct !DILexicalBlock(scope: !517, file: !130, line: 28, column: 3)
!517 = distinct !DILexicalBlock(scope: !495, file: !130, line: 28, column: 3)
!518 = !{!511, !511, i64 0}
!519 = !DILocation(line: 28, column: 3, scope: !516)
!520 = !DILocation(line: 28, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !130, line: 28, column: 3)
!522 = distinct !DILexicalBlock(scope: !515, file: !130, line: 28, column: 3)
!523 = !{!524, !508, i64 1536}
!524 = !{!"", !509, i64 0, !509, i64 512, !509, i64 1024, !509, i64 1280, !508, i64 1536, !508, i64 1540, !509, i64 1544}
!525 = !DILocation(line: 28, column: 3, scope: !522)
!526 = !DILocation(line: 28, column: 3, scope: !527)
!527 = distinct !DILexicalBlock(scope: !521, file: !130, line: 28, column: 3)
!528 = !{!508, !508, i64 0}
!529 = !{!524, !508, i64 1540}
!530 = !DILocation(line: 29, column: 41, scope: !495)
!531 = !DILocation(line: 29, column: 25, scope: !495)
!532 = !DILocation(line: 29, column: 62, scope: !495)
!533 = !{!506, !511, i64 752}
!534 = !DILocation(line: 29, column: 67, scope: !495)
!535 = !{!536, !508, i64 12}
