; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/pcset.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/pcset.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 98, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!31 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!32 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!33 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 85, baseType: !28, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!37 = !DIEnumerator(name: "PC_LEFT", value: 0)
!38 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!39 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 285, baseType: !7, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 395, baseType: !28, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55}
!49 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!50 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!51 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!52 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!53 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!54 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!55 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 663, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!64 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!82 = !{!83, !87, !88, !123, !291, !294, !173}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !84, line: 330, baseType: !85)
!84 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !84, line: 330, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !91, line: 73, size: 4480, elements: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!92 = !{!93, !95, !144, !145, !147, !150, !151, !152, !153, !161, !162, !164, !168, !172, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !185, !186, !187, !189, !190, !192, !194, !195, !196, !197, !198, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !224, !226, !227, !231, !232, !281, !286, !288, !289, !290}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !90, file: !91, line: 74, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !90, file: !91, line: 75, baseType: !96, size: 448, offset: 64)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 448, elements: !142)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !91, line: 53, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 45, size: 448, elements: !99)
!99 = !{!100, !106, !114, !119, !126, !130, !137}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !98, file: !91, line: 46, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !88, !105}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !98, file: !91, line: 47, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!104, !88, !110}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !111, line: 16, baseType: !112)
!111 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !111, line: 16, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !98, file: !91, line: 48, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!104, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !98, file: !91, line: 49, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!104, !88, !123, !88}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !98, file: !91, line: 50, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!104, !88, !123, !118}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !98, file: !91, line: 51, baseType: !131, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!104, !88, !123, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !98, file: !91, line: 52, baseType: !138, size: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!104, !88, !123, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!142 = !{!143}
!143 = !DISubrange(count: 1)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !90, file: !91, line: 76, baseType: !83, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !91, line: 77, baseType: !146, size: 32, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !90, file: !91, line: 78, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !149)
!149 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !90, file: !91, line: 78, baseType: !148, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !90, file: !91, line: 78, baseType: !148, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !90, file: !91, line: 78, baseType: !148, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !91, line: 79, baseType: !154, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !159, line: 43, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!160 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !90, file: !91, line: 80, baseType: !146, size: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !90, file: !91, line: 81, baseType: !163, size: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !90, file: !91, line: 82, baseType: !165, size: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !90, file: !91, line: 83, baseType: !169, size: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !90, file: !91, line: 84, baseType: !173, size: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !90, file: !91, line: 85, baseType: !173, size: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !90, file: !91, line: 86, baseType: !173, size: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !90, file: !91, line: 87, baseType: !173, size: 64, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !91, line: 88, baseType: !88, size: 64, offset: 1408)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !90, file: !91, line: 89, baseType: !154, size: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !91, line: 90, baseType: !173, size: 64, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !90, file: !91, line: 91, baseType: !173, size: 64, offset: 1600)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !90, file: !91, line: 92, baseType: !146, size: 32, offset: 1664)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !90, file: !91, line: 93, baseType: !87, size: 64, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !90, file: !91, line: 94, baseType: !184, size: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !155)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !90, file: !91, line: 95, baseType: !146, size: 32, offset: 1856)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !90, file: !91, line: 95, baseType: !146, size: 32, offset: 1888)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !90, file: !91, line: 96, baseType: !188, size: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !90, file: !91, line: 96, baseType: !188, size: 64, offset: 1984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !90, file: !91, line: 97, baseType: !191, size: 64, offset: 2048)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !90, file: !91, line: 97, baseType: !193, size: 64, offset: 2112)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !90, file: !91, line: 98, baseType: !146, size: 32, offset: 2176)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !90, file: !91, line: 98, baseType: !146, size: 32, offset: 2208)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !90, file: !91, line: 99, baseType: !188, size: 64, offset: 2240)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !90, file: !91, line: 99, baseType: !188, size: 64, offset: 2304)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !90, file: !91, line: 100, baseType: !199, size: 64, offset: 2368)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !149)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !90, file: !91, line: 100, baseType: !202, size: 64, offset: 2432)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !90, file: !91, line: 101, baseType: !146, size: 32, offset: 2496)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !90, file: !91, line: 101, baseType: !146, size: 32, offset: 2528)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !90, file: !91, line: 102, baseType: !188, size: 64, offset: 2560)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !90, file: !91, line: 102, baseType: !188, size: 64, offset: 2624)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !90, file: !91, line: 103, baseType: !208, size: 64, offset: 2688)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !200)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !90, file: !91, line: 103, baseType: !211, size: 64, offset: 2752)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !90, file: !91, line: 104, baseType: !141, size: 64, offset: 2816)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !90, file: !91, line: 105, baseType: !146, size: 32, offset: 2880)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !90, file: !91, line: 106, baseType: !215, size: 128, offset: 2944)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !222)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !91, line: 64, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 61, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !218, file: !91, line: 62, baseType: !134, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !218, file: !91, line: 63, baseType: !87, size: 64, offset: 64)
!222 = !{!223}
!223 = !DISubrange(count: 2)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !90, file: !91, line: 107, baseType: !225, size: 64, offset: 3072)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !222)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !90, file: !91, line: 108, baseType: !87, size: 64, offset: 3136)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !90, file: !91, line: 109, baseType: !228, size: 64, offset: 3200)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!104, !87}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !90, file: !91, line: 111, baseType: !146, size: 32, offset: 3264)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !90, file: !91, line: 112, baseType: !233, size: 320, offset: 3328)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !279)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!104, !237, !88, !87}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !240)
!240 = !{!241, !242, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !239, file: !12, line: 100, baseType: !146, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !12, line: 101, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !254, !255, !256, !260, !262, !264, !265, !266}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !245, file: !12, line: 84, baseType: !173, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !245, file: !12, line: 85, baseType: !173, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !12, line: 86, baseType: !87, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !245, file: !12, line: 87, baseType: !165, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !245, file: !12, line: 88, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !245, file: !12, line: 89, baseType: !125, size: 8, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !245, file: !12, line: 90, baseType: !173, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !245, file: !12, line: 91, baseType: !257, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !258, line: 46, baseType: !259)
!258 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!259 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !245, file: !12, line: 92, baseType: !261, size: 32, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !12, line: 93, baseType: !263, size: 32, offset: 544)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !12, line: 94, baseType: !243, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !245, file: !12, line: 95, baseType: !173, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !245, file: !12, line: 96, baseType: !87, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !239, file: !12, line: 102, baseType: !173, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !239, file: !12, line: 102, baseType: !173, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !239, file: !12, line: 103, baseType: !173, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !239, file: !12, line: 104, baseType: !83, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !239, file: !12, line: 105, baseType: !261, size: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !239, file: !12, line: 105, baseType: !261, size: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !239, file: !12, line: 105, baseType: !261, size: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !239, file: !12, line: 106, baseType: !88, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !239, file: !12, line: 107, baseType: !276, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!279 = !{!280}
!280 = !DISubrange(count: 5)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !90, file: !91, line: 113, baseType: !282, size: 320, offset: 3648)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!104, !88, !87}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !90, file: !91, line: 114, baseType: !287, size: 320, offset: 3968)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 320, elements: !279)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !90, file: !91, line: 115, baseType: !261, size: 32, offset: 4288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !90, file: !91, line: 120, baseType: !276, size: 64, offset: 4352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !90, file: !91, line: 121, baseType: !261, size: 32, offset: 4416)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !293, line: 1451, baseType: !134)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!295 = !{!0, !296}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "PCList", scope: !2, file: !298, line: 13, type: !165, isLocal: false, isDefinition: true)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/pcset.c", directory: "/home/users/ndemeye/xSDK")
!299 = !{i32 7, !"Dwarf Version", i32 4}
!300 = !{i32 2, !"Debug Info Version", i32 3}
!301 = !{i32 1, !"wchar_size", i32 4}
!302 = !{i32 7, !"PIC Level", i32 2}
!303 = !{i32 7, !"uwtable", i32 1}
!304 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!305 = distinct !DISubprogram(name: "PCSetType", scope: !298, file: !298, line: 54, type: !306, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!306 = !DISubroutineType(types: !307)
!307 = !{!104, !308, !418}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !311, line: 37, size: 6720, elements: !312)
!311 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!312 = !{!313, !315, !382, !387, !388, !389, !390, !391, !393, !394, !395, !396, !397, !398, !399, !400, !401, !411, !412, !413, !414, !415, !417}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !310, file: !311, line: 38, baseType: !314, size: 4480)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !91, line: 122, baseType: !90)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !310, file: !311, line: 38, baseType: !316, size: 1152, offset: 4480)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 1152, elements: !142)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !311, line: 13, size: 1152, elements: !318)
!318 = !{!319, !323, !331, !338, !344, !349, !350, !354, !358, !366, !367, !372, !373, !374, !375, !376, !380, !381}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !317, file: !311, line: 14, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!104, !308}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !317, file: !311, line: 15, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!104, !308, !327, !327}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !328, line: 21, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !328, line: 21, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !317, file: !311, line: 16, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!104, !308, !335, !335}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !317, file: !311, line: 17, baseType: !339, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!104, !308, !327, !327, !327, !200, !200, !200, !146, !261, !191, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !317, file: !311, line: 18, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!104, !308, !348, !327, !327, !327}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !317, file: !311, line: 19, baseType: !324, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !317, file: !311, line: 20, baseType: !351, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!104, !308, !146, !327, !327, !327}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !317, file: !311, line: 21, baseType: !355, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!104, !237, !308}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !317, file: !311, line: 22, baseType: !359, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!104, !308, !362, !327, !327}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !363, line: 22, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !363, line: 22, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !317, file: !311, line: 23, baseType: !359, size: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !317, file: !311, line: 24, baseType: !368, size: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!104, !308, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !317, file: !311, line: 25, baseType: !324, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !317, file: !311, line: 26, baseType: !324, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !317, file: !311, line: 27, baseType: !320, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !317, file: !311, line: 28, baseType: !320, size: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !317, file: !311, line: 29, baseType: !377, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!104, !308, !110}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !317, file: !311, line: 30, baseType: !320, size: 64, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !317, file: !311, line: 31, baseType: !377, size: 64, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !310, file: !311, line: 39, baseType: !383, size: 64, offset: 5632)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !384, line: 14, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !384, line: 14, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !310, file: !311, line: 40, baseType: !146, size: 32, offset: 5696)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !310, file: !311, line: 41, baseType: !184, size: 64, offset: 5760)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !310, file: !311, line: 41, baseType: !184, size: 64, offset: 5824)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !310, file: !311, line: 42, baseType: !261, size: 32, offset: 5888)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 43, baseType: !392, size: 32, offset: 5920)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !310, file: !311, line: 45, baseType: !146, size: 32, offset: 5952)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !310, file: !311, line: 46, baseType: !261, size: 32, offset: 5984)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !310, file: !311, line: 47, baseType: !335, size: 64, offset: 6016)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !310, file: !311, line: 47, baseType: !335, size: 64, offset: 6080)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !310, file: !311, line: 48, baseType: !327, size: 64, offset: 6144)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !310, file: !311, line: 48, baseType: !327, size: 64, offset: 6208)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !310, file: !311, line: 49, baseType: !261, size: 32, offset: 6272)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !310, file: !311, line: 50, baseType: !261, size: 32, offset: 6304)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !310, file: !311, line: 51, baseType: !402, size: 64, offset: 6336)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!104, !308, !146, !405, !405, !371, !87}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !408, line: 11, baseType: !409)
!408 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !408, line: 11, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !310, file: !311, line: 52, baseType: !87, size: 64, offset: 6400)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !311, line: 53, baseType: !87, size: 64, offset: 6464)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !310, file: !311, line: 54, baseType: !146, size: 32, offset: 6528)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !310, file: !311, line: 55, baseType: !87, size: 64, offset: 6592)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !310, file: !311, line: 56, baseType: !416, size: 32, offset: 6656)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !310, file: !311, line: 57, baseType: !416, size: 32, offset: 6688)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCType", file: !27, line: 25, baseType: !123)
!419 = !{!420, !421, !422, !423, !424, !425, !427, !429, !433, !435, !437, !439}
!420 = !DILocalVariable(name: "pc", arg: 1, scope: !305, file: !298, line: 54, type: !308)
!421 = !DILocalVariable(name: "type", arg: 2, scope: !305, file: !298, line: 54, type: !418)
!422 = !DILocalVariable(name: "ierr", scope: !305, file: !298, line: 56, type: !104)
!423 = !DILocalVariable(name: "r", scope: !305, file: !298, line: 56, type: !320)
!424 = !DILocalVariable(name: "match", scope: !305, file: !298, line: 57, type: !261)
!425 = !DILocalVariable(name: "ierr__", scope: !426, file: !298, line: 63, type: !104)
!426 = distinct !DILexicalBlock(scope: !305, file: !298, line: 63, column: 62)
!427 = !DILocalVariable(name: "ierr__", scope: !428, file: !298, line: 66, type: !104)
!428 = distinct !DILexicalBlock(scope: !305, file: !298, line: 66, column: 49)
!429 = !DILocalVariable(name: "ierr__", scope: !430, file: !298, line: 70, type: !104)
!430 = distinct !DILexicalBlock(scope: !431, file: !298, line: 70, column: 48)
!431 = distinct !DILexicalBlock(scope: !432, file: !298, line: 69, column: 25)
!432 = distinct !DILexicalBlock(scope: !305, file: !298, line: 69, column: 7)
!433 = !DILocalVariable(name: "ierr__", scope: !434, file: !298, line: 74, type: !104)
!434 = distinct !DILexicalBlock(scope: !305, file: !298, line: 74, column: 62)
!435 = !DILocalVariable(name: "ierr__", scope: !436, file: !298, line: 76, type: !104)
!436 = distinct !DILexicalBlock(scope: !305, file: !298, line: 76, column: 54)
!437 = !DILocalVariable(name: "ierr__", scope: !438, file: !298, line: 83, type: !104)
!438 = distinct !DILexicalBlock(scope: !305, file: !298, line: 83, column: 58)
!439 = !DILocalVariable(name: "ierr__", scope: !440, file: !298, line: 84, type: !104)
!440 = distinct !DILexicalBlock(scope: !305, file: !298, line: 84, column: 19)
!441 = !DILocation(line: 0, scope: !305)
!442 = !DILocation(line: 56, column: 3, scope: !305)
!443 = !DILocation(line: 57, column: 3, scope: !305)
!444 = !DILocation(line: 59, column: 3, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !298, line: 59, column: 3)
!446 = distinct !DILexicalBlock(scope: !447, file: !298, line: 59, column: 3)
!447 = distinct !DILexicalBlock(scope: !305, file: !298, line: 59, column: 3)
!448 = !{!449, !449, i64 0}
!449 = !{!"any pointer", !450, i64 0}
!450 = !{!"omnipotent char", !451, i64 0}
!451 = !{!"Simple C/C++ TBAA"}
!452 = !DILocation(line: 59, column: 3, scope: !446)
!453 = !DILocation(line: 59, column: 3, scope: !454)
!454 = distinct !DILexicalBlock(scope: !455, file: !298, line: 59, column: 3)
!455 = distinct !DILexicalBlock(scope: !445, file: !298, line: 59, column: 3)
!456 = !{!457, !458, i64 1536}
!457 = !{!"", !450, i64 0, !450, i64 512, !450, i64 1024, !450, i64 1280, !458, i64 1536, !458, i64 1540, !450, i64 1544}
!458 = !{!"int", !450, i64 0}
!459 = !DILocation(line: 59, column: 3, scope: !455)
!460 = !DILocation(line: 59, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !454, file: !298, line: 59, column: 3)
!462 = !{!458, !458, i64 0}
!463 = !{!457, !458, i64 1540}
!464 = !DILocation(line: 60, column: 3, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !298, line: 60, column: 3)
!466 = distinct !DILexicalBlock(scope: !305, file: !298, line: 60, column: 3)
!467 = !DILocation(line: 60, column: 3, scope: !466)
!468 = !DILocation(line: 60, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !466, file: !298, line: 60, column: 3)
!470 = !DILocation(line: 60, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !466, file: !298, line: 60, column: 3)
!472 = !{!473, !458, i64 0}
