; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xcolor.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xcolor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._XDisplay = type opaque
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.XColor = type { i64, i16, i16, i16, i8, i8 }
%struct.anon = type { %struct._XExtData*, %struct._XPrivate*, i32, i32, i32, i32, i8*, i64, i64, i64, i32, i64 (%struct._XDisplay*)*, i32, i32, i32, i32, i32, %struct.ScreenFormat*, i32, i32, %struct._XPrivate*, %struct._XPrivate*, i32, i64, i64, i8*, i8*, i8*, i8*, i32, %struct._XrmHashBucketRec*, i32 (%struct._XDisplay*)*, i8*, i32, i32, %struct.Screen*, i64, i64, i32, i32, i8*, i8*, i32, i8* }
%struct.ScreenFormat = type { %struct._XExtData*, i32, i32, i32 }
%struct._XPrivate = type opaque
%struct._XrmHashBucketRec = type opaque
%struct.Screen = type { %struct._XExtData*, %struct._XDisplay*, i64, i32, i32, i32, i32, i32, %struct.Depth*, i32, %struct.Visual*, %struct._XGC*, i64, i64, i64, i32, i32, i32, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gColormap", scope: !2, file: !380, line: 66, type: !154, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !377, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xcolor.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 663, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !{!33, !171, !172, !176, !177, !178, !213, !154, !53, !344}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !34, line: 550, baseType: !35)
!34 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 493, size: 2368, elements: !37)
!37 = !{!38, !55, !58, !59, !60, !61, !62, !63, !67, !68, !69, !70, !76, !77, !78, !79, !80, !81, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !109, !110, !111, !112, !163, !164, !165, !166, !167, !168, !169, !170}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !36, file: !34, line: 498, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !34, line: 155, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !34, line: 148, size: 256, elements: !42)
!42 = !{!43, !45, !47, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !41, file: !34, line: 149, baseType: !44, size: 32)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !34, line: 150, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !41, file: !34, line: 151, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!44, !46}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !41, file: !34, line: 154, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !34, line: 80, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !36, file: !34, line: 499, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !34, line: 490, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !36, file: !34, line: 500, baseType: !44, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !36, file: !34, line: 501, baseType: !44, size: 32, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !36, file: !34, line: 502, baseType: !44, size: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !36, file: !34, line: 503, baseType: !44, size: 32, offset: 224)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !36, file: !34, line: 504, baseType: !53, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !36, file: !34, line: 505, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !65, line: 66, baseType: !66)
!65 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !36, file: !34, line: 506, baseType: !64, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !36, file: !34, line: 507, baseType: !64, size: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !36, file: !34, line: 508, baseType: !44, size: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !36, file: !34, line: 509, baseType: !71, size: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!64, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !34, line: 255, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !36, file: !34, line: 512, baseType: !44, size: 32, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !36, file: !34, line: 513, baseType: !44, size: 32, offset: 672)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !36, file: !34, line: 514, baseType: !44, size: 32, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !36, file: !34, line: 515, baseType: !44, size: 32, offset: 736)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !36, file: !34, line: 516, baseType: !44, size: 32, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !36, file: !34, line: 517, baseType: !82, size: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !34, line: 285, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 280, size: 192, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !84, file: !34, line: 281, baseType: !39, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !84, file: !34, line: 282, baseType: !44, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !84, file: !34, line: 283, baseType: !44, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !84, file: !34, line: 284, baseType: !44, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !36, file: !34, line: 518, baseType: !44, size: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !36, file: !34, line: 519, baseType: !44, size: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !36, file: !34, line: 520, baseType: !56, size: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !36, file: !34, line: 520, baseType: !56, size: 64, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !36, file: !34, line: 521, baseType: !44, size: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !36, file: !34, line: 522, baseType: !66, size: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !36, file: !34, line: 523, baseType: !66, size: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !36, file: !34, line: 524, baseType: !52, size: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !36, file: !34, line: 525, baseType: !52, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !36, file: !34, line: 526, baseType: !52, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !36, file: !34, line: 527, baseType: !52, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !36, file: !34, line: 528, baseType: !7, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !36, file: !34, line: 529, baseType: !103, size: 64, offset: 1600)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !34, line: 491, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !36, file: !34, line: 530, baseType: !106, size: 64, offset: 1664)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!44, !74}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !36, file: !34, line: 533, baseType: !53, size: 64, offset: 1728)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !36, file: !34, line: 534, baseType: !44, size: 32, offset: 1792)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !36, file: !34, line: 535, baseType: !44, size: 32, offset: 1824)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !36, file: !34, line: 536, baseType: !113, size: 64, offset: 1856)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !34, line: 275, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 257, size: 1024, elements: !116)
!116 = !{!117, !118, !119, !121, !122, !123, !124, !125, !126, !147, !148, !149, !153, !155, !156, !157, !158, !159, !160, !161}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !115, file: !34, line: 258, baseType: !39, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !115, file: !34, line: 259, baseType: !74, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !115, file: !34, line: 260, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !65, line: 96, baseType: !64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !115, file: !34, line: 261, baseType: !44, size: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !115, file: !34, line: 261, baseType: !44, size: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !115, file: !34, line: 262, baseType: !44, size: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !115, file: !34, line: 262, baseType: !44, size: 32, offset: 288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !115, file: !34, line: 263, baseType: !44, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !115, file: !34, line: 264, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !34, line: 247, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 243, size: 128, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !129, file: !34, line: 244, baseType: !44, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !129, file: !34, line: 245, baseType: !44, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !129, file: !34, line: 246, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !34, line: 238, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 227, size: 448, elements: !137)
!137 = !{!138, !139, !141, !142, !143, !144, !145, !146}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !136, file: !34, line: 228, baseType: !39, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !136, file: !34, line: 229, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !65, line: 76, baseType: !66)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !136, file: !34, line: 233, baseType: !44, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !136, file: !34, line: 235, baseType: !66, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !136, file: !34, line: 235, baseType: !66, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !136, file: !34, line: 235, baseType: !66, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !136, file: !34, line: 236, baseType: !44, size: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !136, file: !34, line: 237, baseType: !44, size: 32, offset: 416)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !115, file: !34, line: 265, baseType: !44, size: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !115, file: !34, line: 266, baseType: !134, size: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !115, file: !34, line: 267, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !34, line: 222, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !34, line: 214, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !115, file: !34, line: 268, baseType: !154, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !65, line: 104, baseType: !64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !115, file: !34, line: 269, baseType: !66, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !115, file: !34, line: 270, baseType: !66, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !115, file: !34, line: 271, baseType: !44, size: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !115, file: !34, line: 271, baseType: !44, size: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !115, file: !34, line: 272, baseType: !44, size: 32, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !115, file: !34, line: 273, baseType: !44, size: 32, offset: 928)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !115, file: !34, line: 274, baseType: !162, size: 64, offset: 960)
!162 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !36, file: !34, line: 537, baseType: !66, size: 64, offset: 1920)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !36, file: !34, line: 538, baseType: !66, size: 64, offset: 1984)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !36, file: !34, line: 539, baseType: !44, size: 32, offset: 2048)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !36, file: !34, line: 540, baseType: !44, size: 32, offset: 2080)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !36, file: !34, line: 541, baseType: !52, size: 64, offset: 2112)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !36, file: !34, line: 542, baseType: !52, size: 64, offset: 2176)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !36, file: !34, line: 543, baseType: !44, size: 32, offset: 2240)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !36, file: !34, line: 544, baseType: !53, size: 64, offset: 2304)
!171 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !173, line: 330, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !173, line: 330, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !181, line: 73, size: 4480, elements: !182)
!181 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!182 = !{!183, !185, !233, !234, !236, !239, !240, !241, !242, !249, !250, !252, !256, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !272, !273, !274, !276, !277, !279, !281, !282, !283, !284, !285, !288, !290, !291, !292, !293, !294, !297, !299, !300, !301, !311, !313, !314, !318, !319, !367, !372, !374, !375, !376}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !180, file: !181, line: 74, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !44)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !180, file: !181, line: 75, baseType: !186, size: 448, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 448, elements: !231)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !181, line: 53, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 45, size: 448, elements: !189)
!189 = !{!190, !196, !204, !209, !215, !219, !226}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !188, file: !181, line: 46, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !178, !195}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !44)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !188, file: !181, line: 47, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!194, !178, !200}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !201, line: 16, baseType: !202)
!201 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !201, line: 16, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !188, file: !181, line: 48, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!194, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !188, file: !181, line: 49, baseType: !210, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!194, !178, !213, !178}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !188, file: !181, line: 50, baseType: !216, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!194, !178, !213, !208}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !188, file: !181, line: 51, baseType: !220, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!194, !178, !213, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !188, file: !181, line: 52, baseType: !227, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!194, !178, !213, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!231 = !{!232}
!232 = !DISubrange(count: 1)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !180, file: !181, line: 76, baseType: !172, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !181, line: 77, baseType: !235, size: 32, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !44)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !180, file: !181, line: 78, baseType: !237, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !238)
!238 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !180, file: !181, line: 78, baseType: !237, size: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !180, file: !181, line: 78, baseType: !237, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !180, file: !181, line: 78, baseType: !237, size: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !181, line: 79, baseType: !243, size: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !246, line: 27, baseType: !247)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !248, line: 43, baseType: !162)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !180, file: !181, line: 80, baseType: !235, size: 32, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !180, file: !181, line: 81, baseType: !251, size: 32, offset: 992)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !44)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !180, file: !181, line: 82, baseType: !253, size: 64, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !180, file: !181, line: 83, baseType: !257, size: 64, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !180, file: !181, line: 84, baseType: !53, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !180, file: !181, line: 85, baseType: !53, size: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !180, file: !181, line: 86, baseType: !53, size: 64, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !180, file: !181, line: 87, baseType: !53, size: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !180, file: !181, line: 88, baseType: !178, size: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !180, file: !181, line: 89, baseType: !243, size: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !181, line: 90, baseType: !53, size: 64, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !180, file: !181, line: 91, baseType: !53, size: 64, offset: 1600)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !180, file: !181, line: 92, baseType: !235, size: 32, offset: 1664)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !180, file: !181, line: 93, baseType: !176, size: 64, offset: 1728)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !180, file: !181, line: 94, baseType: !271, size: 64, offset: 1792)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !244)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !180, file: !181, line: 95, baseType: !235, size: 32, offset: 1856)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !180, file: !181, line: 95, baseType: !235, size: 32, offset: 1888)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !180, file: !181, line: 96, baseType: !275, size: 64, offset: 1920)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !180, file: !181, line: 96, baseType: !275, size: 64, offset: 1984)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !180, file: !181, line: 97, baseType: !278, size: 64, offset: 2048)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !180, file: !181, line: 97, baseType: !280, size: 64, offset: 2112)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !180, file: !181, line: 98, baseType: !235, size: 32, offset: 2176)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !180, file: !181, line: 98, baseType: !235, size: 32, offset: 2208)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !180, file: !181, line: 99, baseType: !275, size: 64, offset: 2240)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !180, file: !181, line: 99, baseType: !275, size: 64, offset: 2304)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !180, file: !181, line: 100, baseType: !286, size: 64, offset: 2368)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !238)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !180, file: !181, line: 100, baseType: !289, size: 64, offset: 2432)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !180, file: !181, line: 101, baseType: !235, size: 32, offset: 2496)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !180, file: !181, line: 101, baseType: !235, size: 32, offset: 2528)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !180, file: !181, line: 102, baseType: !275, size: 64, offset: 2560)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !180, file: !181, line: 102, baseType: !275, size: 64, offset: 2624)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !180, file: !181, line: 103, baseType: !295, size: 64, offset: 2688)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !287)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !180, file: !181, line: 103, baseType: !298, size: 64, offset: 2752)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !180, file: !181, line: 104, baseType: !230, size: 64, offset: 2816)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !180, file: !181, line: 105, baseType: !235, size: 32, offset: 2880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !180, file: !181, line: 106, baseType: !302, size: 128, offset: 2944)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, elements: !309)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !181, line: 64, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 61, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !305, file: !181, line: 62, baseType: !223, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !305, file: !181, line: 63, baseType: !176, size: 64, offset: 64)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !180, file: !181, line: 107, baseType: !312, size: 64, offset: 3072)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 64, elements: !309)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !180, file: !181, line: 108, baseType: !176, size: 64, offset: 3136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !180, file: !181, line: 109, baseType: !315, size: 64, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!194, !176}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !180, file: !181, line: 111, baseType: !235, size: 32, offset: 3264)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !180, file: !181, line: 112, baseType: !320, size: 320, offset: 3328)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !365)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!194, !324, !178, !176}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !327)
!327 = !{!328, !329, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !326, file: !18, line: 100, baseType: !235, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !18, line: 101, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !341, !342, !343, !346, !348, !350, !351, !352}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !332, file: !18, line: 84, baseType: !53, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !332, file: !18, line: 85, baseType: !53, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !18, line: 86, baseType: !176, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !332, file: !18, line: 87, baseType: !253, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !332, file: !18, line: 88, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !332, file: !18, line: 89, baseType: !54, size: 8, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !332, file: !18, line: 90, baseType: !53, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !332, file: !18, line: 91, baseType: !344, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 46, baseType: !66)
!345 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !18, line: 92, baseType: !347, size: 32, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !18, line: 93, baseType: !349, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !18, line: 94, baseType: !330, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !332, file: !18, line: 95, baseType: !53, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !332, file: !18, line: 96, baseType: !176, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !326, file: !18, line: 102, baseType: !53, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !326, file: !18, line: 102, baseType: !53, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !326, file: !18, line: 103, baseType: !53, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !326, file: !18, line: 104, baseType: !172, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !326, file: !18, line: 105, baseType: !347, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !326, file: !18, line: 105, baseType: !347, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !326, file: !18, line: 105, baseType: !347, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !326, file: !18, line: 106, baseType: !178, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !326, file: !18, line: 107, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!365 = !{!366}
!366 = !DISubrange(count: 5)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !180, file: !181, line: 113, baseType: !368, size: 320, offset: 3648)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 320, elements: !365)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!194, !178, !176}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !180, file: !181, line: 114, baseType: !373, size: 320, offset: 3968)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !365)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !180, file: !181, line: 115, baseType: !347, size: 32, offset: 4288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !181, line: 120, baseType: !362, size: 64, offset: 4352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !180, file: !181, line: 121, baseType: !347, size: 32, offset: 4416)
!377 = !{!378, !386, !391, !0, !394, !399}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "gCmapping", scope: !2, file: !380, line: 67, type: !381, isLocal: true, isDefinition: true)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xcolor.c", directory: "/home/users/ndemeye/xSDK")
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 16384, elements: !384)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiPixVal", file: !383, line: 13, baseType: !66)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/x/ximpl.h", directory: "/home/users/ndemeye/xSDK")
!384 = !{!385}
!385 = !DISubrange(count: 256)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "gCpalette", scope: !2, file: !380, line: 68, type: !388, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 6144, elements: !389)
!389 = !{!385, !390}
!390 = !DISubrange(count: 3)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "cmap_pixvalues_used", scope: !2, file: !380, line: 118, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8192, elements: !384)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "colornames", scope: !2, file: !380, line: 12, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 2112, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 33)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "cmap_base", scope: !2, file: !380, line: 119, type: !44, isLocal: true, isDefinition: true)
!401 = !{i32 7, !"Dwarf Version", i32 4}
!402 = !{i32 2, !"Debug Info Version", i32 3}
!403 = !{i32 1, !"wchar_size", i32 4}
!404 = !{i32 7, !"PIC Level", i32 2}
!405 = !{i32 7, !"uwtable", i32 1}
!406 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!407 = distinct !DISubprogram(name: "PetscDrawSetUpColormap_Shared", scope: !380, file: !380, line: 70, type: !408, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !412)
!408 = !DISubroutineType(types: !409)
!409 = !{!194, !410, !44, !134, !154}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !34, line: 487, baseType: !75)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !424, !425, !426, !436, !437, !438, !439, !441, !443}
!413 = !DILocalVariable(name: "display", arg: 1, scope: !407, file: !380, line: 70, type: !410)
!414 = !DILocalVariable(name: "screen", arg: 2, scope: !407, file: !380, line: 70, type: !44)
!415 = !DILocalVariable(name: "visual", arg: 3, scope: !407, file: !380, line: 70, type: !134)
!416 = !DILocalVariable(name: "colormap", arg: 4, scope: !407, file: !380, line: 70, type: !154)
!417 = !DILocalVariable(name: "i", scope: !407, file: !380, line: 72, type: !44)
!418 = !DILocalVariable(name: "k", scope: !407, file: !380, line: 72, type: !44)
!419 = !DILocalVariable(name: "ncolors", scope: !407, file: !380, line: 72, type: !44)
!420 = !DILocalVariable(name: "R", scope: !407, file: !380, line: 73, type: !421)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 1784, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 223)
!424 = !DILocalVariable(name: "G", scope: !407, file: !380, line: 74, type: !421)
!425 = !DILocalVariable(name: "B", scope: !407, file: !380, line: 75, type: !421)
!426 = !DILocalVariable(name: "colordef", scope: !407, file: !380, line: 76, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColor", file: !34, line: 415, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 410, size: 128, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !428, file: !34, line: 411, baseType: !66, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !428, file: !34, line: 412, baseType: !177, size: 16, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !428, file: !34, line: 412, baseType: !177, size: 16, offset: 80)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !428, file: !34, line: 412, baseType: !177, size: 16, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !428, file: !34, line: 413, baseType: !54, size: 8, offset: 112)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !34, line: 414, baseType: !54, size: 8, offset: 120)
!436 = !DILocalVariable(name: "ecolordef", scope: !407, file: !380, line: 76, type: !427)
!437 = !DILocalVariable(name: "fast", scope: !407, file: !380, line: 77, type: !347)
!438 = !DILocalVariable(name: "ierr", scope: !407, file: !380, line: 78, type: !194)
!439 = !DILocalVariable(name: "ierr__", scope: !440, file: !380, line: 94, type: !194)
!440 = distinct !DILexicalBlock(scope: !407, file: !380, line: 94, column: 65)
!441 = !DILocalVariable(name: "ierr__", scope: !442, file: !380, line: 95, type: !194)
!442 = distinct !DILexicalBlock(scope: !407, file: !380, line: 95, column: 54)
!443 = !DILocalVariable(name: "ierr__", scope: !444, file: !380, line: 109, type: !194)
!444 = distinct !DILexicalBlock(scope: !407, file: !380, line: 109, column: 60)
!445 = !DILocation(line: 0, scope: !407)
!446 = !DILocation(line: 73, column: 3, scope: !407)
!447 = !DILocation(line: 73, column: 18, scope: !407)
!448 = !DILocation(line: 74, column: 3, scope: !407)
!449 = !DILocation(line: 74, column: 18, scope: !407)
!450 = !DILocation(line: 75, column: 3, scope: !407)
!451 = !DILocation(line: 75, column: 18, scope: !407)
!452 = !DILocation(line: 76, column: 3, scope: !407)
!453 = !DILocation(line: 76, column: 18, scope: !407)
!454 = !DILocation(line: 76, column: 27, scope: !407)
!455 = !DILocation(line: 77, column: 3, scope: !407)
!456 = !DILocation(line: 77, column: 18, scope: !407)
!457 = !{!458, !458, i64 0}
!458 = !{!"omnipotent char", !459, i64 0}
!459 = !{!"Simple C/C++ TBAA"}
!460 = !DILocation(line: 80, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !380, line: 80, column: 3)
!462 = distinct !DILexicalBlock(scope: !463, file: !380, line: 80, column: 3)
!463 = distinct !DILexicalBlock(scope: !407, file: !380, line: 80, column: 3)
!464 = !{!465, !465, i64 0}
!465 = !{!"any pointer", !458, i64 0}
!466 = !DILocation(line: 80, column: 3, scope: !462)
!467 = !DILocation(line: 80, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !380, line: 80, column: 3)
!469 = distinct !DILexicalBlock(scope: !461, file: !380, line: 80, column: 3)
!470 = !{!471, !472, i64 1536}
!471 = !{!"", !458, i64 0, !458, i64 512, !458, i64 1024, !458, i64 1280, !472, i64 1536, !472, i64 1540, !458, i64 1544}
!472 = !{!"int", !458, i64 0}
!473 = !DILocation(line: 80, column: 3, scope: !469)
!474 = !DILocation(line: 80, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !468, file: !380, line: 80, column: 3)
!476 = !{!472, !472, i64 0}
!477 = !{!471, !472, i64 1540}
!478 = !DILocation(line: 81, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !407, file: !380, line: 81, column: 7)
!480 = !DILocation(line: 81, column: 7, scope: !407)
!481 = !DILocation(line: 82, column: 29, scope: !479)
!482 = !{!483, !465, i64 232}
!483 = !{!"", !465, i64 0, !465, i64 8, !472, i64 16, !472, i64 20, !472, i64 24, !472, i64 28, !465, i64 32, !484, i64 40, !484, i64 48, !484, i64 56, !472, i64 64, !465, i64 72, !472, i64 80, !472, i64 84, !472, i64 88, !472, i64 92, !472, i64 96, !465, i64 104, !472, i64 112, !472, i64 116, !465, i64 120, !465, i64 128, !472, i64 136, !484, i64 144, !484, i64 152, !465, i64 160, !465, i64 168, !465, i64 176, !465, i64 184, !472, i64 192, !465, i64 200, !465, i64 208, !465, i64 216, !472, i64 224, !472, i64 228, !465, i64 232, !484, i64 240, !484, i64 248, !472, i64 256, !472, i64 260, !465, i64 264, !465, i64 272, !472, i64 280, !465, i64 288}
!484 = !{!"long", !458, i64 0}
!485 = !{!486, !484, i64 80}
!486 = !{!"", !465, i64 0, !465, i64 8, !484, i64 16, !472, i64 24, !472, i64 28, !472, i64 32, !472, i64 36, !472, i64 40, !465, i64 48, !472, i64 56, !465, i64 64, !465, i64 72, !484, i64 80, !484, i64 88, !484, i64 96, !472, i64 104, !472, i64 108, !472, i64 112, !472, i64 116, !484, i64 120}
!487 = !DILocation(line: 0, scope: !479)
!488 = !{!484, !484, i64 0}
!489 = !DILocation(line: 85, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !407, file: !380, line: 85, column: 3)
!491 = !DILocation(line: 86, column: 30, scope: !492)
!492 = distinct !DILexicalBlock(scope: !493, file: !380, line: 85, column: 45)
!493 = distinct !DILexicalBlock(scope: !490, file: !380, line: 85, column: 3)
!494 = !DILocation(line: 86, column: 40, scope: !492)
!495 = !DILocation(line: 86, column: 5, scope: !492)
!496 = !DILocation(line: 87, column: 32, scope: !492)
!497 = !{!498, !484, i64 0}
!498 = !{!"", !484, i64 0, !499, i64 8, !499, i64 10, !499, i64 12, !458, i64 14, !458, i64 15}
!499 = !{!"short", !458, i64 0}
!500 = !DILocation(line: 87, column: 5, scope: !492)
!501 = !DILocation(line: 87, column: 21, scope: !492)
!502 = !DILocation(line: 88, column: 48, scope: !492)
!503 = !{!498, !499, i64 8}
!504 = !DILocation(line: 88, column: 54, scope: !492)
!505 = !DILocation(line: 88, column: 23, scope: !492)
!506 = !DILocation(line: 88, column: 5, scope: !492)
!507 = !DILocation(line: 88, column: 21, scope: !492)
!508 = !DILocation(line: 89, column: 48, scope: !492)
!509 = !{!498, !499, i64 10}
!510 = !DILocation(line: 89, column: 54, scope: !492)
!511 = !DILocation(line: 89, column: 23, scope: !492)
!512 = !DILocation(line: 89, column: 5, scope: !492)
!513 = !DILocation(line: 89, column: 21, scope: !492)
!514 = !DILocation(line: 90, column: 48, scope: !492)
!515 = !{!498, !499, i64 12}
!516 = !DILocation(line: 90, column: 54, scope: !492)
!517 = !DILocation(line: 90, column: 23, scope: !492)
!518 = !DILocation(line: 90, column: 5, scope: !492)
!519 = !DILocation(line: 90, column: 21, scope: !492)
!520 = !DILocation(line: 85, column: 41, scope: !493)
!521 = !DILocation(line: 85, column: 14, scope: !493)
!522 = distinct !{!522, !489, !523, !524}
!523 = !DILocation(line: 91, column: 3, scope: !490)
!524 = !{!"llvm.loop.mustprogress"}
!525 = !DILocation(line: 94, column: 10, scope: !407)
!526 = !DILocation(line: 0, scope: !440)
!527 = !DILocation(line: 94, column: 65, scope: !528)
!528 = distinct !DILexicalBlock(scope: !440, file: !380, line: 94, column: 65)
!529 = !DILocation(line: 94, column: 65, scope: !440)
!530 = !{!"branch_weights", i32 2000, i32 1}
!531 = !DILocation(line: 95, column: 10, scope: !407)
!532 = !DILocation(line: 0, scope: !442)
!533 = !DILocation(line: 95, column: 54, scope: !534)
!534 = distinct !DILexicalBlock(scope: !442, file: !380, line: 95, column: 54)
!535 = !DILocation(line: 95, column: 54, scope: !442)
!536 = !DILocation(line: 102, column: 10, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !380, line: 102, column: 9)
!538 = distinct !DILexicalBlock(scope: !539, file: !380, line: 96, column: 61)
!539 = distinct !DILexicalBlock(scope: !540, file: !380, line: 96, column: 3)
!540 = distinct !DILexicalBlock(scope: !407, file: !380, line: 96, column: 3)
!541 = !DILocation(line: 97, column: 39, scope: !538)
!542 = !DILocation(line: 98, column: 39, scope: !538)
!543 = !DILocation(line: 99, column: 39, scope: !538)
!544 = !DILocation(line: 101, column: 22, scope: !538)
!545 = !DILocation(line: 103, column: 5, scope: !538)
!546 = !DILocation(line: 103, column: 21, scope: !538)
!547 = !DILocation(line: 104, column: 5, scope: !538)
!548 = !DILocation(line: 104, column: 21, scope: !538)
!549 = !DILocation(line: 105, column: 5, scope: !538)
!550 = !DILocation(line: 105, column: 21, scope: !538)
!551 = !DILocation(line: 106, column: 5, scope: !538)
!552 = !DILocation(line: 106, column: 21, scope: !538)
!553 = !DILocation(line: 96, column: 52, scope: !539)
!554 = !DILocation(line: 96, column: 57, scope: !539)
!555 = !DILocation(line: 96, column: 41, scope: !539)
!556 = !DILocation(line: 96, column: 3, scope: !540)
!557 = distinct !{!557, !556, !558, !524}
!558 = !DILocation(line: 107, column: 3, scope: !540)
!559 = !DILocation(line: 97, column: 44, scope: !538)
!560 = !DILocation(line: 98, column: 44, scope: !538)
!561 = !DILocation(line: 99, column: 44, scope: !538)
!562 = !DILocation(line: 97, column: 20, scope: !538)
!563 = !DILocation(line: 98, column: 20, scope: !538)
!564 = !DILocation(line: 99, column: 20, scope: !538)
!565 = !DILocation(line: 100, column: 20, scope: !538)
!566 = !{!498, !458, i64 14}
!567 = !DILocation(line: 0, scope: !538)
!568 = !DILocation(line: 109, column: 10, scope: !407)
!569 = !DILocation(line: 101, column: 20, scope: !538)
!570 = !DILocation(line: 102, column: 9, scope: !538)
!571 = !DILocation(line: 102, column: 36, scope: !537)
!572 = !DILocation(line: 102, column: 16, scope: !537)
!573 = !DILocation(line: 103, column: 32, scope: !538)
!574 = !DILocation(line: 104, column: 23, scope: !538)
!575 = !DILocation(line: 105, column: 23, scope: !538)
!576 = !DILocation(line: 106, column: 23, scope: !538)
!577 = !DILocation(line: 0, scope: !444)
!578 = !DILocation(line: 109, column: 60, scope: !579)
!579 = distinct !DILexicalBlock(scope: !444, file: !380, line: 109, column: 60)
!580 = !DILocation(line: 109, column: 60, scope: !444)
!581 = !DILocation(line: 110, column: 3, scope: !582)
!582 = distinct !DILexicalBlock(scope: !583, file: !380, line: 110, column: 3)
!583 = distinct !DILexicalBlock(scope: !584, file: !380, line: 110, column: 3)
!584 = distinct !DILexicalBlock(scope: !407, file: !380, line: 110, column: 3)
!585 = !DILocation(line: 110, column: 3, scope: !583)
!586 = !DILocation(line: 110, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !380, line: 110, column: 3)
!588 = distinct !DILexicalBlock(scope: !582, file: !380, line: 110, column: 3)
!589 = !DILocation(line: 110, column: 3, scope: !588)
!590 = !DILocation(line: 110, column: 3, scope: !591)
!591 = distinct !DILexicalBlock(scope: !592, file: !380, line: 110, column: 3)
!592 = distinct !DILexicalBlock(scope: !587, file: !380, line: 110, column: 3)
!593 = !{!471, !458, i64 1544}
!594 = !DILocation(line: 110, column: 3, scope: !592)
!595 = !DILocation(line: 110, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !591, file: !380, line: 110, column: 3)
!597 = !DILocation(line: 110, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !587, file: !380, line: 110, column: 3)
!599 = !DILocation(line: 110, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !598, file: !380, line: 110, column: 3)
!601 = !DILocation(line: 110, column: 3, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !380, line: 110, column: 3)
!603 = distinct !DILexicalBlock(scope: !600, file: !380, line: 110, column: 3)
!604 = !DILocation(line: 110, column: 3, scope: !603)
!605 = !DILocation(line: 110, column: 3, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !380, line: 110, column: 3)
!607 = !DILocation(line: 111, column: 1, scope: !407)
!608 = !DISubprogram(name: "XAllocNamedColor", scope: !34, file: !34, line: 1988, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!609 = !DISubroutineType(types: !610)
!610 = !{!44, !74, !66, !213, !611, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!612 = !{}
!613 = !DISubprogram(name: "PetscOptionsGetBool", scope: !18, file: !18, line: 20, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!614 = !DISubroutineType(types: !615)
!615 = !{!44, !363, !213, !213, !616, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!617 = !DISubprogram(name: "PetscError", scope: !12, file: !12, line: 668, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!618 = !DISubroutineType(types: !619)
!619 = !{!194, !174, !44, !213, !213, !44, !11, !213, null}
!620 = !DISubprogram(name: "PetscDrawUtilitySetCmap", scope: !621, file: !621, line: 313, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!621 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!622 = !DISubroutineType(types: !623)
!623 = !{!44, !213, !44, !624, !624, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!625 = !DISubprogram(name: "XAllocColor", scope: !34, file: !34, line: 1958, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!626 = !DISubroutineType(types: !627)
!627 = !{!44, !74, !66, !611}
!628 = !DISubprogram(name: "PetscInfo_Private", scope: !629, file: !629, line: 11, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!629 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!630 = !DISubroutineType(types: !631)
!631 = !{!194, !213, !179, !213, null}
!632 = distinct !DISubprogram(name: "PetscDrawSetUpColormap_Private", scope: !380, file: !380, line: 121, type: !408, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !651, !653, !655}
!634 = !DILocalVariable(name: "display", arg: 1, scope: !632, file: !380, line: 121, type: !410)
!635 = !DILocalVariable(name: "screen", arg: 2, scope: !632, file: !380, line: 121, type: !44)
!636 = !DILocalVariable(name: "visual", arg: 3, scope: !632, file: !380, line: 121, type: !134)
!637 = !DILocalVariable(name: "colormap", arg: 4, scope: !632, file: !380, line: 121, type: !154)
!638 = !DILocalVariable(name: "found", scope: !632, file: !380, line: 123, type: !44)
!639 = !DILocalVariable(name: "i", scope: !632, file: !380, line: 123, type: !44)
!640 = !DILocalVariable(name: "k", scope: !632, file: !380, line: 123, type: !44)
!641 = !DILocalVariable(name: "ncolors", scope: !632, file: !380, line: 123, type: !44)
!642 = !DILocalVariable(name: "R", scope: !632, file: !380, line: 124, type: !421)
!643 = !DILocalVariable(name: "G", scope: !632, file: !380, line: 125, type: !421)
!644 = !DILocalVariable(name: "B", scope: !632, file: !380, line: 126, type: !421)
!645 = !DILocalVariable(name: "defaultmap", scope: !632, file: !380, line: 127, type: !154)
!646 = !DILocalVariable(name: "colordef", scope: !632, file: !380, line: 128, type: !427)
!647 = !DILocalVariable(name: "fast", scope: !632, file: !380, line: 129, type: !347)
!648 = !DILocalVariable(name: "ierr", scope: !632, file: !380, line: 130, type: !194)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !380, line: 138, type: !194)
!650 = distinct !DILexicalBlock(scope: !632, file: !380, line: 138, column: 72)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !380, line: 162, type: !194)
!652 = distinct !DILexicalBlock(scope: !632, file: !380, line: 162, column: 65)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !380, line: 163, type: !194)
!654 = distinct !DILexicalBlock(scope: !632, file: !380, line: 163, column: 54)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !380, line: 190, type: !194)
!656 = distinct !DILexicalBlock(scope: !632, file: !380, line: 190, column: 60)
!657 = !DILocation(line: 0, scope: !632)
!658 = !DILocation(line: 124, column: 3, scope: !632)
!659 = !DILocation(line: 124, column: 18, scope: !632)
!660 = !DILocation(line: 125, column: 3, scope: !632)
!661 = !DILocation(line: 125, column: 18, scope: !632)
!662 = !DILocation(line: 126, column: 3, scope: !632)
!663 = !DILocation(line: 126, column: 18, scope: !632)
!664 = !DILocation(line: 127, column: 31, scope: !632)
!665 = !DILocation(line: 128, column: 3, scope: !632)
!666 = !DILocation(line: 128, column: 18, scope: !632)
!667 = !DILocation(line: 129, column: 3, scope: !632)
!668 = !DILocation(line: 129, column: 18, scope: !632)
!669 = !DILocation(line: 132, column: 3, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !380, line: 132, column: 3)
!671 = distinct !DILexicalBlock(scope: !672, file: !380, line: 132, column: 3)
!672 = distinct !DILexicalBlock(scope: !632, file: !380, line: 132, column: 3)
!673 = !DILocation(line: 132, column: 3, scope: !671)
!674 = !DILocation(line: 132, column: 3, scope: !675)
!675 = distinct !DILexicalBlock(scope: !676, file: !380, line: 132, column: 3)
!676 = distinct !DILexicalBlock(scope: !670, file: !380, line: 132, column: 3)
!677 = !DILocation(line: 132, column: 3, scope: !676)
!678 = !DILocation(line: 132, column: 3, scope: !679)
!679 = distinct !DILexicalBlock(scope: !675, file: !380, line: 132, column: 3)
!680 = !DILocation(line: 133, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !632, file: !380, line: 133, column: 7)
!682 = !DILocation(line: 133, column: 7, scope: !632)
!683 = !DILocation(line: 134, column: 53, scope: !681)
!684 = !{!486, !484, i64 16}
!685 = !DILocation(line: 134, column: 29, scope: !681)
!686 = !DILocation(line: 0, scope: !681)
!687 = !DILocation(line: 136, column: 13, scope: !632)
!688 = !DILocalVariable(name: "a", arg: 1, scope: !689, file: !690, line: 1856, type: !176)
!689 = distinct !DISubprogram(name: "PetscMemzero", scope: !690, file: !690, line: 1856, type: !691, scopeLine: 1857, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!690 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!691 = !DISubroutineType(types: !692)
!692 = !{!194, !176, !344}
!693 = !{!688, !694}
!694 = !DILocalVariable(name: "n", arg: 2, scope: !689, file: !690, line: 1856, type: !344)
!695 = !DILocation(line: 0, scope: !689, inlinedAt: !696)
!696 = distinct !DILocation(line: 138, column: 10, scope: !632)
!697 = !DILocation(line: 1877, column: 7, scope: !698, inlinedAt: !696)
!698 = distinct !DILexicalBlock(scope: !699, file: !690, line: 1858, column: 14)
!699 = distinct !DILexicalBlock(scope: !689, file: !690, line: 1858, column: 7)
!700 = !DILocation(line: 141, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !632, file: !380, line: 141, column: 3)
!702 = !DILocation(line: 142, column: 25, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !380, line: 141, column: 45)
!704 = distinct !DILexicalBlock(scope: !701, file: !380, line: 141, column: 3)
!705 = !DILocation(line: 142, column: 35, scope: !703)
!706 = !DILocation(line: 142, column: 5, scope: !703)
!707 = !DILocation(line: 144, column: 13, scope: !703)
!708 = !DILocation(line: 146, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !703, file: !380, line: 146, column: 9)
!710 = !DILocation(line: 146, column: 15, scope: !709)
!711 = !DILocation(line: 146, column: 60, scope: !709)
!712 = !DILocation(line: 146, column: 9, scope: !703)
!713 = !DILocation(line: 150, column: 34, scope: !714)
!714 = distinct !DILexicalBlock(scope: !709, file: !380, line: 149, column: 12)
!715 = !DILocation(line: 150, column: 14, scope: !714)
!716 = !DILocation(line: 150, column: 7, scope: !714)
!717 = !DILocation(line: 150, column: 55, scope: !714)
!718 = distinct !{!718, !716, !717, !524}
!719 = !DILocation(line: 0, scope: !714)
!720 = !DILocation(line: 151, column: 40, scope: !714)
!721 = !DILocation(line: 152, column: 36, scope: !714)
!722 = !DILocation(line: 0, scope: !709)
!723 = !DILocation(line: 154, column: 25, scope: !703)
!724 = !DILocation(line: 154, column: 5, scope: !703)
!725 = !DILocation(line: 155, column: 32, scope: !703)
!726 = !DILocation(line: 155, column: 5, scope: !703)
!727 = !DILocation(line: 155, column: 21, scope: !703)
!728 = !DILocation(line: 156, column: 48, scope: !703)
!729 = !DILocation(line: 156, column: 54, scope: !703)
!730 = !DILocation(line: 156, column: 23, scope: !703)
!731 = !DILocation(line: 156, column: 5, scope: !703)
!732 = !DILocation(line: 156, column: 21, scope: !703)
!733 = !DILocation(line: 157, column: 48, scope: !703)
!734 = !DILocation(line: 157, column: 54, scope: !703)
!735 = !DILocation(line: 157, column: 23, scope: !703)
!736 = !DILocation(line: 157, column: 5, scope: !703)
!737 = !DILocation(line: 157, column: 21, scope: !703)
!738 = !DILocation(line: 158, column: 48, scope: !703)
!739 = !DILocation(line: 158, column: 54, scope: !703)
!740 = !DILocation(line: 158, column: 23, scope: !703)
!741 = !DILocation(line: 158, column: 5, scope: !703)
!742 = !DILocation(line: 158, column: 21, scope: !703)
!743 = !DILocation(line: 141, column: 41, scope: !704)
!744 = !DILocation(line: 141, column: 14, scope: !704)
!745 = distinct !{!745, !700, !746, !524}
!746 = !DILocation(line: 159, column: 3, scope: !701)
!747 = !DILocation(line: 162, column: 10, scope: !632)
!748 = !DILocation(line: 0, scope: !652)
!749 = !DILocation(line: 162, column: 65, scope: !750)
!750 = distinct !DILexicalBlock(scope: !652, file: !380, line: 162, column: 65)
!751 = !DILocation(line: 162, column: 65, scope: !652)
!752 = !DILocation(line: 163, column: 10, scope: !632)
!753 = !DILocation(line: 0, scope: !654)
!754 = !DILocation(line: 163, column: 54, scope: !755)
!755 = distinct !DILexicalBlock(scope: !654, file: !380, line: 163, column: 54)
!756 = !DILocation(line: 163, column: 54, scope: !654)
!757 = !DILocation(line: 164, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !632, file: !380, line: 164, column: 3)
!759 = !DILocation(line: 165, column: 39, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !380, line: 164, column: 61)
!761 = distinct !DILexicalBlock(scope: !758, file: !380, line: 164, column: 3)
!762 = !DILocation(line: 165, column: 44, scope: !760)
!763 = !DILocation(line: 165, column: 20, scope: !760)
!764 = !DILocation(line: 166, column: 39, scope: !760)
!765 = !DILocation(line: 166, column: 44, scope: !760)
!766 = !DILocation(line: 166, column: 20, scope: !760)
!767 = !DILocation(line: 167, column: 39, scope: !760)
!768 = !DILocation(line: 167, column: 44, scope: !760)
!769 = !DILocation(line: 167, column: 20, scope: !760)
!770 = !DILocation(line: 168, column: 20, scope: !760)
!771 = !DILocation(line: 169, column: 22, scope: !760)
!772 = !DILocation(line: 169, column: 20, scope: !760)
!773 = !DILocation(line: 170, column: 10, scope: !774)
!774 = distinct !DILexicalBlock(scope: !760, file: !380, line: 170, column: 9)
!775 = !DILocation(line: 170, column: 9, scope: !760)
!776 = !DILocation(line: 172, column: 15, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !380, line: 170, column: 16)
!778 = !DILocation(line: 174, column: 11, scope: !779)
!779 = distinct !DILexicalBlock(scope: !777, file: !380, line: 174, column: 11)
!780 = !DILocation(line: 174, column: 17, scope: !779)
!781 = !DILocation(line: 174, column: 62, scope: !779)
!782 = !DILocation(line: 174, column: 11, scope: !777)
!783 = !DILocation(line: 178, column: 36, scope: !784)
!784 = distinct !DILexicalBlock(scope: !779, file: !380, line: 177, column: 14)
!785 = !DILocation(line: 178, column: 16, scope: !784)
!786 = !DILocation(line: 178, column: 9, scope: !784)
!787 = !DILocation(line: 178, column: 57, scope: !784)
!788 = distinct !{!788, !786, !787, !524}
!789 = !DILocation(line: 0, scope: !784)
!790 = !DILocation(line: 179, column: 42, scope: !784)
!791 = !DILocation(line: 180, column: 38, scope: !784)
!792 = !DILocation(line: 0, scope: !779)
!793 = !DILocation(line: 182, column: 27, scope: !777)
!794 = !DILocation(line: 182, column: 7, scope: !777)
!795 = !DILocation(line: 184, column: 32, scope: !760)
!796 = !DILocation(line: 185, column: 23, scope: !760)
!797 = !DILocation(line: 186, column: 23, scope: !760)
!798 = !DILocation(line: 187, column: 23, scope: !760)
!799 = !DILocation(line: 183, column: 5, scope: !777)
!800 = !DILocation(line: 184, column: 5, scope: !760)
!801 = !DILocation(line: 184, column: 21, scope: !760)
!802 = !DILocation(line: 185, column: 5, scope: !760)
!803 = !DILocation(line: 185, column: 21, scope: !760)
!804 = !DILocation(line: 186, column: 5, scope: !760)
!805 = !DILocation(line: 186, column: 21, scope: !760)
!806 = !DILocation(line: 187, column: 5, scope: !760)
!807 = !DILocation(line: 187, column: 21, scope: !760)
!808 = !DILocation(line: 164, column: 52, scope: !761)
!809 = !DILocation(line: 164, column: 57, scope: !761)
!810 = !DILocation(line: 164, column: 41, scope: !761)
!811 = distinct !{!811, !757, !812, !524}
!812 = !DILocation(line: 188, column: 3, scope: !758)
!813 = !DILocation(line: 190, column: 10, scope: !632)
!814 = !DILocation(line: 0, scope: !656)
!815 = !DILocation(line: 190, column: 60, scope: !816)
!816 = distinct !DILexicalBlock(scope: !656, file: !380, line: 190, column: 60)
!817 = !DILocation(line: 190, column: 60, scope: !656)
!818 = !DILocation(line: 191, column: 3, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !380, line: 191, column: 3)
!820 = distinct !DILexicalBlock(scope: !821, file: !380, line: 191, column: 3)
!821 = distinct !DILexicalBlock(scope: !632, file: !380, line: 191, column: 3)
!822 = !DILocation(line: 191, column: 3, scope: !820)
!823 = !DILocation(line: 191, column: 3, scope: !824)
!824 = distinct !DILexicalBlock(scope: !825, file: !380, line: 191, column: 3)
!825 = distinct !DILexicalBlock(scope: !819, file: !380, line: 191, column: 3)
!826 = !DILocation(line: 191, column: 3, scope: !825)
!827 = !DILocation(line: 191, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !380, line: 191, column: 3)
!829 = distinct !DILexicalBlock(scope: !824, file: !380, line: 191, column: 3)
!830 = !DILocation(line: 191, column: 3, scope: !829)
!831 = !DILocation(line: 191, column: 3, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !380, line: 191, column: 3)
!833 = !DILocation(line: 191, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !824, file: !380, line: 191, column: 3)
!835 = !DILocation(line: 191, column: 3, scope: !836)
!836 = distinct !DILexicalBlock(scope: !834, file: !380, line: 191, column: 3)
!837 = !DILocation(line: 191, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !380, line: 191, column: 3)
!839 = distinct !DILexicalBlock(scope: !836, file: !380, line: 191, column: 3)
!840 = !DILocation(line: 191, column: 3, scope: !839)
!841 = !DILocation(line: 191, column: 3, scope: !842)
!842 = distinct !DILexicalBlock(scope: !838, file: !380, line: 191, column: 3)
!843 = !DILocation(line: 192, column: 1, scope: !632)
!844 = !DISubprogram(name: "XCreateColormap", scope: !34, file: !34, line: 1552, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!845 = !DISubroutineType(types: !846)
!846 = !{!66, !74, !66, !847, !44}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!848 = !DISubprogram(name: "XParseColor", scope: !34, file: !34, line: 2850, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!849 = !DISubroutineType(types: !850)
!850 = !{!44, !74, !66, !213, !611}
!851 = !DISubprogram(name: "XStoreColor", scope: !34, file: !34, line: 3382, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!852 = distinct !DISubprogram(name: "PetscDrawSetUpColormap_X", scope: !380, file: !380, line: 194, type: !408, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !875, !877, !881}
!854 = !DILocalVariable(name: "display", arg: 1, scope: !852, file: !380, line: 194, type: !410)
!855 = !DILocalVariable(name: "screen", arg: 2, scope: !852, file: !380, line: 194, type: !44)
!856 = !DILocalVariable(name: "visual", arg: 3, scope: !852, file: !380, line: 194, type: !134)
!857 = !DILocalVariable(name: "colormap", arg: 4, scope: !852, file: !380, line: 194, type: !154)
!858 = !DILocalVariable(name: "ierr", scope: !852, file: !380, line: 196, type: !194)
!859 = !DILocalVariable(name: "sharedcolormap", scope: !852, file: !380, line: 197, type: !347)
!860 = !DILocalVariable(name: "vinfo", scope: !852, file: !380, line: 198, type: !861)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisualInfo", file: !862, line: 302, baseType: !863)
!862 = !DIFile(filename: "/usr/include/X11/Xutil.h", directory: "")
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !862, line: 287, size: 512, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !863, file: !862, line: 288, baseType: !134, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !863, file: !862, line: 289, baseType: !140, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !863, file: !862, line: 290, baseType: !44, size: 32, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !863, file: !862, line: 291, baseType: !44, size: 32, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !863, file: !862, line: 295, baseType: !44, size: 32, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !863, file: !862, line: 297, baseType: !66, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !863, file: !862, line: 298, baseType: !66, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !863, file: !862, line: 299, baseType: !66, size: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !863, file: !862, line: 300, baseType: !44, size: 32, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !863, file: !862, line: 301, baseType: !44, size: 32, offset: 480)
!875 = !DILocalVariable(name: "ierr__", scope: !876, file: !380, line: 201, type: !194)
!876 = distinct !DILexicalBlock(scope: !852, file: !380, line: 201, column: 88)
!877 = !DILocalVariable(name: "ierr__", scope: !878, file: !380, line: 215, type: !194)
!878 = distinct !DILexicalBlock(scope: !879, file: !380, line: 215, column: 74)
!879 = distinct !DILexicalBlock(scope: !880, file: !380, line: 214, column: 23)
!880 = distinct !DILexicalBlock(scope: !852, file: !380, line: 214, column: 7)
!881 = !DILocalVariable(name: "ierr__", scope: !882, file: !380, line: 217, type: !194)
!882 = distinct !DILexicalBlock(scope: !883, file: !380, line: 217, column: 75)
!883 = distinct !DILexicalBlock(scope: !880, file: !380, line: 216, column: 10)
!884 = !DILocation(line: 0, scope: !852)
!885 = !DILocation(line: 197, column: 3, scope: !852)
!886 = !DILocation(line: 197, column: 18, scope: !852)
!887 = !DILocation(line: 198, column: 3, scope: !852)
!888 = !DILocation(line: 198, column: 18, scope: !852)
!889 = !DILocation(line: 200, column: 3, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !380, line: 200, column: 3)
!891 = distinct !DILexicalBlock(scope: !892, file: !380, line: 200, column: 3)
!892 = distinct !DILexicalBlock(scope: !852, file: !380, line: 200, column: 3)
!893 = !DILocation(line: 200, column: 3, scope: !891)
!894 = !DILocation(line: 200, column: 3, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !380, line: 200, column: 3)
!896 = distinct !DILexicalBlock(scope: !890, file: !380, line: 200, column: 3)
!897 = !DILocation(line: 200, column: 3, scope: !896)
!898 = !DILocation(line: 200, column: 3, scope: !899)
!899 = distinct !DILexicalBlock(scope: !895, file: !380, line: 200, column: 3)
!900 = !DILocation(line: 201, column: 10, scope: !852)
!901 = !DILocation(line: 0, scope: !876)
!902 = !DILocation(line: 201, column: 88, scope: !903)
!903 = distinct !DILexicalBlock(scope: !876, file: !380, line: 201, column: 88)
!904 = !DILocation(line: 201, column: 88, scope: !876)
!905 = !DILocation(line: 205, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !852, file: !380, line: 205, column: 7)
!907 = !DILocation(line: 205, column: 62, scope: !906)
!908 = !DILocation(line: 206, column: 7, scope: !906)
!909 = !DILocation(line: 206, column: 62, scope: !906)
!910 = !DILocation(line: 207, column: 7, scope: !906)
!911 = !DILocation(line: 207, column: 62, scope: !906)
!912 = !DILocation(line: 208, column: 7, scope: !906)
!913 = !DILocation(line: 208, column: 62, scope: !906)
!914 = !DILocation(line: 209, column: 7, scope: !906)
!915 = !DILocation(line: 209, column: 62, scope: !906)
!916 = !DILocation(line: 210, column: 7, scope: !906)
!917 = !DILocation(line: 205, column: 7, scope: !852)
!918 = !DILocation(line: 210, column: 76, scope: !906)
!919 = !DILocation(line: 214, column: 7, scope: !852)
!920 = !DILocation(line: 214, column: 7, scope: !880)
!921 = !DILocation(line: 215, column: 12, scope: !879)
!922 = !DILocation(line: 0, scope: !878)
!923 = !DILocation(line: 215, column: 74, scope: !924)
!924 = distinct !DILexicalBlock(scope: !878, file: !380, line: 215, column: 74)
!925 = !DILocation(line: 215, column: 74, scope: !878)
!926 = !DILocation(line: 217, column: 12, scope: !883)
!927 = !DILocation(line: 0, scope: !882)
!928 = !DILocation(line: 217, column: 75, scope: !929)
!929 = distinct !DILexicalBlock(scope: !882, file: !380, line: 217, column: 75)
!930 = !DILocation(line: 217, column: 75, scope: !882)
!931 = !DILocation(line: 219, column: 3, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !380, line: 219, column: 3)
!933 = distinct !DILexicalBlock(scope: !934, file: !380, line: 219, column: 3)
!934 = distinct !DILexicalBlock(scope: !852, file: !380, line: 219, column: 3)
!935 = !DILocation(line: 219, column: 3, scope: !933)
!936 = !DILocation(line: 219, column: 3, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !380, line: 219, column: 3)
!938 = distinct !DILexicalBlock(scope: !932, file: !380, line: 219, column: 3)
!939 = !DILocation(line: 219, column: 3, scope: !938)
!940 = !DILocation(line: 219, column: 3, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !380, line: 219, column: 3)
!942 = distinct !DILexicalBlock(scope: !937, file: !380, line: 219, column: 3)
!943 = !DILocation(line: 219, column: 3, scope: !942)
!944 = !DILocation(line: 219, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !941, file: !380, line: 219, column: 3)
!946 = !DILocation(line: 219, column: 3, scope: !947)
!947 = distinct !DILexicalBlock(scope: !937, file: !380, line: 219, column: 3)
!948 = !DILocation(line: 219, column: 3, scope: !949)
!949 = distinct !DILexicalBlock(scope: !947, file: !380, line: 219, column: 3)
!950 = !DILocation(line: 219, column: 3, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !380, line: 219, column: 3)
!952 = distinct !DILexicalBlock(scope: !949, file: !380, line: 219, column: 3)
!953 = !DILocation(line: 219, column: 3, scope: !952)
!954 = !DILocation(line: 219, column: 3, scope: !955)
!955 = distinct !DILexicalBlock(scope: !951, file: !380, line: 219, column: 3)
!956 = !DILocation(line: 220, column: 1, scope: !852)
!957 = !DISubprogram(name: "XMatchVisualInfo", scope: !862, file: !862, line: 542, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !612)
!958 = !DISubroutineType(types: !959)
!959 = !{!44, !74, !44, !44, !44, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!961 = distinct !DISubprogram(name: "PetscDrawSetColormap_X", scope: !380, file: !380, line: 224, type: !962, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!962 = !DISubroutineType(types: !963)
!963 = !{!194, !964, !154}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_X", file: !383, line: 43, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 27, size: 23488, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !978, !989, !990, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !966, file: !383, line: 28, baseType: !410, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !966, file: !383, line: 29, baseType: !44, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !966, file: !383, line: 30, baseType: !134, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !966, file: !383, line: 31, baseType: !44, size: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !966, file: !383, line: 32, baseType: !973, size: 128, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiGC", file: !383, line: 18, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 15, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !974, file: !383, line: 16, baseType: !150, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pix", scope: !974, file: !383, line: 17, baseType: !382, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !966, file: !383, line: 33, baseType: !979, size: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiFont", file: !383, line: 25, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 20, size: 256, elements: !982)
!982 = !{!983, !985, !986, !987, !988}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fnt", scope: !981, file: !383, line: 21, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "Font", file: !65, line: 100, baseType: !64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "font_w", scope: !981, file: !383, line: 22, baseType: !44, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "font_h", scope: !981, file: !383, line: 22, baseType: !44, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "font_descent", scope: !981, file: !383, line: 23, baseType: !44, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "font_pix", scope: !981, file: !383, line: 24, baseType: !382, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !966, file: !383, line: 34, baseType: !120, size: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "drw", scope: !966, file: !383, line: 35, baseType: !991, size: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !65, line: 97, baseType: !64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !966, file: !383, line: 36, baseType: !154, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "cmapsize", scope: !966, file: !383, line: 37, baseType: !44, size: 32, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !966, file: !383, line: 38, baseType: !382, size: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !966, file: !383, line: 39, baseType: !382, size: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "cmapping", scope: !966, file: !383, line: 40, baseType: !381, size: 16384, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "cpalette", scope: !966, file: !383, line: 41, baseType: !388, size: 6144, offset: 17216)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !966, file: !383, line: 42, baseType: !44, size: 32, offset: 23360)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !966, file: !383, line: 42, baseType: !44, size: 32, offset: 23392)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !966, file: !383, line: 42, baseType: !44, size: 32, offset: 23424)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !966, file: !383, line: 42, baseType: !44, size: 32, offset: 23456)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1009, !1013, !1015}
!1003 = !DILocalVariable(name: "XiWin", arg: 1, scope: !961, file: !380, line: 224, type: !964)
!1004 = !DILocalVariable(name: "colormap", arg: 2, scope: !961, file: !380, line: 224, type: !154)
!1005 = !DILocalVariable(name: "fast", scope: !961, file: !380, line: 226, type: !347)
!1006 = !DILocalVariable(name: "ierr", scope: !961, file: !380, line: 227, type: !194)
!1007 = !DILocalVariable(name: "ierr__", scope: !1008, file: !380, line: 230, type: !194)
!1008 = distinct !DILexicalBlock(scope: !961, file: !380, line: 230, column: 65)
!1009 = !DILocalVariable(name: "ierr__", scope: !1010, file: !380, line: 233, type: !194)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !380, line: 233, column: 84)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !380, line: 232, column: 19)
!1012 = distinct !DILexicalBlock(scope: !961, file: !380, line: 232, column: 7)
!1013 = !DILocalVariable(name: "ierr__", scope: !1014, file: !380, line: 237, type: !194)
!1014 = distinct !DILexicalBlock(scope: !961, file: !380, line: 237, column: 73)
!1015 = !DILocalVariable(name: "ierr__", scope: !1016, file: !380, line: 238, type: !194)
!1016 = distinct !DILexicalBlock(scope: !961, file: !380, line: 238, column: 73)
!1017 = !DILocation(line: 0, scope: !961)
!1018 = !DILocation(line: 226, column: 3, scope: !961)
!1019 = !DILocation(line: 226, column: 18, scope: !961)
!1020 = !DILocation(line: 229, column: 3, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !380, line: 229, column: 3)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !380, line: 229, column: 3)
!1023 = distinct !DILexicalBlock(scope: !961, file: !380, line: 229, column: 3)
!1024 = !DILocation(line: 229, column: 3, scope: !1022)
!1025 = !DILocation(line: 229, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !380, line: 229, column: 3)
!1027 = distinct !DILexicalBlock(scope: !1021, file: !380, line: 229, column: 3)
!1028 = !DILocation(line: 229, column: 3, scope: !1027)
!1029 = !DILocation(line: 229, column: 3, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !380, line: 229, column: 3)
!1031 = !DILocation(line: 230, column: 10, scope: !961)
!1032 = !DILocation(line: 0, scope: !1008)
!1033 = !DILocation(line: 230, column: 65, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1008, file: !380, line: 230, column: 65)
!1035 = !DILocation(line: 230, column: 65, scope: !1008)
!1036 = !DILocation(line: 231, column: 14, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !961, file: !380, line: 231, column: 7)
!1038 = !{!1039, !472, i64 24}
!1039 = !{!"", !465, i64 0, !472, i64 8, !465, i64 16, !472, i64 24, !1040, i64 32, !465, i64 48, !484, i64 56, !484, i64 64, !484, i64 72, !472, i64 80, !484, i64 88, !484, i64 96, !458, i64 104, !458, i64 2152, !472, i64 2920, !472, i64 2924, !472, i64 2928, !472, i64 2932}
!1040 = !{!"", !465, i64 0, !484, i64 8}
!1041 = !DILocation(line: 231, column: 20, scope: !1037)
!1042 = !DILocation(line: 231, column: 7, scope: !961)
!1043 = !DILocation(line: 231, column: 25, scope: !1037)
!1044 = !DILocation(line: 232, column: 8, scope: !1012)
!1045 = !DILocation(line: 232, column: 7, scope: !961)
!1046 = !DILocation(line: 233, column: 44, scope: !1011)
!1047 = !{!1039, !465, i64 0}
!1048 = !DILocation(line: 233, column: 56, scope: !1011)
!1049 = !{!1039, !472, i64 8}
!1050 = !DILocation(line: 233, column: 70, scope: !1011)
!1051 = !{!1039, !465, i64 16}
!1052 = !DILocation(line: 233, column: 12, scope: !1011)
!1053 = !DILocation(line: 0, scope: !1010)
!1054 = !DILocation(line: 233, column: 84, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1010, file: !380, line: 233, column: 84)
!1056 = !DILocation(line: 233, column: 84, scope: !1010)
!1057 = !DILocation(line: 235, column: 21, scope: !961)
