; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/taosolverregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/taosolverregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

!327 = !DILocation(line: 109, column: 48, scope: !134)
!328 = !DILocation(line: 110, column: 10, scope: !77)
!329 = !DILocation(line: 0, scope: !136)
!330 = !DILocation(line: 110, column: 48, scope: !331)
!331 = distinct !DILexicalBlock(scope: !136, file: !66, line: 110, column: 48)
!332 = !DILocation(line: 110, column: 48, scope: !136)
!333 = !DILocation(line: 111, column: 10, scope: !77)
!334 = !DILocation(line: 0, scope: !138)
!335 = !DILocation(line: 111, column: 44, scope: !336)
!336 = distinct !DILexicalBlock(scope: !138, file: !66, line: 111, column: 44)
!337 = !DILocation(line: 111, column: 44, scope: !138)
!338 = !DILocation(line: 112, column: 10, scope: !77)
!339 = !DILocation(line: 0, scope: !140)
!340 = !DILocation(line: 112, column: 48, scope: !341)
!341 = distinct !DILexicalBlock(scope: !140, file: !66, line: 112, column: 48)
!342 = !DILocation(line: 112, column: 48, scope: !140)
!343 = !DILocation(line: 113, column: 10, scope: !77)
!344 = !DILocation(line: 0, scope: !142)
!345 = !DILocation(line: 113, column: 48, scope: !346)
!346 = distinct !DILexicalBlock(scope: !142, file: !66, line: 113, column: 48)
!347 = !DILocation(line: 113, column: 48, scope: !142)
!348 = !DILocation(line: 114, column: 10, scope: !77)
!349 = !DILocation(line: 0, scope: !144)
!350 = !DILocation(line: 114, column: 46, scope: !351)
!351 = distinct !DILexicalBlock(scope: !144, file: !66, line: 114, column: 46)
!352 = !DILocation(line: 114, column: 46, scope: !144)
!353 = !DILocation(line: 115, column: 10, scope: !77)
!354 = !DILocation(line: 0, scope: !146)
!355 = !DILocation(line: 115, column: 46, scope: !356)
!356 = distinct !DILexicalBlock(scope: !146, file: !66, line: 115, column: 46)
!357 = !DILocation(line: 115, column: 46, scope: !146)
!358 = !DILocation(line: 117, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !66, line: 117, column: 3)
!360 = distinct !DILexicalBlock(scope: !361, file: !66, line: 117, column: 3)
!361 = distinct !DILexicalBlock(scope: !77, file: !66, line: 117, column: 3)
!362 = !DILocation(line: 117, column: 3, scope: !360)
!363 = !DILocation(line: 117, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !66, line: 117, column: 3)
!365 = distinct !DILexicalBlock(scope: !359, file: !66, line: 117, column: 3)
!366 = !DILocation(line: 117, column: 3, scope: !365)
!367 = !DILocation(line: 117, column: 3, scope: !368)
!368 = distinct !DILexicalBlock(scope: !369, file: !66, line: 117, column: 3)
!369 = distinct !DILexicalBlock(scope: !364, file: !66, line: 117, column: 3)
!370 = !DILocation(line: 117, column: 3, scope: !369)
!371 = !DILocation(line: 117, column: 3, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !66, line: 117, column: 3)
!373 = !DILocation(line: 117, column: 3, scope: !374)
!374 = distinct !DILexicalBlock(scope: !364, file: !66, line: 117, column: 3)
!375 = !DILocation(line: 117, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !374, file: !66, line: 117, column: 3)
!377 = !DILocation(line: 117, column: 3, scope: !378)
!378 = distinct !DILexicalBlock(scope: !379, file: !66, line: 117, column: 3)
!379 = distinct !DILexicalBlock(scope: !376, file: !66, line: 117, column: 3)
!380 = !DILocation(line: 117, column: 3, scope: !379)
!381 = !DILocation(line: 117, column: 3, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !66, line: 117, column: 3)
!383 = !DILocation(line: 118, column: 1, scope: !77)
!384 = !DISubprogram(name: "TaoRegister", scope: !27, file: !27, line: 217, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !822)
!385 = !DISubroutineType(types: !386)
!386 = !{!28, !55, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!28, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !392, line: 45, size: 14656, elements: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!393 = !{!394, !595, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !689, !695, !697, !698, !699, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !774, !775, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !814, !815, !816, !817, !818, !819, !820, !821}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !391, file: !392, line: 46, baseType: !395, size: 4480)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !396, line: 122, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !396, line: 73, size: 4480, elements: !398)
!398 = !{!399, !401, !448, !449, !451, !454, !455, !456, !457, !465, !466, !468, !472, !476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !489, !490, !491, !493, !494, !496, !498, !499, !500, !501, !502, !505, !507, !508, !509, !510, !511, !514, !516, !517, !518, !528, !530, !531, !535, !536, !585, !590, !592, !593, !594}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !397, file: !396, line: 74, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !397, file: !396, line: 75, baseType: !402, size: 448, offset: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 448, elements: !446)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !396, line: 53, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 45, size: 448, elements: !405)
!405 = !{!406, !413, !421, !426, !430, !434, !441}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !404, file: !396, line: 46, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!80, !410, !412}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !404, file: !396, line: 47, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!80, !410, !417}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !418, line: 16, baseType: !419)
!418 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !418, line: 16, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !404, file: !396, line: 48, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!80, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !404, file: !396, line: 49, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!80, !410, !55, !410}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !404, file: !396, line: 50, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!80, !410, !55, !425}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !404, file: !396, line: 51, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!80, !410, !55, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !404, file: !396, line: 52, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!80, !410, !55, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!446 = !{!447}
!447 = !DISubrange(count: 1)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !397, file: !396, line: 76, baseType: !58, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !396, line: 77, baseType: !450, size: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !397, file: !396, line: 78, baseType: !452, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !453)
!453 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !397, file: !396, line: 78, baseType: !452, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !397, file: !396, line: 78, baseType: !452, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !397, file: !396, line: 78, baseType: !452, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !397, file: !396, line: 79, baseType: !458, size: 64, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !461, line: 27, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !463, line: 43, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!464 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !397, file: !396, line: 80, baseType: !450, size: 32, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !397, file: !396, line: 81, baseType: !467, size: 32, offset: 992)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !397, file: !396, line: 82, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !397, file: !396, line: 83, baseType: !473, size: 64, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !397, file: !396, line: 84, baseType: !477, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !397, file: !396, line: 85, baseType: !477, size: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !397, file: !396, line: 86, baseType: !477, size: 64, offset: 1280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !397, file: !396, line: 87, baseType: !477, size: 64, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !397, file: !396, line: 88, baseType: !410, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !397, file: !396, line: 89, baseType: !458, size: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !396, line: 90, baseType: !477, size: 64, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !397, file: !396, line: 91, baseType: !477, size: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !397, file: !396, line: 92, baseType: !450, size: 32, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !397, file: !396, line: 93, baseType: !62, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !397, file: !396, line: 94, baseType: !488, size: 64, offset: 1792)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !459)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !397, file: !396, line: 95, baseType: !450, size: 32, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !397, file: !396, line: 95, baseType: !450, size: 32, offset: 1888)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !397, file: !396, line: 96, baseType: !492, size: 64, offset: 1920)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !397, file: !396, line: 96, baseType: !492, size: 64, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !397, file: !396, line: 97, baseType: !495, size: 64, offset: 2048)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !397, file: !396, line: 97, baseType: !497, size: 64, offset: 2112)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !397, file: !396, line: 98, baseType: !450, size: 32, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !397, file: !396, line: 98, baseType: !450, size: 32, offset: 2208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !397, file: !396, line: 99, baseType: !492, size: 64, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !397, file: !396, line: 99, baseType: !492, size: 64, offset: 2304)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !397, file: !396, line: 100, baseType: !503, size: 64, offset: 2368)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !453)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !397, file: !396, line: 100, baseType: !506, size: 64, offset: 2432)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !397, file: !396, line: 101, baseType: !450, size: 32, offset: 2496)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !397, file: !396, line: 101, baseType: !450, size: 32, offset: 2528)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !397, file: !396, line: 102, baseType: !492, size: 64, offset: 2560)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !397, file: !396, line: 102, baseType: !492, size: 64, offset: 2624)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !397, file: !396, line: 103, baseType: !512, size: 64, offset: 2688)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !504)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !397, file: !396, line: 103, baseType: !515, size: 64, offset: 2752)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !397, file: !396, line: 104, baseType: !445, size: 64, offset: 2816)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !397, file: !396, line: 105, baseType: !450, size: 32, offset: 2880)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !397, file: !396, line: 106, baseType: !519, size: 128, offset: 2944)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 128, elements: !526)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !396, line: 64, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 61, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !522, file: !396, line: 62, baseType: !438, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !522, file: !396, line: 63, baseType: !62, size: 64, offset: 64)
!526 = !{!527}
!527 = !DISubrange(count: 2)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !397, file: !396, line: 107, baseType: !529, size: 64, offset: 3072)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 64, elements: !526)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !397, file: !396, line: 108, baseType: !62, size: 64, offset: 3136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !397, file: !396, line: 109, baseType: !532, size: 64, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!80, !62}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !397, file: !396, line: 111, baseType: !450, size: 32, offset: 3264)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !397, file: !396, line: 112, baseType: !537, size: 320, offset: 3328)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !583)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!80, !541, !410, !62}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !544)
!544 = !{!545, !546, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !543, file: !12, line: 100, baseType: !450, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !12, line: 101, baseType: !547, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !558, !559, !560, !564, !566, !568, !569, !570}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !549, file: !12, line: 84, baseType: !477, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !549, file: !12, line: 85, baseType: !477, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !549, file: !12, line: 86, baseType: !62, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !549, file: !12, line: 87, baseType: !469, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !549, file: !12, line: 88, baseType: !556, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !549, file: !12, line: 89, baseType: !57, size: 8, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !549, file: !12, line: 90, baseType: !477, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !549, file: !12, line: 91, baseType: !561, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !562, line: 46, baseType: !563)
!562 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!563 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !549, file: !12, line: 92, baseType: !565, size: 32, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !549, file: !12, line: 93, baseType: !567, size: 32, offset: 544)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !12, line: 94, baseType: !547, size: 64, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !549, file: !12, line: 95, baseType: !477, size: 64, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !549, file: !12, line: 96, baseType: !62, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !543, file: !12, line: 102, baseType: !477, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !543, file: !12, line: 102, baseType: !477, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !543, file: !12, line: 103, baseType: !477, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !543, file: !12, line: 104, baseType: !58, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !543, file: !12, line: 105, baseType: !565, size: 32, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !543, file: !12, line: 105, baseType: !565, size: 32, offset: 416)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !543, file: !12, line: 105, baseType: !565, size: 32, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !543, file: !12, line: 106, baseType: !410, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !543, file: !12, line: 107, baseType: !580, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!583 = !{!584}
!584 = !DISubrange(count: 5)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !397, file: !396, line: 113, baseType: !586, size: 320, offset: 3648)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 320, elements: !583)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!80, !410, !62}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !397, file: !396, line: 114, baseType: !591, size: 320, offset: 3968)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 320, elements: !583)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !397, file: !396, line: 115, baseType: !565, size: 32, offset: 4288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !397, file: !396, line: 120, baseType: !580, size: 64, offset: 4352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !397, file: !396, line: 121, baseType: !565, size: 32, offset: 4416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !391, file: !392, line: 46, baseType: !596, size: 1536, offset: 4480)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 1536, elements: !446)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !392, line: 13, size: 1536, elements: !598)
!598 = !{!599, !608, !612, !616, !624, !625, !626, !627, !628, !629, !630, !634, !638, !639, !640, !641, !645, !649, !650, !654, !658, !659, !663, !667}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !597, file: !392, line: 15, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!80, !603, !604, !503, !62}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !390)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !605, line: 21, baseType: !606)
!605 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !605, line: 21, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !597, file: !392, line: 16, baseType: !609, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!80, !603, !604, !503, !604, !62}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !597, file: !392, line: 17, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!80, !603, !604, !604, !62}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !597, file: !392, line: 18, baseType: !617, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!80, !603, !604, !620, !620, !62}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !621, line: 16, baseType: !622)
!621 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !621, line: 16, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !597, file: !392, line: 19, baseType: !613, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !597, file: !392, line: 20, baseType: !617, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !597, file: !392, line: 21, baseType: !613, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !597, file: !392, line: 22, baseType: !613, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !597, file: !392, line: 23, baseType: !613, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !597, file: !392, line: 24, baseType: !617, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !597, file: !392, line: 25, baseType: !631, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!80, !603, !604, !620, !620, !620, !62}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !597, file: !392, line: 26, baseType: !635, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!80, !603, !604, !620, !62}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !597, file: !392, line: 27, baseType: !617, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !597, file: !392, line: 28, baseType: !617, size: 64, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !597, file: !392, line: 29, baseType: !613, size: 64, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !597, file: !392, line: 30, baseType: !642, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!80, !603, !450, !62}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !597, file: !392, line: 31, baseType: !646, size: 64, offset: 1024)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!80, !603, !62}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !597, file: !392, line: 32, baseType: !532, size: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !597, file: !392, line: 35, baseType: !651, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!80, !603, !604, !604}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !597, file: !392, line: 36, baseType: !655, size: 64, offset: 1216)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!80, !603}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !597, file: !392, line: 37, baseType: !655, size: 64, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !597, file: !392, line: 38, baseType: !660, size: 64, offset: 1344)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!80, !603, !417}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !597, file: !392, line: 39, baseType: !664, size: 64, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!80, !541, !603}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !597, file: !392, line: 40, baseType: !655, size: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !391, file: !392, line: 47, baseType: !62, size: 64, offset: 6016)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !391, file: !392, line: 48, baseType: !62, size: 64, offset: 6080)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !391, file: !392, line: 49, baseType: !62, size: 64, offset: 6144)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !391, file: !392, line: 50, baseType: !62, size: 64, offset: 6208)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !391, file: !392, line: 51, baseType: !62, size: 64, offset: 6272)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !391, file: !392, line: 52, baseType: !62, size: 64, offset: 6336)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !391, file: !392, line: 53, baseType: !62, size: 64, offset: 6400)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !391, file: !392, line: 54, baseType: !62, size: 64, offset: 6464)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !391, file: !392, line: 55, baseType: !62, size: 64, offset: 6528)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !391, file: !392, line: 56, baseType: !62, size: 64, offset: 6592)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !391, file: !392, line: 57, baseType: !62, size: 64, offset: 6656)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !391, file: !392, line: 58, baseType: !62, size: 64, offset: 6720)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !391, file: !392, line: 59, baseType: !62, size: 64, offset: 6784)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !391, file: !392, line: 60, baseType: !62, size: 64, offset: 6848)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !391, file: !392, line: 61, baseType: !62, size: 64, offset: 6912)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !391, file: !392, line: 62, baseType: !62, size: 64, offset: 6976)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !391, file: !392, line: 63, baseType: !62, size: 64, offset: 7040)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !391, file: !392, line: 65, baseType: !686, size: 640, offset: 7104)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 640, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 10)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !391, file: !392, line: 66, baseType: !690, size: 640, offset: 7744)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 640, elements: !687)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!80, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !391, file: !392, line: 67, baseType: !696, size: 640, offset: 8384)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 640, elements: !687)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !391, file: !392, line: 68, baseType: !450, size: 32, offset: 9024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !391, file: !392, line: 69, baseType: !62, size: 64, offset: 9088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !391, file: !392, line: 70, baseType: !700, size: 32, offset: 9152)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !391, file: !392, line: 72, baseType: !565, size: 32, offset: 9184)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !391, file: !392, line: 73, baseType: !62, size: 64, offset: 9216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !391, file: !392, line: 75, baseType: !604, size: 64, offset: 9280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !391, file: !392, line: 76, baseType: !604, size: 64, offset: 9344)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !391, file: !392, line: 77, baseType: !604, size: 64, offset: 9408)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !391, file: !392, line: 78, baseType: !604, size: 64, offset: 9472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !391, file: !392, line: 79, baseType: !604, size: 64, offset: 9536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !391, file: !392, line: 80, baseType: !604, size: 64, offset: 9600)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !391, file: !392, line: 81, baseType: !604, size: 64, offset: 9664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !391, file: !392, line: 82, baseType: !604, size: 64, offset: 9728)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !391, file: !392, line: 83, baseType: !604, size: 64, offset: 9792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !391, file: !392, line: 84, baseType: !620, size: 64, offset: 9856)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !391, file: !392, line: 85, baseType: !620, size: 64, offset: 9920)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !391, file: !392, line: 86, baseType: !620, size: 64, offset: 9984)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !391, file: !392, line: 87, baseType: !604, size: 64, offset: 10048)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !391, file: !392, line: 88, baseType: !604, size: 64, offset: 10112)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !391, file: !392, line: 89, baseType: !620, size: 64, offset: 10176)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !391, file: !392, line: 90, baseType: !620, size: 64, offset: 10240)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !391, file: !392, line: 91, baseType: !604, size: 64, offset: 10304)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !391, file: !392, line: 92, baseType: !450, size: 32, offset: 10368)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !391, file: !392, line: 93, baseType: !495, size: 64, offset: 10432)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !391, file: !392, line: 94, baseType: !495, size: 64, offset: 10496)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !391, file: !392, line: 95, baseType: !503, size: 64, offset: 10560)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !391, file: !392, line: 96, baseType: !604, size: 64, offset: 10624)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !391, file: !392, line: 97, baseType: !604, size: 64, offset: 10688)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !391, file: !392, line: 98, baseType: !604, size: 64, offset: 10752)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !391, file: !392, line: 99, baseType: !620, size: 64, offset: 10816)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !391, file: !392, line: 100, baseType: !620, size: 64, offset: 10880)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !391, file: !392, line: 101, baseType: !620, size: 64, offset: 10944)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !391, file: !392, line: 102, baseType: !620, size: 64, offset: 11008)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !391, file: !392, line: 103, baseType: !620, size: 64, offset: 11072)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !391, file: !392, line: 104, baseType: !620, size: 64, offset: 11136)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !391, file: !392, line: 105, baseType: !620, size: 64, offset: 11200)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !391, file: !392, line: 106, baseType: !620, size: 64, offset: 11264)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !391, file: !392, line: 107, baseType: !620, size: 64, offset: 11328)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !391, file: !392, line: 108, baseType: !620, size: 64, offset: 11392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !391, file: !392, line: 109, baseType: !620, size: 64, offset: 11456)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !391, file: !392, line: 110, baseType: !739, size: 64, offset: 11520)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !740, line: 11, baseType: !741)
!740 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !740, line: 11, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !391, file: !392, line: 111, baseType: !739, size: 64, offset: 11584)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !391, file: !392, line: 112, baseType: !504, size: 64, offset: 11648)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !391, file: !392, line: 113, baseType: !504, size: 64, offset: 11712)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !391, file: !392, line: 114, baseType: !504, size: 64, offset: 11776)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !391, file: !392, line: 115, baseType: !504, size: 64, offset: 11840)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !391, file: !392, line: 116, baseType: !504, size: 64, offset: 11904)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !391, file: !392, line: 117, baseType: !504, size: 64, offset: 11968)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !391, file: !392, line: 119, baseType: !450, size: 32, offset: 12032)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !391, file: !392, line: 120, baseType: !450, size: 32, offset: 12064)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !391, file: !392, line: 121, baseType: !450, size: 32, offset: 12096)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !391, file: !392, line: 122, baseType: !450, size: 32, offset: 12128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !391, file: !392, line: 123, baseType: !450, size: 32, offset: 12160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !391, file: !392, line: 124, baseType: !450, size: 32, offset: 12192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !391, file: !392, line: 125, baseType: !450, size: 32, offset: 12224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !391, file: !392, line: 126, baseType: !450, size: 32, offset: 12256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !391, file: !392, line: 127, baseType: !450, size: 32, offset: 12288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !391, file: !392, line: 128, baseType: !450, size: 32, offset: 12320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !391, file: !392, line: 129, baseType: !450, size: 32, offset: 12352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !391, file: !392, line: 130, baseType: !450, size: 32, offset: 12384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !391, file: !392, line: 131, baseType: !450, size: 32, offset: 12416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !391, file: !392, line: 132, baseType: !450, size: 32, offset: 12448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !391, file: !392, line: 133, baseType: !450, size: 32, offset: 12480)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !391, file: !392, line: 134, baseType: !450, size: 32, offset: 12512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !391, file: !392, line: 135, baseType: !450, size: 32, offset: 12544)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !391, file: !392, line: 137, baseType: !450, size: 32, offset: 12576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !391, file: !392, line: 138, baseType: !450, size: 32, offset: 12608)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !391, file: !392, line: 140, baseType: !770, size: 64, offset: 12672)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !771, line: 5, baseType: !772)
!771 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !771, line: 5, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !391, file: !392, line: 141, baseType: !565, size: 32, offset: 12736)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !391, file: !392, line: 142, baseType: !776, size: 64, offset: 12800)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !777, line: 22, baseType: !778)
!777 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !777, line: 22, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !391, file: !392, line: 143, baseType: !504, size: 64, offset: 12864)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !391, file: !392, line: 144, baseType: !504, size: 64, offset: 12928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !391, file: !392, line: 146, baseType: !504, size: 64, offset: 12992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !391, file: !392, line: 147, baseType: !504, size: 64, offset: 13056)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !391, file: !392, line: 148, baseType: !504, size: 64, offset: 13120)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !391, file: !392, line: 149, baseType: !504, size: 64, offset: 13184)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !391, file: !392, line: 150, baseType: !504, size: 64, offset: 13248)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !391, file: !392, line: 151, baseType: !504, size: 64, offset: 13312)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !391, file: !392, line: 152, baseType: !504, size: 64, offset: 13376)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !391, file: !392, line: 153, baseType: !565, size: 32, offset: 13440)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !391, file: !392, line: 154, baseType: !565, size: 32, offset: 13472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !391, file: !392, line: 155, baseType: !565, size: 32, offset: 13504)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !391, file: !392, line: 156, baseType: !565, size: 32, offset: 13536)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !391, file: !392, line: 157, baseType: !565, size: 32, offset: 13568)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !391, file: !392, line: 158, baseType: !565, size: 32, offset: 13600)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !391, file: !392, line: 159, baseType: !565, size: 32, offset: 13632)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !391, file: !392, line: 160, baseType: !565, size: 32, offset: 13664)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !391, file: !392, line: 161, baseType: !565, size: 32, offset: 13696)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !391, file: !392, line: 162, baseType: !565, size: 32, offset: 13728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !391, file: !392, line: 163, baseType: !565, size: 32, offset: 13760)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !391, file: !392, line: 164, baseType: !565, size: 32, offset: 13792)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !391, file: !392, line: 165, baseType: !565, size: 32, offset: 13824)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !391, file: !392, line: 166, baseType: !565, size: 32, offset: 13856)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !391, file: !392, line: 167, baseType: !565, size: 32, offset: 13888)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !391, file: !392, line: 168, baseType: !565, size: 32, offset: 13920)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !391, file: !392, line: 169, baseType: !565, size: 32, offset: 13952)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !391, file: !392, line: 170, baseType: !565, size: 32, offset: 13984)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !391, file: !392, line: 171, baseType: !565, size: 32, offset: 14016)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !391, file: !392, line: 172, baseType: !565, size: 32, offset: 14048)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !391, file: !392, line: 173, baseType: !565, size: 32, offset: 14080)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !391, file: !392, line: 174, baseType: !565, size: 32, offset: 14112)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !391, file: !392, line: 175, baseType: !565, size: 32, offset: 14144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !391, file: !392, line: 177, baseType: !813, size: 32, offset: 14176)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !391, file: !392, line: 178, baseType: !450, size: 32, offset: 14208)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !391, file: !392, line: 179, baseType: !503, size: 64, offset: 14272)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !391, file: !392, line: 180, baseType: !503, size: 64, offset: 14336)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !391, file: !392, line: 181, baseType: !503, size: 64, offset: 14400)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !391, file: !392, line: 182, baseType: !495, size: 64, offset: 14464)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !391, file: !392, line: 183, baseType: !450, size: 32, offset: 14528)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !391, file: !392, line: 184, baseType: !565, size: 32, offset: 14560)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !391, file: !392, line: 185, baseType: !565, size: 32, offset: 14592)
!822 = !{}
!823 = !DISubprogram(name: "PetscError", scope: !49, file: !49, line: 668, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !822)
!824 = !DISubroutineType(types: !825)
!825 = !{!80, !60, !28, !55, !55, !28, !48, !55, null}
