; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/dlregis_taolinesearch.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/dlregis_taolinesearch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_TaoLineSearch = type { %struct._p_PetscObject, [1 x %struct._TaoLineSearchOps], i8*, i8*, i8*, i8*, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec*, %struct._p_Vec*, double, double, %struct._p_Vec*, %struct._p_Vec*, double, double, i32, i32, i32, i32, i32, double, double, double, double, double, %struct._p_Tao* }

!213 = !DILocation(line: 47, column: 71, scope: !214)
!214 = distinct !DILexicalBlock(scope: !149, file: !59, line: 47, column: 71)
!215 = !DILocation(line: 47, column: 71, scope: !149)
!216 = !DILocation(line: 48, column: 10, scope: !141)
!217 = !DILocation(line: 0, scope: !151)
!218 = !DILocation(line: 48, column: 65, scope: !219)
!219 = distinct !DILexicalBlock(scope: !151, file: !59, line: 48, column: 65)
!220 = !DILocation(line: 48, column: 65, scope: !151)
!221 = !DILocation(line: 49, column: 10, scope: !141)
!222 = !DILocation(line: 0, scope: !153)
!223 = !DILocation(line: 49, column: 69, scope: !224)
!224 = distinct !DILexicalBlock(scope: !153, file: !59, line: 49, column: 69)
!225 = !DILocation(line: 49, column: 69, scope: !153)
!226 = !DILocation(line: 50, column: 10, scope: !141)
!227 = !DILocation(line: 0, scope: !155)
!228 = !DILocation(line: 50, column: 73, scope: !229)
!229 = distinct !DILexicalBlock(scope: !155, file: !59, line: 50, column: 73)
!230 = !DILocation(line: 50, column: 73, scope: !155)
!231 = !DILocation(line: 51, column: 53, scope: !141)
!232 = !DILocation(line: 51, column: 10, scope: !141)
!233 = !DILocation(line: 0, scope: !157)
!234 = !DILocation(line: 51, column: 97, scope: !235)
!235 = distinct !DILexicalBlock(scope: !157, file: !59, line: 51, column: 97)
!236 = !DILocation(line: 51, column: 97, scope: !157)
!237 = !DILocation(line: 52, column: 53, scope: !141)
!238 = !DILocation(line: 52, column: 10, scope: !141)
!239 = !DILocation(line: 0, scope: !159)
!240 = !DILocation(line: 52, column: 96, scope: !241)
!241 = distinct !DILexicalBlock(scope: !159, file: !59, line: 52, column: 96)
!242 = !DILocation(line: 52, column: 96, scope: !159)
!243 = !DILocation(line: 54, column: 10, scope: !141)
!244 = !DILocation(line: 0, scope: !161)
!245 = !DILocation(line: 54, column: 62, scope: !246)
!246 = distinct !DILexicalBlock(scope: !161, file: !59, line: 54, column: 62)
!247 = !DILocation(line: 54, column: 62, scope: !161)
!248 = !DILocation(line: 55, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !59, line: 55, column: 3)
!250 = distinct !DILexicalBlock(scope: !251, file: !59, line: 55, column: 3)
!251 = distinct !DILexicalBlock(scope: !141, file: !59, line: 55, column: 3)
!252 = !DILocation(line: 55, column: 3, scope: !250)
!253 = !DILocation(line: 55, column: 3, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !59, line: 55, column: 3)
!255 = distinct !DILexicalBlock(scope: !249, file: !59, line: 55, column: 3)
!256 = !DILocation(line: 55, column: 3, scope: !255)
!257 = !DILocation(line: 55, column: 3, scope: !258)
!258 = distinct !DILexicalBlock(scope: !259, file: !59, line: 55, column: 3)
!259 = distinct !DILexicalBlock(scope: !254, file: !59, line: 55, column: 3)
!260 = !DILocation(line: 55, column: 3, scope: !259)
!261 = !DILocation(line: 55, column: 3, scope: !262)
!262 = distinct !DILexicalBlock(scope: !258, file: !59, line: 55, column: 3)
!263 = !DILocation(line: 55, column: 3, scope: !264)
!264 = distinct !DILexicalBlock(scope: !254, file: !59, line: 55, column: 3)
!265 = !DILocation(line: 55, column: 3, scope: !266)
!266 = distinct !DILexicalBlock(scope: !264, file: !59, line: 55, column: 3)
!267 = !DILocation(line: 55, column: 3, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !59, line: 55, column: 3)
!269 = distinct !DILexicalBlock(scope: !266, file: !59, line: 55, column: 3)
!270 = !DILocation(line: 55, column: 3, scope: !269)
!271 = !DILocation(line: 55, column: 3, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !59, line: 55, column: 3)
!273 = !DILocation(line: 56, column: 1, scope: !141)
!274 = !DISubprogram(name: "PetscClassIdRegister", scope: !131, file: !131, line: 1408, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !137)
!275 = !DISubroutineType(types: !276)
!276 = !{!34, !54, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!278 = !DISubprogram(name: "TaoLineSearchRegister", scope: !33, file: !33, line: 73, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !137)
!279 = !DISubroutineType(types: !280)
!280 = !{!34, !54, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!34, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !286, line: 22, size: 7104, elements: !287)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taolinesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!287 = !{!288, !486, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !285, file: !286, line: 23, baseType: !289, size: 4480)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !290, line: 122, baseType: !291)
!290 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !290, line: 73, size: 4480, elements: !292)
!292 = !{!293, !295, !342, !343, !345, !348, !349, !350, !351, !359, !360, !362, !364, !368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !381, !382, !383, !385, !386, !388, !390, !391, !392, !393, !394, !397, !399, !400, !401, !402, !403, !406, !408, !409, !410, !420, !422, !423, !427, !428, !476, !481, !483, !484, !485}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !291, file: !290, line: 74, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !34)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !291, file: !290, line: 75, baseType: !296, size: 448, offset: 64)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 448, elements: !340)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !290, line: 53, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 45, size: 448, elements: !299)
!299 = !{!300, !307, !315, !320, !324, !328, !335}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !298, file: !290, line: 46, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!70, !304, !306}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !298, file: !290, line: 47, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!70, !304, !311}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !312, line: 16, baseType: !313)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !312, line: 16, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !298, file: !290, line: 48, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!70, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !298, file: !290, line: 49, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!70, !304, !54, !304}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !298, file: !290, line: 50, baseType: !325, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!70, !304, !54, !319}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !298, file: !290, line: 51, baseType: !329, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!70, !304, !54, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !298, file: !290, line: 52, baseType: !336, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!70, !304, !54, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !291, file: !290, line: 76, baseType: !49, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !290, line: 77, baseType: !344, size: 32, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !34)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !291, file: !290, line: 78, baseType: !346, size: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !347)
!347 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !291, file: !290, line: 78, baseType: !346, size: 64, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !291, file: !290, line: 78, baseType: !346, size: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !291, file: !290, line: 78, baseType: !346, size: 64, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !290, line: 79, baseType: !352, size: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !355, line: 27, baseType: !356)
!355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !357, line: 43, baseType: !358)
!357 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!358 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !291, file: !290, line: 80, baseType: !344, size: 32, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !291, file: !290, line: 81, baseType: !361, size: 32, offset: 992)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !34)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !291, file: !290, line: 82, baseType: !363, size: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !135)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !291, file: !290, line: 83, baseType: !365, size: 64, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !291, file: !290, line: 84, baseType: !369, size: 64, offset: 1152)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !291, file: !290, line: 85, baseType: !369, size: 64, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !291, file: !290, line: 86, baseType: !369, size: 64, offset: 1280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !291, file: !290, line: 87, baseType: !369, size: 64, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !291, file: !290, line: 88, baseType: !304, size: 64, offset: 1408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !291, file: !290, line: 89, baseType: !352, size: 64, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !290, line: 90, baseType: !369, size: 64, offset: 1536)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !290, line: 91, baseType: !369, size: 64, offset: 1600)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !291, file: !290, line: 92, baseType: !344, size: 32, offset: 1664)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !291, file: !290, line: 93, baseType: !53, size: 64, offset: 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !291, file: !290, line: 94, baseType: !380, size: 64, offset: 1792)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !353)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !291, file: !290, line: 95, baseType: !344, size: 32, offset: 1856)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !291, file: !290, line: 95, baseType: !344, size: 32, offset: 1888)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !291, file: !290, line: 96, baseType: !384, size: 64, offset: 1920)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !291, file: !290, line: 96, baseType: !384, size: 64, offset: 1984)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !291, file: !290, line: 97, baseType: !387, size: 64, offset: 2048)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !291, file: !290, line: 97, baseType: !389, size: 64, offset: 2112)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !291, file: !290, line: 98, baseType: !344, size: 32, offset: 2176)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !291, file: !290, line: 98, baseType: !344, size: 32, offset: 2208)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !291, file: !290, line: 99, baseType: !384, size: 64, offset: 2240)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !291, file: !290, line: 99, baseType: !384, size: 64, offset: 2304)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !291, file: !290, line: 100, baseType: !395, size: 64, offset: 2368)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !347)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !291, file: !290, line: 100, baseType: !398, size: 64, offset: 2432)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !291, file: !290, line: 101, baseType: !344, size: 32, offset: 2496)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !291, file: !290, line: 101, baseType: !344, size: 32, offset: 2528)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !291, file: !290, line: 102, baseType: !384, size: 64, offset: 2560)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !291, file: !290, line: 102, baseType: !384, size: 64, offset: 2624)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !291, file: !290, line: 103, baseType: !404, size: 64, offset: 2688)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !396)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !291, file: !290, line: 103, baseType: !407, size: 64, offset: 2752)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !291, file: !290, line: 104, baseType: !339, size: 64, offset: 2816)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !291, file: !290, line: 105, baseType: !344, size: 32, offset: 2880)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !291, file: !290, line: 106, baseType: !411, size: 128, offset: 2944)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 128, elements: !418)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !290, line: 64, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 61, size: 128, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !414, file: !290, line: 62, baseType: !332, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !414, file: !290, line: 63, baseType: !53, size: 64, offset: 64)
!418 = !{!419}
!419 = !DISubrange(count: 2)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !291, file: !290, line: 107, baseType: !421, size: 64, offset: 3072)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !418)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !291, file: !290, line: 108, baseType: !53, size: 64, offset: 3136)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !291, file: !290, line: 109, baseType: !424, size: 64, offset: 3200)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!70, !53}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !291, file: !290, line: 111, baseType: !344, size: 32, offset: 3264)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !291, file: !290, line: 112, baseType: !429, size: 320, offset: 3328)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 320, elements: !474)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!70, !433, !304, !53}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !436)
!436 = !{!437, !438, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !435, file: !18, line: 100, baseType: !344, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !18, line: 101, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !450, !451, !452, !456, !457, !459, !460, !461}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !441, file: !18, line: 84, baseType: !369, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !441, file: !18, line: 85, baseType: !369, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !18, line: 86, baseType: !53, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !441, file: !18, line: 87, baseType: !363, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !441, file: !18, line: 88, baseType: !448, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !441, file: !18, line: 89, baseType: !56, size: 8, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !441, file: !18, line: 90, baseType: !369, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !441, file: !18, line: 91, baseType: !453, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !454, line: 46, baseType: !455)
!454 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!455 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !441, file: !18, line: 92, baseType: !60, size: 32, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !18, line: 93, baseType: !458, size: 32, offset: 544)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !18, line: 94, baseType: !439, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !441, file: !18, line: 95, baseType: !369, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !441, file: !18, line: 96, baseType: !53, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !435, file: !18, line: 102, baseType: !369, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !435, file: !18, line: 102, baseType: !369, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !435, file: !18, line: 103, baseType: !369, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !435, file: !18, line: 104, baseType: !49, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !435, file: !18, line: 105, baseType: !60, size: 32, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !435, file: !18, line: 105, baseType: !60, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !435, file: !18, line: 105, baseType: !60, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !435, file: !18, line: 106, baseType: !304, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !435, file: !18, line: 107, baseType: !471, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!474 = !{!475}
!475 = !DISubrange(count: 5)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !291, file: !290, line: 113, baseType: !477, size: 320, offset: 3648)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !474)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!70, !304, !53}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !291, file: !290, line: 114, baseType: !482, size: 320, offset: 3968)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, elements: !474)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !291, file: !290, line: 115, baseType: !60, size: 32, offset: 4288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !291, file: !290, line: 120, baseType: !471, size: 64, offset: 4352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !291, file: !290, line: 121, baseType: !60, size: 32, offset: 4416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !285, file: !286, line: 23, baseType: !487, size: 704, offset: 4480)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 704, elements: !340)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoLineSearchOps", file: !286, line: 8, size: 704, elements: !489)
!489 = !{!490, !499, !503, !507, !511, !515, !519, !523, !527, !528, !529}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !488, file: !286, line: 9, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!70, !494, !495, !395, !53}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !33, line: 5, baseType: !284)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !496, line: 21, baseType: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !496, line: 21, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !488, file: !286, line: 10, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!70, !494, !495, !495, !53}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !488, file: !286, line: 11, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!70, !494, !495, !395, !495, !53}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgts", scope: !488, file: !286, line: 12, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!70, !494, !495, !495, !395, !395, !53}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !488, file: !286, line: 13, baseType: !512, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!70, !494}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !488, file: !286, line: 14, baseType: !516, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!70, !494, !495, !395, !495, !495}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !488, file: !286, line: 15, baseType: !520, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!70, !494, !311}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !488, file: !286, line: 16, baseType: !524, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!70, !433, !494}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !488, file: !286, line: 17, baseType: !512, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !488, file: !286, line: 18, baseType: !512, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !488, file: !286, line: 19, baseType: !512, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_func", scope: !285, file: !286, line: 24, baseType: !53, size: 64, offset: 5184)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_grad", scope: !285, file: !286, line: 25, baseType: !53, size: 64, offset: 5248)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgrad", scope: !285, file: !286, line: 26, baseType: !53, size: 64, offset: 5312)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgts", scope: !285, file: !286, line: 27, baseType: !53, size: 64, offset: 5376)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "usemonitor", scope: !285, file: !286, line: 28, baseType: !60, size: 32, offset: 5440)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !285, file: !286, line: 29, baseType: !311, size: 64, offset: 5504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !285, file: !286, line: 31, baseType: !60, size: 32, offset: 5568)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "usegts", scope: !285, file: !286, line: 32, baseType: !60, size: 32, offset: 5600)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "usetaoroutines", scope: !285, file: !286, line: 33, baseType: !60, size: 32, offset: 5632)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjective", scope: !285, file: !286, line: 34, baseType: !60, size: 32, offset: 5664)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hasgradient", scope: !285, file: !286, line: 35, baseType: !60, size: 32, offset: 5696)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjectiveandgradient", scope: !285, file: !286, line: 36, baseType: !60, size: 32, offset: 5728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !286, line: 37, baseType: !53, size: 64, offset: 5760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !285, file: !286, line: 40, baseType: !495, size: 64, offset: 5824)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !285, file: !286, line: 41, baseType: !495, size: 64, offset: 5888)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !285, file: !286, line: 42, baseType: !344, size: 32, offset: 5952)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !285, file: !286, line: 44, baseType: !495, size: 64, offset: 6016)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !285, file: !286, line: 45, baseType: !495, size: 64, offset: 6080)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "f_fullstep", scope: !285, file: !286, line: 46, baseType: !396, size: 64, offset: 6144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "new_f", scope: !285, file: !286, line: 47, baseType: !396, size: 64, offset: 6208)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "new_x", scope: !285, file: !286, line: 48, baseType: !495, size: 64, offset: 6272)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "new_g", scope: !285, file: !286, line: 49, baseType: !495, size: 64, offset: 6336)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !285, file: !286, line: 51, baseType: !396, size: 64, offset: 6400)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !285, file: !286, line: 52, baseType: !396, size: 64, offset: 6464)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !285, file: !286, line: 54, baseType: !344, size: 32, offset: 6528)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nfeval", scope: !285, file: !286, line: 55, baseType: !344, size: 32, offset: 6560)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ngeval", scope: !285, file: !286, line: 56, baseType: !344, size: 32, offset: 6592)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nfgeval", scope: !285, file: !286, line: 57, baseType: !344, size: 32, offset: 6624)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !285, file: !286, line: 58, baseType: !559, size: 32, offset: 6656)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearchConvergedReason", file: !33, line: 19, baseType: !32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !285, file: !286, line: 60, baseType: !396, size: 64, offset: 6720)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ftol", scope: !285, file: !286, line: 61, baseType: !396, size: 64, offset: 6784)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !285, file: !286, line: 62, baseType: !396, size: 64, offset: 6848)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stepmin", scope: !285, file: !286, line: 63, baseType: !396, size: 64, offset: 6912)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "stepmax", scope: !285, file: !286, line: 64, baseType: !396, size: 64, offset: 6976)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tao", scope: !285, file: !286, line: 66, baseType: !566, size: 64, offset: 7040)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !567, line: 118, baseType: !568)
!567 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !567, line: 118, flags: DIFlagFwdDecl)
!570 = !DISubprogram(name: "PetscLogEventRegister", scope: !571, file: !571, line: 388, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !137)
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!572 = !DISubroutineType(types: !573)
!573 = !{!34, !54, !34, !277}
!574 = !DISubprogram(name: "PetscRegisterFinalize", scope: !131, file: !131, line: 1509, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !137)
!575 = !DISubroutineType(types: !576)
!576 = !{!34, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!34}
