; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/localref/mlocalref.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/localref/mlocalref.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!325 = !{!326, !330, !331, !500, !534, !366, !389, !416}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !327, line: 330, baseType: !328)
!327 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !327, line: 330, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !334, line: 73, size: 4480, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !338, !387, !388, !390, !393, !394, !395, !396, !404, !405, !407, !411, !415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !428, !429, !430, !432, !433, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !449, !450, !453, !455, !456, !457, !467, !469, !470, !474, !475, !524, !529, !531, !532, !533}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !333, file: !334, line: 74, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !333, file: !334, line: 75, baseType: !339, size: 448, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 448, elements: !385)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !334, line: 53, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 45, size: 448, elements: !342)
!342 = !{!343, !349, !357, !362, !369, !373, !380}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !341, file: !334, line: 46, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !331, !348}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !341, file: !334, line: 47, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!347, !331, !353}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !354, line: 16, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !354, line: 16, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !341, file: !334, line: 48, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!347, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !341, file: !334, line: 49, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!347, !331, !366, !331}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !341, file: !334, line: 50, baseType: !370, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!347, !331, !366, !361}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !341, file: !334, line: 51, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!347, !331, !366, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !341, file: !334, line: 52, baseType: !381, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!347, !331, !366, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!385 = !{!386}
!386 = !DISubrange(count: 1)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !333, file: !334, line: 76, baseType: !326, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !334, line: 77, baseType: !389, size: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !392)
!392 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !333, file: !334, line: 78, baseType: !391, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !334, line: 79, baseType: !397, size: 64, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !400, line: 27, baseType: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !402, line: 43, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!403 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !333, file: !334, line: 80, baseType: !389, size: 32, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !333, file: !334, line: 81, baseType: !406, size: 32, offset: 992)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !333, file: !334, line: 82, baseType: !408, size: 64, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !333, file: !334, line: 83, baseType: !412, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !333, file: !334, line: 84, baseType: !416, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !333, file: !334, line: 85, baseType: !416, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !333, file: !334, line: 86, baseType: !416, size: 64, offset: 1280)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !333, file: !334, line: 87, baseType: !416, size: 64, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !333, file: !334, line: 88, baseType: !331, size: 64, offset: 1408)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !333, file: !334, line: 89, baseType: !397, size: 64, offset: 1472)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !334, line: 90, baseType: !416, size: 64, offset: 1536)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !333, file: !334, line: 91, baseType: !416, size: 64, offset: 1600)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !333, file: !334, line: 92, baseType: !389, size: 32, offset: 1664)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !333, file: !334, line: 93, baseType: !330, size: 64, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !334, line: 94, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !398)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !333, file: !334, line: 95, baseType: !389, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !333, file: !334, line: 95, baseType: !389, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !333, file: !334, line: 96, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !333, file: !334, line: 96, baseType: !431, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !333, file: !334, line: 97, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !333, file: !334, line: 97, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !333, file: !334, line: 98, baseType: !389, size: 32, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !333, file: !334, line: 98, baseType: !389, size: 32, offset: 2208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !333, file: !334, line: 99, baseType: !431, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !333, file: !334, line: 99, baseType: !431, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !333, file: !334, line: 100, baseType: !442, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !392)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !333, file: !334, line: 100, baseType: !445, size: 64, offset: 2432)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !333, file: !334, line: 101, baseType: !389, size: 32, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !333, file: !334, line: 101, baseType: !389, size: 32, offset: 2528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !333, file: !334, line: 102, baseType: !431, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !333, file: !334, line: 102, baseType: !431, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !333, file: !334, line: 103, baseType: !451, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !443)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !333, file: !334, line: 103, baseType: !454, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !333, file: !334, line: 104, baseType: !384, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !333, file: !334, line: 105, baseType: !389, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !333, file: !334, line: 106, baseType: !458, size: 128, offset: 2944)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !465)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !334, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 61, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !334, line: 62, baseType: !377, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !461, file: !334, line: 63, baseType: !330, size: 64, offset: 64)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !333, file: !334, line: 107, baseType: !468, size: 64, offset: 3072)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !465)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !333, file: !334, line: 108, baseType: !330, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !333, file: !334, line: 109, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!347, !330}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !333, file: !334, line: 111, baseType: !389, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !333, file: !334, line: 112, baseType: !476, size: 320, offset: 3328)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !522)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!347, !480, !331, !330}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !483)
!483 = !{!484, !485, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !10, line: 100, baseType: !389, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 101, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !497, !498, !499, !503, !505, !507, !508, !509}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !488, file: !10, line: 84, baseType: !416, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !488, file: !10, line: 85, baseType: !416, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !10, line: 86, baseType: !330, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !488, file: !10, line: 87, baseType: !408, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !488, file: !10, line: 88, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !488, file: !10, line: 89, baseType: !368, size: 8, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !488, file: !10, line: 90, baseType: !416, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !488, file: !10, line: 91, baseType: !500, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !501, line: 46, baseType: !502)
!501 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!502 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !10, line: 92, baseType: !504, size: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !10, line: 93, baseType: !506, size: 32, offset: 544)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 94, baseType: !486, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !488, file: !10, line: 95, baseType: !416, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !488, file: !10, line: 96, baseType: !330, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !482, file: !10, line: 102, baseType: !416, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !482, file: !10, line: 102, baseType: !416, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !482, file: !10, line: 103, baseType: !416, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !482, file: !10, line: 104, baseType: !326, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !482, file: !10, line: 105, baseType: !504, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !482, file: !10, line: 106, baseType: !331, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !482, file: !10, line: 107, baseType: !519, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!522 = !{!523}
!523 = !DISubrange(count: 5)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !333, file: !334, line: 113, baseType: !525, size: 320, offset: 3648)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!347, !331, !330}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !333, file: !334, line: 114, baseType: !530, size: 320, offset: 3968)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 320, elements: !522)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !333, file: !334, line: 115, baseType: !504, size: 32, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !333, file: !334, line: 120, baseType: !519, size: 64, offset: 4352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !333, file: !334, line: 121, baseType: !504, size: 32, offset: 4416)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LocalRef", file: !536, line: 10, baseType: !537)
!536 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/localref/mlocalref.c", directory: "/home/users/ndemeye/xSDK")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 4, size: 256, elements: !538)
!538 = !{!539, !1311, !1312, !1313, !1314}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Top", scope: !537, file: !536, line: 5, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !543, line: 436, size: 23424, elements: !544)
!543 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!544 = !{!545, !547, !1054, !1074, !1075, !1076, !1078, !1079, !1080, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1207, !1208, !1224, !1225, !1226, !1227, !1228, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1263, !1283, !1284, !1286, !1287, !1288, !1289, !1290, !1291, !1309, !1310}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !542, file: !543, line: 437, baseType: !546, size: 4480)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !334, line: 122, baseType: !333)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !542, file: !543, line: 437, baseType: !548, size: 9472, offset: 4480)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 9472, elements: !385)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !543, line: 32, size: 9472, elements: !550)
!550 = !{!551, !560, !564, !565, !572, !576, !577, !578, !579, !580, !581, !582, !606, !610, !615, !621, !640, !645, !649, !650, !655, !660, !661, !666, !670, !674, !678, !682, !686, !687, !688, !689, !690, !694, !695, !700, !701, !702, !703, !704, !709, !716, !721, !725, !729, !733, !737, !738, !742, !743, !750, !755, !756, !757, !758, !820, !828, !829, !833, !834, !838, !839, !843, !848, !849, !853, !857, !864, !865, !866, !867, !868, !869, !874, !875, !879, !883, !887, !888, !889, !893, !903, !904, !908, !909, !913, !914, !918, !919, !924, !925, !929, !933, !934, !935, !936, !937, !938, !939, !943, !944, !945, !946, !947, !948, !952, !953, !954, !955, !956, !957, !958, !959, !963, !967, !968, !969, !973, !974, !975, !976, !977, !978, !979, !983, !984, !985, !990, !994, !995, !999, !1000, !1001, !1002, !1028, !1032, !1033, !1034, !1035, !1036, !1040, !1041, !1042, !1043, !1044, !1048, !1052, !1053}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !549, file: !543, line: 34, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!347, !540, !389, !555, !389, !555, !557, !559}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !549, file: !543, line: 35, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!347, !540, !389, !434, !436, !454}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !549, file: !543, line: 36, baseType: !561, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !549, file: !543, line: 37, baseType: !566, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!347, !540, !569, !569}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !549, file: !543, line: 38, baseType: !573, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!347, !540, !569, !569, !569}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !549, file: !543, line: 40, baseType: !566, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !549, file: !543, line: 41, baseType: !573, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !549, file: !543, line: 42, baseType: !566, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !549, file: !543, line: 43, baseType: !573, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !549, file: !543, line: 44, baseType: !566, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !549, file: !543, line: 46, baseType: !573, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !549, file: !543, line: 47, baseType: !583, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!347, !540, !586, !586, !590}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !587, line: 11, baseType: !588)
!587 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !587, line: 11, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !593, file: !36, line: 1227, baseType: !443, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !593, file: !36, line: 1228, baseType: !443, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !593, file: !36, line: 1229, baseType: !443, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !593, file: !36, line: 1230, baseType: !443, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !593, file: !36, line: 1231, baseType: !443, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !593, file: !36, line: 1232, baseType: !443, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !593, file: !36, line: 1233, baseType: !443, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !593, file: !36, line: 1234, baseType: !443, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !593, file: !36, line: 1236, baseType: !443, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !593, file: !36, line: 1237, baseType: !443, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !593, file: !36, line: 1238, baseType: !443, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !549, file: !543, line: 48, baseType: !607, size: 64, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!347, !540, !586, !590}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !549, file: !543, line: 49, baseType: !611, size: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!347, !540, !569, !443, !614, !443, !389, !389, !569}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !549, file: !543, line: 50, baseType: !616, size: 64, offset: 896)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!347, !540, !619, !620}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !549, file: !543, line: 52, baseType: !622, size: 64, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!347, !540, !625, !626}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !628, file: !36, line: 593, baseType: !391, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !628, file: !36, line: 594, baseType: !391, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !628, file: !36, line: 594, baseType: !391, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !628, file: !36, line: 594, baseType: !391, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !628, file: !36, line: 595, baseType: !391, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !628, file: !36, line: 596, baseType: !391, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !628, file: !36, line: 597, baseType: !391, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !628, file: !36, line: 598, baseType: !391, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !628, file: !36, line: 598, baseType: !391, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !628, file: !36, line: 599, baseType: !391, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !549, file: !543, line: 53, baseType: !641, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!347, !540, !540, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !549, file: !543, line: 54, baseType: !646, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!347, !540, !569}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !549, file: !543, line: 55, baseType: !566, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !549, file: !543, line: 56, baseType: !651, size: 64, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!347, !540, !654, !442}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !549, file: !543, line: 58, baseType: !656, size: 64, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!347, !540, !659}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !549, file: !543, line: 59, baseType: !656, size: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !549, file: !543, line: 60, baseType: !662, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!347, !540, !665, !504}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !549, file: !543, line: 61, baseType: !667, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!347, !540}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !549, file: !543, line: 63, baseType: !671, size: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!347, !540, !389, !555, !452, !569, !569}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !549, file: !543, line: 64, baseType: !675, size: 64, offset: 1600)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!347, !540, !540, !586, !586, !590}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !549, file: !543, line: 65, baseType: !679, size: 64, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!347, !540, !540, !590}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !549, file: !543, line: 66, baseType: !683, size: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!347, !540, !540, !586, !590}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !549, file: !543, line: 67, baseType: !679, size: 64, offset: 1792)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !549, file: !543, line: 69, baseType: !667, size: 64, offset: 1856)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !549, file: !543, line: 70, baseType: !675, size: 64, offset: 1920)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !549, file: !543, line: 71, baseType: !683, size: 64, offset: 1984)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !549, file: !543, line: 72, baseType: !691, size: 64, offset: 2048)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!347, !540, !620}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !549, file: !543, line: 73, baseType: !667, size: 64, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !549, file: !543, line: 75, baseType: !696, size: 64, offset: 2176)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!347, !540, !699, !620}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !549, file: !543, line: 76, baseType: !566, size: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !549, file: !543, line: 77, baseType: !566, size: 64, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !549, file: !543, line: 78, baseType: !583, size: 64, offset: 2368)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !549, file: !543, line: 79, baseType: !607, size: 64, offset: 2432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !549, file: !543, line: 81, baseType: !705, size: 64, offset: 2496)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!347, !540, !452, !540, !708}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !549, file: !543, line: 82, baseType: !710, size: 64, offset: 2560)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!347, !540, !389, !713, !713, !619, !715}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !549, file: !543, line: 83, baseType: !717, size: 64, offset: 2624)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!347, !540, !389, !720, !389}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !549, file: !543, line: 84, baseType: !722, size: 64, offset: 2688)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!347, !540, !389, !555, !389, !555, !451}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !549, file: !543, line: 85, baseType: !726, size: 64, offset: 2752)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!347, !540, !540, !708}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !549, file: !543, line: 87, baseType: !730, size: 64, offset: 2816)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!347, !540, !569, !434}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !549, file: !543, line: 88, baseType: !734, size: 64, offset: 2880)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!347, !540, !452}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !549, file: !543, line: 89, baseType: !734, size: 64, offset: 2944)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !549, file: !543, line: 90, baseType: !739, size: 64, offset: 3008)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!347, !540, !569, !559}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !549, file: !543, line: 91, baseType: !671, size: 64, offset: 3072)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !549, file: !543, line: 93, baseType: !744, size: 64, offset: 3136)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!347, !540, !747}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !549, file: !543, line: 94, baseType: !751, size: 64, offset: 3200)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!347, !540, !389, !504, !504, !434, !754, !754, !644}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !549, file: !543, line: 95, baseType: !751, size: 64, offset: 3264)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !549, file: !543, line: 96, baseType: !751, size: 64, offset: 3328)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !549, file: !543, line: 97, baseType: !751, size: 64, offset: 3392)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !549, file: !543, line: 99, baseType: !759, size: 64, offset: 3456)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!347, !540, !762, !765}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !587, line: 51, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !587, line: 51, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !543, line: 609, size: 6208, elements: !768)
!768 = !{!769, !770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !789, !796, !797, !798, !799, !800, !801, !802, !803, !807, !808, !809, !810, !811, !813, !814, !815, !816, !817, !818, !819}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !767, file: !543, line: 610, baseType: !546, size: 4480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !767, file: !543, line: 610, baseType: !771, size: 32, offset: 4480)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !385)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !767, file: !543, line: 611, baseType: !389, size: 32, offset: 4512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !767, file: !543, line: 611, baseType: !389, size: 32, offset: 4544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !767, file: !543, line: 611, baseType: !389, size: 32, offset: 4576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !767, file: !543, line: 612, baseType: !389, size: 32, offset: 4608)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !767, file: !543, line: 613, baseType: !389, size: 32, offset: 4640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !767, file: !543, line: 614, baseType: !434, size: 64, offset: 4672)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !767, file: !543, line: 615, baseType: !436, size: 64, offset: 4736)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !767, file: !543, line: 616, baseType: !720, size: 64, offset: 4800)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !767, file: !543, line: 617, baseType: !434, size: 64, offset: 4864)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !767, file: !543, line: 618, baseType: !782, size: 64, offset: 4928)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !543, line: 602, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 598, size: 128, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !784, file: !543, line: 599, baseType: !389, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !784, file: !543, line: 600, baseType: !389, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !784, file: !543, line: 601, baseType: !451, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !767, file: !543, line: 619, baseType: !790, size: 64, offset: 4992)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !543, line: 607, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 604, size: 128, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !792, file: !543, line: 605, baseType: !389, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !792, file: !543, line: 606, baseType: !451, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !767, file: !543, line: 620, baseType: !451, size: 64, offset: 5056)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !767, file: !543, line: 621, baseType: !443, size: 64, offset: 5120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !767, file: !543, line: 622, baseType: !443, size: 64, offset: 5184)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !767, file: !543, line: 623, baseType: !569, size: 64, offset: 5248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !767, file: !543, line: 623, baseType: !569, size: 64, offset: 5312)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !767, file: !543, line: 623, baseType: !569, size: 64, offset: 5376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !767, file: !543, line: 624, baseType: !504, size: 32, offset: 5440)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !767, file: !543, line: 625, baseType: !804, size: 64, offset: 5504)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!347}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !767, file: !543, line: 626, baseType: !330, size: 64, offset: 5568)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !767, file: !543, line: 627, baseType: !569, size: 64, offset: 5632)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !767, file: !543, line: 628, baseType: !389, size: 32, offset: 5696)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !767, file: !543, line: 629, baseType: !366, size: 64, offset: 5760)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !767, file: !543, line: 630, baseType: !812, size: 32, offset: 5824)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !767, file: !543, line: 631, baseType: !389, size: 32, offset: 5856)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !767, file: !543, line: 631, baseType: !389, size: 32, offset: 5888)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !767, file: !543, line: 632, baseType: !504, size: 32, offset: 5920)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !767, file: !543, line: 633, baseType: !504, size: 32, offset: 5952)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !767, file: !543, line: 634, baseType: !377, size: 64, offset: 6016)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !767, file: !543, line: 634, baseType: !330, size: 64, offset: 6080)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !767, file: !543, line: 635, baseType: !397, size: 64, offset: 6144)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !549, file: !543, line: 100, baseType: !821, size: 64, offset: 3520)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!347, !540, !389, !389, !824, !827}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !826)
!826 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !549, file: !543, line: 101, baseType: !667, size: 64, offset: 3584)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !549, file: !543, line: 102, baseType: !830, size: 64, offset: 3648)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!347, !540, !586, !586, !620}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !549, file: !543, line: 103, baseType: !552, size: 64, offset: 3712)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !549, file: !543, line: 105, baseType: !835, size: 64, offset: 3776)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!347, !540, !586, !586, !619, !620}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !549, file: !543, line: 106, baseType: !667, size: 64, offset: 3840)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !549, file: !543, line: 107, baseType: !840, size: 64, offset: 3904)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!347, !540, !353}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !549, file: !543, line: 108, baseType: !844, size: 64, offset: 3968)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!347, !540, !847, !619, !620}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !366)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !549, file: !543, line: 109, baseType: !804, size: 64, offset: 4032)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !549, file: !543, line: 111, baseType: !850, size: 64, offset: 4096)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!347, !540, !540, !540, !443, !540}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !549, file: !543, line: 112, baseType: !854, size: 64, offset: 4160)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!347, !540, !540, !540, !540}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !549, file: !543, line: 113, baseType: !858, size: 64, offset: 4224)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!347, !540, !861, !861}
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !587, line: 30, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !587, line: 30, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !549, file: !543, line: 114, baseType: !552, size: 64, offset: 4288)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !549, file: !543, line: 115, baseType: !671, size: 64, offset: 4352)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !549, file: !543, line: 117, baseType: !730, size: 64, offset: 4416)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !549, file: !543, line: 118, baseType: !730, size: 64, offset: 4480)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !549, file: !543, line: 119, baseType: !844, size: 64, offset: 4544)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !549, file: !543, line: 120, baseType: !870, size: 64, offset: 4608)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!347, !540, !873, !644}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !549, file: !543, line: 121, baseType: !804, size: 64, offset: 4672)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !549, file: !543, line: 123, baseType: !876, size: 64, offset: 4736)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!347, !540, !389, !330}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !549, file: !543, line: 124, baseType: !880, size: 64, offset: 4800)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!347, !540, !765, !569, !330}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !549, file: !543, line: 125, baseType: !884, size: 64, offset: 4864)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!347, !480, !540}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !549, file: !543, line: 126, baseType: !566, size: 64, offset: 4928)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !549, file: !543, line: 127, baseType: !566, size: 64, offset: 4992)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !549, file: !543, line: 129, baseType: !890, size: 64, offset: 5056)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!347, !540, !720}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !549, file: !543, line: 130, baseType: !894, size: 64, offset: 5120)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!347, !540, !897, !897}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !899, file: !60, line: 653, baseType: !389, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !899, file: !60, line: 653, baseType: !569, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !549, file: !543, line: 131, baseType: !894, size: 64, offset: 5184)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !549, file: !543, line: 132, baseType: !905, size: 64, offset: 5248)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!347, !540, !434, !434, !434}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !549, file: !543, line: 133, baseType: !840, size: 64, offset: 5312)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !549, file: !543, line: 135, baseType: !910, size: 64, offset: 5376)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!347, !540, !443, !644}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !549, file: !543, line: 136, baseType: !910, size: 64, offset: 5440)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !549, file: !543, line: 137, baseType: !915, size: 64, offset: 5504)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!347, !540, !644}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !549, file: !543, line: 138, baseType: !552, size: 64, offset: 5568)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !549, file: !543, line: 139, baseType: !920, size: 64, offset: 5632)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!347, !540, !923, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !549, file: !543, line: 141, baseType: !804, size: 64, offset: 5696)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !549, file: !543, line: 142, baseType: !926, size: 64, offset: 5760)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!347, !540, !540, !443, !540}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !549, file: !543, line: 143, baseType: !930, size: 64, offset: 5824)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!347, !540, !540, !540}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !549, file: !543, line: 144, baseType: !804, size: 64, offset: 5888)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !549, file: !543, line: 145, baseType: !926, size: 64, offset: 5952)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !549, file: !543, line: 147, baseType: !930, size: 64, offset: 6016)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !549, file: !543, line: 148, baseType: !804, size: 64, offset: 6080)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !549, file: !543, line: 149, baseType: !926, size: 64, offset: 6144)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !549, file: !543, line: 150, baseType: !930, size: 64, offset: 6208)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !549, file: !543, line: 151, baseType: !940, size: 64, offset: 6272)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!347, !540, !504}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !549, file: !543, line: 153, baseType: !667, size: 64, offset: 6336)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !549, file: !543, line: 154, baseType: !667, size: 64, offset: 6400)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !549, file: !543, line: 155, baseType: !667, size: 64, offset: 6464)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !549, file: !543, line: 156, baseType: !667, size: 64, offset: 6528)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !549, file: !543, line: 157, baseType: !840, size: 64, offset: 6592)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !549, file: !543, line: 159, baseType: !949, size: 64, offset: 6656)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!347, !540, !389, !557}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !549, file: !543, line: 160, baseType: !667, size: 64, offset: 6720)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !549, file: !543, line: 161, baseType: !667, size: 64, offset: 6784)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !549, file: !543, line: 162, baseType: !667, size: 64, offset: 6848)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !549, file: !543, line: 163, baseType: !667, size: 64, offset: 6912)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !549, file: !543, line: 165, baseType: !930, size: 64, offset: 6976)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !549, file: !543, line: 166, baseType: !930, size: 64, offset: 7040)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !549, file: !543, line: 167, baseType: !730, size: 64, offset: 7104)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !549, file: !543, line: 168, baseType: !960, size: 64, offset: 7168)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!347, !540, !569, !389}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !549, file: !543, line: 169, baseType: !964, size: 64, offset: 7232)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!347, !540, !644, !434}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !549, file: !543, line: 171, baseType: !691, size: 64, offset: 7296)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !549, file: !543, line: 172, baseType: !667, size: 64, offset: 7360)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !549, file: !543, line: 173, baseType: !970, size: 64, offset: 7424)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!347, !540, !434, !754}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !549, file: !543, line: 174, baseType: !830, size: 64, offset: 7488)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !549, file: !543, line: 175, baseType: !830, size: 64, offset: 7552)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !549, file: !543, line: 177, baseType: !566, size: 64, offset: 7616)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !549, file: !543, line: 178, baseType: !616, size: 64, offset: 7680)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !549, file: !543, line: 179, baseType: !566, size: 64, offset: 7744)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !549, file: !543, line: 180, baseType: !573, size: 64, offset: 7808)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !549, file: !543, line: 181, baseType: !980, size: 64, offset: 7872)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!347, !540, !326, !619, !620}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !549, file: !543, line: 183, baseType: !890, size: 64, offset: 7936)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !549, file: !543, line: 184, baseType: !651, size: 64, offset: 8000)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !549, file: !543, line: 185, baseType: !986, size: 64, offset: 8064)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!347, !540, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !549, file: !543, line: 186, baseType: !991, size: 64, offset: 8128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!347, !540, !389, !555, !451}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !549, file: !543, line: 187, baseType: !710, size: 64, offset: 8192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !549, file: !543, line: 189, baseType: !996, size: 64, offset: 8256)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!347, !540, !389, !389, !434, !557}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !549, file: !543, line: 190, baseType: !804, size: 64, offset: 8320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !549, file: !543, line: 191, baseType: !926, size: 64, offset: 8384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !549, file: !543, line: 192, baseType: !930, size: 64, offset: 8448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !549, file: !543, line: 193, baseType: !1003, size: 64, offset: 8512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!347, !540, !762, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !543, line: 660, size: 5312, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1008, file: !543, line: 661, baseType: !546, size: 4480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1008, file: !543, line: 661, baseType: !771, size: 32, offset: 4480)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1008, file: !543, line: 662, baseType: !389, size: 32, offset: 4512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1008, file: !543, line: 662, baseType: !389, size: 32, offset: 4544)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1008, file: !543, line: 662, baseType: !389, size: 32, offset: 4576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1008, file: !543, line: 663, baseType: !389, size: 32, offset: 4608)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1008, file: !543, line: 664, baseType: !389, size: 32, offset: 4640)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1008, file: !543, line: 665, baseType: !434, size: 64, offset: 4672)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1008, file: !543, line: 666, baseType: !434, size: 64, offset: 4736)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1008, file: !543, line: 667, baseType: !389, size: 32, offset: 4800)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1008, file: !543, line: 668, baseType: !812, size: 32, offset: 4832)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1008, file: !543, line: 670, baseType: !434, size: 64, offset: 4864)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1008, file: !543, line: 670, baseType: !434, size: 64, offset: 4928)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1008, file: !543, line: 671, baseType: !434, size: 64, offset: 4992)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1008, file: !543, line: 672, baseType: !434, size: 64, offset: 5056)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1008, file: !543, line: 673, baseType: !434, size: 64, offset: 5120)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1008, file: !543, line: 674, baseType: !389, size: 32, offset: 5184)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1008, file: !543, line: 675, baseType: !434, size: 64, offset: 5248)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !549, file: !543, line: 195, baseType: !1029, size: 64, offset: 8576)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!347, !1006, !540, !540}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !549, file: !543, line: 196, baseType: !1029, size: 64, offset: 8640)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !549, file: !543, line: 197, baseType: !804, size: 64, offset: 8704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !549, file: !543, line: 198, baseType: !926, size: 64, offset: 8768)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !549, file: !543, line: 199, baseType: !930, size: 64, offset: 8832)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !549, file: !543, line: 201, baseType: !1037, size: 64, offset: 8896)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!347, !540, !389, !389}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !549, file: !543, line: 202, baseType: !705, size: 64, offset: 8960)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !549, file: !543, line: 203, baseType: !573, size: 64, offset: 9024)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !549, file: !543, line: 204, baseType: !759, size: 64, offset: 9088)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !549, file: !543, line: 205, baseType: !890, size: 64, offset: 9152)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !549, file: !543, line: 206, baseType: !1045, size: 64, offset: 9216)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!347, !326, !540, !389, !619, !620}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !549, file: !543, line: 208, baseType: !1049, size: 64, offset: 9280)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!347, !389, !715}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !549, file: !543, line: 209, baseType: !930, size: 64, offset: 9344)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !549, file: !543, line: 210, baseType: !722, size: 64, offset: 9408)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !542, file: !543, line: 438, baseType: !1055, size: 64, offset: 13952)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !587, line: 60, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1057, file: !114, line: 241, baseType: !326, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1057, file: !114, line: 242, baseType: !406, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1057, file: !114, line: 243, baseType: !389, size: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1057, file: !114, line: 243, baseType: !389, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1057, file: !114, line: 244, baseType: !389, size: 32, offset: 160)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1057, file: !114, line: 244, baseType: !389, size: 32, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1057, file: !114, line: 245, baseType: !434, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1057, file: !114, line: 246, baseType: !504, size: 32, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1057, file: !114, line: 247, baseType: !389, size: 32, offset: 352)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1057, file: !114, line: 251, baseType: !389, size: 32, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1057, file: !114, line: 252, baseType: !861, size: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1057, file: !114, line: 253, baseType: !504, size: 32, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1057, file: !114, line: 254, baseType: !389, size: 32, offset: 544)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1057, file: !114, line: 254, baseType: !389, size: 32, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1057, file: !114, line: 255, baseType: !389, size: 32, offset: 608)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !542, file: !543, line: 438, baseType: !1055, size: 64, offset: 14016)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !543, line: 439, baseType: !330, size: 64, offset: 14080)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !542, file: !543, line: 440, baseType: !1077, size: 32, offset: 14144)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !542, file: !543, line: 441, baseType: !504, size: 32, offset: 14176)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !542, file: !543, line: 442, baseType: !504, size: 32, offset: 14208)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !542, file: !543, line: 443, baseType: !1081, size: 448, offset: 14272)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 448, elements: !1083)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !366)
!1083 = !{!1084}
!1084 = !DISubrange(count: 7)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !542, file: !543, line: 444, baseType: !504, size: 32, offset: 14720)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !542, file: !543, line: 445, baseType: !504, size: 32, offset: 14752)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !542, file: !543, line: 446, baseType: !389, size: 32, offset: 14784)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !542, file: !543, line: 447, baseType: !427, size: 64, offset: 14848)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !542, file: !543, line: 448, baseType: !427, size: 64, offset: 14912)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !542, file: !543, line: 449, baseType: !627, size: 640, offset: 14976)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !542, file: !543, line: 450, baseType: !559, size: 32, offset: 15616)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !542, file: !543, line: 451, baseType: !1093, size: 2880, offset: 15680)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !543, line: 318, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !543, line: 319, size: 2880, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1115, !1116, !1121, !1126, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1141, !1142, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1174, !1175, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1198, !1199, !1200, !1204, !1205}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1094, file: !543, line: 320, baseType: !389, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1094, file: !543, line: 321, baseType: !389, size: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1094, file: !543, line: 322, baseType: !389, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1094, file: !543, line: 323, baseType: !389, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1094, file: !543, line: 324, baseType: !389, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1094, file: !543, line: 325, baseType: !389, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1094, file: !543, line: 326, baseType: !1103, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !543, line: 293, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !543, line: 295, size: 448, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !543, line: 296, baseType: !1103, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1105, file: !543, line: 297, baseType: !451, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1105, file: !543, line: 297, baseType: !451, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1105, file: !543, line: 298, baseType: !434, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1105, file: !543, line: 298, baseType: !434, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1105, file: !543, line: 299, baseType: !389, size: 32, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1105, file: !543, line: 300, baseType: !389, size: 32, offset: 352)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1105, file: !543, line: 301, baseType: !389, size: 32, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1094, file: !543, line: 326, baseType: !1103, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1094, file: !543, line: 328, baseType: !1117, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!347, !540, !1120, !434}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1094, file: !543, line: 329, baseType: !1122, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!347, !1120, !1125, !436, !436, !454, !434}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1094, file: !543, line: 330, baseType: !1127, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!347, !1120}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1094, file: !543, line: 331, baseType: !1127, size: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1094, file: !543, line: 334, baseType: !326, size: 64, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !543, line: 335, baseType: !406, size: 32, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1094, file: !543, line: 335, baseType: !406, size: 32, offset: 672)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1094, file: !543, line: 336, baseType: !406, size: 32, offset: 704)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1094, file: !543, line: 336, baseType: !406, size: 32, offset: 736)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1094, file: !543, line: 337, baseType: !1137, size: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !327, line: 339, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !327, line: 339, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1094, file: !543, line: 338, baseType: !1137, size: 64, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1094, file: !543, line: 339, baseType: !1143, size: 64, offset: 896)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !327, line: 341, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !327, line: 351, size: 192, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1145, file: !327, line: 354, baseType: !72, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1145, file: !327, line: 355, baseType: !72, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1145, file: !327, line: 356, baseType: !72, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1145, file: !327, line: 361, baseType: !72, size: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1145, file: !327, line: 362, baseType: !500, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1094, file: !543, line: 340, baseType: !389, size: 32, offset: 960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1094, file: !543, line: 340, baseType: !389, size: 32, offset: 992)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1094, file: !543, line: 341, baseType: !451, size: 64, offset: 1024)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1094, file: !543, line: 342, baseType: !434, size: 64, offset: 1088)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1094, file: !543, line: 343, baseType: !454, size: 64, offset: 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1094, file: !543, line: 344, baseType: !436, size: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1094, file: !543, line: 345, baseType: !389, size: 32, offset: 1280)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1094, file: !543, line: 346, baseType: !1125, size: 64, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1094, file: !543, line: 347, baseType: !504, size: 32, offset: 1408)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1094, file: !543, line: 348, baseType: !389, size: 32, offset: 1440)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1094, file: !543, line: 351, baseType: !504, size: 32, offset: 1472)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1094, file: !543, line: 352, baseType: !504, size: 32, offset: 1504)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1094, file: !543, line: 353, baseType: !406, size: 32, offset: 1536)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1094, file: !543, line: 354, baseType: !406, size: 32, offset: 1568)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1094, file: !543, line: 355, baseType: !1125, size: 64, offset: 1600)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1094, file: !543, line: 356, baseType: !1125, size: 64, offset: 1664)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1094, file: !543, line: 357, baseType: !1169, size: 64, offset: 1728)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !543, line: 310, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 308, size: 32, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1171, file: !543, line: 309, baseType: !389, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1094, file: !543, line: 357, baseType: !1169, size: 64, offset: 1792)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1094, file: !543, line: 358, baseType: !1176, size: 64, offset: 1856)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !543, line: 316, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 312, size: 128, elements: !1179)
!1179 = !{!1180, !1181, !1182}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1178, file: !543, line: 313, baseType: !330, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1178, file: !543, line: 314, baseType: !389, size: 32, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1178, file: !543, line: 315, baseType: !368, size: 8, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1094, file: !543, line: 359, baseType: !1176, size: 64, offset: 1920)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1094, file: !543, line: 360, baseType: !1176, size: 64, offset: 1984)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1094, file: !543, line: 361, baseType: !389, size: 32, offset: 2048)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1094, file: !543, line: 362, baseType: !406, size: 32, offset: 2080)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1094, file: !543, line: 363, baseType: !389, size: 32, offset: 2112)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1094, file: !543, line: 364, baseType: !1125, size: 64, offset: 2176)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1094, file: !543, line: 365, baseType: !1143, size: 64, offset: 2240)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1094, file: !543, line: 366, baseType: !406, size: 32, offset: 2304)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1094, file: !543, line: 367, baseType: !406, size: 32, offset: 2336)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1094, file: !543, line: 368, baseType: !1137, size: 64, offset: 2368)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1094, file: !543, line: 369, baseType: !1137, size: 64, offset: 2432)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1094, file: !543, line: 370, baseType: !1195, size: 64, offset: 2496)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1094, file: !543, line: 371, baseType: !1195, size: 64, offset: 2560)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1094, file: !543, line: 372, baseType: !1195, size: 64, offset: 2624)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1094, file: !543, line: 373, baseType: !1201, size: 64, offset: 2688)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !327, line: 331, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !327, line: 331, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1094, file: !543, line: 374, baseType: !500, size: 64, offset: 2752)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1094, file: !543, line: 375, baseType: !1206, size: 64, offset: 2816)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !542, file: !543, line: 451, baseType: !1093, size: 2880, offset: 18560)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !542, file: !543, line: 452, baseType: !1209, size: 64, offset: 21440)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !543, line: 681, size: 4864, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217, !1218, !1219, !1223}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1211, file: !543, line: 682, baseType: !546, size: 4480)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1211, file: !543, line: 682, baseType: !771, size: 32, offset: 4480)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1211, file: !543, line: 683, baseType: !504, size: 32, offset: 4512)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1211, file: !543, line: 684, baseType: !389, size: 32, offset: 4544)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1211, file: !543, line: 685, baseType: !923, size: 64, offset: 4608)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1211, file: !543, line: 686, baseType: !451, size: 64, offset: 4672)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1211, file: !543, line: 687, baseType: !1220, size: 64, offset: 4736)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!347, !1209, !569, !330}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1211, file: !543, line: 688, baseType: !330, size: 64, offset: 4800)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !542, file: !543, line: 453, baseType: !1209, size: 64, offset: 21504)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !542, file: !543, line: 454, baseType: !1209, size: 64, offset: 21568)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !542, file: !543, line: 455, baseType: !389, size: 32, offset: 21632)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !542, file: !543, line: 456, baseType: !504, size: 32, offset: 21664)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !542, file: !543, line: 457, baseType: !1229, size: 320, offset: 21696)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !543, line: 399, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 394, size: 320, elements: !1231)
!1231 = !{!1232, !1233, !1237, !1238}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1230, file: !543, line: 395, baseType: !389, size: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1230, file: !543, line: 396, baseType: !1234, size: 128, offset: 32)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !1235)
!1235 = !{!1236}
!1236 = !DISubrange(count: 4)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1230, file: !543, line: 397, baseType: !1234, size: 128, offset: 160)
