; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/space/impls/poly/spacepoly.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/space/impls/poly/spacepoly.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSpace = type { %struct._p_PetscObject, [1 x %struct._PetscSpaceOps], i8*, i32, i32, i32, i32, i32, %struct._p_DM* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!46 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 140, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 42, baseType: !7, size: 32, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 60, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!66 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!67 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 663, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!76 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 29, baseType: !7, size: 32, elements: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfetypes.h", directory: "/home/users/ndemeye/xSDK")
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "PETSCSPACE_POLYNOMIALTYPE_P", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSCSPACE_POLYNOMIALTYPE_PMINUS_HDIV", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSCSPACE_POLYNOMIALTYPE_PMINUS_HCURL", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !101)
!101 = !{!102}
!102 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!103 = !{!104, !108, !109, !313, !145, !279, !316, !314, !1118, !1119, !222, !168, !1120, !195}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !105, line: 330, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !105, line: 330, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !112, line: 73, size: 4480, elements: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!113 = !{!114, !117, !166, !167, !169, !172, !173, !174, !175, !183, !184, !186, !190, !194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !207, !208, !209, !211, !212, !214, !216, !217, !218, !219, !220, !223, !225, !226, !227, !228, !229, !232, !234, !235, !236, !246, !248, !249, !253, !254, !303, !308, !310, !311, !312}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !111, file: !112, line: 74, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !116)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !111, file: !112, line: 75, baseType: !118, size: 448, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 448, elements: !164)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !112, line: 53, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 45, size: 448, elements: !121)
!121 = !{!122, !128, !136, !141, !148, !152, !159}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !120, file: !112, line: 46, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !109, !127}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !116)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !120, file: !112, line: 47, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!126, !109, !132}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !133, line: 16, baseType: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !133, line: 16, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !120, file: !112, line: 48, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!126, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !120, file: !112, line: 49, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!126, !109, !145, !109}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !120, file: !112, line: 50, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!126, !109, !145, !140}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !120, file: !112, line: 51, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!126, !109, !145, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !120, file: !112, line: 52, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!126, !109, !145, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!164 = !{!165}
!165 = !DISubrange(count: 1)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !111, file: !112, line: 76, baseType: !104, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !112, line: 77, baseType: !168, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !116)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !171)
!171 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !111, file: !112, line: 78, baseType: !170, size: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !112, line: 79, baseType: !176, size: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !179, line: 27, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !181, line: 43, baseType: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!182 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !111, file: !112, line: 80, baseType: !168, size: 32, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !112, line: 81, baseType: !185, size: 32, offset: 992)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !116)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !111, file: !112, line: 82, baseType: !187, size: 64, offset: 1024)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !111, file: !112, line: 83, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !111, file: !112, line: 84, baseType: !195, size: 64, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !111, file: !112, line: 85, baseType: !195, size: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !111, file: !112, line: 86, baseType: !195, size: 64, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !111, file: !112, line: 87, baseType: !195, size: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !112, line: 88, baseType: !109, size: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !111, file: !112, line: 89, baseType: !176, size: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !112, line: 90, baseType: !195, size: 64, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !111, file: !112, line: 91, baseType: !195, size: 64, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !111, file: !112, line: 92, baseType: !168, size: 32, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !111, file: !112, line: 93, baseType: !108, size: 64, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !111, file: !112, line: 94, baseType: !206, size: 64, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !177)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !111, file: !112, line: 95, baseType: !168, size: 32, offset: 1856)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !111, file: !112, line: 95, baseType: !168, size: 32, offset: 1888)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !111, file: !112, line: 96, baseType: !210, size: 64, offset: 1920)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !111, file: !112, line: 96, baseType: !210, size: 64, offset: 1984)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !111, file: !112, line: 97, baseType: !213, size: 64, offset: 2048)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !111, file: !112, line: 97, baseType: !215, size: 64, offset: 2112)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !111, file: !112, line: 98, baseType: !168, size: 32, offset: 2176)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !111, file: !112, line: 98, baseType: !168, size: 32, offset: 2208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !111, file: !112, line: 99, baseType: !210, size: 64, offset: 2240)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !111, file: !112, line: 99, baseType: !210, size: 64, offset: 2304)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !111, file: !112, line: 100, baseType: !221, size: 64, offset: 2368)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !171)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !111, file: !112, line: 100, baseType: !224, size: 64, offset: 2432)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !111, file: !112, line: 101, baseType: !168, size: 32, offset: 2496)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !111, file: !112, line: 101, baseType: !168, size: 32, offset: 2528)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !111, file: !112, line: 102, baseType: !210, size: 64, offset: 2560)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !111, file: !112, line: 102, baseType: !210, size: 64, offset: 2624)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !111, file: !112, line: 103, baseType: !230, size: 64, offset: 2688)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !222)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !111, file: !112, line: 103, baseType: !233, size: 64, offset: 2752)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !111, file: !112, line: 104, baseType: !163, size: 64, offset: 2816)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !111, file: !112, line: 105, baseType: !168, size: 32, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !111, file: !112, line: 106, baseType: !237, size: 128, offset: 2944)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, elements: !244)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !112, line: 64, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 61, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !240, file: !112, line: 62, baseType: !156, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !240, file: !112, line: 63, baseType: !108, size: 64, offset: 64)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !111, file: !112, line: 107, baseType: !247, size: 64, offset: 3072)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !244)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !111, file: !112, line: 108, baseType: !108, size: 64, offset: 3136)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !111, file: !112, line: 109, baseType: !250, size: 64, offset: 3200)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!126, !108}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !111, file: !112, line: 111, baseType: !168, size: 32, offset: 3264)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !111, file: !112, line: 112, baseType: !255, size: 320, offset: 3328)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 320, elements: !301)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!126, !259, !109, !108}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !262)
!262 = !{!263, !264, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !12, line: 100, baseType: !168, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !12, line: 101, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !276, !277, !278, !282, !284, !286, !287, !288}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !267, file: !12, line: 84, baseType: !195, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !267, file: !12, line: 85, baseType: !195, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !12, line: 86, baseType: !108, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !267, file: !12, line: 87, baseType: !187, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !267, file: !12, line: 88, baseType: !274, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !267, file: !12, line: 89, baseType: !147, size: 8, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !267, file: !12, line: 90, baseType: !195, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !267, file: !12, line: 91, baseType: !279, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !280, line: 46, baseType: !281)
!280 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!281 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !267, file: !12, line: 92, baseType: !283, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !12, line: 93, baseType: !285, size: 32, offset: 544)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !12, line: 94, baseType: !265, size: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !267, file: !12, line: 95, baseType: !195, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !267, file: !12, line: 96, baseType: !108, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !261, file: !12, line: 102, baseType: !195, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !261, file: !12, line: 102, baseType: !195, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !261, file: !12, line: 103, baseType: !195, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !261, file: !12, line: 104, baseType: !104, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !261, file: !12, line: 105, baseType: !283, size: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !261, file: !12, line: 106, baseType: !109, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !261, file: !12, line: 107, baseType: !298, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!301 = !{!302}
!302 = !DISubrange(count: 5)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !111, file: !112, line: 113, baseType: !304, size: 320, offset: 3648)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 320, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!126, !109, !108}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !111, file: !112, line: 114, baseType: !309, size: 320, offset: 3968)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, elements: !301)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !111, file: !112, line: 115, baseType: !283, size: 32, offset: 4288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !111, file: !112, line: 120, baseType: !298, size: 64, offset: 4352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !111, file: !112, line: 121, baseType: !283, size: 32, offset: 4416)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !315, line: 1451, baseType: !156)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSpace_Poly", file: !318, line: 54, baseType: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscfeimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 47, size: 256, elements: !320)
!320 = !{!321, !322, !323, !324, !326, !327}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !319, file: !318, line: 48, baseType: !283, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tensor", scope: !319, file: !318, line: 49, baseType: !283, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "degrees", scope: !319, file: !318, line: 50, baseType: !213, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !319, file: !318, line: 51, baseType: !325, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSpacePolynomialType", file: !95, line: 29, baseType: !94)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "setupCalled", scope: !319, file: !318, line: 52, baseType: !283, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "subspaces", scope: !319, file: !318, line: 53, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSpace", file: !95, line: 11, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSpace", file: !318, line: 36, size: 5248, elements: !332)
!332 = !{!333, !335, !366, !367, !368, !369, !370, !371, !372}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !331, file: !318, line: 37, baseType: !334, size: 4480)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !112, line: 122, baseType: !111)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !331, file: !318, line: 37, baseType: !336, size: 448, offset: 4480)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 448, elements: !164)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSpaceOps", file: !318, line: 25, size: 448, elements: !338)
!338 = !{!339, !343, !347, !351, !352, !356, !362}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !337, file: !318, line: 26, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!126, !259, !329}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !337, file: !318, line: 27, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!126, !329}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !337, file: !318, line: 28, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!126, !329, !132}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !337, file: !318, line: 29, baseType: !344, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "getdimension", scope: !337, file: !318, line: 31, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!126, !329, !213}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "evaluate", scope: !337, file: !318, line: 32, baseType: !357, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!126, !329, !168, !360, !221, !221, !221}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "getheightsubspace", scope: !337, file: !318, line: 33, baseType: !363, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!126, !329, !168, !328}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !318, line: 38, baseType: !108, size: 64, offset: 4928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !331, file: !318, line: 39, baseType: !168, size: 32, offset: 4992)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "maxDegree", scope: !331, file: !318, line: 40, baseType: !168, size: 32, offset: 5024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !331, file: !318, line: 41, baseType: !168, size: 32, offset: 5056)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !331, file: !318, line: 42, baseType: !168, size: 32, offset: 5088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !331, file: !318, line: 43, baseType: !168, size: 32, offset: 5120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !331, file: !318, line: 44, baseType: !373, size: 64, offset: 5184)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !43, line: 14, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !49, line: 202, size: 40000, elements: !376)
!376 = !{!377, !378, !613, !617, !618, !619, !620, !630, !631, !639, !640, !648, !649, !650, !651, !655, !656, !660, !662, !664, !665, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !693, !705, !717, !729, !738, !739, !762, !763, !764, !765, !766, !767, !769, !860, !861, !881, !882, !883, !884, !885, !886, !890, !891, !895, !896, !897, !898, !899, !900, !901, !902, !903, !906, !918, !919, !920, !929, !1017, !1018, !1106, !1107, !1108, !1109, !1111, !1113, !1114, !1115, !1116, !1117}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !375, file: !49, line: 203, baseType: !334, size: 4480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !375, file: !49, line: 203, baseType: !379, size: 3456, offset: 4480)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 3456, elements: !164)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !49, line: 30, size: 3456, elements: !381)
!381 = !{!382, !386, !387, !392, !396, !400, !401, !402, !411, !412, !413, !425, !426, !434, !443, !452, !456, !460, !461, !466, !467, !471, !472, !476, !477, !485, !489, !494, !495, !496, !497, !498, !499, !500, !504, !510, !514, !519, !523, !534, !538, !543, !550, !554, !555, !561, !570, !574, !584, !588, !596, !600, !608, !609}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !49, line: 31, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!126, !373, !132}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !380, file: !49, line: 32, baseType: !383, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !380, file: !49, line: 33, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!126, !373, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !380, file: !49, line: 34, baseType: !393, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!126, !259, !373}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !380, file: !49, line: 35, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!126, !373}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !380, file: !49, line: 36, baseType: !397, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !380, file: !49, line: 37, baseType: !397, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !380, file: !49, line: 38, baseType: !403, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!126, !373, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !408, line: 21, baseType: !409)
!408 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !408, line: 21, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !380, file: !49, line: 39, baseType: !403, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !380, file: !49, line: 40, baseType: !397, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !380, file: !49, line: 41, baseType: !414, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!126, !373, !213, !417, !419}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !422, line: 11, baseType: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !422, line: 11, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !380, file: !49, line: 42, baseType: !388, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !380, file: !49, line: 43, baseType: !427, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!126, !373, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !43, line: 165, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !43, line: 165, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !380, file: !49, line: 45, baseType: !435, size: 64, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!126, !373, !438, !439}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !27, line: 213, baseType: !26)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !422, line: 51, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !422, line: 51, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !380, file: !49, line: 46, baseType: !444, size: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!126, !373, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !449, line: 16, baseType: !450)
!449 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !449, line: 16, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !380, file: !49, line: 47, baseType: !453, size: 64, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!126, !373, !373, !447, !406}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !380, file: !49, line: 48, baseType: !457, size: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!126, !373, !373, !447}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !380, file: !49, line: 49, baseType: !457, size: 64, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !380, file: !49, line: 50, baseType: !462, size: 64, offset: 1152)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!126, !373, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !380, file: !49, line: 51, baseType: !457, size: 64, offset: 1216)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !380, file: !49, line: 53, baseType: !468, size: 64, offset: 1280)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!126, !373, !104, !391}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !380, file: !49, line: 54, baseType: !468, size: 64, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !380, file: !49, line: 55, baseType: !473, size: 64, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!126, !373, !168, !391}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !380, file: !49, line: 56, baseType: !473, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !380, file: !49, line: 57, baseType: !478, size: 64, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!126, !373, !481, !391}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !482, line: 12, baseType: !483)
!482 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !482, line: 12, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !380, file: !49, line: 58, baseType: !486, size: 64, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!126, !373, !407, !481, !391}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !380, file: !49, line: 60, baseType: !490, size: 64, offset: 1664)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!126, !373, !407, !493, !407}
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !31)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !380, file: !49, line: 61, baseType: !490, size: 64, offset: 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !380, file: !49, line: 62, baseType: !490, size: 64, offset: 1792)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !380, file: !49, line: 63, baseType: !490, size: 64, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !380, file: !49, line: 64, baseType: !490, size: 64, offset: 1920)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !380, file: !49, line: 65, baseType: !490, size: 64, offset: 1984)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !380, file: !49, line: 67, baseType: !397, size: 64, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !380, file: !49, line: 69, baseType: !501, size: 64, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!126, !373, !407, !407}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !380, file: !49, line: 71, baseType: !505, size: 64, offset: 2176)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!126, !373, !168, !508, !420, !391}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !380, file: !49, line: 72, baseType: !511, size: 64, offset: 2240)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!126, !391, !168, !419, !391}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !380, file: !49, line: 73, baseType: !515, size: 64, offset: 2304)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!126, !373, !213, !417, !419, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !380, file: !49, line: 74, baseType: !520, size: 64, offset: 2368)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!126, !373, !213, !417, !419, !419, !518}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !380, file: !49, line: 75, baseType: !524, size: 64, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!126, !373, !168, !391, !527, !527, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !530, line: 59, baseType: !531)
!530 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !530, line: 15, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !530, line: 15, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !380, file: !49, line: 77, baseType: !535, size: 64, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!126, !373, !168, !213, !213}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !380, file: !49, line: 78, baseType: !539, size: 64, offset: 2560)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!126, !373, !407, !542, !531}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !43, line: 74, baseType: !42)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !380, file: !49, line: 79, baseType: !544, size: 64, offset: 2624)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!126, !373, !213, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !380, file: !49, line: 80, baseType: !551, size: 64, offset: 2688)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!126, !373, !221, !221}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !380, file: !49, line: 81, baseType: !551, size: 64, offset: 2752)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !380, file: !49, line: 82, baseType: !556, size: 64, offset: 2816)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!126, !373, !407, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !380, file: !49, line: 84, baseType: !562, size: 64, offset: 2880)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!126, !373, !222, !565, !569, !493, !407}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!126, !168, !222, !360, !168, !230, !108}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !380, file: !49, line: 85, baseType: !571, size: 64, offset: 2944)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!126, !373, !222, !481, !168, !508, !168, !508, !565, !569, !493, !407}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !380, file: !49, line: 86, baseType: !575, size: 64, offset: 3008)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!126, !373, !222, !407, !578, !493, !407}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !168, !168, !168, !508, !508, !582, !582, !582, !508, !508, !582, !582, !582, !222, !360, !168, !582, !230}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !380, file: !49, line: 87, baseType: !585, size: 64, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!126, !373, !222, !481, !168, !508, !168, !508, !407, !578, !493, !407}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !380, file: !49, line: 88, baseType: !589, size: 64, offset: 3136)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!126, !373, !222, !481, !168, !508, !168, !508, !407, !592, !493, !407}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !168, !168, !168, !508, !508, !582, !582, !582, !508, !508, !582, !582, !582, !222, !360, !360, !168, !582, !230}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !380, file: !49, line: 89, baseType: !597, size: 64, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!126, !373, !222, !565, !569, !407, !221}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !380, file: !49, line: 90, baseType: !601, size: 64, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!126, !373, !222, !604, !569, !407, !360, !221}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!126, !168, !222, !360, !360, !168, !230, !108}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !380, file: !49, line: 91, baseType: !597, size: 64, offset: 3328)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !380, file: !49, line: 93, baseType: !610, size: 64, offset: 3392)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!126, !373, !373, !465, !465}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !375, file: !49, line: 204, baseType: !614, size: 6400, offset: 7936)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 6400, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 100)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !375, file: !49, line: 204, baseType: !614, size: 6400, offset: 14336)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !375, file: !49, line: 205, baseType: !614, size: 6400, offset: 20736)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !375, file: !49, line: 205, baseType: !614, size: 6400, offset: 27136)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !375, file: !49, line: 206, baseType: !621, size: 64, offset: 33536)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !49, line: 141, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !49, line: 142, size: 256, elements: !624)
!624 = !{!625, !626, !627, !629}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !623, file: !49, line: 143, baseType: !407, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !49, line: 144, baseType: !195, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !623, file: !49, line: 145, baseType: !628, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !49, line: 140, baseType: !48)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !49, line: 146, baseType: !621, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !375, file: !49, line: 207, baseType: !621, size: 64, offset: 33600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !375, file: !49, line: 208, baseType: !632, size: 64, offset: 33664)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !49, line: 149, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !49, line: 150, size: 192, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !634, file: !49, line: 151, baseType: !279, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !634, file: !49, line: 152, baseType: !108, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !634, file: !49, line: 153, baseType: !632, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !375, file: !49, line: 208, baseType: !632, size: 64, offset: 33728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !375, file: !49, line: 209, baseType: !641, size: 64, offset: 33792)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !49, line: 163, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !49, line: 158, size: 192, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !643, file: !49, line: 159, baseType: !481, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !643, file: !49, line: 160, baseType: !283, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !49, line: 161, baseType: !642, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !375, file: !49, line: 210, baseType: !481, size: 64, offset: 33856)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !375, file: !49, line: 211, baseType: !481, size: 64, offset: 33920)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !375, file: !49, line: 212, baseType: !108, size: 64, offset: 33984)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !375, file: !49, line: 213, baseType: !652, size: 64, offset: 34048)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!126, !569}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !375, file: !49, line: 214, baseType: !438, size: 32, offset: 34112)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !375, file: !49, line: 215, baseType: !657, size: 64, offset: 34176)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !449, line: 1378, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !449, line: 1378, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !375, file: !49, line: 216, baseType: !661, size: 64, offset: 34240)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !408, line: 83, baseType: !145)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !375, file: !49, line: 217, baseType: !663, size: 64, offset: 34304)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !449, line: 25, baseType: !145)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !375, file: !49, line: 218, baseType: !168, size: 32, offset: 34368)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !375, file: !49, line: 219, baseType: !666, size: 64, offset: 34432)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !422, line: 30, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !422, line: 30, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !375, file: !49, line: 220, baseType: !283, size: 32, offset: 34496)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !375, file: !49, line: 221, baseType: !283, size: 32, offset: 34528)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !375, file: !49, line: 222, baseType: !168, size: 32, offset: 34560)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !375, file: !49, line: 222, baseType: !168, size: 32, offset: 34592)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !375, file: !49, line: 223, baseType: !283, size: 32, offset: 34624)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !375, file: !49, line: 224, baseType: !283, size: 32, offset: 34656)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !49, line: 225, baseType: !108, size: 64, offset: 34688)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !375, file: !49, line: 227, baseType: !373, size: 64, offset: 34752)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !375, file: !49, line: 228, baseType: !373, size: 64, offset: 34816)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !375, file: !49, line: 229, baseType: !679, size: 64, offset: 34880)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !49, line: 100, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !49, line: 101, size: 256, elements: !682)
!682 = !{!683, !687, !691, !692}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !681, file: !49, line: 102, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!126, !373, !373, !108}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !681, file: !49, line: 103, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!126, !373, !448, !407, !448, !373, !108}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !681, file: !49, line: 104, baseType: !108, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !681, file: !49, line: 105, baseType: !679, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !375, file: !49, line: 230, baseType: !694, size: 64, offset: 34944)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !49, line: 108, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !49, line: 109, size: 256, elements: !697)
!697 = !{!698, !699, !703, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !696, file: !49, line: 110, baseType: !684, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !696, file: !49, line: 111, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!126, !373, !448, !373, !108}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !696, file: !49, line: 112, baseType: !108, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !696, file: !49, line: 113, baseType: !694, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !375, file: !49, line: 231, baseType: !706, size: 64, offset: 35008)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !49, line: 116, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !49, line: 117, size: 256, elements: !709)
!709 = !{!710, !711, !715, !716}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !708, file: !49, line: 118, baseType: !684, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !708, file: !49, line: 119, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!126, !373, !529, !529, !373, !108}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !708, file: !49, line: 120, baseType: !108, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !49, line: 121, baseType: !706, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !375, file: !49, line: 232, baseType: !718, size: 64, offset: 35072)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !49, line: 124, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !49, line: 125, size: 256, elements: !721)
!721 = !{!722, !726, !727, !728}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !720, file: !49, line: 126, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!126, !373, !407, !493, !407, !108}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !720, file: !49, line: 127, baseType: !723, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !720, file: !49, line: 128, baseType: !108, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !49, line: 129, baseType: !718, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !375, file: !49, line: 233, baseType: !730, size: 64, offset: 35136)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !49, line: 132, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !49, line: 133, size: 256, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !732, file: !49, line: 134, baseType: !723, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !732, file: !49, line: 135, baseType: !723, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !732, file: !49, line: 136, baseType: !108, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !49, line: 137, baseType: !730, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !375, file: !49, line: 235, baseType: !168, size: 32, offset: 35200)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !375, file: !49, line: 237, baseType: !740, size: 64, offset: 35264)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !49, line: 27, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !49, line: 27, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !49, line: 27, size: 320, elements: !744)
!744 = !{!745, !749, !750, !751, !752, !754, !761}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !743, file: !49, line: 27, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !747, line: 166, baseType: !748)
!747 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !747, line: 139, baseType: !7)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !49, line: 27, baseType: !746, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !743, file: !49, line: 27, baseType: !746, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !743, file: !49, line: 27, baseType: !746, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !743, file: !49, line: 27, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !743, file: !49, line: 27, baseType: !755, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !49, line: 21, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !49, line: 17, size: 128, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !757, file: !49, line: 19, baseType: !481, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !757, file: !49, line: 20, baseType: !168, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !743, file: !49, line: 27, baseType: !406, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !375, file: !49, line: 239, baseType: !531, size: 64, offset: 35328)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !375, file: !49, line: 240, baseType: !531, size: 64, offset: 35392)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !375, file: !49, line: 241, baseType: !531, size: 64, offset: 35456)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !375, file: !49, line: 242, baseType: !531, size: 64, offset: 35520)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !375, file: !49, line: 243, baseType: !283, size: 32, offset: 35584)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !375, file: !49, line: 245, baseType: !768, size: 64, offset: 35616)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !244)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !375, file: !49, line: 246, baseType: !770, size: 64, offset: 35712)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !771, line: 18, baseType: !772)
!771 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !774, line: 29, size: 5760, elements: !775)
!774 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!775 = !{!776, !777, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !795, !796, !797, !798, !823, !824, !825}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !773, file: !774, line: 30, baseType: !334, size: 4480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !773, file: !774, line: 30, baseType: !778, size: 32, offset: 4480)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, elements: !164)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !773, file: !774, line: 31, baseType: !168, size: 32, offset: 4512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !773, file: !774, line: 31, baseType: !168, size: 32, offset: 4544)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !773, file: !774, line: 32, baseType: !421, size: 64, offset: 4608)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !773, file: !774, line: 33, baseType: !283, size: 32, offset: 4672)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !773, file: !774, line: 34, baseType: !283, size: 32, offset: 4704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !773, file: !774, line: 35, baseType: !213, size: 64, offset: 4736)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !773, file: !774, line: 36, baseType: !213, size: 64, offset: 4800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !773, file: !774, line: 37, baseType: !168, size: 32, offset: 4864)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !773, file: !774, line: 38, baseType: !770, size: 64, offset: 4928)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !773, file: !774, line: 39, baseType: !213, size: 64, offset: 4992)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !773, file: !774, line: 40, baseType: !283, size: 32, offset: 5056)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !773, file: !774, line: 42, baseType: !168, size: 32, offset: 5088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !773, file: !774, line: 43, baseType: !418, size: 64, offset: 5120)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !773, file: !774, line: 44, baseType: !213, size: 64, offset: 5184)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !773, file: !774, line: 45, baseType: !794, size: 64, offset: 5248)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !773, file: !774, line: 46, baseType: !283, size: 32, offset: 5312)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !773, file: !774, line: 47, baseType: !417, size: 64, offset: 5376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !773, file: !774, line: 49, baseType: !109, size: 64, offset: 5440)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !773, file: !774, line: 50, baseType: !799, size: 64, offset: 5504)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !774, line: 27, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !774, line: 27, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !774, line: 27, size: 320, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !816}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !802, file: !774, line: 27, baseType: !746, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !802, file: !774, line: 27, baseType: !746, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !802, file: !774, line: 27, baseType: !746, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !802, file: !774, line: 27, baseType: !746, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !802, file: !774, line: 27, baseType: !753, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !802, file: !774, line: 27, baseType: !810, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !774, line: 10, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !774, line: 8, size: 64, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !812, file: !774, line: 9, baseType: !168, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !812, file: !774, line: 9, baseType: !168, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !802, file: !774, line: 27, baseType: !817, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !774, line: 14, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 12, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !819, file: !774, line: 13, baseType: !213, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !819, file: !774, line: 13, baseType: !213, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !773, file: !774, line: 51, baseType: !770, size: 64, offset: 5568)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !773, file: !774, line: 52, baseType: !421, size: 64, offset: 5632)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !773, file: !774, line: 53, baseType: !826, size: 64, offset: 5696)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !771, line: 33, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !774, line: 72, size: 4864, elements: !829)
!829 = !{!830, !831, !849, !850, !859}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !828, file: !774, line: 73, baseType: !334, size: 4480)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !828, file: !774, line: 73, baseType: !832, size: 192, offset: 4480)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 192, elements: !164)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !774, line: 56, size: 192, elements: !834)
!834 = !{!835, !841, !845}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !833, file: !774, line: 57, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!126, !826, !770, !168, !508, !839, !840}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !833, file: !774, line: 58, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!126, !826}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !833, file: !774, line: 59, baseType: !846, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!126, !826, !132}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !828, file: !774, line: 74, baseType: !108, size: 64, offset: 4672)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !828, file: !774, line: 75, baseType: !851, size: 64, offset: 4736)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !774, line: 62, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !774, line: 64, size: 256, elements: !854)
!854 = !{!855, !856, !857, !858}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !774, line: 66, baseType: !851, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !853, file: !774, line: 67, baseType: !839, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !853, file: !774, line: 68, baseType: !840, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !853, file: !774, line: 69, baseType: !168, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !828, file: !774, line: 76, baseType: !851, size: 64, offset: 4800)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !375, file: !49, line: 247, baseType: !770, size: 64, offset: 35776)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !375, file: !49, line: 248, baseType: !862, size: 64, offset: 35840)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !422, line: 60, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !27, line: 240, size: 640, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !864, file: !27, line: 241, baseType: !104, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !864, file: !27, line: 242, baseType: !185, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !864, file: !27, line: 243, baseType: !168, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !864, file: !27, line: 243, baseType: !168, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !864, file: !27, line: 244, baseType: !168, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !864, file: !27, line: 244, baseType: !168, size: 32, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !864, file: !27, line: 245, baseType: !213, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !864, file: !27, line: 246, baseType: !283, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !864, file: !27, line: 247, baseType: !168, size: 32, offset: 352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !864, file: !27, line: 251, baseType: !168, size: 32, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !864, file: !27, line: 252, baseType: !666, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !864, file: !27, line: 253, baseType: !283, size: 32, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !864, file: !27, line: 254, baseType: !168, size: 32, offset: 544)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !864, file: !27, line: 254, baseType: !168, size: 32, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !864, file: !27, line: 255, baseType: !168, size: 32, offset: 608)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !375, file: !49, line: 250, baseType: !770, size: 64, offset: 35904)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !375, file: !49, line: 251, baseType: !448, size: 64, offset: 35968)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !375, file: !49, line: 253, baseType: !373, size: 64, offset: 36032)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !375, file: !49, line: 254, baseType: !407, size: 64, offset: 36096)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !375, file: !49, line: 255, baseType: !108, size: 64, offset: 36160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !375, file: !49, line: 256, baseType: !887, size: 64, offset: 36224)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!126, !373, !108}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !375, file: !49, line: 257, baseType: !887, size: 64, offset: 36288)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !375, file: !49, line: 258, baseType: !892, size: 64, offset: 36352)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!126, !373, !360, !283, !840, !108}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !375, file: !49, line: 260, baseType: !168, size: 32, offset: 36416)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !375, file: !49, line: 261, baseType: !373, size: 64, offset: 36480)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !375, file: !49, line: 262, baseType: !407, size: 64, offset: 36544)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !375, file: !49, line: 263, baseType: !407, size: 64, offset: 36608)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !375, file: !49, line: 264, baseType: !283, size: 32, offset: 36672)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !375, file: !49, line: 265, baseType: !431, size: 64, offset: 36736)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !375, file: !49, line: 266, baseType: !221, size: 64, offset: 36800)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !375, file: !49, line: 266, baseType: !221, size: 64, offset: 36864)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !375, file: !49, line: 267, baseType: !904, size: 64, offset: 36928)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !43, line: 42, baseType: !53)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !375, file: !49, line: 269, baseType: !907, size: 640, offset: 36992)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 640, elements: !916)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !49, line: 15, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!126, !373, !168, !168, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !449, line: 1723, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !449, line: 1723, flags: DIFlagFwdDecl)
!916 = !{!917}
!917 = !DISubrange(count: 10)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !375, file: !49, line: 270, baseType: !907, size: 640, offset: 37632)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !375, file: !49, line: 272, baseType: !168, size: 32, offset: 38272)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !375, file: !49, line: 273, baseType: !921, size: 64, offset: 38336)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !49, line: 178, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !49, line: 173, size: 256, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !923, file: !49, line: 174, baseType: !109, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !923, file: !49, line: 175, baseType: !481, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !923, file: !49, line: 176, baseType: !768, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !923, file: !49, line: 177, baseType: !283, size: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !375, file: !49, line: 274, baseType: !930, size: 64, offset: 38400)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !49, line: 165, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !49, line: 167, size: 192, elements: !933)
!933 = !{!934, !1015, !1016}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !932, file: !49, line: 168, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !936, line: 11, baseType: !937)
!936 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !936, line: 13, size: 832, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !1006, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !936, line: 14, baseType: !145, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !938, file: !936, line: 15, baseType: !481, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !938, file: !936, line: 16, baseType: !145, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !938, file: !936, line: 17, baseType: !168, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !938, file: !936, line: 18, baseType: !213, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !938, file: !936, line: 19, baseType: !946, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !947, line: 22, baseType: !948)
!947 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !936, line: 81, size: 4992, elements: !950)
!950 = !{!951, !952, !966, !967, !968, !977}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !949, file: !936, line: 82, baseType: !334, size: 4480)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !949, file: !936, line: 82, baseType: !953, size: 256, offset: 4480)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 256, elements: !164)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !936, line: 74, size: 256, elements: !955)
!955 = !{!956, !960, !961, !965}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !954, file: !936, line: 75, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!126, !946}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !954, file: !936, line: 76, baseType: !957, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !954, file: !936, line: 77, baseType: !962, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!126, !946, !132}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !954, file: !936, line: 78, baseType: !957, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !949, file: !936, line: 83, baseType: !108, size: 64, offset: 4736)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !949, file: !936, line: 85, baseType: !168, size: 32, offset: 4800)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !949, file: !936, line: 86, baseType: !969, size: 64, offset: 4864)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !936, line: 41, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 36, size: 256, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !936, line: 37, baseType: !279, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !971, file: !936, line: 38, baseType: !279, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !971, file: !936, line: 39, baseType: !279, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !971, file: !936, line: 40, baseType: !195, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !949, file: !936, line: 87, baseType: !978, size: 64, offset: 4928)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !936, line: 54, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !936, line: 54, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !936, line: 54, size: 320, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !998}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !982, file: !936, line: 54, baseType: !746, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !982, file: !936, line: 54, baseType: !746, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !982, file: !936, line: 54, baseType: !746, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !982, file: !936, line: 54, baseType: !746, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !982, file: !936, line: 54, baseType: !753, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !982, file: !936, line: 54, baseType: !990, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !947, line: 41, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !947, line: 35, size: 192, elements: !993)
!993 = !{!994, !995, !996, !997}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !992, file: !947, line: 37, baseType: !481, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !992, file: !947, line: 38, baseType: !168, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !992, file: !947, line: 39, baseType: !168, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !992, file: !947, line: 40, baseType: !168, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !982, file: !936, line: 54, baseType: !999, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !936, line: 34, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 30, size: 96, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1001, file: !936, line: 31, baseType: !168, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1001, file: !936, line: 32, baseType: !168, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1001, file: !936, line: 33, baseType: !168, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !938, file: !936, line: 20, baseType: !1007, size: 32, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !43, line: 60, baseType: !60)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !938, file: !936, line: 21, baseType: !168, size: 32, offset: 416)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !938, file: !936, line: 22, baseType: !168, size: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !938, file: !936, line: 23, baseType: !213, size: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !938, file: !936, line: 24, baseType: !156, size: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !938, file: !936, line: 25, baseType: !156, size: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !938, file: !936, line: 26, baseType: !108, size: 64, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !936, line: 27, baseType: !935, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !932, file: !49, line: 169, baseType: !481, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !932, file: !49, line: 170, baseType: !930, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !375, file: !49, line: 275, baseType: !168, size: 32, offset: 38464)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !375, file: !49, line: 276, baseType: !1019, size: 64, offset: 38528)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !49, line: 184, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !49, line: 180, size: 192, elements: !1022)
!1022 = !{!1023, !1104, !1105}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1021, file: !49, line: 181, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !947, line: 13, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !936, line: 98, size: 7232, elements: !1027)
!1027 = !{!1028, !1029, !1043, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1060, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1026, file: !936, line: 99, baseType: !334, size: 4480)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1026, file: !936, line: 99, baseType: !1030, size: 256, offset: 4480)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 256, elements: !164)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !936, line: 91, size: 256, elements: !1032)
!1032 = !{!1033, !1037, !1038, !1042}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1031, file: !936, line: 92, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!126, !1024}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1031, file: !936, line: 93, baseType: !1034, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1031, file: !936, line: 94, baseType: !1039, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!126, !1024, !132}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1031, file: !936, line: 95, baseType: !1034, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1026, file: !936, line: 100, baseType: !108, size: 64, offset: 4736)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1026, file: !936, line: 101, baseType: !1045, size: 64, offset: 4800)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
