; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/pipegcr/pipegcr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/pipegcr/pipegcr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 203, baseType: !7, size: 32, elements: !117)
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_STANDARD", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_NOTAY", value: 1, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 663, baseType: !7, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125}
!123 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!128 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 155, baseType: !7, size: 32, elements: !148)
!147 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!153 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!157 = !{!158, !232, !203, !229, !291, !645, !648, !301, !28, !253, !651, !380, !652, !7, !194, !654, !655}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_PIPEGCR", file: !160, line: 24, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gcr/pipegcr/pipegcrimpl.h", directory: "/home/users/ndemeye/xSDK")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 6, size: 1536, elements: !162)
!162 = !{!163, !165, !166, !167, !168, !173, !174, !175, !176, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188, !190, !191, !196, !198, !199, !201, !202, !204, !644}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mmax", scope: !161, file: !160, line: 7, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nprealloc", scope: !161, file: !160, line: 8, baseType: !164, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nvecs", scope: !161, file: !160, line: 9, baseType: !164, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !161, file: !160, line: 10, baseType: !164, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pvecs", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !147, line: 21, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !147, line: 21, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "svecs", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "qvecs", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tvecs", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ppvecs", scope: !161, file: !160, line: 11, baseType: !177, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "psvecs", scope: !161, file: !160, line: 11, baseType: !177, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pqvecs", scope: !161, file: !160, line: 11, baseType: !177, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ptvecs", scope: !161, file: !160, line: 11, baseType: !177, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "qold", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pold", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sold", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "told", scope: !161, file: !160, line: 11, baseType: !169, size: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "chunksizes", scope: !161, file: !160, line: 12, baseType: !186, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nchunks", scope: !161, file: !160, line: 13, baseType: !164, size: 32, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "truncstrat", scope: !161, file: !160, line: 14, baseType: !189, size: 32, offset: 992)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPFCDTruncationType", file: !35, line: 203, baseType: !116)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "n_restarts", scope: !161, file: !160, line: 15, baseType: !164, size: 32, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dots", scope: !161, file: !160, line: 16, baseType: !192, size: 64, offset: 1088)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !195)
!195 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "etas", scope: !161, file: !160, line: 17, baseType: !197, size: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "redux", scope: !161, file: !160, line: 18, baseType: !169, size: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "norm_breakdown", scope: !161, file: !160, line: 19, baseType: !200, size: 32, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "unroll_w", scope: !161, file: !160, line: 20, baseType: !200, size: 32, offset: 1312)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc_ctx", scope: !161, file: !160, line: 21, baseType: !203, size: 64, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc", scope: !161, file: !160, line: 22, baseType: !205, size: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !209, !164, !194, !203}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !212)
!212 = !{!213, !413, !462, !467, !468, !469, !470, !500, !501, !502, !503, !504, !506, !511, !512, !513, !514, !515, !516, !517, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !537, !543, !544, !545, !546, !551, !552, !553, !554, !559, !560, !561, !562, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !614, !615, !616, !617, !618, !625, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !641, !642, !643}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !211, file: !104, line: 76, baseType: !214, size: 4480)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !215, line: 122, baseType: !216)
!215 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !215, line: 73, size: 4480, elements: !217)
!217 = !{!218, !220, !274, !275, !276, !278, !279, !280, !281, !289, !290, !292, !296, !300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !313, !314, !315, !317, !318, !319, !321, !322, !323, !324, !325, !326, !328, !329, !330, !331, !332, !333, !335, !336, !337, !347, !349, !350, !354, !355, !403, !408, !410, !411, !412}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !216, file: !215, line: 74, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !216, file: !215, line: 75, baseType: !221, size: 448, offset: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 448, elements: !272)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !215, line: 53, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 45, size: 448, elements: !224)
!224 = !{!225, !236, !244, !249, !256, !260, !267}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !223, file: !215, line: 46, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!208, !229, !231}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !233, line: 330, baseType: !234)
!233 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !233, line: 330, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !223, file: !215, line: 47, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!208, !229, !240}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !241, line: 16, baseType: !242)
!241 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !241, line: 16, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !223, file: !215, line: 48, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!208, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !223, file: !215, line: 49, baseType: !250, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!208, !229, !253, !229}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !223, file: !215, line: 50, baseType: !257, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!208, !229, !253, !248}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !223, file: !215, line: 51, baseType: !261, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!208, !229, !253, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !223, file: !215, line: 52, baseType: !268, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!208, !229, !253, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!272 = !{!273}
!273 = !DISubrange(count: 1)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !216, file: !215, line: 76, baseType: !232, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !215, line: 77, baseType: !164, size: 32, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !216, file: !215, line: 78, baseType: !277, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !195)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !216, file: !215, line: 78, baseType: !277, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !216, file: !215, line: 78, baseType: !277, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !216, file: !215, line: 78, baseType: !277, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !215, line: 79, baseType: !282, size: 64, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !285, line: 27, baseType: !286)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !287, line: 43, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!288 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !216, file: !215, line: 80, baseType: !164, size: 32, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !216, file: !215, line: 81, baseType: !291, size: 32, offset: 992)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !216, file: !215, line: 82, baseType: !293, size: 64, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !216, file: !215, line: 83, baseType: !297, size: 64, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !216, file: !215, line: 84, baseType: !301, size: 64, offset: 1152)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !216, file: !215, line: 85, baseType: !301, size: 64, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !216, file: !215, line: 86, baseType: !301, size: 64, offset: 1280)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !216, file: !215, line: 87, baseType: !301, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !215, line: 88, baseType: !229, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !216, file: !215, line: 89, baseType: !282, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !215, line: 90, baseType: !301, size: 64, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !216, file: !215, line: 91, baseType: !301, size: 64, offset: 1600)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !216, file: !215, line: 92, baseType: !164, size: 32, offset: 1664)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !216, file: !215, line: 93, baseType: !203, size: 64, offset: 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !216, file: !215, line: 94, baseType: !312, size: 64, offset: 1792)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !283)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !216, file: !215, line: 95, baseType: !164, size: 32, offset: 1856)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !216, file: !215, line: 95, baseType: !164, size: 32, offset: 1888)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !216, file: !215, line: 96, baseType: !316, size: 64, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !216, file: !215, line: 96, baseType: !316, size: 64, offset: 1984)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !216, file: !215, line: 97, baseType: !186, size: 64, offset: 2048)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !216, file: !215, line: 97, baseType: !320, size: 64, offset: 2112)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !216, file: !215, line: 98, baseType: !164, size: 32, offset: 2176)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !216, file: !215, line: 98, baseType: !164, size: 32, offset: 2208)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !216, file: !215, line: 99, baseType: !316, size: 64, offset: 2240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !216, file: !215, line: 99, baseType: !316, size: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !216, file: !215, line: 100, baseType: !197, size: 64, offset: 2368)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !216, file: !215, line: 100, baseType: !327, size: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !216, file: !215, line: 101, baseType: !164, size: 32, offset: 2496)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !216, file: !215, line: 101, baseType: !164, size: 32, offset: 2528)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !216, file: !215, line: 102, baseType: !316, size: 64, offset: 2560)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !216, file: !215, line: 102, baseType: !316, size: 64, offset: 2624)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !216, file: !215, line: 103, baseType: !192, size: 64, offset: 2688)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !216, file: !215, line: 103, baseType: !334, size: 64, offset: 2752)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !216, file: !215, line: 104, baseType: !271, size: 64, offset: 2816)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !216, file: !215, line: 105, baseType: !164, size: 32, offset: 2880)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !216, file: !215, line: 106, baseType: !338, size: 128, offset: 2944)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 128, elements: !345)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !215, line: 64, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 61, size: 128, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !341, file: !215, line: 62, baseType: !264, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !341, file: !215, line: 63, baseType: !203, size: 64, offset: 64)
!345 = !{!346}
!346 = !DISubrange(count: 2)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !216, file: !215, line: 107, baseType: !348, size: 64, offset: 3072)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !345)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !216, file: !215, line: 108, baseType: !203, size: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !216, file: !215, line: 109, baseType: !351, size: 64, offset: 3200)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!208, !203}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !216, file: !215, line: 111, baseType: !164, size: 32, offset: 3264)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !216, file: !215, line: 112, baseType: !356, size: 320, offset: 3328)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 320, elements: !401)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!208, !360, !229, !203}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !363)
!363 = !{!364, !365, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !362, file: !12, line: 100, baseType: !164, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !12, line: 101, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !377, !378, !379, !383, !384, !386, !387, !388}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !368, file: !12, line: 84, baseType: !301, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !368, file: !12, line: 85, baseType: !301, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !12, line: 86, baseType: !203, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !368, file: !12, line: 87, baseType: !293, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !368, file: !12, line: 88, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !368, file: !12, line: 89, baseType: !255, size: 8, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !368, file: !12, line: 90, baseType: !301, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !368, file: !12, line: 91, baseType: !380, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 46, baseType: !382)
!381 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!382 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !368, file: !12, line: 92, baseType: !200, size: 32, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !12, line: 93, baseType: !385, size: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !12, line: 94, baseType: !366, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !368, file: !12, line: 95, baseType: !301, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !368, file: !12, line: 96, baseType: !203, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !362, file: !12, line: 102, baseType: !301, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !362, file: !12, line: 102, baseType: !301, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !362, file: !12, line: 103, baseType: !301, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !362, file: !12, line: 104, baseType: !232, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !362, file: !12, line: 105, baseType: !200, size: 32, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !362, file: !12, line: 105, baseType: !200, size: 32, offset: 416)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !362, file: !12, line: 105, baseType: !200, size: 32, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !362, file: !12, line: 106, baseType: !229, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !362, file: !12, line: 107, baseType: !398, size: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !216, file: !215, line: 113, baseType: !404, size: 320, offset: 3648)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!208, !229, !203}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !216, file: !215, line: 114, baseType: !409, size: 320, offset: 3968)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, elements: !401)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !216, file: !215, line: 115, baseType: !200, size: 32, offset: 4288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !216, file: !215, line: 120, baseType: !398, size: 64, offset: 4352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !216, file: !215, line: 121, baseType: !200, size: 32, offset: 4416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !211, file: !104, line: 76, baseType: !414, size: 896, offset: 4480)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 896, elements: !272)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !416)
!416 = !{!417, !421, !425, !429, !437, !438, !442, !443, !447, !451, !455, !456, !460, !461}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !415, file: !104, line: 19, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!208, !209, !170, !169}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !415, file: !104, line: 22, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!208, !209, !170, !170, !169}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !415, file: !104, line: 25, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!208, !209}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !415, file: !104, line: 26, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!208, !209, !433, !433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !434, line: 16, baseType: !435)
!434 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !434, line: 16, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !415, file: !104, line: 27, baseType: !426, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !415, file: !104, line: 28, baseType: !439, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!208, !360, !209}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !415, file: !104, line: 29, baseType: !426, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !415, file: !104, line: 30, baseType: !444, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!208, !209, !197, !197}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !415, file: !104, line: 31, baseType: !448, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!208, !209, !164, !197, !197, !186}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !415, file: !104, line: 32, baseType: !452, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!208, !209, !200, !200, !186, !169, !197, !197}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !415, file: !104, line: 33, baseType: !426, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !415, file: !104, line: 34, baseType: !457, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!208, !209, !240}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !415, file: !104, line: 35, baseType: !426, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !415, file: !104, line: 36, baseType: !457, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !211, file: !104, line: 77, baseType: !463, size: 64, offset: 5376)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !464, line: 14, baseType: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !464, line: 14, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !211, file: !104, line: 78, baseType: !200, size: 32, offset: 5440)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !211, file: !104, line: 79, baseType: !200, size: 32, offset: 5472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !211, file: !104, line: 81, baseType: !164, size: 32, offset: 5504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !211, file: !104, line: 82, baseType: !471, size: 64, offset: 5568)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !474)
!474 = !{!475, !476, !496, !497, !498, !499}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !473, file: !104, line: 55, baseType: !214, size: 4480)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !473, file: !104, line: 55, baseType: !477, size: 448, offset: 4480)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 448, elements: !272)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !479)
!479 = !{!480, !484, !485, !489, !490, !491, !495}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !478, file: !104, line: 42, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!208, !471, !170, !170}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !478, file: !104, line: 43, baseType: !481, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !478, file: !104, line: 44, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!208, !471}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !478, file: !104, line: 45, baseType: !486, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !478, file: !104, line: 46, baseType: !486, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !478, file: !104, line: 47, baseType: !492, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!208, !471, !240}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !478, file: !104, line: 48, baseType: !486, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !473, file: !104, line: 56, baseType: !209, size: 64, offset: 4928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !473, file: !104, line: 57, baseType: !433, size: 64, offset: 4992)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !473, file: !104, line: 58, baseType: !312, size: 64, offset: 5056)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !473, file: !104, line: 59, baseType: !203, size: 64, offset: 5120)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !211, file: !104, line: 83, baseType: !200, size: 32, offset: 5632)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !211, file: !104, line: 84, baseType: !200, size: 32, offset: 5664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !211, file: !104, line: 85, baseType: !200, size: 32, offset: 5696)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !211, file: !104, line: 86, baseType: !200, size: 32, offset: 5728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !211, file: !104, line: 87, baseType: !505, size: 32, offset: 5760)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !211, file: !104, line: 88, baseType: !507, size: 384, offset: 5792)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 384, elements: !508)
!508 = !{!509, !510}
!509 = !DISubrange(count: 4)
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !211, file: !104, line: 89, baseType: !194, size: 64, offset: 6208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !211, file: !104, line: 90, baseType: !194, size: 64, offset: 6272)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !211, file: !104, line: 91, baseType: !194, size: 64, offset: 6336)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !211, file: !104, line: 92, baseType: !194, size: 64, offset: 6400)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !211, file: !104, line: 93, baseType: !194, size: 64, offset: 6464)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !211, file: !104, line: 94, baseType: !194, size: 64, offset: 6528)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !211, file: !104, line: 95, baseType: !518, size: 32, offset: 6592)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !211, file: !104, line: 96, baseType: !200, size: 32, offset: 6624)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !211, file: !104, line: 98, baseType: !170, size: 64, offset: 6656)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !211, file: !104, line: 98, baseType: !170, size: 64, offset: 6720)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !211, file: !104, line: 102, baseType: !197, size: 64, offset: 6784)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !211, file: !104, line: 103, baseType: !197, size: 64, offset: 6848)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !211, file: !104, line: 104, baseType: !164, size: 32, offset: 6912)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !211, file: !104, line: 105, baseType: !164, size: 32, offset: 6944)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !211, file: !104, line: 106, baseType: !200, size: 32, offset: 6976)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !211, file: !104, line: 107, baseType: !197, size: 64, offset: 7040)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !211, file: !104, line: 108, baseType: !197, size: 64, offset: 7104)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !211, file: !104, line: 109, baseType: !164, size: 32, offset: 7168)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !211, file: !104, line: 110, baseType: !164, size: 32, offset: 7200)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !211, file: !104, line: 111, baseType: !200, size: 32, offset: 7232)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !211, file: !104, line: 113, baseType: !164, size: 32, offset: 7264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !211, file: !104, line: 114, baseType: !200, size: 32, offset: 7296)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !211, file: !104, line: 117, baseType: !164, size: 32, offset: 7328)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !211, file: !104, line: 120, baseType: !536, size: 320, offset: 7360)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !401)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !211, file: !104, line: 121, baseType: !538, size: 320, offset: 7680)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 320, elements: !401)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!208, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !211, file: !104, line: 122, baseType: !409, size: 320, offset: 8000)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !211, file: !104, line: 123, baseType: !164, size: 32, offset: 8320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !211, file: !104, line: 124, baseType: !200, size: 32, offset: 8352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !211, file: !104, line: 126, baseType: !547, size: 320, offset: 8384)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 320, elements: !401)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!208, !209, !203}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !211, file: !104, line: 127, baseType: !538, size: 320, offset: 8704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !211, file: !104, line: 128, baseType: !409, size: 320, offset: 9024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !211, file: !104, line: 129, baseType: !164, size: 32, offset: 9344)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !211, file: !104, line: 131, baseType: !555, size: 64, offset: 9408)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!208, !209, !164, !194, !558, !203}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !211, file: !104, line: 132, baseType: !351, size: 64, offset: 9472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !211, file: !104, line: 133, baseType: !203, size: 64, offset: 9536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !211, file: !104, line: 135, baseType: !203, size: 64, offset: 9600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !211, file: !104, line: 137, baseType: !563, size: 64, offset: 9664)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !104, line: 139, baseType: !203, size: 64, offset: 9728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9792)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9824)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9888)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9952)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 9984)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10016)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10048)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10080)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10144)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !211, file: !104, line: 142, baseType: !200, size: 32, offset: 10208)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10240)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10304)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10368)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10432)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10560)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10624)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10688)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10752)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10816)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10880)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 10944)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 11008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !211, file: !104, line: 143, baseType: !240, size: 64, offset: 11072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11136)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11168)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11200)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11232)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11296)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11328)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11360)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11392)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11424)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11456)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11488)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11520)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !211, file: !104, line: 144, baseType: !596, size: 32, offset: 11552)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !211, file: !104, line: 147, baseType: !164, size: 32, offset: 11584)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !211, file: !104, line: 148, baseType: !169, size: 64, offset: 11648)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !211, file: !104, line: 150, baseType: !613, size: 32, offset: 11712)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !211, file: !104, line: 151, baseType: !200, size: 32, offset: 11744)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !211, file: !104, line: 153, baseType: !164, size: 32, offset: 11776)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !211, file: !104, line: 154, baseType: !164, size: 32, offset: 11808)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !211, file: !104, line: 156, baseType: !200, size: 32, offset: 11840)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !211, file: !104, line: 161, baseType: !619, size: 192, offset: 11904)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !104, line: 157, size: 192, elements: !620)
!620 = !{!621, !622, !623, !624}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !619, file: !104, line: 158, baseType: !433, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !619, file: !104, line: 158, baseType: !433, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !619, file: !104, line: 159, baseType: !200, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !619, file: !104, line: 160, baseType: !200, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !211, file: !104, line: 163, baseType: !626, size: 32, offset: 12096)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !211, file: !104, line: 165, baseType: !505, size: 32, offset: 12128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !211, file: !104, line: 166, baseType: !626, size: 32, offset: 12160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !211, file: !104, line: 171, baseType: !200, size: 32, offset: 12192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !211, file: !104, line: 172, baseType: !200, size: 32, offset: 12224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !211, file: !104, line: 173, baseType: !200, size: 32, offset: 12256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !211, file: !104, line: 174, baseType: !170, size: 64, offset: 12288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !211, file: !104, line: 175, baseType: !170, size: 64, offset: 12352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !211, file: !104, line: 177, baseType: !164, size: 32, offset: 12416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !211, file: !104, line: 178, baseType: !200, size: 32, offset: 12448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !211, file: !104, line: 180, baseType: !240, size: 64, offset: 12480)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !211, file: !104, line: 182, baseType: !638, size: 64, offset: 12544)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!208, !209, !170, !170, !203}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !211, file: !104, line: 183, baseType: !638, size: 64, offset: 12608)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !211, file: !104, line: 184, baseType: !203, size: 64, offset: 12672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !211, file: !104, line: 184, baseType: !203, size: 64, offset: 12736)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "modifypc_destroy", scope: !161, file: !160, line: 23, baseType: !351, size: 64, offset: 1472)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !233, line: 331, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !233, line: 331, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !233, line: 338, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !233, line: 338, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !653, line: 1451, baseType: !264)
!653 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !154)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!656 = !{!0, !657}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "cited", scope: !2, file: !659, line: 8, type: !200, isLocal: true, isDefinition: true)
!659 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gcr/pipegcr/pipegcr.c", directory: "/home/users/ndemeye/xSDK")
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 3072, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 384)
!663 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!664 = !{i32 7, !"Dwarf Version", i32 4}
!665 = !{i32 2, !"Debug Info Version", i32 3}
!666 = !{i32 1, !"wchar_size", i32 4}
!667 = !{i32 7, !"PIC Level", i32 2}
!668 = !{i32 7, !"uwtable", i32 1}
!669 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!670 = distinct !DISubprogram(name: "KSPPIPEGCRSetUnrollW", scope: !659, file: !659, line: 486, type: !671, scopeLine: 487, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!208, !209, !200}
!673 = !{!674, !675, !676, !677, !679, !680, !682, !683, !685, !689, !690, !692, !698, !699, !701, !704, !705, !707, !710}
!674 = !DILocalVariable(name: "ksp", arg: 1, scope: !670, file: !659, line: 486, type: !209)
!675 = !DILocalVariable(name: "unroll_w", arg: 2, scope: !670, file: !659, line: 486, type: !200)
!676 = !DILocalVariable(name: "pipegcr", scope: !670, file: !659, line: 488, type: !158)
!677 = !DILocalVariable(name: "_7_ierr", scope: !678, file: !659, line: 492, type: !208)
!678 = distinct !DILexicalBlock(scope: !670, file: !659, line: 492, column: 3)
!679 = !DILocalVariable(name: "b0", scope: !678, file: !659, line: 492, type: !291)
!680 = !DILocalVariable(name: "b1", scope: !678, file: !659, line: 492, type: !681)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 64, elements: !345)
!682 = !DILocalVariable(name: "b2", scope: !678, file: !659, line: 492, type: !681)
!683 = !DILocalVariable(name: "_4_ierr", scope: !684, file: !659, line: 492, type: !208)
!684 = distinct !DILexicalBlock(scope: !678, file: !659, line: 492, column: 3)
!685 = !DILocalVariable(name: "a_b1", scope: !684, file: !659, line: 492, type: !686)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 192, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 6)
!689 = !DILocalVariable(name: "a_b2", scope: !684, file: !659, line: 492, type: !686)
!690 = !DILocalVariable(name: "_7_errorcode", scope: !691, file: !659, line: 492, type: !208)
