; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itfunc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itfunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!364 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 70, baseType: !5, size: 32, elements: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = !{!373, !374, !375}
!373 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 451, baseType: !72, size: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!379 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!380 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!381 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!382 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 663, baseType: !5, size: 32, elements: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!385 = !{!386, !387, !388}
!386 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!391 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!396 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!397 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!398 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!399 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!400 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!401 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!402 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!403 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!405 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!406 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!407 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!408 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 395, baseType: !72, size: 32, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417}
!411 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!412 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!413 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!414 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!415 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!416 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!417 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !419, line: 624, baseType: !5, size: 32, elements: !420)
!419 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!420 = !{!421, !422, !423, !424}
!421 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!422 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!423 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!424 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!425 = !{!426, !429, !430, !465, !633, !515, !72, !505, !636, !639, !491, !603, !599, !642, !5}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !419, line: 330, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !419, line: 330, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !433, line: 73, size: 4480, elements: !434)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!434 = !{!435, !437, !486, !487, !489, !492, !493, !494, !495, !503, !504, !506, !510, !514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !527, !528, !529, !531, !532, !534, !536, !537, !538, !539, !540, !543, !545, !546, !547, !548, !549, !552, !554, !555, !556, !566, !568, !569, !573, !574, !623, !628, !630, !631, !632}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !432, file: !433, line: 74, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !432, file: !433, line: 75, baseType: !438, size: 448, offset: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 448, elements: !484)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !433, line: 53, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 45, size: 448, elements: !441)
!441 = !{!442, !448, !456, !461, !468, !472, !479}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !440, file: !433, line: 46, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !430, !447}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !440, file: !433, line: 47, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!446, !430, !452}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !453, line: 16, baseType: !454)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !453, line: 16, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !440, file: !433, line: 48, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!446, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !440, file: !433, line: 49, baseType: !462, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!446, !430, !465, !430}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !440, file: !433, line: 50, baseType: !469, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!446, !430, !465, !460}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !440, file: !433, line: 51, baseType: !473, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!446, !430, !465, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !440, file: !433, line: 52, baseType: !480, size: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!446, !430, !465, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!484 = !{!485}
!485 = !DISubrange(count: 1)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !432, file: !433, line: 76, baseType: !426, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !433, line: 77, baseType: !488, size: 32, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !432, file: !433, line: 78, baseType: !490, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !491)
!491 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !432, file: !433, line: 78, baseType: !490, size: 64, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !432, file: !433, line: 78, baseType: !490, size: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !432, file: !433, line: 78, baseType: !490, size: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !433, line: 79, baseType: !496, size: 64, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !499, line: 27, baseType: !500)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !501, line: 43, baseType: !502)
!501 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!502 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !432, file: !433, line: 80, baseType: !488, size: 32, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !432, file: !433, line: 81, baseType: !505, size: 32, offset: 992)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !432, file: !433, line: 82, baseType: !507, size: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !432, file: !433, line: 83, baseType: !511, size: 64, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !432, file: !433, line: 84, baseType: !515, size: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !432, file: !433, line: 85, baseType: !515, size: 64, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !432, file: !433, line: 86, baseType: !515, size: 64, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !432, file: !433, line: 87, baseType: !515, size: 64, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !432, file: !433, line: 88, baseType: !430, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !432, file: !433, line: 89, baseType: !496, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !433, line: 90, baseType: !515, size: 64, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !432, file: !433, line: 91, baseType: !515, size: 64, offset: 1600)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !432, file: !433, line: 92, baseType: !488, size: 32, offset: 1664)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !432, file: !433, line: 93, baseType: !429, size: 64, offset: 1728)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !432, file: !433, line: 94, baseType: !526, size: 64, offset: 1792)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !497)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !432, file: !433, line: 95, baseType: !488, size: 32, offset: 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !432, file: !433, line: 95, baseType: !488, size: 32, offset: 1888)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !432, file: !433, line: 96, baseType: !530, size: 64, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !432, file: !433, line: 96, baseType: !530, size: 64, offset: 1984)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !432, file: !433, line: 97, baseType: !533, size: 64, offset: 2048)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !432, file: !433, line: 97, baseType: !535, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !432, file: !433, line: 98, baseType: !488, size: 32, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !432, file: !433, line: 98, baseType: !488, size: 32, offset: 2208)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !432, file: !433, line: 99, baseType: !530, size: 64, offset: 2240)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !432, file: !433, line: 99, baseType: !530, size: 64, offset: 2304)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !432, file: !433, line: 100, baseType: !541, size: 64, offset: 2368)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !491)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !432, file: !433, line: 100, baseType: !544, size: 64, offset: 2432)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !432, file: !433, line: 101, baseType: !488, size: 32, offset: 2496)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !432, file: !433, line: 101, baseType: !488, size: 32, offset: 2528)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !432, file: !433, line: 102, baseType: !530, size: 64, offset: 2560)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !432, file: !433, line: 102, baseType: !530, size: 64, offset: 2624)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !432, file: !433, line: 103, baseType: !550, size: 64, offset: 2688)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !542)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !432, file: !433, line: 103, baseType: !553, size: 64, offset: 2752)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !432, file: !433, line: 104, baseType: !483, size: 64, offset: 2816)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !432, file: !433, line: 105, baseType: !488, size: 32, offset: 2880)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !432, file: !433, line: 106, baseType: !557, size: 128, offset: 2944)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !564)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !433, line: 64, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 61, size: 128, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !560, file: !433, line: 62, baseType: !476, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !560, file: !433, line: 63, baseType: !429, size: 64, offset: 64)
!564 = !{!565}
!565 = !DISubrange(count: 2)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !432, file: !433, line: 107, baseType: !567, size: 64, offset: 3072)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 64, elements: !564)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !432, file: !433, line: 108, baseType: !429, size: 64, offset: 3136)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !432, file: !433, line: 109, baseType: !570, size: 64, offset: 3200)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!446, !429}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !432, file: !433, line: 111, baseType: !488, size: 32, offset: 3264)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !432, file: !433, line: 112, baseType: !575, size: 320, offset: 3328)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 320, elements: !621)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!446, !579, !430, !429}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !582)
!582 = !{!583, !584, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !581, file: !10, line: 100, baseType: !488, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !10, line: 101, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !596, !597, !598, !602, !604, !606, !607, !608}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !587, file: !10, line: 84, baseType: !515, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !587, file: !10, line: 85, baseType: !515, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !10, line: 86, baseType: !429, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !587, file: !10, line: 87, baseType: !507, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !587, file: !10, line: 88, baseType: !594, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !587, file: !10, line: 89, baseType: !467, size: 8, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !587, file: !10, line: 90, baseType: !515, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !587, file: !10, line: 91, baseType: !599, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !600, line: 46, baseType: !601)
!600 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!601 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !587, file: !10, line: 92, baseType: !603, size: 32, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !10, line: 93, baseType: !605, size: 32, offset: 544)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !10, line: 94, baseType: !585, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !587, file: !10, line: 95, baseType: !515, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !587, file: !10, line: 96, baseType: !429, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !581, file: !10, line: 102, baseType: !515, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !581, file: !10, line: 102, baseType: !515, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !581, file: !10, line: 103, baseType: !515, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !581, file: !10, line: 104, baseType: !426, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !581, file: !10, line: 105, baseType: !603, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !581, file: !10, line: 105, baseType: !603, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !581, file: !10, line: 105, baseType: !603, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !581, file: !10, line: 106, baseType: !430, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !581, file: !10, line: 107, baseType: !618, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!621 = !{!622}
!622 = !DISubrange(count: 5)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !432, file: !433, line: 113, baseType: !624, size: 320, offset: 3648)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 320, elements: !621)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!446, !430, !429}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !432, file: !433, line: 114, baseType: !629, size: 320, offset: 3968)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 320, elements: !621)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !432, file: !433, line: 115, baseType: !603, size: 32, offset: 4288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !432, file: !433, line: 120, baseType: !618, size: 64, offset: 4352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !432, file: !433, line: 121, baseType: !603, size: 32, offset: 4416)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!446}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !419, line: 331, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !419, line: 331, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !419, line: 338, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !419, line: 338, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !326, line: 178, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 178, size: 256, elements: !645)
!645 = !{!646, !647, !649, !654}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !644, file: !326, line: 178, baseType: !452, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !644, file: !326, line: 178, baseType: !648, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !326, line: 162, baseType: !325)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !644, file: !326, line: 178, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !651, line: 43, baseType: !652)
!651 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !651, line: 43, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !326, line: 178, baseType: !429, size: 64, offset: 192)
!655 = !{i32 7, !"Dwarf Version", i32 4}
!656 = !{i32 2, !"Debug Info Version", i32 3}
!657 = !{i32 1, !"wchar_size", i32 4}
!658 = !{i32 7, !"PIC Level", i32 2}
!659 = !{i32 7, !"uwtable", i32 1}
!660 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!661 = distinct !DISubprogram(name: "KSPComputeExtremeSingularValues", scope: !662, file: !662, line: 53, type: !663, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1661)
!662 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itfunc.c", directory: "/home/users/ndemeye/xSDK")
!663 = !DISubroutineType(types: !664)
!664 = !{!446, !665, !541, !541}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !302, line: 22, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !371, line: 75, size: 12800, elements: !668)
!668 = !{!669, !671, !1478, !1483, !1484, !1485, !1486, !1516, !1517, !1518, !1519, !1520, !1522, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1555, !1561, !1562, !1563, !1564, !1569, !1570, !1571, !1572, !1577, !1578, !1579, !1580, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1631, !1632, !1633, !1634, !1635, !1642, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1658, !1659, !1660}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !667, file: !371, line: 76, baseType: !670, size: 4480)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !433, line: 122, baseType: !432)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !667, file: !371, line: 76, baseType: !672, size: 896, offset: 4480)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 896, elements: !484)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !371, line: 18, size: 896, elements: !674)
!674 = !{!675, !683, !687, !691, !1455, !1456, !1460, !1461, !1463, !1467, !1471, !1472, !1476, !1477}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !673, file: !371, line: 19, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!446, !665, !679, !682}
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !673, file: !371, line: 22, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!446, !665, !679, !679, !682}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !673, file: !371, line: 25, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!446, !665}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !673, file: !371, line: 26, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!446, !665, !695, !695}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !698, line: 436, size: 23424, elements: !699)
!698 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!699 = !{!700, !701, !1201, !1221, !1222, !1223, !1225, !1226, !1227, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1351, !1352, !1368, !1369, !1370, !1371, !1372, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1407, !1427, !1428, !1430, !1431, !1432, !1433, !1434, !1435, !1453, !1454}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !697, file: !698, line: 437, baseType: !670, size: 4480)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !697, file: !698, line: 437, baseType: !702, size: 9472, offset: 4480)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 9472, elements: !484)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !698, line: 32, size: 9472, elements: !704)
!704 = !{!705, !714, !718, !719, !723, !727, !728, !729, !730, !731, !732, !733, !757, !761, !766, !772, !791, !796, !800, !801, !806, !811, !812, !817, !821, !825, !829, !833, !837, !838, !839, !840, !841, !845, !846, !851, !852, !853, !854, !855, !860, !867, !872, !876, !880, !884, !888, !889, !893, !894, !901, !906, !907, !908, !909, !968, !976, !977, !981, !982, !986, !987, !991, !996, !997, !1001, !1005, !1012, !1013, !1014, !1015, !1016, !1017, !1022, !1023, !1027, !1031, !1035, !1036, !1037, !1041, !1051, !1052, !1056, !1057, !1061, !1062, !1066, !1067, !1071, !1072, !1076, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1090, !1091, !1092, !1093, !1094, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1110, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1130, !1131, !1132, !1137, !1141, !1142, !1146, !1147, !1148, !1149, !1175, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1189, !1190, !1191, !1195, !1199, !1200}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !703, file: !698, line: 34, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!446, !695, !488, !709, !488, !709, !711, !713}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !703, file: !698, line: 35, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!446, !695, !488, !533, !535, !553}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !703, file: !698, line: 36, baseType: !715, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !703, file: !698, line: 37, baseType: !720, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!446, !695, !679, !679}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !703, file: !698, line: 38, baseType: !724, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!446, !695, !679, !679, !679}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !703, file: !698, line: 40, baseType: !720, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !703, file: !698, line: 41, baseType: !724, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !703, file: !698, line: 42, baseType: !720, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !703, file: !698, line: 43, baseType: !724, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !703, file: !698, line: 44, baseType: !720, size: 64, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !703, file: !698, line: 46, baseType: !724, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !703, file: !698, line: 47, baseType: !734, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!446, !695, !737, !737, !741}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !738, line: 11, baseType: !739)
!738 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !738, line: 11, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !744, file: !36, line: 1227, baseType: !542, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !744, file: !36, line: 1228, baseType: !542, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !744, file: !36, line: 1229, baseType: !542, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !744, file: !36, line: 1230, baseType: !542, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !744, file: !36, line: 1231, baseType: !542, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !744, file: !36, line: 1232, baseType: !542, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !744, file: !36, line: 1233, baseType: !542, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !744, file: !36, line: 1234, baseType: !542, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !744, file: !36, line: 1236, baseType: !542, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !744, file: !36, line: 1237, baseType: !542, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !744, file: !36, line: 1238, baseType: !542, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !703, file: !698, line: 48, baseType: !758, size: 64, offset: 768)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!446, !695, !737, !741}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !703, file: !698, line: 49, baseType: !762, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!446, !695, !679, !542, !765, !542, !488, !488, !679}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !703, file: !698, line: 50, baseType: !767, size: 64, offset: 896)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!446, !695, !770, !771}
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !703, file: !698, line: 52, baseType: !773, size: 64, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!446, !695, !776, !777}
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !779, file: !36, line: 593, baseType: !490, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !779, file: !36, line: 594, baseType: !490, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !779, file: !36, line: 594, baseType: !490, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !779, file: !36, line: 594, baseType: !490, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !779, file: !36, line: 595, baseType: !490, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !779, file: !36, line: 596, baseType: !490, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !779, file: !36, line: 597, baseType: !490, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !779, file: !36, line: 598, baseType: !490, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !779, file: !36, line: 598, baseType: !490, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !779, file: !36, line: 599, baseType: !490, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !703, file: !698, line: 53, baseType: !792, size: 64, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!446, !695, !695, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !703, file: !698, line: 54, baseType: !797, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!446, !695, !679}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !703, file: !698, line: 55, baseType: !720, size: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !703, file: !698, line: 56, baseType: !802, size: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!446, !695, !805, !541}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !703, file: !698, line: 58, baseType: !807, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!446, !695, !810}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !703, file: !698, line: 59, baseType: !807, size: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !703, file: !698, line: 60, baseType: !813, size: 64, offset: 1408)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!446, !695, !816, !603}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !703, file: !698, line: 61, baseType: !818, size: 64, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!446, !695}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !703, file: !698, line: 63, baseType: !822, size: 64, offset: 1536)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!446, !695, !488, !709, !551, !679, !679}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !703, file: !698, line: 64, baseType: !826, size: 64, offset: 1600)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!446, !695, !695, !737, !737, !741}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !703, file: !698, line: 65, baseType: !830, size: 64, offset: 1664)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!446, !695, !695, !741}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !703, file: !698, line: 66, baseType: !834, size: 64, offset: 1728)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!446, !695, !695, !737, !741}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !703, file: !698, line: 67, baseType: !830, size: 64, offset: 1792)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !703, file: !698, line: 69, baseType: !818, size: 64, offset: 1856)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !703, file: !698, line: 70, baseType: !826, size: 64, offset: 1920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !703, file: !698, line: 71, baseType: !834, size: 64, offset: 1984)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !703, file: !698, line: 72, baseType: !842, size: 64, offset: 2048)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!446, !695, !771}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !703, file: !698, line: 73, baseType: !818, size: 64, offset: 2112)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !703, file: !698, line: 75, baseType: !847, size: 64, offset: 2176)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!446, !695, !850, !771}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !703, file: !698, line: 76, baseType: !720, size: 64, offset: 2240)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !703, file: !698, line: 77, baseType: !720, size: 64, offset: 2304)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !703, file: !698, line: 78, baseType: !734, size: 64, offset: 2368)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !703, file: !698, line: 79, baseType: !758, size: 64, offset: 2432)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !703, file: !698, line: 81, baseType: !856, size: 64, offset: 2496)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!446, !695, !551, !695, !859}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !703, file: !698, line: 82, baseType: !861, size: 64, offset: 2560)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!446, !695, !488, !864, !864, !770, !866}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !703, file: !698, line: 83, baseType: !868, size: 64, offset: 2624)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!446, !695, !488, !871, !488}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !703, file: !698, line: 84, baseType: !873, size: 64, offset: 2688)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!446, !695, !488, !709, !488, !709, !550}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !703, file: !698, line: 85, baseType: !877, size: 64, offset: 2752)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!446, !695, !695, !859}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !703, file: !698, line: 87, baseType: !881, size: 64, offset: 2816)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!446, !695, !679, !533}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !703, file: !698, line: 88, baseType: !885, size: 64, offset: 2880)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!446, !695, !551}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !703, file: !698, line: 89, baseType: !885, size: 64, offset: 2944)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !703, file: !698, line: 90, baseType: !890, size: 64, offset: 3008)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!446, !695, !679, !713}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !703, file: !698, line: 91, baseType: !822, size: 64, offset: 3072)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !703, file: !698, line: 93, baseType: !895, size: 64, offset: 3136)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!446, !695, !898}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !703, file: !698, line: 94, baseType: !902, size: 64, offset: 3200)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!446, !695, !488, !603, !603, !533, !905, !905, !795}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !703, file: !698, line: 95, baseType: !902, size: 64, offset: 3264)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !703, file: !698, line: 96, baseType: !902, size: 64, offset: 3328)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !703, file: !698, line: 97, baseType: !902, size: 64, offset: 3392)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !703, file: !698, line: 99, baseType: !910, size: 64, offset: 3456)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!446, !695, !913, !916}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !738, line: 51, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !738, line: 51, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !698, line: 609, size: 6208, elements: !919)
!919 = !{!920, !921, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !940, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !961, !962, !963, !964, !965, !966, !967}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !918, file: !698, line: 610, baseType: !670, size: 4480)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !918, file: !698, line: 610, baseType: !922, size: 32, offset: 4480)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !484)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !918, file: !698, line: 611, baseType: !488, size: 32, offset: 4512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !918, file: !698, line: 611, baseType: !488, size: 32, offset: 4544)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !918, file: !698, line: 611, baseType: !488, size: 32, offset: 4576)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !918, file: !698, line: 612, baseType: !488, size: 32, offset: 4608)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !918, file: !698, line: 613, baseType: !488, size: 32, offset: 4640)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !918, file: !698, line: 614, baseType: !533, size: 64, offset: 4672)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !918, file: !698, line: 615, baseType: !535, size: 64, offset: 4736)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !918, file: !698, line: 616, baseType: !871, size: 64, offset: 4800)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !918, file: !698, line: 617, baseType: !533, size: 64, offset: 4864)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !918, file: !698, line: 618, baseType: !933, size: 64, offset: 4928)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !698, line: 602, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 598, size: 128, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !935, file: !698, line: 599, baseType: !488, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !935, file: !698, line: 600, baseType: !488, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !935, file: !698, line: 601, baseType: !550, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !918, file: !698, line: 619, baseType: !941, size: 64, offset: 4992)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !698, line: 607, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 604, size: 128, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !943, file: !698, line: 605, baseType: !488, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !943, file: !698, line: 606, baseType: !550, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !918, file: !698, line: 620, baseType: !550, size: 64, offset: 5056)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !918, file: !698, line: 621, baseType: !542, size: 64, offset: 5120)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !918, file: !698, line: 622, baseType: !542, size: 64, offset: 5184)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !918, file: !698, line: 623, baseType: !679, size: 64, offset: 5248)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !918, file: !698, line: 623, baseType: !679, size: 64, offset: 5312)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !918, file: !698, line: 623, baseType: !679, size: 64, offset: 5376)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !918, file: !698, line: 624, baseType: !603, size: 32, offset: 5440)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !918, file: !698, line: 625, baseType: !633, size: 64, offset: 5504)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !918, file: !698, line: 626, baseType: !429, size: 64, offset: 5568)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !918, file: !698, line: 627, baseType: !679, size: 64, offset: 5632)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !918, file: !698, line: 628, baseType: !488, size: 32, offset: 5696)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !918, file: !698, line: 629, baseType: !465, size: 64, offset: 5760)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !918, file: !698, line: 630, baseType: !960, size: 32, offset: 5824)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !918, file: !698, line: 631, baseType: !488, size: 32, offset: 5856)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !918, file: !698, line: 631, baseType: !488, size: 32, offset: 5888)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !918, file: !698, line: 632, baseType: !603, size: 32, offset: 5920)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !918, file: !698, line: 633, baseType: !603, size: 32, offset: 5952)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !918, file: !698, line: 634, baseType: !476, size: 64, offset: 6016)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !918, file: !698, line: 634, baseType: !429, size: 64, offset: 6080)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !918, file: !698, line: 635, baseType: !496, size: 64, offset: 6144)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !703, file: !698, line: 100, baseType: !969, size: 64, offset: 3520)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!446, !695, !488, !488, !972, !975}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !974)
!974 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !703, file: !698, line: 101, baseType: !818, size: 64, offset: 3584)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !703, file: !698, line: 102, baseType: !978, size: 64, offset: 3648)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!446, !695, !737, !737, !771}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !703, file: !698, line: 103, baseType: !706, size: 64, offset: 3712)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !703, file: !698, line: 105, baseType: !983, size: 64, offset: 3776)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!446, !695, !737, !737, !770, !771}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !703, file: !698, line: 106, baseType: !818, size: 64, offset: 3840)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !703, file: !698, line: 107, baseType: !988, size: 64, offset: 3904)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!446, !695, !452}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !703, file: !698, line: 108, baseType: !992, size: 64, offset: 3968)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!446, !695, !995, !770, !771}
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !465)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !703, file: !698, line: 109, baseType: !633, size: 64, offset: 4032)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !703, file: !698, line: 111, baseType: !998, size: 64, offset: 4096)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!446, !695, !695, !695, !542, !695}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !703, file: !698, line: 112, baseType: !1002, size: 64, offset: 4160)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!446, !695, !695, !695, !695}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !703, file: !698, line: 113, baseType: !1006, size: 64, offset: 4224)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!446, !695, !1009, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !738, line: 30, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !738, line: 30, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !703, file: !698, line: 114, baseType: !706, size: 64, offset: 4288)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !703, file: !698, line: 115, baseType: !822, size: 64, offset: 4352)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !703, file: !698, line: 117, baseType: !881, size: 64, offset: 4416)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !703, file: !698, line: 118, baseType: !881, size: 64, offset: 4480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !703, file: !698, line: 119, baseType: !992, size: 64, offset: 4544)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !703, file: !698, line: 120, baseType: !1018, size: 64, offset: 4608)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!446, !695, !1021, !795}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !703, file: !698, line: 121, baseType: !633, size: 64, offset: 4672)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !703, file: !698, line: 123, baseType: !1024, size: 64, offset: 4736)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!446, !695, !488, !429}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !703, file: !698, line: 124, baseType: !1028, size: 64, offset: 4800)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!446, !695, !916, !679, !429}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !703, file: !698, line: 125, baseType: !1032, size: 64, offset: 4864)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!446, !579, !695}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !703, file: !698, line: 126, baseType: !720, size: 64, offset: 4928)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !703, file: !698, line: 127, baseType: !720, size: 64, offset: 4992)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !703, file: !698, line: 129, baseType: !1038, size: 64, offset: 5056)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!446, !695, !871}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !703, file: !698, line: 130, baseType: !1042, size: 64, offset: 5120)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!446, !695, !1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1047, file: !60, line: 653, baseType: !488, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1047, file: !60, line: 653, baseType: !679, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !703, file: !698, line: 131, baseType: !1042, size: 64, offset: 5184)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !703, file: !698, line: 132, baseType: !1053, size: 64, offset: 5248)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!446, !695, !533, !533, !533}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !703, file: !698, line: 133, baseType: !988, size: 64, offset: 5312)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !703, file: !698, line: 135, baseType: !1058, size: 64, offset: 5376)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!446, !695, !542, !795}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !703, file: !698, line: 136, baseType: !1058, size: 64, offset: 5440)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !703, file: !698, line: 137, baseType: !1063, size: 64, offset: 5504)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!446, !695, !795}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !703, file: !698, line: 138, baseType: !706, size: 64, offset: 5568)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !703, file: !698, line: 139, baseType: !1068, size: 64, offset: 5632)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!446, !695, !682, !682}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !703, file: !698, line: 141, baseType: !633, size: 64, offset: 5696)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !703, file: !698, line: 142, baseType: !1073, size: 64, offset: 5760)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!446, !695, !695, !542, !695}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !703, file: !698, line: 143, baseType: !1077, size: 64, offset: 5824)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!446, !695, !695, !695}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !703, file: !698, line: 144, baseType: !633, size: 64, offset: 5888)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !703, file: !698, line: 145, baseType: !1073, size: 64, offset: 5952)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !703, file: !698, line: 147, baseType: !1077, size: 64, offset: 6016)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !703, file: !698, line: 148, baseType: !633, size: 64, offset: 6080)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !703, file: !698, line: 149, baseType: !1073, size: 64, offset: 6144)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !703, file: !698, line: 150, baseType: !1077, size: 64, offset: 6208)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !703, file: !698, line: 151, baseType: !1087, size: 64, offset: 6272)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!446, !695, !603}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !703, file: !698, line: 153, baseType: !818, size: 64, offset: 6336)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !703, file: !698, line: 154, baseType: !818, size: 64, offset: 6400)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !703, file: !698, line: 155, baseType: !818, size: 64, offset: 6464)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !703, file: !698, line: 156, baseType: !818, size: 64, offset: 6528)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !703, file: !698, line: 157, baseType: !988, size: 64, offset: 6592)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !703, file: !698, line: 159, baseType: !1096, size: 64, offset: 6656)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!446, !695, !488, !711}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !703, file: !698, line: 160, baseType: !818, size: 64, offset: 6720)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !703, file: !698, line: 161, baseType: !818, size: 64, offset: 6784)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !703, file: !698, line: 162, baseType: !818, size: 64, offset: 6848)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !703, file: !698, line: 163, baseType: !818, size: 64, offset: 6912)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !703, file: !698, line: 165, baseType: !1077, size: 64, offset: 6976)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !703, file: !698, line: 166, baseType: !1077, size: 64, offset: 7040)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !703, file: !698, line: 167, baseType: !881, size: 64, offset: 7104)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !703, file: !698, line: 168, baseType: !1107, size: 64, offset: 7168)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!446, !695, !679, !488}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !703, file: !698, line: 169, baseType: !1111, size: 64, offset: 7232)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!446, !695, !795, !533}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !703, file: !698, line: 171, baseType: !842, size: 64, offset: 7296)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !703, file: !698, line: 172, baseType: !818, size: 64, offset: 7360)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !703, file: !698, line: 173, baseType: !1117, size: 64, offset: 7424)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!446, !695, !533, !905}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !703, file: !698, line: 174, baseType: !978, size: 64, offset: 7488)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !703, file: !698, line: 175, baseType: !978, size: 64, offset: 7552)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !703, file: !698, line: 177, baseType: !720, size: 64, offset: 7616)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !703, file: !698, line: 178, baseType: !767, size: 64, offset: 7680)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !703, file: !698, line: 179, baseType: !720, size: 64, offset: 7744)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !703, file: !698, line: 180, baseType: !724, size: 64, offset: 7808)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !703, file: !698, line: 181, baseType: !1127, size: 64, offset: 7872)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!446, !695, !426, !770, !771}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !703, file: !698, line: 183, baseType: !1038, size: 64, offset: 7936)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !703, file: !698, line: 184, baseType: !802, size: 64, offset: 8000)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !703, file: !698, line: 185, baseType: !1133, size: 64, offset: 8064)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!446, !695, !1136}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !703, file: !698, line: 186, baseType: !1138, size: 64, offset: 8128)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!446, !695, !488, !709, !550}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !703, file: !698, line: 187, baseType: !861, size: 64, offset: 8192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !703, file: !698, line: 189, baseType: !1143, size: 64, offset: 8256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!446, !695, !488, !488, !533, !711}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !703, file: !698, line: 190, baseType: !633, size: 64, offset: 8320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !703, file: !698, line: 191, baseType: !1073, size: 64, offset: 8384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !703, file: !698, line: 192, baseType: !1077, size: 64, offset: 8448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !703, file: !698, line: 193, baseType: !1150, size: 64, offset: 8512)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!446, !695, !913, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !698, line: 660, size: 5312, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1155, file: !698, line: 661, baseType: !670, size: 4480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1155, file: !698, line: 661, baseType: !922, size: 32, offset: 4480)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1155, file: !698, line: 662, baseType: !488, size: 32, offset: 4512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1155, file: !698, line: 662, baseType: !488, size: 32, offset: 4544)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1155, file: !698, line: 662, baseType: !488, size: 32, offset: 4576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1155, file: !698, line: 663, baseType: !488, size: 32, offset: 4608)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1155, file: !698, line: 664, baseType: !488, size: 32, offset: 4640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1155, file: !698, line: 665, baseType: !533, size: 64, offset: 4672)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1155, file: !698, line: 666, baseType: !533, size: 64, offset: 4736)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1155, file: !698, line: 667, baseType: !488, size: 32, offset: 4800)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1155, file: !698, line: 668, baseType: !960, size: 32, offset: 4832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1155, file: !698, line: 670, baseType: !533, size: 64, offset: 4864)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1155, file: !698, line: 670, baseType: !533, size: 64, offset: 4928)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1155, file: !698, line: 671, baseType: !533, size: 64, offset: 4992)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1155, file: !698, line: 672, baseType: !533, size: 64, offset: 5056)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1155, file: !698, line: 673, baseType: !533, size: 64, offset: 5120)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1155, file: !698, line: 674, baseType: !488, size: 32, offset: 5184)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1155, file: !698, line: 675, baseType: !533, size: 64, offset: 5248)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !703, file: !698, line: 195, baseType: !1176, size: 64, offset: 8576)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!446, !1153, !695, !695}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !703, file: !698, line: 196, baseType: !1176, size: 64, offset: 8640)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !703, file: !698, line: 197, baseType: !633, size: 64, offset: 8704)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !703, file: !698, line: 198, baseType: !1073, size: 64, offset: 8768)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !703, file: !698, line: 199, baseType: !1077, size: 64, offset: 8832)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !703, file: !698, line: 201, baseType: !1184, size: 64, offset: 8896)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!446, !695, !488, !488}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !703, file: !698, line: 202, baseType: !856, size: 64, offset: 8960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !703, file: !698, line: 203, baseType: !724, size: 64, offset: 9024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !703, file: !698, line: 204, baseType: !910, size: 64, offset: 9088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !703, file: !698, line: 205, baseType: !1038, size: 64, offset: 9152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !703, file: !698, line: 206, baseType: !1192, size: 64, offset: 9216)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!446, !426, !695, !488, !770, !771}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !703, file: !698, line: 208, baseType: !1196, size: 64, offset: 9280)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!446, !488, !866}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !703, file: !698, line: 209, baseType: !1077, size: 64, offset: 9344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !703, file: !698, line: 210, baseType: !873, size: 64, offset: 9408)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !697, file: !698, line: 438, baseType: !1202, size: 64, offset: 13952)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !738, line: 60, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1204, file: !114, line: 241, baseType: !426, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !114, line: 242, baseType: !505, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1204, file: !114, line: 243, baseType: !488, size: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1204, file: !114, line: 243, baseType: !488, size: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1204, file: !114, line: 244, baseType: !488, size: 32, offset: 160)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1204, file: !114, line: 244, baseType: !488, size: 32, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1204, file: !114, line: 245, baseType: !533, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1204, file: !114, line: 246, baseType: !603, size: 32, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1204, file: !114, line: 247, baseType: !488, size: 32, offset: 352)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1204, file: !114, line: 251, baseType: !488, size: 32, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1204, file: !114, line: 252, baseType: !1009, size: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1204, file: !114, line: 253, baseType: !603, size: 32, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1204, file: !114, line: 254, baseType: !488, size: 32, offset: 544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1204, file: !114, line: 254, baseType: !488, size: 32, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1204, file: !114, line: 255, baseType: !488, size: 32, offset: 608)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !697, file: !698, line: 438, baseType: !1202, size: 64, offset: 14016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !698, line: 439, baseType: !429, size: 64, offset: 14080)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !697, file: !698, line: 440, baseType: !1224, size: 32, offset: 14144)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !697, file: !698, line: 441, baseType: !603, size: 32, offset: 14176)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !697, file: !698, line: 442, baseType: !603, size: 32, offset: 14208)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !697, file: !698, line: 443, baseType: !1228, size: 448, offset: 14272)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1229, size: 448, elements: !1230)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !465)
!1230 = !{!1231}
!1231 = !DISubrange(count: 7)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !697, file: !698, line: 444, baseType: !603, size: 32, offset: 14720)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !697, file: !698, line: 445, baseType: !603, size: 32, offset: 14752)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !697, file: !698, line: 446, baseType: !488, size: 32, offset: 14784)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !697, file: !698, line: 447, baseType: !526, size: 64, offset: 14848)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !697, file: !698, line: 448, baseType: !526, size: 64, offset: 14912)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !697, file: !698, line: 449, baseType: !778, size: 640, offset: 14976)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !697, file: !698, line: 450, baseType: !713, size: 32, offset: 15616)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !697, file: !698, line: 451, baseType: !1240, size: 2880, offset: 15680)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !698, line: 318, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !698, line: 319, size: 2880, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1262, !1263, !1268, !1273, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1288, !1289, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1321, !1322, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1347, !1348, !1349}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1241, file: !698, line: 320, baseType: !488, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1241, file: !698, line: 321, baseType: !488, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1241, file: !698, line: 322, baseType: !488, size: 32, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1241, file: !698, line: 323, baseType: !488, size: 32, offset: 96)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1241, file: !698, line: 324, baseType: !488, size: 32, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1241, file: !698, line: 325, baseType: !488, size: 32, offset: 160)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1241, file: !698, line: 326, baseType: !1250, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !698, line: 293, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !698, line: 295, size: 448, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1252, file: !698, line: 296, baseType: !1250, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1252, file: !698, line: 297, baseType: !550, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1252, file: !698, line: 297, baseType: !550, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1252, file: !698, line: 298, baseType: !533, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1252, file: !698, line: 298, baseType: !533, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1252, file: !698, line: 299, baseType: !488, size: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1252, file: !698, line: 300, baseType: !488, size: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1252, file: !698, line: 301, baseType: !488, size: 32, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1241, file: !698, line: 326, baseType: !1250, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1241, file: !698, line: 328, baseType: !1264, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!446, !695, !1267, !533}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1241, file: !698, line: 329, baseType: !1269, size: 64, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!446, !1267, !1272, !535, !535, !553, !533}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1241, file: !698, line: 330, baseType: !1274, size: 64, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!446, !1267}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1241, file: !698, line: 331, baseType: !1274, size: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1241, file: !698, line: 334, baseType: !426, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1241, file: !698, line: 335, baseType: !505, size: 32, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1241, file: !698, line: 335, baseType: !505, size: 32, offset: 672)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1241, file: !698, line: 336, baseType: !505, size: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1241, file: !698, line: 336, baseType: !505, size: 32, offset: 736)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1241, file: !698, line: 337, baseType: !1284, size: 64, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !419, line: 339, baseType: !1286)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !419, line: 339, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1241, file: !698, line: 338, baseType: !1284, size: 64, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1241, file: !698, line: 339, baseType: !1290, size: 64, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !419, line: 341, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !419, line: 351, size: 192, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1292, file: !419, line: 354, baseType: !72, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1292, file: !419, line: 355, baseType: !72, size: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1292, file: !419, line: 356, baseType: !72, size: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1292, file: !419, line: 361, baseType: !72, size: 32, offset: 96)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1292, file: !419, line: 362, baseType: !599, size: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1241, file: !698, line: 340, baseType: !488, size: 32, offset: 960)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1241, file: !698, line: 340, baseType: !488, size: 32, offset: 992)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1241, file: !698, line: 341, baseType: !550, size: 64, offset: 1024)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1241, file: !698, line: 342, baseType: !533, size: 64, offset: 1088)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1241, file: !698, line: 343, baseType: !553, size: 64, offset: 1152)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1241, file: !698, line: 344, baseType: !535, size: 64, offset: 1216)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1241, file: !698, line: 345, baseType: !488, size: 32, offset: 1280)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1241, file: !698, line: 346, baseType: !1272, size: 64, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1241, file: !698, line: 347, baseType: !603, size: 32, offset: 1408)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1241, file: !698, line: 348, baseType: !488, size: 32, offset: 1440)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1241, file: !698, line: 351, baseType: !603, size: 32, offset: 1472)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1241, file: !698, line: 352, baseType: !603, size: 32, offset: 1504)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1241, file: !698, line: 353, baseType: !505, size: 32, offset: 1536)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1241, file: !698, line: 354, baseType: !505, size: 32, offset: 1568)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1241, file: !698, line: 355, baseType: !1272, size: 64, offset: 1600)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1241, file: !698, line: 356, baseType: !1272, size: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1241, file: !698, line: 357, baseType: !1316, size: 64, offset: 1728)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !698, line: 310, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 308, size: 32, elements: !1319)
!1319 = !{!1320}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1318, file: !698, line: 309, baseType: !488, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1241, file: !698, line: 357, baseType: !1316, size: 64, offset: 1792)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1241, file: !698, line: 358, baseType: !1323, size: 64, offset: 1856)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !698, line: 316, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 312, size: 128, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1325, file: !698, line: 313, baseType: !429, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1325, file: !698, line: 314, baseType: !488, size: 32, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1325, file: !698, line: 315, baseType: !467, size: 8, offset: 96)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1241, file: !698, line: 359, baseType: !1323, size: 64, offset: 1920)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1241, file: !698, line: 360, baseType: !1323, size: 64, offset: 1984)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1241, file: !698, line: 361, baseType: !488, size: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1241, file: !698, line: 362, baseType: !505, size: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1241, file: !698, line: 363, baseType: !488, size: 32, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1241, file: !698, line: 364, baseType: !1272, size: 64, offset: 2176)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1241, file: !698, line: 365, baseType: !1290, size: 64, offset: 2240)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1241, file: !698, line: 366, baseType: !505, size: 32, offset: 2304)
