; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/morethuente/morethuente.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/morethuente/morethuente.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TaoLineSearch = type { %struct._p_PetscObject, [1 x %struct._TaoLineSearchOps], i8*, i8*, i8*, i8*, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec*, %struct._p_Vec*, double, double, %struct._p_Vec*, %struct._p_Vec*, double, double, i32, i32, i32, i32, i32, double, double, double, double, double, %struct._p_Tao* }

!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 6, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!29 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!30 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!31 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!32 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!33 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!34 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!35 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!36 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!37 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!38 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!39 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 663, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!48 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!66 = !{!67, !71, !72, !241, !107, !275, !133}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !68, line: 330, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !68, line: 330, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !75, line: 73, size: 4480, elements: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!76 = !{!77, !79, !128, !129, !131, !134, !135, !136, !137, !145, !146, !148, !152, !156, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !169, !170, !171, !173, !174, !176, !178, !179, !180, !181, !182, !185, !187, !188, !189, !190, !191, !194, !196, !197, !198, !208, !210, !211, !215, !216, !265, !270, !272, !273, !274}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !74, file: !75, line: 74, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !74, file: !75, line: 75, baseType: !80, size: 448, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 448, elements: !126)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !75, line: 53, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 45, size: 448, elements: !83)
!83 = !{!84, !90, !98, !103, !110, !114, !121}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !82, file: !75, line: 46, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !72, !89}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !82, file: !75, line: 47, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!88, !72, !94}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !95, line: 16, baseType: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !95, line: 16, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !82, file: !75, line: 48, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!88, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !82, file: !75, line: 49, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!88, !72, !107, !72}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !82, file: !75, line: 50, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!88, !72, !107, !102}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !82, file: !75, line: 51, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!88, !72, !107, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !82, file: !75, line: 52, baseType: !122, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!88, !72, !107, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !74, file: !75, line: 76, baseType: !67, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 77, baseType: !130, size: 32, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !74, file: !75, line: 78, baseType: !132, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !133)
!133 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !74, file: !75, line: 78, baseType: !132, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !74, file: !75, line: 78, baseType: !132, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !74, file: !75, line: 78, baseType: !132, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 79, baseType: !138, size: 64, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !141, line: 27, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !143, line: 43, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!144 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !74, file: !75, line: 80, baseType: !130, size: 32, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !74, file: !75, line: 81, baseType: !147, size: 32, offset: 992)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !74, file: !75, line: 82, baseType: !149, size: 64, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !74, file: !75, line: 83, baseType: !153, size: 64, offset: 1088)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !74, file: !75, line: 84, baseType: !157, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !74, file: !75, line: 85, baseType: !157, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !74, file: !75, line: 86, baseType: !157, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !74, file: !75, line: 87, baseType: !157, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !75, line: 88, baseType: !72, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !74, file: !75, line: 89, baseType: !138, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 90, baseType: !157, size: 64, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !74, file: !75, line: 91, baseType: !157, size: 64, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !74, file: !75, line: 92, baseType: !130, size: 32, offset: 1664)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !74, file: !75, line: 93, baseType: !71, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !74, file: !75, line: 94, baseType: !168, size: 64, offset: 1792)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !139)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !74, file: !75, line: 95, baseType: !130, size: 32, offset: 1856)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !74, file: !75, line: 95, baseType: !130, size: 32, offset: 1888)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !74, file: !75, line: 96, baseType: !172, size: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !74, file: !75, line: 96, baseType: !172, size: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !74, file: !75, line: 97, baseType: !175, size: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !74, file: !75, line: 97, baseType: !177, size: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !74, file: !75, line: 98, baseType: !130, size: 32, offset: 2176)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !74, file: !75, line: 98, baseType: !130, size: 32, offset: 2208)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !74, file: !75, line: 99, baseType: !172, size: 64, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !74, file: !75, line: 99, baseType: !172, size: 64, offset: 2304)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !74, file: !75, line: 100, baseType: !183, size: 64, offset: 2368)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !133)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !74, file: !75, line: 100, baseType: !186, size: 64, offset: 2432)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !74, file: !75, line: 101, baseType: !130, size: 32, offset: 2496)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !74, file: !75, line: 101, baseType: !130, size: 32, offset: 2528)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !74, file: !75, line: 102, baseType: !172, size: 64, offset: 2560)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !74, file: !75, line: 102, baseType: !172, size: 64, offset: 2624)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !74, file: !75, line: 103, baseType: !192, size: 64, offset: 2688)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !184)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !74, file: !75, line: 103, baseType: !195, size: 64, offset: 2752)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !74, file: !75, line: 104, baseType: !125, size: 64, offset: 2816)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !74, file: !75, line: 105, baseType: !130, size: 32, offset: 2880)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !74, file: !75, line: 106, baseType: !199, size: 128, offset: 2944)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, elements: !206)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !75, line: 64, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 61, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !202, file: !75, line: 62, baseType: !118, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !202, file: !75, line: 63, baseType: !71, size: 64, offset: 64)
!206 = !{!207}
!207 = !DISubrange(count: 2)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !74, file: !75, line: 107, baseType: !209, size: 64, offset: 3072)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !206)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !74, file: !75, line: 108, baseType: !71, size: 64, offset: 3136)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !74, file: !75, line: 109, baseType: !212, size: 64, offset: 3200)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!88, !71}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !74, file: !75, line: 111, baseType: !130, size: 32, offset: 3264)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !74, file: !75, line: 112, baseType: !217, size: 320, offset: 3328)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 320, elements: !263)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!88, !221, !72, !71}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !224)
!224 = !{!225, !226, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !223, file: !10, line: 100, baseType: !130, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !10, line: 101, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !238, !239, !240, !244, !246, !248, !249, !250}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !229, file: !10, line: 84, baseType: !157, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !229, file: !10, line: 85, baseType: !157, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !10, line: 86, baseType: !71, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !229, file: !10, line: 87, baseType: !149, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !229, file: !10, line: 88, baseType: !236, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !229, file: !10, line: 89, baseType: !109, size: 8, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !229, file: !10, line: 90, baseType: !157, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !229, file: !10, line: 91, baseType: !241, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !242, line: 46, baseType: !243)
!242 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!243 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !229, file: !10, line: 92, baseType: !245, size: 32, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !10, line: 93, baseType: !247, size: 32, offset: 544)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !10, line: 94, baseType: !227, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !229, file: !10, line: 95, baseType: !157, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !229, file: !10, line: 96, baseType: !71, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !223, file: !10, line: 102, baseType: !157, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !223, file: !10, line: 102, baseType: !157, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !223, file: !10, line: 103, baseType: !157, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !223, file: !10, line: 104, baseType: !67, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !223, file: !10, line: 105, baseType: !245, size: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !223, file: !10, line: 105, baseType: !245, size: 32, offset: 416)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !223, file: !10, line: 105, baseType: !245, size: 32, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !223, file: !10, line: 106, baseType: !72, size: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !223, file: !10, line: 107, baseType: !260, size: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!263 = !{!264}
!264 = !DISubrange(count: 5)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !74, file: !75, line: 113, baseType: !266, size: 320, offset: 3648)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 320, elements: !263)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!88, !72, !71}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !74, file: !75, line: 114, baseType: !271, size: 320, offset: 3968)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 320, elements: !263)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !74, file: !75, line: 115, baseType: !245, size: 32, offset: 4288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !74, file: !75, line: 120, baseType: !260, size: 64, offset: 4352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !74, file: !75, line: 121, baseType: !245, size: 32, offset: 4416)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch_MT", file: !277, line: 14, baseType: !278)
!277 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/linesearch/impls/morethuente/morethuente.h", directory: "/home/users/ndemeye/xSDK")
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 4, size: 640, elements: !279)
!279 = !{!280, !281, !282, !283, !288, !289, !290, !291, !292, !293, !294}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bracket", scope: !278, file: !277, line: 5, baseType: !130, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "infoc", scope: !278, file: !277, line: 6, baseType: !130, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !278, file: !277, line: 7, baseType: !184, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !278, file: !277, line: 8, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !285, line: 21, baseType: !286)
!285 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !285, line: 21, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !278, file: !277, line: 9, baseType: !284, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stx", scope: !278, file: !277, line: 11, baseType: !184, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fx", scope: !278, file: !277, line: 11, baseType: !184, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dgx", scope: !278, file: !277, line: 11, baseType: !184, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sty", scope: !278, file: !277, line: 12, baseType: !184, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fy", scope: !278, file: !277, line: 12, baseType: !184, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dgy", scope: !278, file: !277, line: 12, baseType: !184, size: 64, offset: 576)
!295 = !{i32 7, !"Dwarf Version", i32 4}
!296 = !{i32 2, !"Debug Info Version", i32 3}
!297 = !{i32 1, !"wchar_size", i32 4}
!298 = !{i32 7, !"PIC Level", i32 2}
!299 = !{i32 7, !"uwtable", i32 1}
!300 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!301 = distinct !DISubprogram(name: "TaoLineSearchCreate_MT", scope: !302, file: !302, line: 311, type: !303, scopeLine: 312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !389)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/morethuente/morethuente.c", directory: "/home/users/ndemeye/xSDK")
!303 = !DISubroutineType(types: !304)
!304 = !{!88, !305}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !25, line: 5, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !308, line: 22, size: 7104, elements: !309)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taolinesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!309 = !{!310, !312, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !379, !380, !381, !382, !383, !384}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !307, file: !308, line: 23, baseType: !311, size: 4480)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !75, line: 122, baseType: !74)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !307, file: !308, line: 23, baseType: !313, size: 704, offset: 4480)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !126)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoLineSearchOps", file: !308, line: 8, size: 704, elements: !315)
!315 = !{!316, !320, !324, !328, !332, !334, !338, !342, !346, !347, !348}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !314, file: !308, line: 9, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!88, !305, !284, !183, !71}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !314, file: !308, line: 10, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!88, !305, !284, !284, !71}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !314, file: !308, line: 11, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!88, !305, !284, !183, !284, !71}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgts", scope: !314, file: !308, line: 12, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!88, !305, !284, !284, !183, !183, !71}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !314, file: !308, line: 13, baseType: !333, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !314, file: !308, line: 14, baseType: !335, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!88, !305, !284, !183, !284, !284}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !314, file: !308, line: 15, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!88, !305, !94}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !314, file: !308, line: 16, baseType: !343, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!88, !221, !305}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !314, file: !308, line: 17, baseType: !333, size: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !314, file: !308, line: 18, baseType: !333, size: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !314, file: !308, line: 19, baseType: !333, size: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_func", scope: !307, file: !308, line: 24, baseType: !71, size: 64, offset: 5184)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_grad", scope: !307, file: !308, line: 25, baseType: !71, size: 64, offset: 5248)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgrad", scope: !307, file: !308, line: 26, baseType: !71, size: 64, offset: 5312)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgts", scope: !307, file: !308, line: 27, baseType: !71, size: 64, offset: 5376)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "usemonitor", scope: !307, file: !308, line: 28, baseType: !245, size: 32, offset: 5440)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !307, file: !308, line: 29, baseType: !94, size: 64, offset: 5504)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !307, file: !308, line: 31, baseType: !245, size: 32, offset: 5568)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "usegts", scope: !307, file: !308, line: 32, baseType: !245, size: 32, offset: 5600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "usetaoroutines", scope: !307, file: !308, line: 33, baseType: !245, size: 32, offset: 5632)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjective", scope: !307, file: !308, line: 34, baseType: !245, size: 32, offset: 5664)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hasgradient", scope: !307, file: !308, line: 35, baseType: !245, size: 32, offset: 5696)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjectiveandgradient", scope: !307, file: !308, line: 36, baseType: !245, size: 32, offset: 5728)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !308, line: 37, baseType: !71, size: 64, offset: 5760)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !307, file: !308, line: 40, baseType: !284, size: 64, offset: 5824)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !307, file: !308, line: 41, baseType: !284, size: 64, offset: 5888)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !307, file: !308, line: 42, baseType: !130, size: 32, offset: 5952)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !307, file: !308, line: 44, baseType: !284, size: 64, offset: 6016)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !307, file: !308, line: 45, baseType: !284, size: 64, offset: 6080)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "f_fullstep", scope: !307, file: !308, line: 46, baseType: !184, size: 64, offset: 6144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "new_f", scope: !307, file: !308, line: 47, baseType: !184, size: 64, offset: 6208)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "new_x", scope: !307, file: !308, line: 48, baseType: !284, size: 64, offset: 6272)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "new_g", scope: !307, file: !308, line: 49, baseType: !284, size: 64, offset: 6336)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !307, file: !308, line: 51, baseType: !184, size: 64, offset: 6400)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !307, file: !308, line: 52, baseType: !184, size: 64, offset: 6464)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !307, file: !308, line: 54, baseType: !130, size: 32, offset: 6528)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nfeval", scope: !307, file: !308, line: 55, baseType: !130, size: 32, offset: 6560)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ngeval", scope: !307, file: !308, line: 56, baseType: !130, size: 32, offset: 6592)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nfgeval", scope: !307, file: !308, line: 57, baseType: !130, size: 32, offset: 6624)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !307, file: !308, line: 58, baseType: !378, size: 32, offset: 6656)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearchConvergedReason", file: !25, line: 19, baseType: !24)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !307, file: !308, line: 60, baseType: !184, size: 64, offset: 6720)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ftol", scope: !307, file: !308, line: 61, baseType: !184, size: 64, offset: 6784)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !307, file: !308, line: 62, baseType: !184, size: 64, offset: 6848)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stepmin", scope: !307, file: !308, line: 63, baseType: !184, size: 64, offset: 6912)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stepmax", scope: !307, file: !308, line: 64, baseType: !184, size: 64, offset: 6976)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tao", scope: !307, file: !308, line: 66, baseType: !385, size: 64, offset: 7040)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !386, line: 118, baseType: !387)
!386 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !386, line: 118, flags: DIFlagFwdDecl)
!389 = !{!390, !391, !392, !393}
!390 = !DILocalVariable(name: "ls", arg: 1, scope: !301, file: !302, line: 311, type: !305)
!391 = !DILocalVariable(name: "ierr", scope: !301, file: !302, line: 313, type: !88)
!392 = !DILocalVariable(name: "ctx", scope: !301, file: !302, line: 314, type: !275)
!393 = !DILocalVariable(name: "ierr__", scope: !394, file: !302, line: 318, type: !88)
!394 = distinct !DILexicalBlock(scope: !301, file: !302, line: 318, column: 31)
!395 = !DILocation(line: 0, scope: !301)
!396 = !DILocation(line: 314, column: 3, scope: !301)
!397 = !DILocation(line: 316, column: 3, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !302, line: 316, column: 3)
!399 = distinct !DILexicalBlock(scope: !400, file: !302, line: 316, column: 3)
!400 = distinct !DILexicalBlock(scope: !301, file: !302, line: 316, column: 3)
!401 = !{!402, !402, i64 0}
!402 = !{!"any pointer", !403, i64 0}
!403 = !{!"omnipotent char", !404, i64 0}
!404 = !{!"Simple C/C++ TBAA"}
!405 = !DILocation(line: 316, column: 3, scope: !399)
!406 = !DILocation(line: 316, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !302, line: 316, column: 3)
!408 = distinct !DILexicalBlock(scope: !398, file: !302, line: 316, column: 3)
!409 = !{!410, !411, i64 1536}
!410 = !{!"", !403, i64 0, !403, i64 512, !403, i64 1024, !403, i64 1280, !411, i64 1536, !411, i64 1540, !403, i64 1544}
!411 = !{!"int", !403, i64 0}
!412 = !DILocation(line: 316, column: 3, scope: !408)
!413 = !DILocation(line: 316, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !407, file: !302, line: 316, column: 3)
!415 = !{!411, !411, i64 0}
!416 = !{!410, !411, i64 1540}
!417 = !DILocation(line: 317, column: 3, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !302, line: 317, column: 3)
!419 = distinct !DILexicalBlock(scope: !301, file: !302, line: 317, column: 3)
!420 = !DILocation(line: 317, column: 3, scope: !419)
!421 = !DILocation(line: 317, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !419, file: !302, line: 317, column: 3)
!423 = !DILocation(line: 317, column: 3, scope: !424)
!424 = distinct !DILexicalBlock(scope: !419, file: !302, line: 317, column: 3)
!425 = !{!426, !411, i64 0}
!426 = !{!"_p_PetscObject", !411, i64 0, !403, i64 8, !402, i64 64, !411, i64 72, !427, i64 80, !427, i64 88, !427, i64 96, !427, i64 104, !428, i64 112, !411, i64 120, !411, i64 124, !402, i64 128, !402, i64 136, !402, i64 144, !402, i64 152, !402, i64 160, !402, i64 168, !402, i64 176, !428, i64 184, !402, i64 192, !402, i64 200, !411, i64 208, !402, i64 216, !428, i64 224, !411, i64 232, !411, i64 236, !402, i64 240, !402, i64 248, !402, i64 256, !402, i64 264, !411, i64 272, !411, i64 276, !402, i64 280, !402, i64 288, !402, i64 296, !402, i64 304, !411, i64 312, !411, i64 316, !402, i64 320, !402, i64 328, !402, i64 336, !402, i64 344, !402, i64 352, !411, i64 360, !403, i64 368, !403, i64 384, !402, i64 392, !402, i64 400, !411, i64 408, !403, i64 416, !403, i64 456, !403, i64 496, !403, i64 536, !402, i64 544, !403, i64 552}
!427 = !{!"double", !403, i64 0}
!428 = !{!"long", !403, i64 0}
!429 = !DILocation(line: 317, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !431, file: !302, line: 317, column: 3)
!431 = distinct !DILexicalBlock(scope: !424, file: !302, line: 317, column: 3)
!432 = !DILocation(line: 317, column: 3, scope: !431)
!433 = !DILocation(line: 318, column: 10, scope: !301)
