; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/pstack.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/pstack.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@petscstack = local_unnamed_addr global %struct.PetscStack* null, align 8, !dbg !0
@PETSC_STDOUT = external local_unnamed_addr global %struct._IO_FILE*, align 8
@PetscErrorPrintf = external local_unnamed_addr global i32 (i8*, ...)*, align 8
@.str = private unnamed_addr constant [77 x i8] c"No error traceback is available, the problem could be in the main program. \0A\00", align 1
@.str.1 = private unnamed_addr constant [66 x i8] c"The EXACT line numbers in the error traceback are not available.\0A\00", align 1
@.str.2 = private unnamed_addr constant [64 x i8] c"instead the line number of the start of the function is given.\0A\00", align 1
@.str.3 = private unnamed_addr constant [19 x i8] c"#%d %s() at %s:%d\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "petscstack", scope: !2, file: !34, line: 4, type: !12, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/pstack.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscStack", file: !14, line: 746, baseType: !15)
!14 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 738, size: 12416, elements: !16)
!16 = !{!17, !24, !25, !28, !29, !30, !31}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !15, file: !14, line: 739, baseType: !18, size: 4096)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 4096, elements: !22)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!23}
!23 = !DISubrange(count: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !15, file: !14, line: 740, baseType: !18, size: 4096, offset: 4096)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !15, file: !14, line: 741, baseType: !26, size: 2048, offset: 8192)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !22)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "petscroutine", scope: !15, file: !14, line: 742, baseType: !26, size: 2048, offset: 10240)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "currentsize", scope: !15, file: !14, line: 743, baseType: !27, size: 32, offset: 12288)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hotdepth", scope: !15, file: !14, line: 744, baseType: !27, size: 32, offset: 12320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !15, file: !14, line: 745, baseType: !32, size: 32, offset: 12352)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!33 = !{!0}
!34 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/error/pstack.c", directory: "/home/users/ndemeye/xSDK")
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{i32 7, !"PIC Level", i32 2}
!39 = !{i32 7, !"uwtable", i32 1}
!40 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!41 = distinct !DISubprogram(name: "PetscStackCreate", scope: !34, file: !34, line: 75, type: !42, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !32}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !27)
!45 = !{!46, !47, !48}
!46 = !DILocalVariable(name: "check", arg: 1, scope: !41, file: !34, line: 75, type: !32)
!47 = !DILocalVariable(name: "petscstack_in", scope: !41, file: !34, line: 77, type: !12)
!48 = !DILocalVariable(name: "i", scope: !41, file: !34, line: 78, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !27)
!50 = !DILocation(line: 0, scope: !41)
!51 = !DILocation(line: 773, column: 11, scope: !52, inlinedAt: !56)
!52 = distinct !DISubprogram(name: "PetscStackActive", scope: !14, file: !14, line: 771, type: !53, scopeLine: 772, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{!32}
!55 = !{}
!56 = distinct !DILocation(line: 80, column: 7, scope: !57)
!57 = distinct !DILexicalBlock(scope: !41, file: !34, line: 80, column: 7)
!58 = !{!59, !59, i64 0}
!59 = !{!"any pointer", !60, i64 0}
!60 = !{!"omnipotent char", !61, i64 0}
!61 = !{!"Simple C/C++ TBAA"}
!62 = !DILocation(line: 80, column: 7, scope: !41)
!63 = !DILocation(line: 82, column: 45, scope: !41)
!64 = !DILocation(line: 82, column: 32, scope: !41)
!65 = !DILocation(line: 83, column: 18, scope: !41)
!66 = !DILocation(line: 83, column: 30, scope: !41)
!67 = !{!68, !69, i64 1536}
!68 = !{!"", !60, i64 0, !60, i64 512, !60, i64 1024, !60, i64 1280, !69, i64 1536, !69, i64 1540, !60, i64 1544}
!69 = !{!"int", !60, i64 0}
!70 = !DILocation(line: 84, column: 18, scope: !41)
!71 = !DILocation(line: 84, column: 30, scope: !41)
!72 = !{!68, !69, i64 1540}
!73 = !DILocation(line: 85, column: 18, scope: !41)
!74 = !DILocation(line: 85, column: 30, scope: !41)
!75 = !{!68, !60, i64 1544}
!76 = !DILocation(line: 88, column: 32, scope: !77)
!77 = distinct !DILexicalBlock(scope: !78, file: !34, line: 86, column: 36)
!78 = distinct !DILexicalBlock(scope: !79, file: !34, line: 86, column: 3)
!79 = distinct !DILexicalBlock(scope: !41, file: !34, line: 86, column: 3)
!80 = !DILocation(line: 90, column: 14, scope: !41)
!81 = !DILocation(line: 99, column: 3, scope: !41)
!82 = !DILocation(line: 100, column: 1, scope: !41)
!83 = distinct !DISubprogram(name: "PetscStackView", scope: !34, file: !34, line: 102, type: !84, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !147)
!84 = !DISubroutineType(types: !85)
!85 = !{!44, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 7, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 245, size: 1728, elements: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!91 = !{!92, !93, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !113, !114, !115, !116, !120, !122, !124, !128, !131, !133, !135, !136, !137, !138, !142, !143}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !90, line: 246, baseType: !27, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !89, file: !90, line: 251, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !89, file: !90, line: 252, baseType: !94, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !89, file: !90, line: 253, baseType: !94, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !89, file: !90, line: 254, baseType: !94, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !89, file: !90, line: 255, baseType: !94, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !89, file: !90, line: 256, baseType: !94, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !89, file: !90, line: 257, baseType: !94, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !89, file: !90, line: 258, baseType: !94, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !89, file: !90, line: 260, baseType: !94, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !89, file: !90, line: 261, baseType: !94, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !89, file: !90, line: 262, baseType: !94, size: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !89, file: !90, line: 264, baseType: !106, size: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !90, line: 160, size: 192, elements: !108)
!108 = !{!109, !110, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !107, file: !90, line: 161, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !107, file: !90, line: 162, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !107, file: !90, line: 166, baseType: !27, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !89, file: !90, line: 266, baseType: !111, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !89, file: !90, line: 268, baseType: !27, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !89, file: !90, line: 272, baseType: !27, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !89, file: !90, line: 274, baseType: !117, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 140, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!119 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !89, file: !90, line: 278, baseType: !121, size: 16, offset: 1024)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !89, file: !90, line: 279, baseType: !123, size: 8, offset: 1040)
!123 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !89, file: !90, line: 280, baseType: !125, size: 8, offset: 1048)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !89, file: !90, line: 284, baseType: !129, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !90, line: 154, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !90, line: 293, baseType: !132, size: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 141, baseType: !119)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !89, file: !90, line: 301, baseType: !134, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !89, file: !90, line: 302, baseType: !134, size: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !89, file: !90, line: 303, baseType: !134, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !89, file: !90, line: 304, baseType: !134, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !89, file: !90, line: 306, baseType: !139, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !140, line: 46, baseType: !141)
!140 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!141 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !89, file: !90, line: 307, baseType: !27, size: 32, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !89, file: !90, line: 309, baseType: !144, size: 160, offset: 1568)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 20)
!147 = !{!148, !149, !150}
!148 = !DILocalVariable(name: "file", arg: 1, scope: !83, file: !34, line: 102, type: !86)
!149 = !DILocalVariable(name: "i", scope: !83, file: !34, line: 104, type: !27)
!150 = !DILocalVariable(name: "j", scope: !83, file: !34, line: 104, type: !27)
!151 = !DILocation(line: 0, scope: !83)
!152 = !DILocation(line: 106, column: 8, scope: !153)
!153 = distinct !DILexicalBlock(scope: !83, file: !34, line: 106, column: 7)
!154 = !DILocation(line: 106, column: 7, scope: !83)
!155 = !DILocation(line: 108, column: 7, scope: !156)
!156 = distinct !DILexicalBlock(scope: !83, file: !34, line: 108, column: 7)
!157 = !DILocation(line: 108, column: 19, scope: !156)
!158 = !DILocation(line: 108, column: 31, scope: !156)
!159 = !DILocation(line: 0, scope: !156)
!160 = !DILocation(line: 108, column: 7, scope: !83)
!161 = !DILocation(line: 109, column: 10, scope: !162)
!162 = distinct !DILexicalBlock(scope: !156, file: !34, line: 108, column: 37)
!163 = !DILocation(line: 110, column: 10, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !34, line: 109, column: 32)
!165 = distinct !DILexicalBlock(scope: !162, file: !34, line: 109, column: 10)
!166 = !DILocation(line: 110, column: 8, scope: !164)
!167 = !DILocation(line: 111, column: 6, scope: !164)
!168 = !DILocation(line: 112, column: 8, scope: !169)
!169 = distinct !DILexicalBlock(scope: !165, file: !34, line: 111, column: 13)
!170 = !DILocation(line: 115, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !156, file: !34, line: 114, column: 10)
!172 = !DILocation(line: 116, column: 9, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !34, line: 115, column: 31)
!174 = distinct !DILexicalBlock(scope: !171, file: !34, line: 115, column: 9)
!175 = !DILocation(line: 116, column: 7, scope: !173)
!176 = !DILocation(line: 117, column: 9, scope: !173)
!177 = !DILocation(line: 117, column: 7, scope: !173)
!178 = !DILocation(line: 118, column: 14, scope: !179)
!179 = distinct !DILexicalBlock(scope: !173, file: !34, line: 118, column: 7)
!180 = !DILocation(line: 118, column: 26, scope: !179)
!181 = !DILocation(line: 118, column: 46, scope: !182)
!182 = distinct !DILexicalBlock(scope: !179, file: !34, line: 118, column: 7)
!183 = !DILocation(line: 118, column: 7, scope: !179)
!184 = !DILocation(line: 0, scope: !179)
!185 = !DILocation(line: 118, column: 62, scope: !182)
!186 = !DILocation(line: 118, column: 104, scope: !182)
!187 = !DILocation(line: 118, column: 128, scope: !182)
!188 = !DILocation(line: 118, column: 148, scope: !182)
!189 = !{!69, !69, i64 0}
!190 = !DILocation(line: 118, column: 60, scope: !182)
!191 = distinct !{!191, !183, !192, !193}
!192 = !DILocation(line: 118, column: 167, scope: !179)
!193 = !{!"llvm.loop.mustprogress"}
!194 = !DILocation(line: 118, column: 56, scope: !182)
!195 = !DILocation(line: 120, column: 7, scope: !196)
!196 = distinct !DILexicalBlock(scope: !174, file: !34, line: 119, column: 12)
!197 = !DILocation(line: 121, column: 7, scope: !196)
!198 = !DILocation(line: 122, column: 14, scope: !199)
!199 = distinct !DILexicalBlock(scope: !196, file: !34, line: 122, column: 7)
!200 = !DILocation(line: 122, column: 26, scope: !199)
!201 = !DILocation(line: 122, column: 46, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !34, line: 122, column: 7)
!203 = !DILocation(line: 122, column: 7, scope: !199)
!204 = !DILocation(line: 0, scope: !199)
!205 = !DILocation(line: 122, column: 100, scope: !202)
!206 = !DILocation(line: 122, column: 118, scope: !202)
!207 = !DILocation(line: 122, column: 142, scope: !202)
!208 = !DILocation(line: 122, column: 162, scope: !202)
!209 = !DILocation(line: 122, column: 60, scope: !202)
