; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/order/sregis.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/order/sregis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!384 = !DILocation(line: 43, column: 32, scope: !315)
!385 = !DILocation(line: 45, column: 10, scope: !315)
!386 = !DILocation(line: 0, scope: !315)
!387 = !DILocation(line: 0, scope: !323)
!388 = !DILocation(line: 45, column: 75, scope: !389)
!389 = distinct !DILexicalBlock(scope: !323, file: !316, line: 45, column: 75)
!390 = !DILocation(line: 45, column: 75, scope: !323)
!391 = !{!"branch_weights", i32 2000, i32 1}
!392 = !DILocation(line: 46, column: 10, scope: !315)
!393 = !DILocation(line: 0, scope: !325)
!394 = !DILocation(line: 46, column: 70, scope: !395)
!395 = distinct !DILexicalBlock(scope: !325, file: !316, line: 46, column: 70)
!396 = !DILocation(line: 46, column: 70, scope: !325)
!397 = !DILocation(line: 47, column: 10, scope: !315)
!398 = !DILocation(line: 0, scope: !327)
!399 = !DILocation(line: 47, column: 71, scope: !400)
!400 = distinct !DILexicalBlock(scope: !327, file: !316, line: 47, column: 71)
!401 = !DILocation(line: 47, column: 71, scope: !327)
!402 = !DILocation(line: 48, column: 10, scope: !315)
!403 = !DILocation(line: 0, scope: !329)
!404 = !DILocation(line: 48, column: 71, scope: !405)
!405 = distinct !DILexicalBlock(scope: !329, file: !316, line: 48, column: 71)
!406 = !DILocation(line: 48, column: 71, scope: !329)
!407 = !DILocation(line: 49, column: 10, scope: !315)
!408 = !DILocation(line: 0, scope: !331)
!409 = !DILocation(line: 49, column: 71, scope: !410)
!410 = distinct !DILexicalBlock(scope: !331, file: !316, line: 49, column: 71)
!411 = !DILocation(line: 49, column: 71, scope: !331)
!412 = !DILocation(line: 50, column: 10, scope: !315)
!413 = !DILocation(line: 0, scope: !333)
!414 = !DILocation(line: 50, column: 77, scope: !415)
!415 = distinct !DILexicalBlock(scope: !333, file: !316, line: 50, column: 77)
!416 = !DILocation(line: 50, column: 77, scope: !333)
!417 = !DILocation(line: 54, column: 10, scope: !315)
!418 = !DILocation(line: 0, scope: !335)
!419 = !DILocation(line: 54, column: 76, scope: !420)
!420 = distinct !DILexicalBlock(scope: !335, file: !316, line: 54, column: 76)
!421 = !DILocation(line: 54, column: 76, scope: !335)
!422 = !DILocation(line: 58, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !316, line: 58, column: 3)
!424 = distinct !DILexicalBlock(scope: !425, file: !316, line: 58, column: 3)
!425 = distinct !DILexicalBlock(scope: !315, file: !316, line: 58, column: 3)
!426 = !DILocation(line: 58, column: 3, scope: !424)
!427 = !DILocation(line: 58, column: 3, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !316, line: 58, column: 3)
!429 = distinct !DILexicalBlock(scope: !423, file: !316, line: 58, column: 3)
!430 = !DILocation(line: 58, column: 3, scope: !429)
!431 = !DILocation(line: 58, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !316, line: 58, column: 3)
!433 = distinct !DILexicalBlock(scope: !428, file: !316, line: 58, column: 3)
!434 = !DILocation(line: 58, column: 3, scope: !433)
!435 = !DILocation(line: 58, column: 3, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !316, line: 58, column: 3)
!437 = !DILocation(line: 58, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !428, file: !316, line: 58, column: 3)
!439 = !DILocation(line: 58, column: 3, scope: !440)
!440 = distinct !DILexicalBlock(scope: !438, file: !316, line: 58, column: 3)
!441 = !DILocation(line: 58, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !316, line: 58, column: 3)
!443 = distinct !DILexicalBlock(scope: !440, file: !316, line: 58, column: 3)
!444 = !DILocation(line: 58, column: 3, scope: !443)
!445 = !DILocation(line: 58, column: 3, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !316, line: 58, column: 3)
!447 = !DILocation(line: 59, column: 1, scope: !315)
!448 = !DISubprogram(name: "MatOrderingRegister", scope: !36, file: !36, line: 1174, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1423)
!449 = !DISubroutineType(types: !450)
!450 = !{!72, !301, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!72, !454, !301, !1422, !1422}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !456, line: 436, size: 23424, elements: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!457 = !{!458, !659, !1165, !1185, !1186, !1187, !1189, !1190, !1191, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1318, !1319, !1335, !1336, !1337, !1338, !1339, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1374, !1394, !1395, !1397, !1398, !1399, !1400, !1401, !1402, !1420, !1421}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !455, file: !456, line: 437, baseType: !459, size: 4480)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !460, line: 122, baseType: !461)
!460 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !460, line: 73, size: 4480, elements: !462)
!462 = !{!463, !465, !512, !513, !515, !518, !519, !520, !521, !529, !530, !532, !536, !540, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !553, !554, !555, !557, !558, !560, !562, !563, !564, !565, !566, !569, !571, !572, !573, !574, !575, !578, !580, !581, !582, !592, !594, !595, !599, !600, !649, !654, !656, !657, !658}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !461, file: !460, line: 74, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !461, file: !460, line: 75, baseType: !466, size: 448, offset: 64)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 448, elements: !510)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !460, line: 53, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 45, size: 448, elements: !469)
!469 = !{!470, !477, !485, !490, !494, !498, !505}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !468, file: !460, line: 46, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!319, !474, !476}
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !468, file: !460, line: 47, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!319, !474, !481}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !482, line: 16, baseType: !483)
!482 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !482, line: 16, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !468, file: !460, line: 48, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!319, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !468, file: !460, line: 49, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!319, !474, !301, !474}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !468, file: !460, line: 50, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!319, !474, !301, !489}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !468, file: !460, line: 51, baseType: !499, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!319, !474, !301, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !468, file: !460, line: 52, baseType: !506, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!319, !474, !301, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!510 = !{!511}
!511 = !DISubrange(count: 1)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !461, file: !460, line: 76, baseType: !304, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !460, line: 77, baseType: !514, size: 32, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !461, file: !460, line: 78, baseType: !516, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !517)
!517 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !461, file: !460, line: 78, baseType: !516, size: 64, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !461, file: !460, line: 78, baseType: !516, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !461, file: !460, line: 78, baseType: !516, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !461, file: !460, line: 79, baseType: !522, size: 64, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !525, line: 27, baseType: !526)
!525 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !527, line: 43, baseType: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!528 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !461, file: !460, line: 80, baseType: !514, size: 32, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !461, file: !460, line: 81, baseType: !531, size: 32, offset: 992)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !461, file: !460, line: 82, baseType: !533, size: 64, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !461, file: !460, line: 83, baseType: !537, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !461, file: !460, line: 84, baseType: !541, size: 64, offset: 1152)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !461, file: !460, line: 85, baseType: !541, size: 64, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !461, file: !460, line: 86, baseType: !541, size: 64, offset: 1280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !461, file: !460, line: 87, baseType: !541, size: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !461, file: !460, line: 88, baseType: !474, size: 64, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !461, file: !460, line: 89, baseType: !522, size: 64, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !460, line: 90, baseType: !541, size: 64, offset: 1536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !461, file: !460, line: 91, baseType: !541, size: 64, offset: 1600)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !461, file: !460, line: 92, baseType: !514, size: 32, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !461, file: !460, line: 93, baseType: !308, size: 64, offset: 1728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !460, line: 94, baseType: !552, size: 64, offset: 1792)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !523)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !461, file: !460, line: 95, baseType: !514, size: 32, offset: 1856)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !461, file: !460, line: 95, baseType: !514, size: 32, offset: 1888)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !461, file: !460, line: 96, baseType: !556, size: 64, offset: 1920)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !461, file: !460, line: 96, baseType: !556, size: 64, offset: 1984)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !461, file: !460, line: 97, baseType: !559, size: 64, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !461, file: !460, line: 97, baseType: !561, size: 64, offset: 2112)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !461, file: !460, line: 98, baseType: !514, size: 32, offset: 2176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !461, file: !460, line: 98, baseType: !514, size: 32, offset: 2208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !461, file: !460, line: 99, baseType: !556, size: 64, offset: 2240)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !461, file: !460, line: 99, baseType: !556, size: 64, offset: 2304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !461, file: !460, line: 100, baseType: !567, size: 64, offset: 2368)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !517)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !461, file: !460, line: 100, baseType: !570, size: 64, offset: 2432)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !461, file: !460, line: 101, baseType: !514, size: 32, offset: 2496)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !461, file: !460, line: 101, baseType: !514, size: 32, offset: 2528)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !461, file: !460, line: 102, baseType: !556, size: 64, offset: 2560)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !461, file: !460, line: 102, baseType: !556, size: 64, offset: 2624)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !461, file: !460, line: 103, baseType: !576, size: 64, offset: 2688)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !568)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !461, file: !460, line: 103, baseType: !579, size: 64, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !461, file: !460, line: 104, baseType: !509, size: 64, offset: 2816)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !461, file: !460, line: 105, baseType: !514, size: 32, offset: 2880)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !461, file: !460, line: 106, baseType: !583, size: 128, offset: 2944)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 128, elements: !590)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !460, line: 64, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 61, size: 128, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !586, file: !460, line: 62, baseType: !502, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !586, file: !460, line: 63, baseType: !308, size: 64, offset: 64)
!590 = !{!591}
!591 = !DISubrange(count: 2)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !461, file: !460, line: 107, baseType: !593, size: 64, offset: 3072)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 64, elements: !590)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !461, file: !460, line: 108, baseType: !308, size: 64, offset: 3136)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !461, file: !460, line: 109, baseType: !596, size: 64, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!319, !308}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !461, file: !460, line: 111, baseType: !514, size: 32, offset: 3264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !461, file: !460, line: 112, baseType: !601, size: 320, offset: 3328)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 320, elements: !647)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!319, !605, !474, !308}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !608)
!608 = !{!609, !610, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !607, file: !10, line: 100, baseType: !514, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !10, line: 101, baseType: !611, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !622, !623, !624, !628, !630, !632, !633, !634}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !613, file: !10, line: 84, baseType: !541, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !613, file: !10, line: 85, baseType: !541, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !10, line: 86, baseType: !308, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !613, file: !10, line: 87, baseType: !533, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !613, file: !10, line: 88, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !613, file: !10, line: 89, baseType: !303, size: 8, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !613, file: !10, line: 90, baseType: !541, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !613, file: !10, line: 91, baseType: !625, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !626, line: 46, baseType: !627)
!626 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!627 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !613, file: !10, line: 92, baseType: !629, size: 32, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !613, file: !10, line: 93, baseType: !631, size: 32, offset: 544)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !10, line: 94, baseType: !611, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !613, file: !10, line: 95, baseType: !541, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !613, file: !10, line: 96, baseType: !308, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !607, file: !10, line: 102, baseType: !541, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !607, file: !10, line: 102, baseType: !541, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !607, file: !10, line: 103, baseType: !541, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !607, file: !10, line: 104, baseType: !304, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !607, file: !10, line: 105, baseType: !629, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !607, file: !10, line: 105, baseType: !629, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !607, file: !10, line: 105, baseType: !629, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !607, file: !10, line: 106, baseType: !474, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !607, file: !10, line: 107, baseType: !644, size: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!647 = !{!648}
!648 = !DISubrange(count: 5)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !461, file: !460, line: 113, baseType: !650, size: 320, offset: 3648)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 320, elements: !647)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!319, !474, !308}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !461, file: !460, line: 114, baseType: !655, size: 320, offset: 3968)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !647)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !461, file: !460, line: 115, baseType: !629, size: 32, offset: 4288)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !461, file: !460, line: 120, baseType: !644, size: 64, offset: 4352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !461, file: !460, line: 121, baseType: !629, size: 32, offset: 4416)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !455, file: !456, line: 437, baseType: !660, size: 9472, offset: 4480)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 9472, elements: !510)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !456, line: 32, size: 9472, elements: !662)
!662 = !{!663, !673, !677, !678, !685, !689, !690, !691, !692, !693, !694, !695, !719, !723, !728, !734, !753, !758, !762, !763, !768, !773, !774, !779, !783, !787, !791, !795, !799, !800, !801, !802, !803, !807, !808, !813, !814, !815, !816, !817, !822, !829, !834, !838, !842, !846, !850, !851, !855, !856, !863, !868, !869, !870, !871, !931, !939, !940, !944, !945, !949, !950, !954, !959, !960, !964, !968, !975, !976, !977, !978, !979, !980, !985, !986, !990, !994, !998, !999, !1000, !1004, !1014, !1015, !1019, !1020, !1024, !1025, !1029, !1030, !1035, !1036, !1040, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1074, !1078, !1079, !1080, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1096, !1101, !1105, !1106, !1110, !1111, !1112, !1113, !1139, !1143, !1144, !1145, !1146, !1147, !1151, !1152, !1153, !1154, !1155, !1159, !1163, !1164}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !661, file: !456, line: 34, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!319, !667, !514, !668, !514, !668, !670, !672}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !454)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !661, file: !456, line: 35, baseType: !674, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!319, !667, !514, !559, !561, !579}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !661, file: !456, line: 36, baseType: !674, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !661, file: !456, line: 37, baseType: !679, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!319, !667, !682, !682}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !661, file: !456, line: 38, baseType: !686, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!319, !667, !682, !682, !682}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !661, file: !456, line: 40, baseType: !679, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !661, file: !456, line: 41, baseType: !686, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !661, file: !456, line: 42, baseType: !679, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !661, file: !456, line: 43, baseType: !686, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !661, file: !456, line: 44, baseType: !679, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !661, file: !456, line: 46, baseType: !686, size: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !661, file: !456, line: 47, baseType: !696, size: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!319, !667, !699, !699, !703}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !700, line: 11, baseType: !701)
!700 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !700, line: 11, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !706, file: !36, line: 1227, baseType: !568, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !706, file: !36, line: 1228, baseType: !568, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !706, file: !36, line: 1229, baseType: !568, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !706, file: !36, line: 1230, baseType: !568, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !706, file: !36, line: 1231, baseType: !568, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !706, file: !36, line: 1232, baseType: !568, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !706, file: !36, line: 1233, baseType: !568, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !706, file: !36, line: 1234, baseType: !568, size: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !706, file: !36, line: 1236, baseType: !568, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !706, file: !36, line: 1237, baseType: !568, size: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !706, file: !36, line: 1238, baseType: !568, size: 64, offset: 640)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !661, file: !456, line: 48, baseType: !720, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!319, !667, !699, !703}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !661, file: !456, line: 49, baseType: !724, size: 64, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!319, !667, !682, !568, !727, !568, !514, !514, !682}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !661, file: !456, line: 50, baseType: !729, size: 64, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!319, !667, !732, !733}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !661, file: !456, line: 52, baseType: !735, size: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!319, !667, !738, !739}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !741, file: !36, line: 593, baseType: !516, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !741, file: !36, line: 594, baseType: !516, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !741, file: !36, line: 594, baseType: !516, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !741, file: !36, line: 594, baseType: !516, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !741, file: !36, line: 595, baseType: !516, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !741, file: !36, line: 596, baseType: !516, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !741, file: !36, line: 597, baseType: !516, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !741, file: !36, line: 598, baseType: !516, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !741, file: !36, line: 598, baseType: !516, size: 64, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !741, file: !36, line: 599, baseType: !516, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !661, file: !456, line: 53, baseType: !754, size: 64, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!319, !667, !667, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !661, file: !456, line: 54, baseType: !759, size: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!319, !667, !682}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !661, file: !456, line: 55, baseType: !679, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !661, file: !456, line: 56, baseType: !764, size: 64, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!319, !667, !767, !567}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !661, file: !456, line: 58, baseType: !769, size: 64, offset: 1280)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!319, !667, !772}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !661, file: !456, line: 59, baseType: !769, size: 64, offset: 1344)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !661, file: !456, line: 60, baseType: !775, size: 64, offset: 1408)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!319, !667, !778, !629}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !661, file: !456, line: 61, baseType: !780, size: 64, offset: 1472)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!319, !667}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !661, file: !456, line: 63, baseType: !784, size: 64, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!319, !667, !514, !668, !577, !682, !682}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !661, file: !456, line: 64, baseType: !788, size: 64, offset: 1600)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!319, !667, !667, !699, !699, !703}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !661, file: !456, line: 65, baseType: !792, size: 64, offset: 1664)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!319, !667, !667, !703}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !661, file: !456, line: 66, baseType: !796, size: 64, offset: 1728)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!319, !667, !667, !699, !703}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !661, file: !456, line: 67, baseType: !792, size: 64, offset: 1792)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !661, file: !456, line: 69, baseType: !780, size: 64, offset: 1856)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !661, file: !456, line: 70, baseType: !788, size: 64, offset: 1920)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !661, file: !456, line: 71, baseType: !796, size: 64, offset: 1984)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !661, file: !456, line: 72, baseType: !804, size: 64, offset: 2048)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!319, !667, !733}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !661, file: !456, line: 73, baseType: !780, size: 64, offset: 2112)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !661, file: !456, line: 75, baseType: !809, size: 64, offset: 2176)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!319, !667, !812, !733}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !661, file: !456, line: 76, baseType: !679, size: 64, offset: 2240)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !661, file: !456, line: 77, baseType: !679, size: 64, offset: 2304)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !661, file: !456, line: 78, baseType: !696, size: 64, offset: 2368)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !661, file: !456, line: 79, baseType: !720, size: 64, offset: 2432)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !661, file: !456, line: 81, baseType: !818, size: 64, offset: 2496)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!319, !667, !577, !667, !821}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !661, file: !456, line: 82, baseType: !823, size: 64, offset: 2560)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!319, !667, !514, !826, !826, !732, !828}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !661, file: !456, line: 83, baseType: !830, size: 64, offset: 2624)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!319, !667, !514, !833, !514}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !661, file: !456, line: 84, baseType: !835, size: 64, offset: 2688)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!319, !667, !514, !668, !514, !668, !576}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !661, file: !456, line: 85, baseType: !839, size: 64, offset: 2752)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!319, !667, !667, !821}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !661, file: !456, line: 87, baseType: !843, size: 64, offset: 2816)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!319, !667, !682, !559}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !661, file: !456, line: 88, baseType: !847, size: 64, offset: 2880)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!319, !667, !577}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !661, file: !456, line: 89, baseType: !847, size: 64, offset: 2944)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !661, file: !456, line: 90, baseType: !852, size: 64, offset: 3008)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!319, !667, !682, !672}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !661, file: !456, line: 91, baseType: !784, size: 64, offset: 3072)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !661, file: !456, line: 93, baseType: !857, size: 64, offset: 3136)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!319, !667, !860}
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !661, file: !456, line: 94, baseType: !864, size: 64, offset: 3200)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!319, !667, !514, !629, !629, !559, !867, !867, !757}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !661, file: !456, line: 95, baseType: !864, size: 64, offset: 3264)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !661, file: !456, line: 96, baseType: !864, size: 64, offset: 3328)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !661, file: !456, line: 97, baseType: !864, size: 64, offset: 3392)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !661, file: !456, line: 99, baseType: !872, size: 64, offset: 3456)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!319, !667, !875, !878}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !700, line: 51, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !700, line: 51, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !456, line: 609, size: 6208, elements: !881)
!881 = !{!882, !883, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !902, !909, !910, !911, !912, !913, !914, !915, !916, !918, !919, !920, !921, !922, !924, !925, !926, !927, !928, !929, !930}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !880, file: !456, line: 610, baseType: !459, size: 4480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !880, file: !456, line: 610, baseType: !884, size: 32, offset: 4480)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !510)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !880, file: !456, line: 611, baseType: !514, size: 32, offset: 4512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !880, file: !456, line: 611, baseType: !514, size: 32, offset: 4544)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !880, file: !456, line: 611, baseType: !514, size: 32, offset: 4576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !880, file: !456, line: 612, baseType: !514, size: 32, offset: 4608)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !880, file: !456, line: 613, baseType: !514, size: 32, offset: 4640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !880, file: !456, line: 614, baseType: !559, size: 64, offset: 4672)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !880, file: !456, line: 615, baseType: !561, size: 64, offset: 4736)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !880, file: !456, line: 616, baseType: !833, size: 64, offset: 4800)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !880, file: !456, line: 617, baseType: !559, size: 64, offset: 4864)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !880, file: !456, line: 618, baseType: !895, size: 64, offset: 4928)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !456, line: 602, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 598, size: 128, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !897, file: !456, line: 599, baseType: !514, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !897, file: !456, line: 600, baseType: !514, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !897, file: !456, line: 601, baseType: !576, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !880, file: !456, line: 619, baseType: !903, size: 64, offset: 4992)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !456, line: 607, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 604, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !905, file: !456, line: 605, baseType: !514, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !905, file: !456, line: 606, baseType: !576, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !880, file: !456, line: 620, baseType: !576, size: 64, offset: 5056)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !880, file: !456, line: 621, baseType: !568, size: 64, offset: 5120)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !880, file: !456, line: 622, baseType: !568, size: 64, offset: 5184)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !880, file: !456, line: 623, baseType: !682, size: 64, offset: 5248)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !880, file: !456, line: 623, baseType: !682, size: 64, offset: 5312)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !880, file: !456, line: 623, baseType: !682, size: 64, offset: 5376)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !880, file: !456, line: 624, baseType: !629, size: 32, offset: 5440)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !880, file: !456, line: 625, baseType: !917, size: 64, offset: 5504)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !880, file: !456, line: 626, baseType: !308, size: 64, offset: 5568)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !880, file: !456, line: 627, baseType: !682, size: 64, offset: 5632)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !880, file: !456, line: 628, baseType: !514, size: 32, offset: 5696)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !880, file: !456, line: 629, baseType: !301, size: 64, offset: 5760)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !880, file: !456, line: 630, baseType: !923, size: 32, offset: 5824)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !880, file: !456, line: 631, baseType: !514, size: 32, offset: 5856)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !880, file: !456, line: 631, baseType: !514, size: 32, offset: 5888)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !880, file: !456, line: 632, baseType: !629, size: 32, offset: 5920)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !880, file: !456, line: 633, baseType: !629, size: 32, offset: 5952)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !880, file: !456, line: 634, baseType: !502, size: 64, offset: 6016)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !880, file: !456, line: 634, baseType: !308, size: 64, offset: 6080)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !880, file: !456, line: 635, baseType: !522, size: 64, offset: 6144)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !661, file: !456, line: 100, baseType: !932, size: 64, offset: 3520)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!319, !667, !514, !514, !935, !938}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !937)
!937 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !661, file: !456, line: 101, baseType: !780, size: 64, offset: 3584)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !661, file: !456, line: 102, baseType: !941, size: 64, offset: 3648)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!319, !667, !699, !699, !733}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !661, file: !456, line: 103, baseType: !664, size: 64, offset: 3712)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !661, file: !456, line: 105, baseType: !946, size: 64, offset: 3776)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!319, !667, !699, !699, !732, !733}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !661, file: !456, line: 106, baseType: !780, size: 64, offset: 3840)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !661, file: !456, line: 107, baseType: !951, size: 64, offset: 3904)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!319, !667, !481}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !661, file: !456, line: 108, baseType: !955, size: 64, offset: 3968)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!319, !667, !958, !732, !733}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !301)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !661, file: !456, line: 109, baseType: !917, size: 64, offset: 4032)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !661, file: !456, line: 111, baseType: !961, size: 64, offset: 4096)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!319, !667, !667, !667, !568, !667}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !661, file: !456, line: 112, baseType: !965, size: 64, offset: 4160)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!319, !667, !667, !667, !667}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !661, file: !456, line: 113, baseType: !969, size: 64, offset: 4224)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!319, !667, !972, !972}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !700, line: 30, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !700, line: 30, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !661, file: !456, line: 114, baseType: !664, size: 64, offset: 4288)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !661, file: !456, line: 115, baseType: !784, size: 64, offset: 4352)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !661, file: !456, line: 117, baseType: !843, size: 64, offset: 4416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !661, file: !456, line: 118, baseType: !843, size: 64, offset: 4480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !661, file: !456, line: 119, baseType: !955, size: 64, offset: 4544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !661, file: !456, line: 120, baseType: !981, size: 64, offset: 4608)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!319, !667, !984, !757}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !661, file: !456, line: 121, baseType: !917, size: 64, offset: 4672)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !661, file: !456, line: 123, baseType: !987, size: 64, offset: 4736)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!319, !667, !514, !308}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !661, file: !456, line: 124, baseType: !991, size: 64, offset: 4800)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!319, !667, !878, !682, !308}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !661, file: !456, line: 125, baseType: !995, size: 64, offset: 4864)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!319, !605, !667}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !661, file: !456, line: 126, baseType: !679, size: 64, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !661, file: !456, line: 127, baseType: !679, size: 64, offset: 4992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !661, file: !456, line: 129, baseType: !1001, size: 64, offset: 5056)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!319, !667, !833}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !661, file: !456, line: 130, baseType: !1005, size: 64, offset: 5120)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!319, !667, !1008, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1010, file: !60, line: 653, baseType: !514, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1010, file: !60, line: 653, baseType: !682, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !661, file: !456, line: 131, baseType: !1005, size: 64, offset: 5184)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !661, file: !456, line: 132, baseType: !1016, size: 64, offset: 5248)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!319, !667, !559, !559, !559}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !661, file: !456, line: 133, baseType: !951, size: 64, offset: 5312)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !661, file: !456, line: 135, baseType: !1021, size: 64, offset: 5376)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!319, !667, !568, !757}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !661, file: !456, line: 136, baseType: !1021, size: 64, offset: 5440)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !661, file: !456, line: 137, baseType: !1026, size: 64, offset: 5504)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!319, !667, !757}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !661, file: !456, line: 138, baseType: !664, size: 64, offset: 5568)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !661, file: !456, line: 139, baseType: !1031, size: 64, offset: 5632)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!319, !667, !1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !661, file: !456, line: 141, baseType: !917, size: 64, offset: 5696)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !661, file: !456, line: 142, baseType: !1037, size: 64, offset: 5760)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!319, !667, !667, !568, !667}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !661, file: !456, line: 143, baseType: !1041, size: 64, offset: 5824)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!319, !667, !667, !667}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !661, file: !456, line: 144, baseType: !917, size: 64, offset: 5888)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !661, file: !456, line: 145, baseType: !1037, size: 64, offset: 5952)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !661, file: !456, line: 147, baseType: !1041, size: 64, offset: 6016)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !661, file: !456, line: 148, baseType: !917, size: 64, offset: 6080)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !661, file: !456, line: 149, baseType: !1037, size: 64, offset: 6144)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !661, file: !456, line: 150, baseType: !1041, size: 64, offset: 6208)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !661, file: !456, line: 151, baseType: !1051, size: 64, offset: 6272)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!319, !667, !629}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !661, file: !456, line: 153, baseType: !780, size: 64, offset: 6336)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !661, file: !456, line: 154, baseType: !780, size: 64, offset: 6400)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !661, file: !456, line: 155, baseType: !780, size: 64, offset: 6464)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !661, file: !456, line: 156, baseType: !780, size: 64, offset: 6528)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !661, file: !456, line: 157, baseType: !951, size: 64, offset: 6592)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !661, file: !456, line: 159, baseType: !1060, size: 64, offset: 6656)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!319, !667, !514, !670}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !661, file: !456, line: 160, baseType: !780, size: 64, offset: 6720)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !661, file: !456, line: 161, baseType: !780, size: 64, offset: 6784)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !661, file: !456, line: 162, baseType: !780, size: 64, offset: 6848)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !661, file: !456, line: 163, baseType: !780, size: 64, offset: 6912)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !661, file: !456, line: 165, baseType: !1041, size: 64, offset: 6976)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !661, file: !456, line: 166, baseType: !1041, size: 64, offset: 7040)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !661, file: !456, line: 167, baseType: !843, size: 64, offset: 7104)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !661, file: !456, line: 168, baseType: !1071, size: 64, offset: 7168)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!319, !667, !682, !514}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !661, file: !456, line: 169, baseType: !1075, size: 64, offset: 7232)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!319, !667, !757, !559}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !661, file: !456, line: 171, baseType: !804, size: 64, offset: 7296)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !661, file: !456, line: 172, baseType: !780, size: 64, offset: 7360)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !661, file: !456, line: 173, baseType: !1081, size: 64, offset: 7424)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!319, !667, !559, !867}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !661, file: !456, line: 174, baseType: !941, size: 64, offset: 7488)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !661, file: !456, line: 175, baseType: !941, size: 64, offset: 7552)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !661, file: !456, line: 177, baseType: !679, size: 64, offset: 7616)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !661, file: !456, line: 178, baseType: !729, size: 64, offset: 7680)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !661, file: !456, line: 179, baseType: !679, size: 64, offset: 7744)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !661, file: !456, line: 180, baseType: !686, size: 64, offset: 7808)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !661, file: !456, line: 181, baseType: !1091, size: 64, offset: 7872)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!319, !667, !304, !732, !733}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !661, file: !456, line: 183, baseType: !1001, size: 64, offset: 7936)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !661, file: !456, line: 184, baseType: !764, size: 64, offset: 8000)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !661, file: !456, line: 185, baseType: !1097, size: 64, offset: 8064)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!319, !667, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !661, file: !456, line: 186, baseType: !1102, size: 64, offset: 8128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!319, !667, !514, !668, !576}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !661, file: !456, line: 187, baseType: !823, size: 64, offset: 8192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !661, file: !456, line: 189, baseType: !1107, size: 64, offset: 8256)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!319, !667, !514, !514, !559, !670}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !661, file: !456, line: 190, baseType: !917, size: 64, offset: 8320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !661, file: !456, line: 191, baseType: !1037, size: 64, offset: 8384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !661, file: !456, line: 192, baseType: !1041, size: 64, offset: 8448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !661, file: !456, line: 193, baseType: !1114, size: 64, offset: 8512)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!319, !667, !875, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !456, line: 660, size: 5312, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1119, file: !456, line: 661, baseType: !459, size: 4480)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1119, file: !456, line: 661, baseType: !884, size: 32, offset: 4480)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1119, file: !456, line: 662, baseType: !514, size: 32, offset: 4512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1119, file: !456, line: 662, baseType: !514, size: 32, offset: 4544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1119, file: !456, line: 662, baseType: !514, size: 32, offset: 4576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1119, file: !456, line: 663, baseType: !514, size: 32, offset: 4608)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1119, file: !456, line: 664, baseType: !514, size: 32, offset: 4640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1119, file: !456, line: 665, baseType: !559, size: 64, offset: 4672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1119, file: !456, line: 666, baseType: !559, size: 64, offset: 4736)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1119, file: !456, line: 667, baseType: !514, size: 32, offset: 4800)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1119, file: !456, line: 668, baseType: !923, size: 32, offset: 4832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1119, file: !456, line: 670, baseType: !559, size: 64, offset: 4864)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1119, file: !456, line: 670, baseType: !559, size: 64, offset: 4928)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1119, file: !456, line: 671, baseType: !559, size: 64, offset: 4992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1119, file: !456, line: 672, baseType: !559, size: 64, offset: 5056)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1119, file: !456, line: 673, baseType: !559, size: 64, offset: 5120)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1119, file: !456, line: 674, baseType: !514, size: 32, offset: 5184)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1119, file: !456, line: 675, baseType: !559, size: 64, offset: 5248)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !661, file: !456, line: 195, baseType: !1140, size: 64, offset: 8576)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!319, !1117, !667, !667}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !661, file: !456, line: 196, baseType: !1140, size: 64, offset: 8640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !661, file: !456, line: 197, baseType: !917, size: 64, offset: 8704)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !661, file: !456, line: 198, baseType: !1037, size: 64, offset: 8768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !661, file: !456, line: 199, baseType: !1041, size: 64, offset: 8832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !661, file: !456, line: 201, baseType: !1148, size: 64, offset: 8896)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!319, !667, !514, !514}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !661, file: !456, line: 202, baseType: !818, size: 64, offset: 8960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !661, file: !456, line: 203, baseType: !686, size: 64, offset: 9024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !661, file: !456, line: 204, baseType: !872, size: 64, offset: 9088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !661, file: !456, line: 205, baseType: !1001, size: 64, offset: 9152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !661, file: !456, line: 206, baseType: !1156, size: 64, offset: 9216)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!319, !304, !667, !514, !732, !733}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !661, file: !456, line: 208, baseType: !1160, size: 64, offset: 9280)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!319, !514, !828}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !661, file: !456, line: 209, baseType: !1041, size: 64, offset: 9344)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !661, file: !456, line: 210, baseType: !835, size: 64, offset: 9408)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !455, file: !456, line: 438, baseType: !1166, size: 64, offset: 13952)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !700, line: 60, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1168, file: !114, line: 241, baseType: !304, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !114, line: 242, baseType: !531, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1168, file: !114, line: 243, baseType: !514, size: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1168, file: !114, line: 243, baseType: !514, size: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1168, file: !114, line: 244, baseType: !514, size: 32, offset: 160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1168, file: !114, line: 244, baseType: !514, size: 32, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1168, file: !114, line: 245, baseType: !559, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1168, file: !114, line: 246, baseType: !629, size: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1168, file: !114, line: 247, baseType: !514, size: 32, offset: 352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1168, file: !114, line: 251, baseType: !514, size: 32, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1168, file: !114, line: 252, baseType: !972, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1168, file: !114, line: 253, baseType: !629, size: 32, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1168, file: !114, line: 254, baseType: !514, size: 32, offset: 544)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1168, file: !114, line: 254, baseType: !514, size: 32, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1168, file: !114, line: 255, baseType: !514, size: 32, offset: 608)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !455, file: !456, line: 438, baseType: !1166, size: 64, offset: 14016)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !456, line: 439, baseType: !308, size: 64, offset: 14080)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !455, file: !456, line: 440, baseType: !1188, size: 32, offset: 14144)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !455, file: !456, line: 441, baseType: !629, size: 32, offset: 14176)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !455, file: !456, line: 442, baseType: !629, size: 32, offset: 14208)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !455, file: !456, line: 443, baseType: !1192, size: 448, offset: 14272)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 448, elements: !1194)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !301)
!1194 = !{!1195}
!1195 = !DISubrange(count: 7)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !455, file: !456, line: 444, baseType: !629, size: 32, offset: 14720)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !455, file: !456, line: 445, baseType: !629, size: 32, offset: 14752)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !455, file: !456, line: 446, baseType: !514, size: 32, offset: 14784)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !455, file: !456, line: 447, baseType: !552, size: 64, offset: 14848)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !455, file: !456, line: 448, baseType: !552, size: 64, offset: 14912)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !455, file: !456, line: 449, baseType: !740, size: 640, offset: 14976)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !455, file: !456, line: 450, baseType: !672, size: 32, offset: 15616)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !455, file: !456, line: 451, baseType: !1204, size: 2880, offset: 15680)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !456, line: 318, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !456, line: 319, size: 2880, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1226, !1227, !1232, !1237, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1252, !1253, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1285, !1286, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1309, !1310, !1311, !1315, !1316}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1205, file: !456, line: 320, baseType: !514, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1205, file: !456, line: 321, baseType: !514, size: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1205, file: !456, line: 322, baseType: !514, size: 32, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1205, file: !456, line: 323, baseType: !514, size: 32, offset: 96)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1205, file: !456, line: 324, baseType: !514, size: 32, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1205, file: !456, line: 325, baseType: !514, size: 32, offset: 160)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1205, file: !456, line: 326, baseType: !1214, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !456, line: 293, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !456, line: 295, size: 448, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1216, file: !456, line: 296, baseType: !1214, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1216, file: !456, line: 297, baseType: !576, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1216, file: !456, line: 297, baseType: !576, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1216, file: !456, line: 298, baseType: !559, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1216, file: !456, line: 298, baseType: !559, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1216, file: !456, line: 299, baseType: !514, size: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1216, file: !456, line: 300, baseType: !514, size: 32, offset: 352)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1216, file: !456, line: 301, baseType: !514, size: 32, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1205, file: !456, line: 326, baseType: !1214, size: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1205, file: !456, line: 328, baseType: !1228, size: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!319, !667, !1231, !559}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1205, file: !456, line: 329, baseType: !1233, size: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!319, !1231, !1236, !561, !561, !579, !559}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1205, file: !456, line: 330, baseType: !1238, size: 64, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!319, !1231}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1205, file: !456, line: 331, baseType: !1238, size: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1205, file: !456, line: 334, baseType: !304, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !456, line: 335, baseType: !531, size: 32, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1205, file: !456, line: 335, baseType: !531, size: 32, offset: 672)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1205, file: !456, line: 336, baseType: !531, size: 32, offset: 704)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1205, file: !456, line: 336, baseType: !531, size: 32, offset: 736)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1205, file: !456, line: 337, baseType: !1248, size: 64, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !305, line: 339, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !305, line: 339, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1205, file: !456, line: 338, baseType: !1248, size: 64, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1205, file: !456, line: 339, baseType: !1254, size: 64, offset: 896)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !305, line: 341, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !305, line: 351, size: 192, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1256, file: !305, line: 354, baseType: !72, size: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1256, file: !305, line: 355, baseType: !72, size: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1256, file: !305, line: 356, baseType: !72, size: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1256, file: !305, line: 361, baseType: !72, size: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1256, file: !305, line: 362, baseType: !625, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1205, file: !456, line: 340, baseType: !514, size: 32, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1205, file: !456, line: 340, baseType: !514, size: 32, offset: 992)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1205, file: !456, line: 341, baseType: !576, size: 64, offset: 1024)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1205, file: !456, line: 342, baseType: !559, size: 64, offset: 1088)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1205, file: !456, line: 343, baseType: !579, size: 64, offset: 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1205, file: !456, line: 344, baseType: !561, size: 64, offset: 1216)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1205, file: !456, line: 345, baseType: !514, size: 32, offset: 1280)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1205, file: !456, line: 346, baseType: !1236, size: 64, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1205, file: !456, line: 347, baseType: !629, size: 32, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1205, file: !456, line: 348, baseType: !514, size: 32, offset: 1440)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1205, file: !456, line: 351, baseType: !629, size: 32, offset: 1472)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1205, file: !456, line: 352, baseType: !629, size: 32, offset: 1504)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1205, file: !456, line: 353, baseType: !531, size: 32, offset: 1536)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1205, file: !456, line: 354, baseType: !531, size: 32, offset: 1568)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1205, file: !456, line: 355, baseType: !1236, size: 64, offset: 1600)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1205, file: !456, line: 356, baseType: !1236, size: 64, offset: 1664)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1205, file: !456, line: 357, baseType: !1280, size: 64, offset: 1728)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !456, line: 310, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 308, size: 32, elements: !1283)
!1283 = !{!1284}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1282, file: !456, line: 309, baseType: !514, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1205, file: !456, line: 357, baseType: !1280, size: 64, offset: 1792)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1205, file: !456, line: 358, baseType: !1287, size: 64, offset: 1856)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !456, line: 316, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 312, size: 128, elements: !1290)
!1290 = !{!1291, !1292, !1293}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1289, file: !456, line: 313, baseType: !308, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1289, file: !456, line: 314, baseType: !514, size: 32, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1289, file: !456, line: 315, baseType: !303, size: 8, offset: 96)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1205, file: !456, line: 359, baseType: !1287, size: 64, offset: 1920)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1205, file: !456, line: 360, baseType: !1287, size: 64, offset: 1984)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1205, file: !456, line: 361, baseType: !514, size: 32, offset: 2048)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1205, file: !456, line: 362, baseType: !531, size: 32, offset: 2080)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1205, file: !456, line: 363, baseType: !514, size: 32, offset: 2112)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1205, file: !456, line: 364, baseType: !1236, size: 64, offset: 2176)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1205, file: !456, line: 365, baseType: !1254, size: 64, offset: 2240)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1205, file: !456, line: 366, baseType: !531, size: 32, offset: 2304)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1205, file: !456, line: 367, baseType: !531, size: 32, offset: 2336)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1205, file: !456, line: 368, baseType: !1248, size: 64, offset: 2368)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1205, file: !456, line: 369, baseType: !1248, size: 64, offset: 2432)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1205, file: !456, line: 370, baseType: !1306, size: 64, offset: 2496)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1205, file: !456, line: 371, baseType: !1306, size: 64, offset: 2560)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1205, file: !456, line: 372, baseType: !1306, size: 64, offset: 2624)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1205, file: !456, line: 373, baseType: !1312, size: 64, offset: 2688)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !305, line: 331, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !305, line: 331, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1205, file: !456, line: 374, baseType: !625, size: 64, offset: 2752)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1205, file: !456, line: 375, baseType: !1317, size: 64, offset: 2816)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !455, file: !456, line: 451, baseType: !1204, size: 2880, offset: 18560)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !455, file: !456, line: 452, baseType: !1320, size: 64, offset: 21440)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1321)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !456, line: 681, size: 4864, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1328, !1329, !1330, !1334}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1322, file: !456, line: 682, baseType: !459, size: 4480)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1322, file: !456, line: 682, baseType: !884, size: 32, offset: 4480)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1322, file: !456, line: 683, baseType: !629, size: 32, offset: 4512)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1322, file: !456, line: 684, baseType: !514, size: 32, offset: 4544)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1322, file: !456, line: 685, baseType: !1034, size: 64, offset: 4608)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1322, file: !456, line: 686, baseType: !576, size: 64, offset: 4672)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1322, file: !456, line: 687, baseType: !1331, size: 64, offset: 4736)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!319, !1320, !682, !308}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1322, file: !456, line: 688, baseType: !308, size: 64, offset: 4800)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !455, file: !456, line: 453, baseType: !1320, size: 64, offset: 21504)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !455, file: !456, line: 454, baseType: !1320, size: 64, offset: 21568)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !455, file: !456, line: 455, baseType: !514, size: 32, offset: 21632)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !455, file: !456, line: 456, baseType: !629, size: 32, offset: 21664)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !455, file: !456, line: 457, baseType: !1340, size: 320, offset: 21696)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !456, line: 399, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 394, size: 320, elements: !1342)
!1342 = !{!1343, !1344, !1348, !1349}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1341, file: !456, line: 395, baseType: !514, size: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1341, file: !456, line: 396, baseType: !1345, size: 128, offset: 32)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 128, elements: !1346)
!1346 = !{!1347}
!1347 = !DISubrange(count: 4)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1341, file: !456, line: 397, baseType: !1345, size: 128, offset: 160)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1341, file: !456, line: 398, baseType: !629, size: 32, offset: 288)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !455, file: !456, line: 458, baseType: !629, size: 32, offset: 22016)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !455, file: !456, line: 458, baseType: !629, size: 32, offset: 22048)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !455, file: !456, line: 458, baseType: !629, size: 32, offset: 22080)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !455, file: !456, line: 458, baseType: !629, size: 32, offset: 22112)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !455, file: !456, line: 459, baseType: !629, size: 32, offset: 22144)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !455, file: !456, line: 459, baseType: !629, size: 32, offset: 22176)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !455, file: !456, line: 459, baseType: !629, size: 32, offset: 22208)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "spd_set", scope: !455, file: !456, line: 459, baseType: !629, size: 32, offset: 22240)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_eternal", scope: !455, file: !456, line: 460, baseType: !629, size: 32, offset: 22272)
