; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexgenerate.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexgenerate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PlexGeneratorFunctionList = type { i32 (%struct._p_DM*, i32, %struct._p_DM**)*, i32 (%struct._p_DM*, double*, %struct._p_DM**)*, i32 (%struct._p_DM*, %struct._p_DMLabel*, %struct._p_DM**)*, i8*, i32, %struct._n_PlexGeneratorFunctionList* }

!77 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 60, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85}
!80 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!82 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!85 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 663, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!88 = !{!89, !90, !91}
!89 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 99, baseType: !94, size: 32, elements: !95)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplex.h", directory: "/home/users/ndemeye/xSDK")
!94 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_INVALID", value: -1)
!97 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_NONE", value: 0)
!98 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_PARTIAL", value: 1)
!99 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_MIXED", value: 2)
!100 = !DIEnumerator(name: "DMPLEX_INTERPOLATED_FULL", value: 3)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 30, baseType: !7, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmplextypes.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111}
!104 = !DIEnumerator(name: "DM_REFINER_REGULAR", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "DM_REFINER_TO_BOX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "DM_REFINER_TO_SIMPLEX", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "DM_REFINER_ALFELD2D", value: 3, isUnsigned: true)
!108 = !DIEnumerator(name: "DM_REFINER_ALFELD3D", value: 4, isUnsigned: true)
!109 = !DIEnumerator(name: "DM_REFINER_POWELL_SABIN", value: 5, isUnsigned: true)
!110 = !DIEnumerator(name: "DM_REFINER_BOUNDARYLAYER", value: 6, isUnsigned: true)
!111 = !DIEnumerator(name: "DM_REFINER_SBR", value: 7, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 385, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!114 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!132 = !{!133, !136, !140, !141, !172, !228, !1189, !1192, !238, !94, !322, !7}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !137, line: 330, baseType: !138)
!137 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !137, line: 330, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Plex", file: !143, line: 213, baseType: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmpleximpl.h", directory: "/home/users/ndemeye/xSDK")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 124, size: 3712, elements: !145)
!145 = !{!146, !148, !453, !454, !455, !456, !457, !458, !459, !460, !461, !467, !468, !470, !471, !472, !474, !475, !476, !477, !482, !483, !484, !489, !490, !491, !492, !493, !494, !495, !496, !497, !1135, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1149, !1150, !1151, !1155, !1156, !1157, !1158, !1159, !1163, !1164, !1165, !1183, !1184, !1185, !1186, !1187, !1188}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !144, file: !143, line: 125, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !26, line: 102, baseType: !94)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "coneSection", scope: !144, file: !143, line: 127, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !150, line: 18, baseType: !151)
!150 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !153, line: 29, size: 5760, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !356, !358, !359, !360, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !376, !377, !379, !380, !382, !383, !412, !413, !414}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !152, file: !153, line: 30, baseType: !156, size: 4480)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !157, line: 122, baseType: !158)
!157 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !157, line: 73, size: 4480, elements: !159)
!159 = !{!160, !162, !210, !211, !212, !215, !216, !217, !218, !226, !227, !229, !233, !237, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !250, !251, !252, !254, !255, !257, !259, !260, !261, !262, !263, !266, !268, !269, !270, !271, !272, !275, !277, !278, !279, !289, !291, !292, !296, !297, !346, !351, !353, !354, !355}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !158, file: !157, line: 74, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !26, line: 32, baseType: !94)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !158, file: !157, line: 75, baseType: !163, size: 448, offset: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 448, elements: !208)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !157, line: 53, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 45, size: 448, elements: !166)
!166 = !{!167, !175, !183, !188, !192, !196, !203}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !165, file: !157, line: 46, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !172, !174}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !26, line: 14, baseType: !94)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !26, line: 430, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !165, file: !157, line: 47, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!171, !172, !179}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !180, line: 16, baseType: !181)
!180 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !180, line: 16, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !165, file: !157, line: 48, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!171, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !165, file: !157, line: 49, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!171, !172, !133, !172}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !165, file: !157, line: 50, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!171, !172, !133, !187}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !165, file: !157, line: 51, baseType: !197, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!171, !172, !133, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !165, file: !157, line: 52, baseType: !204, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!171, !172, !133, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !158, file: !157, line: 76, baseType: !136, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !157, line: 77, baseType: !147, size: 32, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !158, file: !157, line: 78, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !26, line: 360, baseType: !214)
!214 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !158, file: !157, line: 78, baseType: !213, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !158, file: !157, line: 78, baseType: !213, size: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !158, file: !157, line: 78, baseType: !213, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !157, line: 79, baseType: !219, size: 64, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !26, line: 442, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !26, line: 90, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !222, line: 27, baseType: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !224, line: 43, baseType: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!225 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !158, file: !157, line: 80, baseType: !147, size: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !158, file: !157, line: 81, baseType: !228, size: 32, offset: 992)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !26, line: 49, baseType: !94)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !158, file: !157, line: 82, baseType: !230, size: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !26, line: 465, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !26, line: 465, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !158, file: !157, line: 83, baseType: !234, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !26, line: 496, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !26, line: 496, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !158, file: !157, line: 84, baseType: !238, size: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !158, file: !157, line: 85, baseType: !238, size: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !158, file: !157, line: 86, baseType: !238, size: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !158, file: !157, line: 87, baseType: !238, size: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !158, file: !157, line: 88, baseType: !172, size: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !158, file: !157, line: 89, baseType: !219, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !157, line: 90, baseType: !238, size: 64, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !158, file: !157, line: 91, baseType: !238, size: 64, offset: 1600)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !158, file: !157, line: 92, baseType: !147, size: 32, offset: 1664)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !158, file: !157, line: 93, baseType: !140, size: 64, offset: 1728)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !158, file: !157, line: 94, baseType: !249, size: 64, offset: 1792)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !26, line: 455, baseType: !220)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !158, file: !157, line: 95, baseType: !147, size: 32, offset: 1856)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !158, file: !157, line: 95, baseType: !147, size: 32, offset: 1888)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !158, file: !157, line: 96, baseType: !253, size: 64, offset: 1920)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !158, file: !157, line: 96, baseType: !253, size: 64, offset: 1984)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !158, file: !157, line: 97, baseType: !256, size: 64, offset: 2048)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !158, file: !157, line: 97, baseType: !258, size: 64, offset: 2112)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !158, file: !157, line: 98, baseType: !147, size: 32, offset: 2176)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !158, file: !157, line: 98, baseType: !147, size: 32, offset: 2208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !158, file: !157, line: 99, baseType: !253, size: 64, offset: 2240)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !158, file: !157, line: 99, baseType: !253, size: 64, offset: 2304)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !158, file: !157, line: 100, baseType: !264, size: 64, offset: 2368)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !26, line: 189, baseType: !214)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !158, file: !157, line: 100, baseType: !267, size: 64, offset: 2432)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !158, file: !157, line: 101, baseType: !147, size: 32, offset: 2496)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !158, file: !157, line: 101, baseType: !147, size: 32, offset: 2528)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !158, file: !157, line: 102, baseType: !253, size: 64, offset: 2560)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !158, file: !157, line: 102, baseType: !253, size: 64, offset: 2624)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !158, file: !157, line: 103, baseType: !273, size: 64, offset: 2688)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !26, line: 305, baseType: !265)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !158, file: !157, line: 103, baseType: !276, size: 64, offset: 2752)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !158, file: !157, line: 104, baseType: !207, size: 64, offset: 2816)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !158, file: !157, line: 105, baseType: !147, size: 32, offset: 2880)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !158, file: !157, line: 106, baseType: !280, size: 128, offset: 2944)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !287)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !157, line: 64, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 61, size: 128, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !283, file: !157, line: 62, baseType: !200, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !283, file: !157, line: 63, baseType: !140, size: 64, offset: 64)
!287 = !{!288}
!288 = !DISubrange(count: 2)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !158, file: !157, line: 107, baseType: !290, size: 64, offset: 3072)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !287)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !158, file: !157, line: 108, baseType: !140, size: 64, offset: 3136)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !158, file: !157, line: 109, baseType: !293, size: 64, offset: 3200)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!171, !140}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !158, file: !157, line: 111, baseType: !147, size: 32, offset: 3264)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !158, file: !157, line: 112, baseType: !298, size: 320, offset: 3328)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !344)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!171, !302, !172, !140}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !31, line: 108, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !31, line: 99, size: 640, elements: !305)
!305 = !{!306, !307, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !304, file: !31, line: 100, baseType: !147, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !31, line: 101, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !31, line: 82, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !31, line: 83, size: 768, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !319, !320, !321, !325, !327, !329, !330, !331}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !310, file: !31, line: 84, baseType: !238, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !310, file: !31, line: 85, baseType: !238, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !31, line: 86, baseType: !140, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !310, file: !31, line: 87, baseType: !230, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !310, file: !31, line: 88, baseType: !317, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !310, file: !31, line: 89, baseType: !135, size: 8, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !310, file: !31, line: 90, baseType: !238, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !310, file: !31, line: 91, baseType: !322, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 46, baseType: !324)
!323 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!324 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !310, file: !31, line: 92, baseType: !326, size: 32, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !26, line: 170, baseType: !25)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !31, line: 93, baseType: !328, size: 32, offset: 544)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !31, line: 81, baseType: !30)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !31, line: 94, baseType: !308, size: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !310, file: !31, line: 95, baseType: !238, size: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !310, file: !31, line: 96, baseType: !140, size: 64, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !304, file: !31, line: 102, baseType: !238, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !304, file: !31, line: 102, baseType: !238, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !304, file: !31, line: 103, baseType: !238, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !304, file: !31, line: 104, baseType: !136, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !304, file: !31, line: 105, baseType: !326, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !304, file: !31, line: 105, baseType: !326, size: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !304, file: !31, line: 105, baseType: !326, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !304, file: !31, line: 106, baseType: !172, size: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !304, file: !31, line: 107, baseType: !341, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !31, line: 10, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !31, line: 10, flags: DIFlagFwdDecl)
!344 = !{!345}
!345 = !DISubrange(count: 5)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !158, file: !157, line: 113, baseType: !347, size: 320, offset: 3648)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 320, elements: !344)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!171, !172, !140}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !158, file: !157, line: 114, baseType: !352, size: 320, offset: 3968)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 320, elements: !344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !158, file: !157, line: 115, baseType: !326, size: 32, offset: 4288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !158, file: !157, line: 120, baseType: !341, size: 64, offset: 4352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !158, file: !157, line: 121, baseType: !326, size: 32, offset: 4416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !152, file: !153, line: 30, baseType: !357, size: 32, offset: 4480)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !208)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !152, file: !153, line: 31, baseType: !147, size: 32, offset: 4512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !152, file: !153, line: 31, baseType: !147, size: 32, offset: 4544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !152, file: !153, line: 32, baseType: !361, size: 64, offset: 4608)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !362, line: 11, baseType: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !362, line: 11, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !152, file: !153, line: 33, baseType: !326, size: 32, offset: 4672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !152, file: !153, line: 34, baseType: !326, size: 32, offset: 4704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !152, file: !153, line: 35, baseType: !256, size: 64, offset: 4736)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !152, file: !153, line: 36, baseType: !256, size: 64, offset: 4800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !152, file: !153, line: 37, baseType: !147, size: 32, offset: 4864)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !152, file: !153, line: 38, baseType: !149, size: 64, offset: 4928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !152, file: !153, line: 39, baseType: !256, size: 64, offset: 4992)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !152, file: !153, line: 40, baseType: !326, size: 32, offset: 5056)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !152, file: !153, line: 42, baseType: !147, size: 32, offset: 5088)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !152, file: !153, line: 43, baseType: !375, size: 64, offset: 5120)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !152, file: !153, line: 44, baseType: !256, size: 64, offset: 5184)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !152, file: !153, line: 45, baseType: !378, size: 64, offset: 5248)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !152, file: !153, line: 46, baseType: !326, size: 32, offset: 5312)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !152, file: !153, line: 47, baseType: !381, size: 64, offset: 5376)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !152, file: !153, line: 49, baseType: !172, size: 64, offset: 5440)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !152, file: !153, line: 50, baseType: !384, size: 64, offset: 5504)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !153, line: 27, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !153, line: 27, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !153, line: 27, size: 320, elements: !388)
!388 = !{!389, !393, !394, !395, !396, !398, !405}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !387, file: !153, line: 27, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !391, line: 166, baseType: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !391, line: 139, baseType: !7)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !387, file: !153, line: 27, baseType: !390, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !387, file: !153, line: 27, baseType: !390, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !387, file: !153, line: 27, baseType: !390, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !387, file: !153, line: 27, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !387, file: !153, line: 27, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !153, line: 10, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !153, line: 8, size: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !401, file: !153, line: 9, baseType: !147, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !153, line: 9, baseType: !147, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !387, file: !153, line: 27, baseType: !406, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !153, line: 14, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 12, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !408, file: !153, line: 13, baseType: !256, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !408, file: !153, line: 13, baseType: !256, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !152, file: !153, line: 51, baseType: !149, size: 64, offset: 5568)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !152, file: !153, line: 52, baseType: !361, size: 64, offset: 5632)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !152, file: !153, line: 53, baseType: !415, size: 64, offset: 5696)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !150, line: 33, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !153, line: 72, size: 4864, elements: !418)
!418 = !{!419, !420, !442, !443, !452}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !417, file: !153, line: 73, baseType: !156, size: 4480)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !417, file: !153, line: 73, baseType: !421, size: 192, offset: 4480)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 192, elements: !208)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !153, line: 56, size: 192, elements: !423)
!423 = !{!424, !434, !438}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !422, file: !153, line: 57, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!171, !415, !149, !147, !428, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !422, file: !153, line: 58, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!171, !415}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !422, file: !153, line: 59, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!171, !415, !179}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !153, line: 74, baseType: !140, size: 64, offset: 4672)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !417, file: !153, line: 75, baseType: !444, size: 64, offset: 4736)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !153, line: 62, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !153, line: 64, size: 256, elements: !447)
!447 = !{!448, !449, !450, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !153, line: 66, baseType: !444, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !446, file: !153, line: 67, baseType: !430, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !446, file: !153, line: 68, baseType: !431, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !446, file: !153, line: 69, baseType: !147, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !417, file: !153, line: 76, baseType: !444, size: 64, offset: 4800)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "maxConeSize", scope: !144, file: !143, line: 128, baseType: !147, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cones", scope: !144, file: !143, line: 129, baseType: !256, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "coneOrientations", scope: !144, file: !143, line: 130, baseType: !256, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "supportSection", scope: !144, file: !143, line: 131, baseType: !149, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "maxSupportSize", scope: !144, file: !143, line: 132, baseType: !147, size: 32, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "supports", scope: !144, file: !143, line: 133, baseType: !256, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "refinementUniform", scope: !144, file: !143, line: 134, baseType: !326, size: 32, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "refinementLimit", scope: !144, file: !143, line: 135, baseType: !265, size: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "refinementFunc", scope: !144, file: !143, line: 136, baseType: !462, size: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!171, !465, !264}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !144, file: !143, line: 137, baseType: !147, size: 32, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "interpolated", scope: !144, file: !143, line: 138, baseType: !469, size: 32, offset: 736)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexInterpolatedFlag", file: !93, line: 105, baseType: !92)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "interpolatedCollective", scope: !144, file: !143, line: 139, baseType: !469, size: 32, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "facesTmp", scope: !144, file: !143, line: 141, baseType: !256, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cellRefiner", scope: !144, file: !143, line: 144, baseType: !473, size: 32, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPlexCellRefinerType", file: !102, line: 30, baseType: !101)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "regularRefinement", scope: !144, file: !143, line: 145, baseType: !326, size: 32, offset: 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tetgenOpts", scope: !144, file: !143, line: 148, baseType: !238, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "triangleOpts", scope: !144, file: !143, line: 149, baseType: !238, size: 64, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "partitioner", scope: !144, file: !143, line: 150, baseType: !478, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !479, line: 13, baseType: !480)
!479 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !479, line: 13, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "partitionBalance", scope: !144, file: !143, line: 151, baseType: !326, size: 32, offset: 1152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "remeshBd", scope: !144, file: !143, line: 152, baseType: !326, size: 32, offset: 1184)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "subpointMap", scope: !144, file: !143, line: 155, baseType: !485, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !486, line: 12, baseType: !487)
!486 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !486, line: 12, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "subpointIS", scope: !144, file: !143, line: 156, baseType: !361, size: 64, offset: 1280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "subpointState", scope: !144, file: !143, line: 157, baseType: !249, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "depthState", scope: !144, file: !143, line: 160, baseType: !249, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeState", scope: !144, file: !143, line: 161, baseType: !249, size: 64, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "globalVertexNumbers", scope: !144, file: !143, line: 162, baseType: !361, size: 64, offset: 1536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "globalCellNumbers", scope: !144, file: !143, line: 163, baseType: !361, size: 64, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "anchorSection", scope: !144, file: !143, line: 166, baseType: !149, size: 64, offset: 1664)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "anchorIS", scope: !144, file: !143, line: 167, baseType: !361, size: 64, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "createanchors", scope: !144, file: !143, line: 168, baseType: !498, size: 64, offset: 1792)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!171, !501}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !6, line: 14, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !67, line: 202, size: 40000, elements: !504)
!504 = !{!505, !506, !724, !728, !729, !730, !731, !741, !742, !750, !751, !759, !760, !761, !762, !766, !767, !771, !773, !775, !776, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !804, !816, !828, !840, !849, !850, !869, !870, !871, !872, !873, !874, !876, !877, !878, !898, !899, !900, !901, !902, !903, !907, !908, !912, !913, !914, !915, !916, !917, !918, !919, !920, !923, !935, !936, !937, !946, !1034, !1035, !1123, !1124, !1125, !1126, !1128, !1130, !1131, !1132, !1133, !1134}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !503, file: !67, line: 203, baseType: !156, size: 4480)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !503, file: !67, line: 203, baseType: !507, size: 3456, offset: 4480)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 3456, elements: !208)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !67, line: 30, size: 3456, elements: !509)
!509 = !{!510, !514, !515, !520, !524, !525, !526, !527, !536, !537, !538, !544, !545, !553, !562, !571, !575, !579, !580, !585, !586, !590, !591, !595, !596, !600, !604, !609, !610, !611, !612, !613, !614, !615, !619, !623, !627, !632, !636, !647, !651, !656, !663, !667, !668, !674, !683, !687, !695, !699, !707, !711, !719, !720}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !508, file: !67, line: 31, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!171, !501, !179}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !508, file: !67, line: 32, baseType: !511, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !508, file: !67, line: 33, baseType: !516, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!171, !501, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !508, file: !67, line: 34, baseType: !521, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!171, !302, !501}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !508, file: !67, line: 35, baseType: !498, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !508, file: !67, line: 36, baseType: !498, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !508, file: !67, line: 37, baseType: !498, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !508, file: !67, line: 38, baseType: !528, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!171, !501, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !533, line: 21, baseType: !534)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !533, line: 21, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !508, file: !67, line: 39, baseType: !528, size: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !508, file: !67, line: 40, baseType: !498, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !508, file: !67, line: 41, baseType: !539, size: 64, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!171, !501, !256, !381, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !508, file: !67, line: 42, baseType: !516, size: 64, offset: 704)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !508, file: !67, line: 43, baseType: !546, size: 64, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!171, !501, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !6, line: 165, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !6, line: 165, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !508, file: !67, line: 45, baseType: !554, size: 64, offset: 832)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!171, !501, !557, !558}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !46, line: 213, baseType: !45)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !362, line: 51, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !362, line: 51, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !508, file: !67, line: 46, baseType: !563, size: 64, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!171, !501, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !568, line: 16, baseType: !569)
!568 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !568, line: 16, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !508, file: !67, line: 47, baseType: !572, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!171, !501, !501, !566, !531}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !508, file: !67, line: 48, baseType: !576, size: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!171, !501, !501, !566}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !508, file: !67, line: 49, baseType: !576, size: 64, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !508, file: !67, line: 50, baseType: !581, size: 64, offset: 1152)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!171, !501, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !508, file: !67, line: 51, baseType: !576, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !508, file: !67, line: 53, baseType: !587, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!171, !501, !136, !519}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !508, file: !67, line: 54, baseType: !587, size: 64, offset: 1344)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !508, file: !67, line: 55, baseType: !592, size: 64, offset: 1408)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!171, !501, !147, !519}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !508, file: !67, line: 56, baseType: !592, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !508, file: !67, line: 57, baseType: !597, size: 64, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!171, !501, !485, !519}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !508, file: !67, line: 58, baseType: !601, size: 64, offset: 1600)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!171, !501, !532, !485, !519}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !508, file: !67, line: 60, baseType: !605, size: 64, offset: 1664)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!171, !501, !532, !608, !532}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !26, line: 580, baseType: !50)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !508, file: !67, line: 61, baseType: !605, size: 64, offset: 1728)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !508, file: !67, line: 62, baseType: !605, size: 64, offset: 1792)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !508, file: !67, line: 63, baseType: !605, size: 64, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !508, file: !67, line: 64, baseType: !605, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !508, file: !67, line: 65, baseType: !605, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !508, file: !67, line: 67, baseType: !498, size: 64, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !508, file: !67, line: 69, baseType: !616, size: 64, offset: 2112)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!171, !501, !532, !532}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !508, file: !67, line: 71, baseType: !620, size: 64, offset: 2176)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!171, !501, !147, !428, !543, !519}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !508, file: !67, line: 72, baseType: !624, size: 64, offset: 2240)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!171, !519, !147, !542, !519}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !508, file: !67, line: 73, baseType: !628, size: 64, offset: 2304)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!171, !501, !256, !381, !542, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !508, file: !67, line: 74, baseType: !633, size: 64, offset: 2368)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!171, !501, !256, !381, !542, !542, !631}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !508, file: !67, line: 75, baseType: !637, size: 64, offset: 2432)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!171, !501, !147, !519, !640, !640, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !643, line: 59, baseType: !644)
!643 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !643, line: 15, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !643, line: 15, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !508, file: !67, line: 77, baseType: !648, size: 64, offset: 2496)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!171, !501, !147, !256, !256}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !508, file: !67, line: 78, baseType: !652, size: 64, offset: 2560)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!171, !501, !532, !655, !644}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !6, line: 74, baseType: !61)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !508, file: !67, line: 79, baseType: !657, size: 64, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!171, !501, !256, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !508, file: !67, line: 80, baseType: !664, size: 64, offset: 2688)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!171, !501, !264, !264}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !508, file: !67, line: 81, baseType: !664, size: 64, offset: 2752)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !508, file: !67, line: 82, baseType: !669, size: 64, offset: 2816)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!171, !501, !532, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !508, file: !67, line: 84, baseType: !675, size: 64, offset: 2880)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!171, !501, !265, !678, !682, !608, !532}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!171, !147, !265, !465, !147, !273, !140}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !508, file: !67, line: 85, baseType: !684, size: 64, offset: 2944)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!171, !501, !265, !485, !147, !428, !147, !428, !678, !682, !608, !532}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !508, file: !67, line: 86, baseType: !688, size: 64, offset: 3008)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!171, !501, !265, !532, !691, !608, !532}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !147, !147, !147, !428, !428, !432, !432, !432, !428, !428, !432, !432, !432, !265, !465, !147, !432, !273}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !508, file: !67, line: 87, baseType: !696, size: 64, offset: 3072)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!171, !501, !265, !485, !147, !428, !147, !428, !532, !691, !608, !532}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !508, file: !67, line: 88, baseType: !700, size: 64, offset: 3136)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!171, !501, !265, !485, !147, !428, !147, !428, !532, !703, !608, !532}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !147, !147, !147, !428, !428, !432, !432, !432, !428, !428, !432, !432, !432, !265, !465, !465, !147, !432, !273}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !508, file: !67, line: 89, baseType: !708, size: 64, offset: 3200)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!171, !501, !265, !678, !682, !532, !264}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !508, file: !67, line: 90, baseType: !712, size: 64, offset: 3264)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!171, !501, !265, !715, !682, !532, !465, !264}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!171, !147, !265, !465, !465, !147, !273, !140}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !508, file: !67, line: 91, baseType: !708, size: 64, offset: 3328)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !508, file: !67, line: 93, baseType: !721, size: 64, offset: 3392)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!171, !501, !501, !584, !584}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !503, file: !67, line: 204, baseType: !725, size: 6400, offset: 7936)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 6400, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 100)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !503, file: !67, line: 204, baseType: !725, size: 6400, offset: 14336)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !503, file: !67, line: 205, baseType: !725, size: 6400, offset: 20736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !503, file: !67, line: 205, baseType: !725, size: 6400, offset: 27136)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !503, file: !67, line: 206, baseType: !732, size: 64, offset: 33536)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !67, line: 141, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !67, line: 142, size: 256, elements: !735)
!735 = !{!736, !737, !738, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !734, file: !67, line: 143, baseType: !532, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !67, line: 144, baseType: !238, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !734, file: !67, line: 145, baseType: !739, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !67, line: 140, baseType: !66)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !67, line: 146, baseType: !732, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !503, file: !67, line: 207, baseType: !732, size: 64, offset: 33600)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !503, file: !67, line: 208, baseType: !743, size: 64, offset: 33664)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !67, line: 149, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !67, line: 150, size: 192, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !745, file: !67, line: 151, baseType: !322, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !745, file: !67, line: 152, baseType: !140, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !67, line: 153, baseType: !743, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !503, file: !67, line: 208, baseType: !743, size: 64, offset: 33728)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !503, file: !67, line: 209, baseType: !752, size: 64, offset: 33792)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !67, line: 163, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !67, line: 158, size: 192, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !754, file: !67, line: 159, baseType: !485, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !754, file: !67, line: 160, baseType: !326, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !67, line: 161, baseType: !753, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !503, file: !67, line: 210, baseType: !485, size: 64, offset: 33856)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !503, file: !67, line: 211, baseType: !485, size: 64, offset: 33920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !503, file: !67, line: 212, baseType: !140, size: 64, offset: 33984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !503, file: !67, line: 213, baseType: !763, size: 64, offset: 34048)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!171, !682}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !503, file: !67, line: 214, baseType: !557, size: 32, offset: 34112)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !503, file: !67, line: 215, baseType: !768, size: 64, offset: 34176)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !568, line: 1378, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !568, line: 1378, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !503, file: !67, line: 216, baseType: !772, size: 64, offset: 34240)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !533, line: 83, baseType: !133)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !503, file: !67, line: 217, baseType: !774, size: 64, offset: 34304)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !568, line: 25, baseType: !133)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !503, file: !67, line: 218, baseType: !147, size: 32, offset: 34368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !503, file: !67, line: 219, baseType: !777, size: 64, offset: 34432)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !362, line: 30, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !362, line: 30, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !503, file: !67, line: 220, baseType: !326, size: 32, offset: 34496)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !503, file: !67, line: 221, baseType: !326, size: 32, offset: 34528)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !503, file: !67, line: 222, baseType: !147, size: 32, offset: 34560)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !503, file: !67, line: 222, baseType: !147, size: 32, offset: 34592)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !503, file: !67, line: 223, baseType: !326, size: 32, offset: 34624)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !503, file: !67, line: 224, baseType: !326, size: 32, offset: 34656)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !503, file: !67, line: 225, baseType: !140, size: 64, offset: 34688)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !503, file: !67, line: 227, baseType: !501, size: 64, offset: 34752)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !503, file: !67, line: 228, baseType: !501, size: 64, offset: 34816)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !503, file: !67, line: 229, baseType: !790, size: 64, offset: 34880)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !67, line: 100, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !67, line: 101, size: 256, elements: !793)
!793 = !{!794, !798, !802, !803}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !792, file: !67, line: 102, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!171, !501, !501, !140}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !792, file: !67, line: 103, baseType: !799, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!171, !501, !567, !532, !567, !501, !140}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !792, file: !67, line: 104, baseType: !140, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !67, line: 105, baseType: !790, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !503, file: !67, line: 230, baseType: !805, size: 64, offset: 34944)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !67, line: 108, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !67, line: 109, size: 256, elements: !808)
!808 = !{!809, !810, !814, !815}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !807, file: !67, line: 110, baseType: !795, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !807, file: !67, line: 111, baseType: !811, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!171, !501, !567, !501, !140}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !807, file: !67, line: 112, baseType: !140, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !67, line: 113, baseType: !805, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !503, file: !67, line: 231, baseType: !817, size: 64, offset: 35008)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !67, line: 116, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !67, line: 117, size: 256, elements: !820)
!820 = !{!821, !822, !826, !827}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !819, file: !67, line: 118, baseType: !795, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !819, file: !67, line: 119, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!171, !501, !642, !642, !501, !140}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !819, file: !67, line: 120, baseType: !140, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !67, line: 121, baseType: !817, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !503, file: !67, line: 232, baseType: !829, size: 64, offset: 35072)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !67, line: 124, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !67, line: 125, size: 256, elements: !832)
!832 = !{!833, !837, !838, !839}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !831, file: !67, line: 126, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!171, !501, !532, !608, !532, !140}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !831, file: !67, line: 127, baseType: !834, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !831, file: !67, line: 128, baseType: !140, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !67, line: 129, baseType: !829, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !503, file: !67, line: 233, baseType: !841, size: 64, offset: 35136)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !67, line: 132, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !67, line: 133, size: 256, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !843, file: !67, line: 134, baseType: !834, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !843, file: !67, line: 135, baseType: !834, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !843, file: !67, line: 136, baseType: !140, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !67, line: 137, baseType: !841, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !503, file: !67, line: 235, baseType: !147, size: 32, offset: 35200)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !503, file: !67, line: 237, baseType: !851, size: 64, offset: 35264)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !67, line: 27, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !67, line: 27, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !67, line: 27, size: 320, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !868}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !854, file: !67, line: 27, baseType: !390, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !67, line: 27, baseType: !390, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !854, file: !67, line: 27, baseType: !390, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !854, file: !67, line: 27, baseType: !390, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !67, line: 27, baseType: !397, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !854, file: !67, line: 27, baseType: !862, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !67, line: 21, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !67, line: 17, size: 128, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !864, file: !67, line: 19, baseType: !485, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !864, file: !67, line: 20, baseType: !147, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !854, file: !67, line: 27, baseType: !531, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !503, file: !67, line: 239, baseType: !644, size: 64, offset: 35328)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !503, file: !67, line: 240, baseType: !644, size: 64, offset: 35392)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !503, file: !67, line: 241, baseType: !644, size: 64, offset: 35456)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !503, file: !67, line: 242, baseType: !644, size: 64, offset: 35520)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !503, file: !67, line: 243, baseType: !326, size: 32, offset: 35584)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !503, file: !67, line: 245, baseType: !875, size: 64, offset: 35616)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, elements: !287)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !503, file: !67, line: 246, baseType: !149, size: 64, offset: 35712)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !503, file: !67, line: 247, baseType: !149, size: 64, offset: 35776)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !503, file: !67, line: 248, baseType: !879, size: 64, offset: 35840)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !362, line: 60, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !46, line: 240, size: 640, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !881, file: !46, line: 241, baseType: !136, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !881, file: !46, line: 242, baseType: !228, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !881, file: !46, line: 243, baseType: !147, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !881, file: !46, line: 243, baseType: !147, size: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !881, file: !46, line: 244, baseType: !147, size: 32, offset: 160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !881, file: !46, line: 244, baseType: !147, size: 32, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !881, file: !46, line: 245, baseType: !256, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !881, file: !46, line: 246, baseType: !326, size: 32, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !881, file: !46, line: 247, baseType: !147, size: 32, offset: 352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !881, file: !46, line: 251, baseType: !147, size: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !881, file: !46, line: 252, baseType: !777, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !881, file: !46, line: 253, baseType: !326, size: 32, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !881, file: !46, line: 254, baseType: !147, size: 32, offset: 544)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !881, file: !46, line: 254, baseType: !147, size: 32, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !881, file: !46, line: 255, baseType: !147, size: 32, offset: 608)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !503, file: !67, line: 250, baseType: !149, size: 64, offset: 35904)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !503, file: !67, line: 251, baseType: !567, size: 64, offset: 35968)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !503, file: !67, line: 253, baseType: !501, size: 64, offset: 36032)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !503, file: !67, line: 254, baseType: !532, size: 64, offset: 36096)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !503, file: !67, line: 255, baseType: !140, size: 64, offset: 36160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !503, file: !67, line: 256, baseType: !904, size: 64, offset: 36224)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!171, !501, !140}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !503, file: !67, line: 257, baseType: !904, size: 64, offset: 36288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !503, file: !67, line: 258, baseType: !909, size: 64, offset: 36352)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!171, !501, !465, !326, !431, !140}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !503, file: !67, line: 260, baseType: !147, size: 32, offset: 36416)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !503, file: !67, line: 261, baseType: !501, size: 64, offset: 36480)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !503, file: !67, line: 262, baseType: !532, size: 64, offset: 36544)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !503, file: !67, line: 263, baseType: !532, size: 64, offset: 36608)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !503, file: !67, line: 264, baseType: !326, size: 32, offset: 36672)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !503, file: !67, line: 265, baseType: !550, size: 64, offset: 36736)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !503, file: !67, line: 266, baseType: !264, size: 64, offset: 36800)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !503, file: !67, line: 266, baseType: !264, size: 64, offset: 36864)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !503, file: !67, line: 267, baseType: !921, size: 64, offset: 36928)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !6, line: 42, baseType: !71)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !503, file: !67, line: 269, baseType: !924, size: 640, offset: 36992)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 640, elements: !933)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !67, line: 15, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!171, !501, !147, !147, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !568, line: 1723, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !568, line: 1723, flags: DIFlagFwdDecl)
!933 = !{!934}
!934 = !DISubrange(count: 10)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !503, file: !67, line: 270, baseType: !924, size: 640, offset: 37632)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !503, file: !67, line: 272, baseType: !147, size: 32, offset: 38272)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !503, file: !67, line: 273, baseType: !938, size: 64, offset: 38336)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !67, line: 178, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !67, line: 173, size: 256, elements: !941)
!941 = !{!942, !943, !944, !945}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !940, file: !67, line: 174, baseType: !172, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !940, file: !67, line: 175, baseType: !485, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !940, file: !67, line: 176, baseType: !875, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !940, file: !67, line: 177, baseType: !326, size: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !503, file: !67, line: 274, baseType: !947, size: 64, offset: 38400)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !67, line: 165, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !67, line: 167, size: 192, elements: !950)
!950 = !{!951, !1032, !1033}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !949, file: !67, line: 168, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !953, line: 11, baseType: !954)
!953 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !953, line: 13, size: 832, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !1023, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !953, line: 14, baseType: !133, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !955, file: !953, line: 15, baseType: !485, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !955, file: !953, line: 16, baseType: !133, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !955, file: !953, line: 17, baseType: !147, size: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !955, file: !953, line: 18, baseType: !256, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !955, file: !953, line: 19, baseType: !963, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !964, line: 22, baseType: !965)
!964 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !953, line: 81, size: 4992, elements: !967)
!967 = !{!968, !969, !983, !984, !985, !994}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !966, file: !953, line: 82, baseType: !156, size: 4480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !966, file: !953, line: 82, baseType: !970, size: 256, offset: 4480)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, elements: !208)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !953, line: 74, size: 256, elements: !972)
!972 = !{!973, !977, !978, !982}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !971, file: !953, line: 75, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!171, !963}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !971, file: !953, line: 76, baseType: !974, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !971, file: !953, line: 77, baseType: !979, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!171, !963, !179}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !971, file: !953, line: 78, baseType: !974, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !966, file: !953, line: 83, baseType: !140, size: 64, offset: 4736)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !966, file: !953, line: 85, baseType: !147, size: 32, offset: 4800)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !966, file: !953, line: 86, baseType: !986, size: 64, offset: 4864)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !953, line: 41, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !953, line: 36, size: 256, elements: !989)
!989 = !{!990, !991, !992, !993}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !988, file: !953, line: 37, baseType: !322, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !988, file: !953, line: 38, baseType: !322, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !988, file: !953, line: 39, baseType: !322, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !988, file: !953, line: 40, baseType: !238, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !966, file: !953, line: 87, baseType: !995, size: 64, offset: 4928)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !953, line: 54, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !953, line: 54, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !953, line: 54, size: 320, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1015}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !999, file: !953, line: 54, baseType: !390, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !999, file: !953, line: 54, baseType: !390, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !999, file: !953, line: 54, baseType: !390, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !999, file: !953, line: 54, baseType: !390, size: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !999, file: !953, line: 54, baseType: !397, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !999, file: !953, line: 54, baseType: !1007, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !964, line: 41, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !964, line: 35, size: 192, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1009, file: !964, line: 37, baseType: !485, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1009, file: !964, line: 38, baseType: !147, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1009, file: !964, line: 39, baseType: !147, size: 32, offset: 96)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1009, file: !964, line: 40, baseType: !147, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !999, file: !953, line: 54, baseType: !1016, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !953, line: 34, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !953, line: 30, size: 96, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1018, file: !953, line: 31, baseType: !147, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1018, file: !953, line: 32, baseType: !147, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1018, file: !953, line: 33, baseType: !147, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !955, file: !953, line: 20, baseType: !1024, size: 32, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !6, line: 60, baseType: !78)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !955, file: !953, line: 21, baseType: !147, size: 32, offset: 416)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !955, file: !953, line: 22, baseType: !147, size: 32, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !955, file: !953, line: 23, baseType: !256, size: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !955, file: !953, line: 24, baseType: !200, size: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !955, file: !953, line: 25, baseType: !200, size: 64, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !955, file: !953, line: 26, baseType: !140, size: 64, offset: 704)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !953, line: 27, baseType: !952, size: 64, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !949, file: !67, line: 169, baseType: !485, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !67, line: 170, baseType: !947, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !503, file: !67, line: 275, baseType: !147, size: 32, offset: 38464)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !503, file: !67, line: 276, baseType: !1036, size: 64, offset: 38528)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !67, line: 184, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !67, line: 180, size: 192, elements: !1039)
!1039 = !{!1040, !1121, !1122}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1038, file: !67, line: 181, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !964, line: 13, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !953, line: 98, size: 7232, elements: !1044)
!1044 = !{!1045, !1046, !1060, !1061, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1077, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1043, file: !953, line: 99, baseType: !156, size: 4480)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1043, file: !953, line: 99, baseType: !1047, size: 256, offset: 4480)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 256, elements: !208)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !953, line: 91, size: 256, elements: !1049)
!1049 = !{!1050, !1054, !1055, !1059}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1048, file: !953, line: 92, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!171, !1041}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1048, file: !953, line: 93, baseType: !1051, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1048, file: !953, line: 94, baseType: !1056, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!171, !1041, !179}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1048, file: !953, line: 95, baseType: !1051, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1043, file: !953, line: 100, baseType: !140, size: 64, offset: 4736)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1043, file: !953, line: 101, baseType: !1062, size: 64, offset: 4800)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1043, file: !953, line: 102, baseType: !326, size: 32, offset: 4864)
