; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/owlqn/owlqn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/owlqn/owlqn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 6, baseType: !26, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!56 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!57 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!58 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!59 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!60 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!61 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!62 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!63 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!64 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!65 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!66 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 155, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!75 = !{!76, !79, !97, !178, !118, !284, !26}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !86, !139, !140, !142, !145, !146, !147, !148, !156, !157, !159, !163, !167, !169, !170, !171, !172, !173, !174, !175, !176, !177, !179, !181, !182, !183, !185, !186, !188, !190, !191, !192, !193, !194, !197, !199, !200, !201, !202, !203, !206, !208, !209, !210, !220, !222, !223, !227, !228, !274, !279, !281, !282, !283}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !87, size: 448, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !137)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !90)
!90 = !{!91, !101, !109, !114, !121, !125, !132}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !89, file: !82, line: 46, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !79, !96}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !98, line: 330, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !98, line: 330, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !89, file: !82, line: 47, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!95, !79, !105}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !106, line: 16, baseType: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !106, line: 16, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !89, file: !82, line: 48, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!95, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !89, file: !82, line: 49, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!95, !79, !118, !79}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !89, file: !82, line: 50, baseType: !122, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!95, !79, !118, !113}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !89, file: !82, line: 51, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!95, !79, !118, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !89, file: !82, line: 52, baseType: !133, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!95, !79, !118, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !97, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !141, size: 32, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !144)
!144 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !143, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !149, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !152, line: 27, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !154, line: 43, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!155 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !141, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !158, size: 32, offset: 992)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !160, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !168, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !168, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !168, size: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !149, size: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !168, size: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !168, size: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !141, size: 32, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !178, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !180, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !150)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !141, size: 32, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !141, size: 32, offset: 1888)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !184, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !184, size: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !187, size: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !189, size: 64, offset: 2112)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !141, size: 32, offset: 2176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !141, size: 32, offset: 2208)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !184, size: 64, offset: 2240)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !184, size: 64, offset: 2304)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !195, size: 64, offset: 2368)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !198, size: 64, offset: 2432)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !141, size: 32, offset: 2496)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !141, size: 32, offset: 2528)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !184, size: 64, offset: 2560)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !184, size: 64, offset: 2624)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !204, size: 64, offset: 2688)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !196)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !207, size: 64, offset: 2752)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !136, size: 64, offset: 2816)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !141, size: 32, offset: 2880)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !211, size: 128, offset: 2944)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 128, elements: !218)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !214, file: !82, line: 62, baseType: !129, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !214, file: !82, line: 63, baseType: !178, size: 64, offset: 64)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !221, size: 64, offset: 3072)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !218)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !178, size: 64, offset: 3136)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !224, size: 64, offset: 3200)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!95, !178}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !141, size: 32, offset: 3264)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !229, size: 320, offset: 3328)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 320, elements: !272)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!95, !233, !79, !178}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !236)
!236 = !{!237, !238, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !235, file: !10, line: 100, baseType: !141, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !10, line: 101, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !250, !251, !252, !253, !255, !257, !258, !259}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !241, file: !10, line: 84, baseType: !168, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !241, file: !10, line: 85, baseType: !168, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !10, line: 86, baseType: !178, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !241, file: !10, line: 87, baseType: !160, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !241, file: !10, line: 88, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !241, file: !10, line: 89, baseType: !120, size: 8, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !241, file: !10, line: 90, baseType: !168, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !241, file: !10, line: 91, baseType: !76, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !241, file: !10, line: 92, baseType: !254, size: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !10, line: 93, baseType: !256, size: 32, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !10, line: 94, baseType: !239, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !241, file: !10, line: 95, baseType: !168, size: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !241, file: !10, line: 96, baseType: !178, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !235, file: !10, line: 102, baseType: !168, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !235, file: !10, line: 102, baseType: !168, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !235, file: !10, line: 103, baseType: !168, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !235, file: !10, line: 104, baseType: !97, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !235, file: !10, line: 105, baseType: !254, size: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !235, file: !10, line: 106, baseType: !79, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !235, file: !10, line: 107, baseType: !269, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!272 = !{!273}
!273 = !DISubrange(count: 5)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !275, size: 320, offset: 3648)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 320, elements: !272)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!95, !79, !178}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !280, size: 320, offset: 3968)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 320, elements: !272)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !254, size: 32, offset: 4288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !269, size: 64, offset: 4352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !254, size: 32, offset: 4416)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_OWLQN", file: !286, line: 27, baseType: !287)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/unconstrained/impls/owlqn/owlqn.h", directory: "/home/users/ndemeye/xSDK")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !286, line: 10, size: 704, elements: !288)
!288 = !{!289, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !287, file: !286, line: 11, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !291, line: 16, baseType: !292)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !291, line: 16, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !287, file: !286, line: 13, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !68, line: 21, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !68, line: 21, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !287, file: !286, line: 14, baseType: !295, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !287, file: !286, line: 15, baseType: !295, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !287, file: !286, line: 16, baseType: !295, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "GV", scope: !287, file: !286, line: 17, baseType: !295, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Xold", scope: !287, file: !286, line: 19, baseType: !295, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Gold", scope: !287, file: !286, line: 20, baseType: !295, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs", scope: !287, file: !286, line: 22, baseType: !141, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sgrad", scope: !287, file: !286, line: 23, baseType: !141, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "grad", scope: !287, file: !286, line: 24, baseType: !141, size: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !287, file: !286, line: 26, baseType: !196, size: 64, offset: 640)
!308 = !{i32 7, !"Dwarf Version", i32 4}
!309 = !{i32 2, !"Debug Info Version", i32 3}
!310 = !{i32 1, !"wchar_size", i32 4}
!311 = !{i32 7, !"PIC Level", i32 2}
!312 = !{i32 7, !"uwtable", i32 1}
!313 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!314 = distinct !DISubprogram(name: "TaoCreate_OWLQN", scope: !315, file: !315, line: 315, type: !316, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !540)
!315 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/owlqn/owlqn.c", directory: "/home/users/ndemeye/xSDK")
!316 = !DISubroutineType(types: !317)
!317 = !{!95, !318}
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !321, line: 45, size: 14656, elements: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!322 = !{!323, !325, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !408, !414, !416, !417, !418, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !492, !493, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538, !539}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !320, file: !321, line: 46, baseType: !324, size: 4480)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !320, file: !321, line: 46, baseType: !326, size: 1536, offset: 4480)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 1536, elements: !137)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !321, line: 13, size: 1536, elements: !328)
!328 = !{!329, !333, !337, !341, !345, !346, !347, !348, !349, !350, !351, !355, !359, !360, !361, !362, !366, !370, !371, !375, !377, !378, !382, !386}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !327, file: !321, line: 15, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!95, !318, !295, !195, !178}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !327, file: !321, line: 16, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!95, !318, !295, !195, !295, !178}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !327, file: !321, line: 17, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!95, !318, !295, !295, !178}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !327, file: !321, line: 18, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!95, !318, !295, !290, !290, !178}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !327, file: !321, line: 19, baseType: !338, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !327, file: !321, line: 20, baseType: !342, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !327, file: !321, line: 21, baseType: !338, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !327, file: !321, line: 22, baseType: !338, size: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !327, file: !321, line: 23, baseType: !338, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !327, file: !321, line: 24, baseType: !342, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !327, file: !321, line: 25, baseType: !352, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!95, !318, !295, !290, !290, !290, !178}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !327, file: !321, line: 26, baseType: !356, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!95, !318, !295, !290, !178}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !327, file: !321, line: 27, baseType: !342, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !327, file: !321, line: 28, baseType: !342, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !327, file: !321, line: 29, baseType: !338, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !327, file: !321, line: 30, baseType: !363, size: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!95, !318, !141, !178}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !327, file: !321, line: 31, baseType: !367, size: 64, offset: 1024)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!95, !318, !178}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !327, file: !321, line: 32, baseType: !224, size: 64, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !327, file: !321, line: 35, baseType: !372, size: 64, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!95, !318, !295, !295}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !327, file: !321, line: 36, baseType: !376, size: 64, offset: 1216)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !327, file: !321, line: 37, baseType: !376, size: 64, offset: 1280)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !327, file: !321, line: 38, baseType: !379, size: 64, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!95, !318, !105}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !327, file: !321, line: 39, baseType: !383, size: 64, offset: 1408)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!95, !233, !318}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !327, file: !321, line: 40, baseType: !376, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !320, file: !321, line: 47, baseType: !178, size: 64, offset: 6016)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !320, file: !321, line: 48, baseType: !178, size: 64, offset: 6080)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !320, file: !321, line: 49, baseType: !178, size: 64, offset: 6144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !320, file: !321, line: 50, baseType: !178, size: 64, offset: 6208)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !320, file: !321, line: 51, baseType: !178, size: 64, offset: 6272)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !320, file: !321, line: 52, baseType: !178, size: 64, offset: 6336)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !320, file: !321, line: 53, baseType: !178, size: 64, offset: 6400)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !320, file: !321, line: 54, baseType: !178, size: 64, offset: 6464)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !320, file: !321, line: 55, baseType: !178, size: 64, offset: 6528)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !320, file: !321, line: 56, baseType: !178, size: 64, offset: 6592)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !320, file: !321, line: 57, baseType: !178, size: 64, offset: 6656)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !320, file: !321, line: 58, baseType: !178, size: 64, offset: 6720)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !320, file: !321, line: 59, baseType: !178, size: 64, offset: 6784)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !320, file: !321, line: 60, baseType: !178, size: 64, offset: 6848)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !320, file: !321, line: 61, baseType: !178, size: 64, offset: 6912)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !320, file: !321, line: 62, baseType: !178, size: 64, offset: 6976)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !320, file: !321, line: 63, baseType: !178, size: 64, offset: 7040)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !320, file: !321, line: 65, baseType: !405, size: 640, offset: 7104)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 640, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 10)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !320, file: !321, line: 66, baseType: !409, size: 640, offset: 7744)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 640, elements: !406)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!95, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !320, file: !321, line: 67, baseType: !415, size: 640, offset: 8384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 640, elements: !406)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !320, file: !321, line: 68, baseType: !141, size: 32, offset: 9024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !320, file: !321, line: 69, baseType: !178, size: 64, offset: 9088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !320, file: !321, line: 70, baseType: !419, size: 32, offset: 9152)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !320, file: !321, line: 72, baseType: !254, size: 32, offset: 9184)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !321, line: 73, baseType: !178, size: 64, offset: 9216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !320, file: !321, line: 75, baseType: !295, size: 64, offset: 9280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !320, file: !321, line: 76, baseType: !295, size: 64, offset: 9344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !320, file: !321, line: 77, baseType: !295, size: 64, offset: 9408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !320, file: !321, line: 78, baseType: !295, size: 64, offset: 9472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !320, file: !321, line: 79, baseType: !295, size: 64, offset: 9536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !320, file: !321, line: 80, baseType: !295, size: 64, offset: 9600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !320, file: !321, line: 81, baseType: !295, size: 64, offset: 9664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !320, file: !321, line: 82, baseType: !295, size: 64, offset: 9728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !320, file: !321, line: 83, baseType: !295, size: 64, offset: 9792)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !320, file: !321, line: 84, baseType: !290, size: 64, offset: 9856)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !320, file: !321, line: 85, baseType: !290, size: 64, offset: 9920)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !320, file: !321, line: 86, baseType: !290, size: 64, offset: 9984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !320, file: !321, line: 87, baseType: !295, size: 64, offset: 10048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !320, file: !321, line: 88, baseType: !295, size: 64, offset: 10112)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !320, file: !321, line: 89, baseType: !290, size: 64, offset: 10176)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !320, file: !321, line: 90, baseType: !290, size: 64, offset: 10240)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !320, file: !321, line: 91, baseType: !295, size: 64, offset: 10304)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !320, file: !321, line: 92, baseType: !141, size: 32, offset: 10368)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !320, file: !321, line: 93, baseType: !187, size: 64, offset: 10432)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !320, file: !321, line: 94, baseType: !187, size: 64, offset: 10496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !320, file: !321, line: 95, baseType: !195, size: 64, offset: 10560)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !320, file: !321, line: 96, baseType: !295, size: 64, offset: 10624)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !320, file: !321, line: 97, baseType: !295, size: 64, offset: 10688)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !320, file: !321, line: 98, baseType: !295, size: 64, offset: 10752)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !320, file: !321, line: 99, baseType: !290, size: 64, offset: 10816)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !320, file: !321, line: 100, baseType: !290, size: 64, offset: 10880)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !320, file: !321, line: 101, baseType: !290, size: 64, offset: 10944)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !320, file: !321, line: 102, baseType: !290, size: 64, offset: 11008)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !320, file: !321, line: 103, baseType: !290, size: 64, offset: 11072)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !320, file: !321, line: 104, baseType: !290, size: 64, offset: 11136)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !320, file: !321, line: 105, baseType: !290, size: 64, offset: 11200)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !320, file: !321, line: 106, baseType: !290, size: 64, offset: 11264)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !320, file: !321, line: 107, baseType: !290, size: 64, offset: 11328)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !320, file: !321, line: 108, baseType: !290, size: 64, offset: 11392)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !320, file: !321, line: 109, baseType: !290, size: 64, offset: 11456)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !320, file: !321, line: 110, baseType: !458, size: 64, offset: 11520)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !459, line: 11, baseType: !460)
!459 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !459, line: 11, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !320, file: !321, line: 111, baseType: !458, size: 64, offset: 11584)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !320, file: !321, line: 112, baseType: !196, size: 64, offset: 11648)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !320, file: !321, line: 113, baseType: !196, size: 64, offset: 11712)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !320, file: !321, line: 114, baseType: !196, size: 64, offset: 11776)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !320, file: !321, line: 115, baseType: !196, size: 64, offset: 11840)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !320, file: !321, line: 116, baseType: !196, size: 64, offset: 11904)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !320, file: !321, line: 117, baseType: !196, size: 64, offset: 11968)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !320, file: !321, line: 119, baseType: !141, size: 32, offset: 12032)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !320, file: !321, line: 120, baseType: !141, size: 32, offset: 12064)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !320, file: !321, line: 121, baseType: !141, size: 32, offset: 12096)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !320, file: !321, line: 122, baseType: !141, size: 32, offset: 12128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !320, file: !321, line: 123, baseType: !141, size: 32, offset: 12160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !320, file: !321, line: 124, baseType: !141, size: 32, offset: 12192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !320, file: !321, line: 125, baseType: !141, size: 32, offset: 12224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !320, file: !321, line: 126, baseType: !141, size: 32, offset: 12256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !320, file: !321, line: 127, baseType: !141, size: 32, offset: 12288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !320, file: !321, line: 128, baseType: !141, size: 32, offset: 12320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !320, file: !321, line: 129, baseType: !141, size: 32, offset: 12352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !320, file: !321, line: 130, baseType: !141, size: 32, offset: 12384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !320, file: !321, line: 131, baseType: !141, size: 32, offset: 12416)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !320, file: !321, line: 132, baseType: !141, size: 32, offset: 12448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !320, file: !321, line: 133, baseType: !141, size: 32, offset: 12480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !320, file: !321, line: 134, baseType: !141, size: 32, offset: 12512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !320, file: !321, line: 135, baseType: !141, size: 32, offset: 12544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !320, file: !321, line: 137, baseType: !141, size: 32, offset: 12576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !320, file: !321, line: 138, baseType: !141, size: 32, offset: 12608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !320, file: !321, line: 140, baseType: !489, size: 64, offset: 12672)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !53, line: 5, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !53, line: 5, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !320, file: !321, line: 141, baseType: !254, size: 32, offset: 12736)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !320, file: !321, line: 142, baseType: !494, size: 64, offset: 12800)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !495, line: 22, baseType: !496)
!495 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !495, line: 22, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !320, file: !321, line: 143, baseType: !196, size: 64, offset: 12864)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !320, file: !321, line: 144, baseType: !196, size: 64, offset: 12928)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !320, file: !321, line: 146, baseType: !196, size: 64, offset: 12992)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !320, file: !321, line: 147, baseType: !196, size: 64, offset: 13056)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !320, file: !321, line: 148, baseType: !196, size: 64, offset: 13120)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !320, file: !321, line: 149, baseType: !196, size: 64, offset: 13184)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !320, file: !321, line: 150, baseType: !196, size: 64, offset: 13248)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !320, file: !321, line: 151, baseType: !196, size: 64, offset: 13312)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !320, file: !321, line: 152, baseType: !196, size: 64, offset: 13376)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !320, file: !321, line: 153, baseType: !254, size: 32, offset: 13440)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !320, file: !321, line: 154, baseType: !254, size: 32, offset: 13472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !320, file: !321, line: 155, baseType: !254, size: 32, offset: 13504)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !320, file: !321, line: 156, baseType: !254, size: 32, offset: 13536)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !320, file: !321, line: 157, baseType: !254, size: 32, offset: 13568)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !320, file: !321, line: 158, baseType: !254, size: 32, offset: 13600)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !320, file: !321, line: 159, baseType: !254, size: 32, offset: 13632)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !320, file: !321, line: 160, baseType: !254, size: 32, offset: 13664)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !320, file: !321, line: 161, baseType: !254, size: 32, offset: 13696)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !320, file: !321, line: 162, baseType: !254, size: 32, offset: 13728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !320, file: !321, line: 163, baseType: !254, size: 32, offset: 13760)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !320, file: !321, line: 164, baseType: !254, size: 32, offset: 13792)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !320, file: !321, line: 165, baseType: !254, size: 32, offset: 13824)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !320, file: !321, line: 166, baseType: !254, size: 32, offset: 13856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !320, file: !321, line: 167, baseType: !254, size: 32, offset: 13888)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !320, file: !321, line: 168, baseType: !254, size: 32, offset: 13920)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !320, file: !321, line: 169, baseType: !254, size: 32, offset: 13952)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !320, file: !321, line: 170, baseType: !254, size: 32, offset: 13984)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !320, file: !321, line: 171, baseType: !254, size: 32, offset: 14016)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !320, file: !321, line: 172, baseType: !254, size: 32, offset: 14048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !320, file: !321, line: 173, baseType: !254, size: 32, offset: 14080)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !320, file: !321, line: 174, baseType: !254, size: 32, offset: 14112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !320, file: !321, line: 175, baseType: !254, size: 32, offset: 14144)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !320, file: !321, line: 177, baseType: !531, size: 32, offset: 14176)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !320, file: !321, line: 178, baseType: !141, size: 32, offset: 14208)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !320, file: !321, line: 179, baseType: !195, size: 64, offset: 14272)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !320, file: !321, line: 180, baseType: !195, size: 64, offset: 14336)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !320, file: !321, line: 181, baseType: !195, size: 64, offset: 14400)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !320, file: !321, line: 182, baseType: !187, size: 64, offset: 14464)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !320, file: !321, line: 183, baseType: !141, size: 32, offset: 14528)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !320, file: !321, line: 184, baseType: !254, size: 32, offset: 14560)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !320, file: !321, line: 185, baseType: !254, size: 32, offset: 14592)
!540 = !{!541, !542, !543, !544, !545, !547, !549, !551, !553, !555}
!541 = !DILocalVariable(name: "tao", arg: 1, scope: !314, file: !315, line: 315, type: !318)
!542 = !DILocalVariable(name: "lmP", scope: !314, file: !315, line: 317, type: !284)
!543 = !DILocalVariable(name: "owarmijo_type", scope: !314, file: !315, line: 318, type: !118)
!544 = !DILocalVariable(name: "ierr", scope: !314, file: !315, line: 319, type: !95)
!545 = !DILocalVariable(name: "ierr__", scope: !546, file: !315, line: 328, type: !95)
!546 = distinct !DILexicalBlock(scope: !314, file: !315, line: 328, column: 32)
!547 = !DILocalVariable(name: "ierr__", scope: !548, file: !315, line: 341, type: !95)
!548 = distinct !DILexicalBlock(scope: !314, file: !315, line: 341, column: 73)
!549 = !DILocalVariable(name: "ierr__", scope: !550, file: !315, line: 342, type: !95)
!550 = distinct !DILexicalBlock(scope: !314, file: !315, line: 342, column: 90)
!551 = !DILocalVariable(name: "ierr__", scope: !552, file: !315, line: 343, type: !95)
!552 = distinct !DILexicalBlock(scope: !314, file: !315, line: 343, column: 62)
!553 = !DILocalVariable(name: "ierr__", scope: !554, file: !315, line: 344, type: !95)
!554 = distinct !DILexicalBlock(scope: !314, file: !315, line: 344, column: 59)
!555 = !DILocalVariable(name: "ierr__", scope: !556, file: !315, line: 345, type: !95)
!556 = distinct !DILexicalBlock(scope: !314, file: !315, line: 345, column: 73)
!557 = !DILocation(line: 0, scope: !314)
!558 = !DILocation(line: 317, column: 3, scope: !314)
!559 = !DILocation(line: 321, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !315, line: 321, column: 3)
!561 = distinct !DILexicalBlock(scope: !562, file: !315, line: 321, column: 3)
!562 = distinct !DILexicalBlock(scope: !314, file: !315, line: 321, column: 3)
!563 = !{!564, !564, i64 0}
!564 = !{!"any pointer", !565, i64 0}
!565 = !{!"omnipotent char", !566, i64 0}
!566 = !{!"Simple C/C++ TBAA"}
!567 = !DILocation(line: 321, column: 3, scope: !561)
!568 = !DILocation(line: 321, column: 3, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !315, line: 321, column: 3)
!570 = distinct !DILexicalBlock(scope: !560, file: !315, line: 321, column: 3)
!571 = !{!572, !573, i64 1536}
!572 = !{!"", !565, i64 0, !565, i64 512, !565, i64 1024, !565, i64 1280, !573, i64 1536, !573, i64 1540, !565, i64 1544}
!573 = !{!"int", !565, i64 0}
!574 = !DILocation(line: 321, column: 3, scope: !570)
!575 = !DILocation(line: 321, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !569, file: !315, line: 321, column: 3)
!577 = !{!573, !573, i64 0}
!578 = !{!572, !573, i64 1540}
!579 = !DILocation(line: 322, column: 13, scope: !314)
!580 = !DILocation(line: 322, column: 19, scope: !314)
!581 = !{!582, !564, i64 152}
!582 = !{!"_TaoOps", !564, i64 0, !564, i64 8, !564, i64 16, !564, i64 24, !564, i64 32, !564, i64 40, !564, i64 48, !564, i64 56, !564, i64 64, !564, i64 72, !564, i64 80, !564, i64 88, !564, i64 96, !564, i64 104, !564, i64 112, !564, i64 120, !564, i64 128, !564, i64 136, !564, i64 144, !564, i64 152, !564, i64 160, !564, i64 168, !564, i64 176, !564, i64 184}
!583 = !DILocation(line: 323, column: 13, scope: !314)
!584 = !DILocation(line: 323, column: 19, scope: !314)
!585 = !{!582, !564, i64 160}
!586 = !DILocation(line: 324, column: 13, scope: !314)
!587 = !DILocation(line: 324, column: 18, scope: !314)
!588 = !{!582, !564, i64 168}
!589 = !DILocation(line: 325, column: 13, scope: !314)
!590 = !DILocation(line: 325, column: 28, scope: !314)
!591 = !{!582, !564, i64 176}
!592 = !DILocation(line: 326, column: 13, scope: !314)
!593 = !DILocation(line: 326, column: 21, scope: !314)
!594 = !{!582, !564, i64 184}
!595 = !DILocation(line: 328, column: 10, scope: !314)
!596 = !{!"branch_weights", i32 2146410443, i32 1073205}
!597 = !DILocation(line: 0, scope: !546)
