; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/pipebcgs/pipebcgs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/pipebcgs/pipebcgs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 70, baseType: !5, size: 32, elements: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !130)
!130 = !{!131, !132, !133, !134, !135}
!131 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!132 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!133 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!134 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!135 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 663, baseType: !5, size: 32, elements: !138)
!137 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!138 = !{!139, !140, !141}
!139 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 155, baseType: !5, size: 32, elements: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!144 = !{!145, !146, !147, !148, !149}
!145 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!149 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!150 = !{!151, !154, !172, !253, !193, !359}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
!152 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!153 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !157, line: 73, size: 4480, elements: !158)
!157 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!158 = !{!159, !161, !214, !215, !217, !220, !221, !222, !223, !231, !232, !234, !238, !242, !244, !245, !246, !247, !248, !249, !250, !251, !252, !254, !256, !257, !258, !260, !261, !263, !265, !266, !267, !268, !269, !272, !274, !275, !276, !277, !278, !281, !283, !284, !285, !295, !297, !298, !302, !303, !349, !354, !356, !357, !358}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !156, file: !157, line: 74, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !156, file: !157, line: 75, baseType: !162, size: 448, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 448, elements: !212)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !157, line: 53, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 45, size: 448, elements: !165)
!165 = !{!166, !176, !184, !189, !196, !200, !207}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !164, file: !157, line: 46, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !154, !171}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !173, line: 330, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !173, line: 330, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !164, file: !157, line: 47, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!170, !154, !180}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !181, line: 16, baseType: !182)
!181 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !181, line: 16, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !164, file: !157, line: 48, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!170, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !164, file: !157, line: 49, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!170, !154, !193, !154}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !164, file: !157, line: 50, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!170, !154, !193, !188}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !164, file: !157, line: 51, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!170, !154, !193, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !164, file: !157, line: 52, baseType: !208, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!170, !154, !193, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!212 = !{!213}
!213 = !DISubrange(count: 1)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !156, file: !157, line: 76, baseType: !172, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !157, line: 77, baseType: !216, size: 32, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !156, file: !157, line: 78, baseType: !218, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !219)
!219 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !156, file: !157, line: 78, baseType: !218, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !156, file: !157, line: 78, baseType: !218, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !156, file: !157, line: 78, baseType: !218, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !157, line: 79, baseType: !224, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !227, line: 27, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !229, line: 43, baseType: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!230 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !156, file: !157, line: 80, baseType: !216, size: 32, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !157, line: 81, baseType: !233, size: 32, offset: 992)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !156, file: !157, line: 82, baseType: !235, size: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !156, file: !157, line: 83, baseType: !239, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !156, file: !157, line: 84, baseType: !243, size: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !156, file: !157, line: 85, baseType: !243, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !156, file: !157, line: 86, baseType: !243, size: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !156, file: !157, line: 87, baseType: !243, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !157, line: 88, baseType: !154, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !156, file: !157, line: 89, baseType: !224, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 90, baseType: !243, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !156, file: !157, line: 91, baseType: !243, size: 64, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !156, file: !157, line: 92, baseType: !216, size: 32, offset: 1664)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !156, file: !157, line: 93, baseType: !253, size: 64, offset: 1728)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !157, line: 94, baseType: !255, size: 64, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !225)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !156, file: !157, line: 95, baseType: !216, size: 32, offset: 1856)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !156, file: !157, line: 95, baseType: !216, size: 32, offset: 1888)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !156, file: !157, line: 96, baseType: !259, size: 64, offset: 1920)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !156, file: !157, line: 96, baseType: !259, size: 64, offset: 1984)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !156, file: !157, line: 97, baseType: !262, size: 64, offset: 2048)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !156, file: !157, line: 97, baseType: !264, size: 64, offset: 2112)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !156, file: !157, line: 98, baseType: !216, size: 32, offset: 2176)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !156, file: !157, line: 98, baseType: !216, size: 32, offset: 2208)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !156, file: !157, line: 99, baseType: !259, size: 64, offset: 2240)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !156, file: !157, line: 99, baseType: !259, size: 64, offset: 2304)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !156, file: !157, line: 100, baseType: !270, size: 64, offset: 2368)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !219)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !156, file: !157, line: 100, baseType: !273, size: 64, offset: 2432)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !156, file: !157, line: 101, baseType: !216, size: 32, offset: 2496)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !156, file: !157, line: 101, baseType: !216, size: 32, offset: 2528)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !156, file: !157, line: 102, baseType: !259, size: 64, offset: 2560)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !156, file: !157, line: 102, baseType: !259, size: 64, offset: 2624)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !156, file: !157, line: 103, baseType: !279, size: 64, offset: 2688)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !271)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !156, file: !157, line: 103, baseType: !282, size: 64, offset: 2752)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !156, file: !157, line: 104, baseType: !211, size: 64, offset: 2816)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !156, file: !157, line: 105, baseType: !216, size: 32, offset: 2880)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !156, file: !157, line: 106, baseType: !286, size: 128, offset: 2944)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !293)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !157, line: 64, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 61, size: 128, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !289, file: !157, line: 62, baseType: !204, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !289, file: !157, line: 63, baseType: !253, size: 64, offset: 64)
!293 = !{!294}
!294 = !DISubrange(count: 2)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !156, file: !157, line: 107, baseType: !296, size: 64, offset: 3072)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 64, elements: !293)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !156, file: !157, line: 108, baseType: !253, size: 64, offset: 3136)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !156, file: !157, line: 109, baseType: !299, size: 64, offset: 3200)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!170, !253}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !156, file: !157, line: 111, baseType: !216, size: 32, offset: 3264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !156, file: !157, line: 112, baseType: !304, size: 320, offset: 3328)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 320, elements: !347)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!170, !308, !154, !253}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !311)
!311 = !{!312, !313, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !310, file: !10, line: 100, baseType: !216, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !10, line: 101, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !325, !326, !327, !328, !330, !332, !333, !334}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !316, file: !10, line: 84, baseType: !243, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !316, file: !10, line: 85, baseType: !243, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !10, line: 86, baseType: !253, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !316, file: !10, line: 87, baseType: !235, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !316, file: !10, line: 88, baseType: !323, size: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !316, file: !10, line: 89, baseType: !195, size: 8, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !316, file: !10, line: 90, baseType: !243, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !316, file: !10, line: 91, baseType: !151, size: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !316, file: !10, line: 92, baseType: !329, size: 32, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !10, line: 93, baseType: !331, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !10, line: 94, baseType: !314, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !316, file: !10, line: 95, baseType: !243, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !316, file: !10, line: 96, baseType: !253, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !310, file: !10, line: 102, baseType: !243, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !310, file: !10, line: 102, baseType: !243, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !310, file: !10, line: 103, baseType: !243, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !310, file: !10, line: 104, baseType: !172, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !310, file: !10, line: 105, baseType: !329, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !310, file: !10, line: 105, baseType: !329, size: 32, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !310, file: !10, line: 105, baseType: !329, size: 32, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !310, file: !10, line: 106, baseType: !154, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !310, file: !10, line: 107, baseType: !344, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!347 = !{!348}
!348 = !DISubrange(count: 5)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !156, file: !157, line: 113, baseType: !350, size: 320, offset: 3648)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!170, !154, !253}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !156, file: !157, line: 114, baseType: !355, size: 320, offset: 3968)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !347)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !156, file: !157, line: 115, baseType: !329, size: 32, offset: 4288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !156, file: !157, line: 120, baseType: !344, size: 64, offset: 4352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !156, file: !157, line: 121, baseType: !329, size: 32, offset: 4416)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_BCGS", file: !361, line: 13, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/bcgs/bcgsimpl.h", directory: "/home/users/ndemeye/xSDK")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 11, size: 64, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !362, file: !361, line: 12, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !143, line: 21, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !143, line: 21, flags: DIFlagFwdDecl)
!368 = !{i32 7, !"Dwarf Version", i32 4}
!369 = !{i32 2, !"Debug Info Version", i32 3}
!370 = !{i32 1, !"wchar_size", i32 4}
!371 = !{i32 7, !"PIC Level", i32 2}
!372 = !{i32 7, !"uwtable", i32 1}
!373 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!374 = distinct !DISubprogram(name: "KSPCreate_PIPEBCGS", scope: !375, file: !375, line: 244, type: !376, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !706)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/pipebcgs/pipebcgs.c", directory: "/home/users/ndemeye/xSDK")
!376 = !DISubroutineType(types: !377)
!377 = !{!170, !378}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !124, line: 75, size: 12800, elements: !381)
!381 = !{!382, !384, !431, !436, !437, !438, !439, !469, !470, !471, !472, !473, !475, !480, !481, !482, !483, !484, !485, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !509, !515, !516, !517, !518, !523, !524, !525, !526, !531, !532, !533, !534, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !676, !677, !678, !679, !680, !687, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !703, !704, !705}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !380, file: !124, line: 76, baseType: !383, size: 4480)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !157, line: 122, baseType: !156)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !380, file: !124, line: 76, baseType: !385, size: 896, offset: 4480)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 896, elements: !212)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !124, line: 18, size: 896, elements: !387)
!387 = !{!388, !393, !397, !399, !406, !407, !411, !412, !416, !420, !424, !425, !429, !430}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !386, file: !124, line: 19, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!170, !378, !365, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !386, file: !124, line: 22, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!170, !378, !365, !365, !392}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !386, file: !124, line: 25, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !386, file: !124, line: 26, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!170, !378, !403, !403}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !63, line: 16, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !386, file: !124, line: 27, baseType: !398, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !386, file: !124, line: 28, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!170, !308, !378}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !386, file: !124, line: 29, baseType: !398, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !386, file: !124, line: 30, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!170, !378, !270, !270}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !386, file: !124, line: 31, baseType: !417, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!170, !378, !216, !270, !270, !262}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !386, file: !124, line: 32, baseType: !421, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!170, !378, !329, !329, !262, !392, !270, !270}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !386, file: !124, line: 33, baseType: !398, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !386, file: !124, line: 34, baseType: !426, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!170, !378, !180}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !386, file: !124, line: 35, baseType: !398, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !386, file: !124, line: 36, baseType: !426, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !380, file: !124, line: 77, baseType: !432, size: 64, offset: 5376)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !433, line: 14, baseType: !434)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !433, line: 14, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !380, file: !124, line: 78, baseType: !329, size: 32, offset: 5440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !380, file: !124, line: 79, baseType: !329, size: 32, offset: 5472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !380, file: !124, line: 81, baseType: !216, size: 32, offset: 5504)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !380, file: !124, line: 82, baseType: !440, size: 64, offset: 5568)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !124, line: 54, size: 5184, elements: !443)
!443 = !{!444, !445, !465, !466, !467, !468}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !442, file: !124, line: 55, baseType: !383, size: 4480)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !442, file: !124, line: 55, baseType: !446, size: 448, offset: 4480)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 448, elements: !212)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !124, line: 41, size: 448, elements: !448)
!448 = !{!449, !453, !454, !458, !459, !460, !464}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !447, file: !124, line: 42, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!170, !440, !365, !365}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !447, file: !124, line: 43, baseType: !450, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !447, file: !124, line: 44, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!170, !440}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !447, file: !124, line: 45, baseType: !455, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !447, file: !124, line: 46, baseType: !455, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !447, file: !124, line: 47, baseType: !461, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!170, !440, !180}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !447, file: !124, line: 48, baseType: !455, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !442, file: !124, line: 56, baseType: !378, size: 64, offset: 4928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !442, file: !124, line: 57, baseType: !403, size: 64, offset: 4992)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !442, file: !124, line: 58, baseType: !255, size: 64, offset: 5056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !124, line: 59, baseType: !253, size: 64, offset: 5120)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !380, file: !124, line: 83, baseType: !329, size: 32, offset: 5632)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !380, file: !124, line: 84, baseType: !329, size: 32, offset: 5664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !380, file: !124, line: 85, baseType: !329, size: 32, offset: 5696)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !380, file: !124, line: 86, baseType: !329, size: 32, offset: 5728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !380, file: !124, line: 87, baseType: !474, size: 32, offset: 5760)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !380, file: !124, line: 88, baseType: !476, size: 384, offset: 5792)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 384, elements: !477)
!477 = !{!478, !479}
!478 = !DISubrange(count: 4)
!479 = !DISubrange(count: 3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !380, file: !124, line: 89, baseType: !271, size: 64, offset: 6208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !380, file: !124, line: 90, baseType: !271, size: 64, offset: 6272)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !380, file: !124, line: 91, baseType: !271, size: 64, offset: 6336)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !380, file: !124, line: 92, baseType: !271, size: 64, offset: 6400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !380, file: !124, line: 93, baseType: !271, size: 64, offset: 6464)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !380, file: !124, line: 94, baseType: !271, size: 64, offset: 6528)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !380, file: !124, line: 95, baseType: !487, size: 32, offset: 6592)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !380, file: !124, line: 96, baseType: !329, size: 32, offset: 6624)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !380, file: !124, line: 98, baseType: !365, size: 64, offset: 6656)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !380, file: !124, line: 98, baseType: !365, size: 64, offset: 6720)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !380, file: !124, line: 102, baseType: !270, size: 64, offset: 6784)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !380, file: !124, line: 103, baseType: !270, size: 64, offset: 6848)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !380, file: !124, line: 104, baseType: !216, size: 32, offset: 6912)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !380, file: !124, line: 105, baseType: !216, size: 32, offset: 6944)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !380, file: !124, line: 106, baseType: !329, size: 32, offset: 6976)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !380, file: !124, line: 107, baseType: !270, size: 64, offset: 7040)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !380, file: !124, line: 108, baseType: !270, size: 64, offset: 7104)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !380, file: !124, line: 109, baseType: !216, size: 32, offset: 7168)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !380, file: !124, line: 110, baseType: !216, size: 32, offset: 7200)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !380, file: !124, line: 111, baseType: !329, size: 32, offset: 7232)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !380, file: !124, line: 113, baseType: !216, size: 32, offset: 7264)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !380, file: !124, line: 114, baseType: !329, size: 32, offset: 7296)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !380, file: !124, line: 117, baseType: !216, size: 32, offset: 7328)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !380, file: !124, line: 120, baseType: !505, size: 320, offset: 7360)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !347)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!170, !378, !216, !271, !253}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !380, file: !124, line: 121, baseType: !510, size: 320, offset: 7680)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 320, elements: !347)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!170, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !380, file: !124, line: 122, baseType: !355, size: 320, offset: 8000)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !380, file: !124, line: 123, baseType: !216, size: 32, offset: 8320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !380, file: !124, line: 124, baseType: !329, size: 32, offset: 8352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !380, file: !124, line: 126, baseType: !519, size: 320, offset: 8384)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !347)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!170, !378, !253}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !380, file: !124, line: 127, baseType: !510, size: 320, offset: 8704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !380, file: !124, line: 128, baseType: !355, size: 320, offset: 9024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !380, file: !124, line: 129, baseType: !216, size: 32, offset: 9344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !380, file: !124, line: 131, baseType: !527, size: 64, offset: 9408)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!170, !378, !216, !271, !530, !253}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !380, file: !124, line: 132, baseType: !299, size: 64, offset: 9472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !380, file: !124, line: 133, baseType: !253, size: 64, offset: 9536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !380, file: !124, line: 135, baseType: !253, size: 64, offset: 9600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !380, file: !124, line: 137, baseType: !535, size: 64, offset: 9664)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !538, line: 37, size: 6720, elements: !539)
!538 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!539 = !{!540, !541, !596, !597, !598, !599, !600, !601, !603, !604, !605, !606, !607, !608, !609, !610, !611, !621, !622, !623, !624, !625, !627}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !537, file: !538, line: 38, baseType: !383, size: 4480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !537, file: !538, line: 38, baseType: !542, size: 1152, offset: 4480)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1152, elements: !212)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !538, line: 13, size: 1152, elements: !544)
!544 = !{!545, !549, !553, !557, !563, !567, !568, !572, !576, !580, !581, !586, !587, !588, !589, !590, !594, !595}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !543, file: !538, line: 14, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!170, !535}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !543, file: !538, line: 15, baseType: !550, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!170, !535, !365, !365}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !543, file: !538, line: 16, baseType: !554, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!170, !535, !403, !403}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !543, file: !538, line: 17, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!170, !535, !365, !365, !365, !271, !271, !271, !216, !329, !262, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !56)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !543, file: !538, line: 18, baseType: !564, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!170, !535, !474, !365, !365, !365}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !543, file: !538, line: 19, baseType: !550, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !543, file: !538, line: 20, baseType: !569, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!170, !535, !216, !365, !365, !365}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !543, file: !538, line: 21, baseType: !573, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!170, !308, !535}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !543, file: !538, line: 22, baseType: !577, size: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!170, !535, !378, !365, !365}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !543, file: !538, line: 23, baseType: !577, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !543, file: !538, line: 24, baseType: !582, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!170, !535, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !543, file: !538, line: 25, baseType: !550, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !543, file: !538, line: 26, baseType: !550, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !543, file: !538, line: 27, baseType: !546, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !543, file: !538, line: 28, baseType: !546, size: 64, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !543, file: !538, line: 29, baseType: !591, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!170, !535, !180}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !543, file: !538, line: 30, baseType: !546, size: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !543, file: !538, line: 31, baseType: !591, size: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !537, file: !538, line: 39, baseType: !432, size: 64, offset: 5632)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !537, file: !538, line: 40, baseType: !216, size: 32, offset: 5696)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !537, file: !538, line: 41, baseType: !255, size: 64, offset: 5760)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !537, file: !538, line: 41, baseType: !255, size: 64, offset: 5824)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !537, file: !538, line: 42, baseType: !329, size: 32, offset: 5888)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !537, file: !538, line: 43, baseType: !602, size: 32, offset: 5920)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !62)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !537, file: !538, line: 45, baseType: !216, size: 32, offset: 5952)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !537, file: !538, line: 46, baseType: !329, size: 32, offset: 5984)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !537, file: !538, line: 47, baseType: !403, size: 64, offset: 6016)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !537, file: !538, line: 47, baseType: !403, size: 64, offset: 6080)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !537, file: !538, line: 48, baseType: !365, size: 64, offset: 6144)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !537, file: !538, line: 48, baseType: !365, size: 64, offset: 6208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !537, file: !538, line: 49, baseType: !329, size: 32, offset: 6272)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !537, file: !538, line: 50, baseType: !329, size: 32, offset: 6304)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !537, file: !538, line: 51, baseType: !612, size: 64, offset: 6336)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!170, !535, !216, !615, !615, !585, !253}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !618, line: 11, baseType: !619)
!618 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !618, line: 11, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !537, file: !538, line: 52, baseType: !253, size: 64, offset: 6400)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !538, line: 53, baseType: !253, size: 64, offset: 6464)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !537, file: !538, line: 54, baseType: !216, size: 32, offset: 6528)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !537, file: !538, line: 55, baseType: !253, size: 64, offset: 6592)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !537, file: !538, line: 56, baseType: !626, size: 32, offset: 6656)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !69)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !537, file: !538, line: 57, baseType: !626, size: 32, offset: 6688)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !124, line: 139, baseType: !253, size: 64, offset: 9728)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9792)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9824)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9856)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9888)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9920)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9952)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 9984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10016)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10080)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10144)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10176)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !380, file: !124, line: 142, baseType: !329, size: 32, offset: 10208)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10432)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10560)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10624)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10688)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10752)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10816)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10880)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 10944)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 11008)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !380, file: !124, line: 143, baseType: !180, size: 64, offset: 11072)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11136)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !79, line: 162, baseType: !78)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11168)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11200)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11232)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11264)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11296)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11328)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11360)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11392)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11424)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11456)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11488)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11520)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !380, file: !124, line: 144, baseType: !658, size: 32, offset: 11552)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !380, file: !124, line: 147, baseType: !216, size: 32, offset: 11584)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !380, file: !124, line: 148, baseType: !392, size: 64, offset: 11648)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !380, file: !124, line: 150, baseType: !675, size: 32, offset: 11712)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !124, line: 70, baseType: !123)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !380, file: !124, line: 151, baseType: !329, size: 32, offset: 11744)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !380, file: !124, line: 153, baseType: !216, size: 32, offset: 11776)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !380, file: !124, line: 154, baseType: !216, size: 32, offset: 11808)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !380, file: !124, line: 156, baseType: !329, size: 32, offset: 11840)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !380, file: !124, line: 161, baseType: !681, size: 192, offset: 11904)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !124, line: 157, size: 192, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !681, file: !124, line: 158, baseType: !403, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !681, file: !124, line: 158, baseType: !403, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !681, file: !124, line: 159, baseType: !329, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !681, file: !124, line: 160, baseType: !329, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !380, file: !124, line: 163, baseType: !688, size: 32, offset: 12096)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !129)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !380, file: !124, line: 165, baseType: !474, size: 32, offset: 12128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !380, file: !124, line: 166, baseType: !688, size: 32, offset: 12160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !380, file: !124, line: 171, baseType: !329, size: 32, offset: 12192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !380, file: !124, line: 172, baseType: !329, size: 32, offset: 12224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !380, file: !124, line: 173, baseType: !329, size: 32, offset: 12256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !380, file: !124, line: 174, baseType: !365, size: 64, offset: 12288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !380, file: !124, line: 175, baseType: !365, size: 64, offset: 12352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !380, file: !124, line: 177, baseType: !216, size: 32, offset: 12416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !380, file: !124, line: 178, baseType: !329, size: 32, offset: 12448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !380, file: !124, line: 180, baseType: !180, size: 64, offset: 12480)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !380, file: !124, line: 182, baseType: !700, size: 64, offset: 12544)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!170, !378, !365, !365, !253}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !380, file: !124, line: 183, baseType: !700, size: 64, offset: 12608)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !380, file: !124, line: 184, baseType: !253, size: 64, offset: 12672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !380, file: !124, line: 184, baseType: !253, size: 64, offset: 12736)
!706 = !{!707, !708, !709, !710, !712, !714}
!707 = !DILocalVariable(name: "ksp", arg: 1, scope: !374, file: !375, line: 244, type: !378)
!708 = !DILocalVariable(name: "ierr", scope: !374, file: !375, line: 246, type: !170)
!709 = !DILocalVariable(name: "bcgs", scope: !374, file: !375, line: 247, type: !359)
!710 = !DILocalVariable(name: "ierr__", scope: !711, file: !375, line: 250, type: !170)
!711 = distinct !DILexicalBlock(scope: !374, file: !375, line: 250, column: 33)
!712 = !DILocalVariable(name: "ierr__", scope: !713, file: !375, line: 260, type: !170)
!713 = distinct !DILexicalBlock(scope: !374, file: !375, line: 260, column: 72)
!714 = !DILocalVariable(name: "ierr__", scope: !715, file: !375, line: 261, type: !170)
!715 = distinct !DILexicalBlock(scope: !374, file: !375, line: 261, column: 60)
!716 = !DILocation(line: 0, scope: !374)
!717 = !DILocation(line: 247, column: 3, scope: !374)
!718 = !DILocation(line: 249, column: 3, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !375, line: 249, column: 3)
!720 = distinct !DILexicalBlock(scope: !721, file: !375, line: 249, column: 3)
!721 = distinct !DILexicalBlock(scope: !374, file: !375, line: 249, column: 3)
!722 = !{!723, !723, i64 0}
!723 = !{!"any pointer", !724, i64 0}
!724 = !{!"omnipotent char", !725, i64 0}
!725 = !{!"Simple C/C++ TBAA"}
!726 = !DILocation(line: 249, column: 3, scope: !720)
!727 = !DILocation(line: 249, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !375, line: 249, column: 3)
!729 = distinct !DILexicalBlock(scope: !719, file: !375, line: 249, column: 3)
!730 = !{!731, !732, i64 1536}
!731 = !{!"", !724, i64 0, !724, i64 512, !724, i64 1024, !724, i64 1280, !732, i64 1536, !732, i64 1540, !724, i64 1544}
!732 = !{!"int", !724, i64 0}
!733 = !DILocation(line: 249, column: 3, scope: !729)
!734 = !DILocation(line: 249, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !728, file: !375, line: 249, column: 3)
!736 = !{!732, !732, i64 0}
!737 = !{!731, !732, i64 1540}
!738 = !DILocation(line: 250, column: 10, scope: !374)
!739 = !{!"branch_weights", i32 2146410443, i32 1073205}
!740 = !DILocation(line: 0, scope: !711)
!741 = !DILocation(line: 250, column: 33, scope: !711)
!742 = !{!"branch_weights", i32 2000, i32 1}
!743 = !DILocation(line: 250, column: 33, scope: !744)
!744 = distinct !DILexicalBlock(scope: !711, file: !375, line: 250, column: 33)
!745 = !DILocation(line: 252, column: 30, scope: !374)
!746 = !DILocation(line: 252, column: 8, scope: !374)
!747 = !DILocation(line: 252, column: 28, scope: !374)
!748 = !{!749, !723, i64 1216}
