; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/bmrm/bmrm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/bmrm/bmrm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque

!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62}
!54 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!60 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!61 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!62 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 30, baseType: !5, size: 32, elements: !65)
!64 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!70 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 155, baseType: !5, size: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77}
!73 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!78 = !{!79, !82, !100, !181, !121, !287, !171, !26, !303}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !85, line: 73, size: 4480, elements: !86)
!85 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!86 = !{!87, !89, !142, !143, !145, !148, !149, !150, !151, !159, !160, !162, !166, !170, !172, !173, !174, !175, !176, !177, !178, !179, !180, !182, !184, !185, !186, !188, !189, !191, !193, !194, !195, !196, !197, !200, !202, !203, !204, !205, !206, !209, !211, !212, !213, !223, !225, !226, !230, !231, !277, !282, !284, !285, !286}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !84, file: !85, line: 74, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !84, file: !85, line: 75, baseType: !90, size: 448, offset: 64)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 448, elements: !140)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !85, line: 53, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 45, size: 448, elements: !93)
!93 = !{!94, !104, !112, !117, !124, !128, !135}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !92, file: !85, line: 46, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !82, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !101, line: 330, baseType: !102)
!101 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !101, line: 330, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !92, file: !85, line: 47, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!98, !82, !108}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !109, line: 16, baseType: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !109, line: 16, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !92, file: !85, line: 48, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!98, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !92, file: !85, line: 49, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!98, !82, !121, !82}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !92, file: !85, line: 50, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!98, !82, !121, !116}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !92, file: !85, line: 51, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!98, !82, !121, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !92, file: !85, line: 52, baseType: !136, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!98, !82, !121, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !84, file: !85, line: 76, baseType: !100, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !85, line: 77, baseType: !144, size: 32, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !84, file: !85, line: 78, baseType: !146, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !147)
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !84, file: !85, line: 78, baseType: !146, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !84, file: !85, line: 78, baseType: !146, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !84, file: !85, line: 78, baseType: !146, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !84, file: !85, line: 79, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !155, line: 27, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !157, line: 43, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!158 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !84, file: !85, line: 80, baseType: !144, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !84, file: !85, line: 81, baseType: !161, size: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !84, file: !85, line: 82, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !84, file: !85, line: 83, baseType: !167, size: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !84, file: !85, line: 84, baseType: !171, size: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !84, file: !85, line: 85, baseType: !171, size: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !84, file: !85, line: 86, baseType: !171, size: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !84, file: !85, line: 87, baseType: !171, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !84, file: !85, line: 88, baseType: !82, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !84, file: !85, line: 89, baseType: !152, size: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 90, baseType: !171, size: 64, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !84, file: !85, line: 91, baseType: !171, size: 64, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !84, file: !85, line: 92, baseType: !144, size: 32, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !84, file: !85, line: 93, baseType: !181, size: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !85, line: 94, baseType: !183, size: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !153)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !84, file: !85, line: 95, baseType: !144, size: 32, offset: 1856)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !84, file: !85, line: 95, baseType: !144, size: 32, offset: 1888)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !84, file: !85, line: 96, baseType: !187, size: 64, offset: 1920)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !84, file: !85, line: 96, baseType: !187, size: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !84, file: !85, line: 97, baseType: !190, size: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !84, file: !85, line: 97, baseType: !192, size: 64, offset: 2112)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !84, file: !85, line: 98, baseType: !144, size: 32, offset: 2176)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !84, file: !85, line: 98, baseType: !144, size: 32, offset: 2208)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !84, file: !85, line: 99, baseType: !187, size: 64, offset: 2240)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !84, file: !85, line: 99, baseType: !187, size: 64, offset: 2304)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !84, file: !85, line: 100, baseType: !198, size: 64, offset: 2368)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !147)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !84, file: !85, line: 100, baseType: !201, size: 64, offset: 2432)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !84, file: !85, line: 101, baseType: !144, size: 32, offset: 2496)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !84, file: !85, line: 101, baseType: !144, size: 32, offset: 2528)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !84, file: !85, line: 102, baseType: !187, size: 64, offset: 2560)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !84, file: !85, line: 102, baseType: !187, size: 64, offset: 2624)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !84, file: !85, line: 103, baseType: !207, size: 64, offset: 2688)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !199)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !84, file: !85, line: 103, baseType: !210, size: 64, offset: 2752)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !84, file: !85, line: 104, baseType: !139, size: 64, offset: 2816)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !84, file: !85, line: 105, baseType: !144, size: 32, offset: 2880)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !84, file: !85, line: 106, baseType: !214, size: 128, offset: 2944)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !221)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !85, line: 64, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 61, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !217, file: !85, line: 62, baseType: !132, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !217, file: !85, line: 63, baseType: !181, size: 64, offset: 64)
!221 = !{!222}
!222 = !DISubrange(count: 2)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !84, file: !85, line: 107, baseType: !224, size: 64, offset: 3072)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !221)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !84, file: !85, line: 108, baseType: !181, size: 64, offset: 3136)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !84, file: !85, line: 109, baseType: !227, size: 64, offset: 3200)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!98, !181}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !84, file: !85, line: 111, baseType: !144, size: 32, offset: 3264)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !84, file: !85, line: 112, baseType: !232, size: 320, offset: 3328)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 320, elements: !275)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!98, !236, !82, !181}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !239)
!239 = !{!240, !241, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !238, file: !10, line: 100, baseType: !144, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !10, line: 101, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !253, !254, !255, !256, !258, !260, !261, !262}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !244, file: !10, line: 84, baseType: !171, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !244, file: !10, line: 85, baseType: !171, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !10, line: 86, baseType: !181, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !244, file: !10, line: 87, baseType: !163, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !244, file: !10, line: 88, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !244, file: !10, line: 89, baseType: !123, size: 8, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !244, file: !10, line: 90, baseType: !171, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !244, file: !10, line: 91, baseType: !79, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !244, file: !10, line: 92, baseType: !257, size: 32, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !10, line: 93, baseType: !259, size: 32, offset: 544)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !10, line: 94, baseType: !242, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !244, file: !10, line: 95, baseType: !171, size: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !244, file: !10, line: 96, baseType: !181, size: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !238, file: !10, line: 102, baseType: !171, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !238, file: !10, line: 102, baseType: !171, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !238, file: !10, line: 103, baseType: !171, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !238, file: !10, line: 104, baseType: !100, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !238, file: !10, line: 105, baseType: !257, size: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !238, file: !10, line: 105, baseType: !257, size: 32, offset: 416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !238, file: !10, line: 105, baseType: !257, size: 32, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !238, file: !10, line: 106, baseType: !82, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !238, file: !10, line: 107, baseType: !272, size: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!275 = !{!276}
!276 = !DISubrange(count: 5)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !84, file: !85, line: 113, baseType: !278, size: 320, offset: 3648)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 320, elements: !275)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!98, !82, !181}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !84, file: !85, line: 114, baseType: !283, size: 320, offset: 3968)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 320, elements: !275)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !84, file: !85, line: 115, baseType: !257, size: 32, offset: 4288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !84, file: !85, line: 120, baseType: !272, size: 64, offset: 4352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !84, file: !85, line: 121, baseType: !257, size: 32, offset: 4416)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BMRM", file: !289, line: 21, baseType: !290)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/unconstrained/impls/bmrm/bmrm.h", directory: "/home/users/ndemeye/xSDK")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 17, size: 192, elements: !291)
!291 = !{!292, !298, !302}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scatter", scope: !290, file: !289, line: 18, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !294, line: 59, baseType: !295)
!294 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !294, line: 15, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !294, line: 15, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "local_w", scope: !290, file: !289, line: 19, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !64, line: 21, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !64, line: 21, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !290, file: !289, line: 20, baseType: !199, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !101, line: 331, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !101, line: 331, flags: DIFlagFwdDecl)
!306 = !{i32 7, !"Dwarf Version", i32 4}
!307 = !{i32 2, !"Debug Info Version", i32 3}
!308 = !{i32 1, !"wchar_size", i32 4}
!309 = !{i32 7, !"PIC Level", i32 2}
!310 = !{i32 7, !"uwtable", i32 1}
!311 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!312 = distinct !DISubprogram(name: "TaoCreate_BMRM", scope: !313, file: !313, line: 263, type: !314, scopeLine: 264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !543)
!313 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/unconstrained/impls/bmrm/bmrm.c", directory: "/home/users/ndemeye/xSDK")
!314 = !DISubroutineType(types: !315)
!315 = !{!98, !316}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !319, line: 45, size: 14656, elements: !320)
!319 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!320 = !{!321, !323, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !410, !416, !418, !419, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !495, !496, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !318, file: !319, line: 46, baseType: !322, size: 4480)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !85, line: 122, baseType: !84)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !318, file: !319, line: 46, baseType: !324, size: 1536, offset: 4480)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 1536, elements: !140)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !319, line: 13, size: 1536, elements: !326)
!326 = !{!327, !331, !335, !339, !347, !348, !349, !350, !351, !352, !353, !357, !361, !362, !363, !364, !368, !372, !373, !377, !379, !380, !384, !388}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !325, file: !319, line: 15, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!98, !316, !299, !198, !181}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !325, file: !319, line: 16, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!98, !316, !299, !198, !299, !181}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !325, file: !319, line: 17, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!98, !316, !299, !299, !181}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !325, file: !319, line: 18, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!98, !316, !299, !343, !343, !181}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !344, line: 16, baseType: !345)
!344 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !344, line: 16, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !325, file: !319, line: 19, baseType: !336, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !325, file: !319, line: 20, baseType: !340, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !325, file: !319, line: 21, baseType: !336, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !325, file: !319, line: 22, baseType: !336, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !325, file: !319, line: 23, baseType: !336, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !325, file: !319, line: 24, baseType: !340, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !325, file: !319, line: 25, baseType: !354, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!98, !316, !299, !343, !343, !343, !181}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !325, file: !319, line: 26, baseType: !358, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!98, !316, !299, !343, !181}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !325, file: !319, line: 27, baseType: !340, size: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !325, file: !319, line: 28, baseType: !340, size: 64, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !325, file: !319, line: 29, baseType: !336, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !325, file: !319, line: 30, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!98, !316, !144, !181}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !325, file: !319, line: 31, baseType: !369, size: 64, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!98, !316, !181}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !325, file: !319, line: 32, baseType: !227, size: 64, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !325, file: !319, line: 35, baseType: !374, size: 64, offset: 1152)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!98, !316, !299, !299}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !325, file: !319, line: 36, baseType: !378, size: 64, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !325, file: !319, line: 37, baseType: !378, size: 64, offset: 1280)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !325, file: !319, line: 38, baseType: !381, size: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!98, !316, !108}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !325, file: !319, line: 39, baseType: !385, size: 64, offset: 1408)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!98, !236, !316}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !325, file: !319, line: 40, baseType: !378, size: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !318, file: !319, line: 47, baseType: !181, size: 64, offset: 6016)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !318, file: !319, line: 48, baseType: !181, size: 64, offset: 6080)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !318, file: !319, line: 49, baseType: !181, size: 64, offset: 6144)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !318, file: !319, line: 50, baseType: !181, size: 64, offset: 6208)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !318, file: !319, line: 51, baseType: !181, size: 64, offset: 6272)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !318, file: !319, line: 52, baseType: !181, size: 64, offset: 6336)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !318, file: !319, line: 53, baseType: !181, size: 64, offset: 6400)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !318, file: !319, line: 54, baseType: !181, size: 64, offset: 6464)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !318, file: !319, line: 55, baseType: !181, size: 64, offset: 6528)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !318, file: !319, line: 56, baseType: !181, size: 64, offset: 6592)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !318, file: !319, line: 57, baseType: !181, size: 64, offset: 6656)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !318, file: !319, line: 58, baseType: !181, size: 64, offset: 6720)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !318, file: !319, line: 59, baseType: !181, size: 64, offset: 6784)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !318, file: !319, line: 60, baseType: !181, size: 64, offset: 6848)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !318, file: !319, line: 61, baseType: !181, size: 64, offset: 6912)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !318, file: !319, line: 62, baseType: !181, size: 64, offset: 6976)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !318, file: !319, line: 63, baseType: !181, size: 64, offset: 7040)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !318, file: !319, line: 65, baseType: !407, size: 640, offset: 7104)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 640, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 10)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !318, file: !319, line: 66, baseType: !411, size: 640, offset: 7744)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 640, elements: !408)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!98, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !318, file: !319, line: 67, baseType: !417, size: 640, offset: 8384)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 640, elements: !408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !318, file: !319, line: 68, baseType: !144, size: 32, offset: 9024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !318, file: !319, line: 69, baseType: !181, size: 64, offset: 9088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !318, file: !319, line: 70, baseType: !421, size: 32, offset: 9152)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !318, file: !319, line: 72, baseType: !257, size: 32, offset: 9184)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 73, baseType: !181, size: 64, offset: 9216)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !318, file: !319, line: 75, baseType: !299, size: 64, offset: 9280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !318, file: !319, line: 76, baseType: !299, size: 64, offset: 9344)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !318, file: !319, line: 77, baseType: !299, size: 64, offset: 9408)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !318, file: !319, line: 78, baseType: !299, size: 64, offset: 9472)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !318, file: !319, line: 79, baseType: !299, size: 64, offset: 9536)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !318, file: !319, line: 80, baseType: !299, size: 64, offset: 9600)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !318, file: !319, line: 81, baseType: !299, size: 64, offset: 9664)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !318, file: !319, line: 82, baseType: !299, size: 64, offset: 9728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !318, file: !319, line: 83, baseType: !299, size: 64, offset: 9792)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !318, file: !319, line: 84, baseType: !343, size: 64, offset: 9856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !318, file: !319, line: 85, baseType: !343, size: 64, offset: 9920)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !318, file: !319, line: 86, baseType: !343, size: 64, offset: 9984)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !318, file: !319, line: 87, baseType: !299, size: 64, offset: 10048)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !318, file: !319, line: 88, baseType: !299, size: 64, offset: 10112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !318, file: !319, line: 89, baseType: !343, size: 64, offset: 10176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !318, file: !319, line: 90, baseType: !343, size: 64, offset: 10240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !318, file: !319, line: 91, baseType: !299, size: 64, offset: 10304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !318, file: !319, line: 92, baseType: !144, size: 32, offset: 10368)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !318, file: !319, line: 93, baseType: !190, size: 64, offset: 10432)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !318, file: !319, line: 94, baseType: !190, size: 64, offset: 10496)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !318, file: !319, line: 95, baseType: !198, size: 64, offset: 10560)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !318, file: !319, line: 96, baseType: !299, size: 64, offset: 10624)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !318, file: !319, line: 97, baseType: !299, size: 64, offset: 10688)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !318, file: !319, line: 98, baseType: !299, size: 64, offset: 10752)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !318, file: !319, line: 99, baseType: !343, size: 64, offset: 10816)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !318, file: !319, line: 100, baseType: !343, size: 64, offset: 10880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !318, file: !319, line: 101, baseType: !343, size: 64, offset: 10944)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !318, file: !319, line: 102, baseType: !343, size: 64, offset: 11008)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !318, file: !319, line: 103, baseType: !343, size: 64, offset: 11072)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !318, file: !319, line: 104, baseType: !343, size: 64, offset: 11136)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !318, file: !319, line: 105, baseType: !343, size: 64, offset: 11200)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !318, file: !319, line: 106, baseType: !343, size: 64, offset: 11264)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !318, file: !319, line: 107, baseType: !343, size: 64, offset: 11328)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !318, file: !319, line: 108, baseType: !343, size: 64, offset: 11392)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !318, file: !319, line: 109, baseType: !343, size: 64, offset: 11456)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !318, file: !319, line: 110, baseType: !460, size: 64, offset: 11520)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !461, line: 11, baseType: !462)
!461 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !461, line: 11, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !318, file: !319, line: 111, baseType: !460, size: 64, offset: 11584)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !318, file: !319, line: 112, baseType: !199, size: 64, offset: 11648)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !318, file: !319, line: 113, baseType: !199, size: 64, offset: 11712)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !318, file: !319, line: 114, baseType: !199, size: 64, offset: 11776)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !318, file: !319, line: 115, baseType: !199, size: 64, offset: 11840)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !318, file: !319, line: 116, baseType: !199, size: 64, offset: 11904)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !318, file: !319, line: 117, baseType: !199, size: 64, offset: 11968)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !318, file: !319, line: 119, baseType: !144, size: 32, offset: 12032)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !318, file: !319, line: 120, baseType: !144, size: 32, offset: 12064)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !318, file: !319, line: 121, baseType: !144, size: 32, offset: 12096)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !318, file: !319, line: 122, baseType: !144, size: 32, offset: 12128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !318, file: !319, line: 123, baseType: !144, size: 32, offset: 12160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !318, file: !319, line: 124, baseType: !144, size: 32, offset: 12192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !318, file: !319, line: 125, baseType: !144, size: 32, offset: 12224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !318, file: !319, line: 126, baseType: !144, size: 32, offset: 12256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !318, file: !319, line: 127, baseType: !144, size: 32, offset: 12288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !318, file: !319, line: 128, baseType: !144, size: 32, offset: 12320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !318, file: !319, line: 129, baseType: !144, size: 32, offset: 12352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !318, file: !319, line: 130, baseType: !144, size: 32, offset: 12384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !318, file: !319, line: 131, baseType: !144, size: 32, offset: 12416)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !318, file: !319, line: 132, baseType: !144, size: 32, offset: 12448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !318, file: !319, line: 133, baseType: !144, size: 32, offset: 12480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !318, file: !319, line: 134, baseType: !144, size: 32, offset: 12512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !318, file: !319, line: 135, baseType: !144, size: 32, offset: 12544)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !318, file: !319, line: 137, baseType: !144, size: 32, offset: 12576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !318, file: !319, line: 138, baseType: !144, size: 32, offset: 12608)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !318, file: !319, line: 140, baseType: !491, size: 64, offset: 12672)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !492, line: 5, baseType: !493)
!492 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !492, line: 5, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !318, file: !319, line: 141, baseType: !257, size: 32, offset: 12736)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !318, file: !319, line: 142, baseType: !497, size: 64, offset: 12800)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !498, line: 22, baseType: !499)
!498 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !498, line: 22, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !318, file: !319, line: 143, baseType: !199, size: 64, offset: 12864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !318, file: !319, line: 144, baseType: !199, size: 64, offset: 12928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !318, file: !319, line: 146, baseType: !199, size: 64, offset: 12992)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !318, file: !319, line: 147, baseType: !199, size: 64, offset: 13056)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !318, file: !319, line: 148, baseType: !199, size: 64, offset: 13120)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !318, file: !319, line: 149, baseType: !199, size: 64, offset: 13184)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !318, file: !319, line: 150, baseType: !199, size: 64, offset: 13248)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !318, file: !319, line: 151, baseType: !199, size: 64, offset: 13312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !318, file: !319, line: 152, baseType: !199, size: 64, offset: 13376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !318, file: !319, line: 153, baseType: !257, size: 32, offset: 13440)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !318, file: !319, line: 154, baseType: !257, size: 32, offset: 13472)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !318, file: !319, line: 155, baseType: !257, size: 32, offset: 13504)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !318, file: !319, line: 156, baseType: !257, size: 32, offset: 13536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !318, file: !319, line: 157, baseType: !257, size: 32, offset: 13568)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !318, file: !319, line: 158, baseType: !257, size: 32, offset: 13600)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !318, file: !319, line: 159, baseType: !257, size: 32, offset: 13632)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !318, file: !319, line: 160, baseType: !257, size: 32, offset: 13664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !318, file: !319, line: 161, baseType: !257, size: 32, offset: 13696)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !318, file: !319, line: 162, baseType: !257, size: 32, offset: 13728)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !318, file: !319, line: 163, baseType: !257, size: 32, offset: 13760)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !318, file: !319, line: 164, baseType: !257, size: 32, offset: 13792)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !318, file: !319, line: 165, baseType: !257, size: 32, offset: 13824)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !318, file: !319, line: 166, baseType: !257, size: 32, offset: 13856)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !318, file: !319, line: 167, baseType: !257, size: 32, offset: 13888)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !318, file: !319, line: 168, baseType: !257, size: 32, offset: 13920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !318, file: !319, line: 169, baseType: !257, size: 32, offset: 13952)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !318, file: !319, line: 170, baseType: !257, size: 32, offset: 13984)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !318, file: !319, line: 171, baseType: !257, size: 32, offset: 14016)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !318, file: !319, line: 172, baseType: !257, size: 32, offset: 14048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !318, file: !319, line: 173, baseType: !257, size: 32, offset: 14080)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !318, file: !319, line: 174, baseType: !257, size: 32, offset: 14112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !318, file: !319, line: 175, baseType: !257, size: 32, offset: 14144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !318, file: !319, line: 177, baseType: !534, size: 32, offset: 14176)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !318, file: !319, line: 178, baseType: !144, size: 32, offset: 14208)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !318, file: !319, line: 179, baseType: !198, size: 64, offset: 14272)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !318, file: !319, line: 180, baseType: !198, size: 64, offset: 14336)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !318, file: !319, line: 181, baseType: !198, size: 64, offset: 14400)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !318, file: !319, line: 182, baseType: !190, size: 64, offset: 14464)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !318, file: !319, line: 183, baseType: !144, size: 32, offset: 14528)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !318, file: !319, line: 184, baseType: !257, size: 32, offset: 14560)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !318, file: !319, line: 185, baseType: !257, size: 32, offset: 14592)
!543 = !{!544, !545, !546, !547}
!544 = !DILocalVariable(name: "tao", arg: 1, scope: !312, file: !313, line: 263, type: !316)
!545 = !DILocalVariable(name: "bmrm", scope: !312, file: !313, line: 265, type: !287)
!546 = !DILocalVariable(name: "ierr", scope: !312, file: !313, line: 266, type: !98)
!547 = !DILocalVariable(name: "ierr__", scope: !548, file: !313, line: 275, type: !98)
!548 = distinct !DILexicalBlock(scope: !312, file: !313, line: 275, column: 33)
!549 = !DILocation(line: 0, scope: !312)
!550 = !DILocation(line: 265, column: 3, scope: !312)
!551 = !DILocation(line: 268, column: 3, scope: !552)
!552 = distinct !DILexicalBlock(scope: !553, file: !313, line: 268, column: 3)
!553 = distinct !DILexicalBlock(scope: !554, file: !313, line: 268, column: 3)
!554 = distinct !DILexicalBlock(scope: !312, file: !313, line: 268, column: 3)
!555 = !{!556, !556, i64 0}
!556 = !{!"any pointer", !557, i64 0}
!557 = !{!"omnipotent char", !558, i64 0}
!558 = !{!"Simple C/C++ TBAA"}
!559 = !DILocation(line: 268, column: 3, scope: !553)
!560 = !DILocation(line: 268, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !313, line: 268, column: 3)
!562 = distinct !DILexicalBlock(scope: !552, file: !313, line: 268, column: 3)
!563 = !{!564, !565, i64 1536}
!564 = !{!"", !557, i64 0, !557, i64 512, !557, i64 1024, !557, i64 1280, !565, i64 1536, !565, i64 1540, !557, i64 1544}
!565 = !{!"int", !557, i64 0}
!566 = !DILocation(line: 268, column: 3, scope: !562)
!567 = !DILocation(line: 268, column: 3, scope: !568)
!568 = distinct !DILexicalBlock(scope: !561, file: !313, line: 268, column: 3)
!569 = !{!565, !565, i64 0}
!570 = !{!564, !565, i64 1540}
!571 = !DILocation(line: 269, column: 13, scope: !312)
!572 = !DILocation(line: 269, column: 19, scope: !312)
!573 = !{!574, !556, i64 152}
!574 = !{!"_TaoOps", !556, i64 0, !556, i64 8, !556, i64 16, !556, i64 24, !556, i64 32, !556, i64 40, !556, i64 48, !556, i64 56, !556, i64 64, !556, i64 72, !556, i64 80, !556, i64 88, !556, i64 96, !556, i64 104, !556, i64 112, !556, i64 120, !556, i64 128, !556, i64 136, !556, i64 144, !556, i64 152, !556, i64 160, !556, i64 168, !556, i64 176, !556, i64 184}
!575 = !DILocation(line: 270, column: 13, scope: !312)
!576 = !DILocation(line: 270, column: 19, scope: !312)
!577 = !{!574, !556, i64 160}
!578 = !DILocation(line: 271, column: 13, scope: !312)
!579 = !DILocation(line: 271, column: 19, scope: !312)
!580 = !{!574, !556, i64 168}
!581 = !DILocation(line: 272, column: 13, scope: !312)
!582 = !DILocation(line: 272, column: 28, scope: !312)
!583 = !{!574, !556, i64 176}
!584 = !DILocation(line: 273, column: 13, scope: !312)
!585 = !DILocation(line: 273, column: 21, scope: !312)
!586 = !{!574, !556, i64 184}
!587 = !DILocation(line: 275, column: 10, scope: !312)
!588 = !{!"branch_weights", i32 2146410443, i32 1073205}
!589 = !DILocation(line: 0, scope: !548)
!590 = !DILocation(line: 275, column: 33, scope: !548)
!591 = !{!"branch_weights", i32 2000, i32 1}
!592 = !DILocation(line: 275, column: 33, scope: !593)
!593 = distinct !DILexicalBlock(scope: !548, file: !313, line: 275, column: 33)
!594 = !DILocation(line: 276, column: 3, scope: !312)
!595 = !DILocation(line: 276, column: 9, scope: !312)
!596 = !DILocation(line: 276, column: 16, scope: !312)
!597 = !{!598, !599, i64 16}
!598 = !{!"", !556, i64 0, !556, i64 8, !599, i64 16}
!599 = !{!"double", !557, i64 0}
!600 = !DILocation(line: 277, column: 8, scope: !312)
!601 = !DILocation(line: 277, column: 13, scope: !312)
!602 = !{!603, !556, i64 1152}
!603 = !{!"_p_Tao", !604, i64 0, !557, i64 560, !556, i64 752, !556, i64 760, !556, i64 768, !556, i64 776, !556, i64 784, !556, i64 792, !556, i64 800, !556, i64 808, !556, i64 816, !556, i64 824, !556, i64 832, !556, i64 840, !556, i64 848, !556, i64 856, !556, i64 864, !556, i64 872, !556, i64 880, !557, i64 888, !557, i64 968, !557, i64 1048, !565, i64 1128, !556, i64 1136, !557, i64 1144, !557, i64 1148, !556, i64 1152, !556, i64 1160, !556, i64 1168, !556, i64 1176, !556, i64 1184, !556, i64 1192, !556, i64 1200, !556, i64 1208, !556, i64 1216, !556, i64 1224, !556, i64 1232, !556, i64 1240, !556, i64 1248, !556, i64 1256, !556, i64 1264, !556, i64 1272, !556, i64 1280, !556, i64 1288, !565, i64 1296, !556, i64 1304, !556, i64 1312, !556, i64 1320, !556, i64 1328, !556, i64 1336, !556, i64 1344, !556, i64 1352, !556, i64 1360, !556, i64 1368, !556, i64 1376, !556, i64 1384, !556, i64 1392, !556, i64 1400, !556, i64 1408, !556, i64 1416, !556, i64 1424, !556, i64 1432, !556, i64 1440, !556, i64 1448, !599, i64 1456, !599, i64 1464, !599, i64 1472, !599, i64 1480, !599, i64 1488, !599, i64 1496, !565, i64 1504, !565, i64 1508, !565, i64 1512, !565, i64 1516, !565, i64 1520, !565, i64 1524, !565, i64 1528, !565, i64 1532, !565, i64 1536, !565, i64 1540, !565, i64 1544, !565, i64 1548, !565, i64 1552, !565, i64 1556, !565, i64 1560, !565, i64 1564, !565, i64 1568, !565, i64 1572, !565, i64 1576, !556, i64 1584, !557, i64 1592, !556, i64 1600, !599, i64 1608, !599, i64 1616, !599, i64 1624, !599, i64 1632, !599, i64 1640, !599, i64 1648, !599, i64 1656, !599, i64 1664, !599, i64 1672, !557, i64 1680, !557, i64 1684, !557, i64 1688, !557, i64 1692, !557, i64 1696, !557, i64 1700, !557, i64 1704, !557, i64 1708, !557, i64 1712, !557, i64 1716, !557, i64 1720, !557, i64 1724, !557, i64 1728, !557, i64 1732, !557, i64 1736, !557, i64 1740, !557, i64 1744, !557, i64 1748, !557, i64 1752, !557, i64 1756, !557, i64 1760, !557, i64 1764, !557, i64 1768, !557, i64 1772, !565, i64 1776, !556, i64 1784, !556, i64 1792, !556, i64 1800, !556, i64 1808, !565, i64 1816, !557, i64 1820, !557, i64 1824}
!604 = !{!"_p_PetscObject", !565, i64 0, !557, i64 8, !556, i64 64, !565, i64 72, !599, i64 80, !599, i64 88, !599, i64 96, !599, i64 104, !605, i64 112, !565, i64 120, !565, i64 124, !556, i64 128, !556, i64 136, !556, i64 144, !556, i64 152, !556, i64 160, !556, i64 168, !556, i64 176, !605, i64 184, !556, i64 192, !556, i64 200, !565, i64 208, !556, i64 216, !605, i64 224, !565, i64 232, !565, i64 236, !556, i64 240, !556, i64 248, !556, i64 256, !556, i64 264, !565, i64 272, !565, i64 276, !556, i64 280, !556, i64 288, !556, i64 296, !556, i64 304, !565, i64 312, !565, i64 316, !556, i64 320, !556, i64 328, !556, i64 336, !556, i64 344, !556, i64 352, !565, i64 360, !557, i64 368, !557, i64 384, !556, i64 392, !556, i64 400, !565, i64 408, !557, i64 416, !557, i64 456, !557, i64 496, !557, i64 536, !556, i64 544, !557, i64 552}
!605 = !{!"long", !557, i64 0}
!606 = !DILocation(line: 280, column: 13, scope: !607)
!607 = distinct !DILexicalBlock(scope: !312, file: !313, line: 280, column: 7)
!608 = !{!603, !557, i64 1684}
!609 = !DILocation(line: 280, column: 8, scope: !607)
!610 = !DILocation(line: 280, column: 7, scope: !312)
!611 = !DILocation(line: 280, column: 34, scope: !607)
!612 = !DILocation(line: 280, column: 41, scope: !607)
!613 = !{!603, !565, i64 1504}
!614 = !DILocation(line: 280, column: 29, scope: !607)
!615 = !DILocation(line: 281, column: 13, scope: !616)
!616 = distinct !DILexicalBlock(scope: !312, file: !313, line: 281, column: 7)
!617 = !{!603, !557, i64 1680}
!618 = !DILocation(line: 281, column: 8, scope: !616)
!619 = !DILocation(line: 281, column: 7, scope: !312)
!620 = !DILocation(line: 281, column: 37, scope: !616)
!621 = !DILocation(line: 281, column: 47, scope: !616)
!622 = !{!603, !565, i64 1508}
!623 = !DILocation(line: 281, column: 32, scope: !616)
!624 = !DILocation(line: 282, column: 13, scope: !625)
!625 = distinct !DILexicalBlock(scope: !312, file: !313, line: 282, column: 7)
!626 = !{!603, !557, i64 1688}
!627 = !DILocation(line: 282, column: 8, scope: !625)
!628 = !DILocation(line: 282, column: 7, scope: !312)
!629 = !DILocation(line: 282, column: 33, scope: !625)
!630 = !DILocation(line: 282, column: 39, scope: !625)
!631 = !{!603, !599, i64 1624}
!632 = !DILocation(line: 282, column: 28, scope: !625)
!633 = !DILocation(line: 283, column: 13, scope: !634)
!634 = distinct !DILexicalBlock(scope: !312, file: !313, line: 283, column: 7)
!635 = !{!603, !557, i64 1692}
!636 = !DILocation(line: 283, column: 8, scope: !634)
!637 = !DILocation(line: 283, column: 7, scope: !312)
!638 = !DILocation(line: 283, column: 33, scope: !634)
!639 = !DILocation(line: 283, column: 39, scope: !634)
!640 = !{!603, !599, i64 1632}
!641 = !DILocation(line: 283, column: 28, scope: !634)
!642 = !DILocation(line: 285, column: 3, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !313, line: 285, column: 3)
!644 = distinct !DILexicalBlock(scope: !645, file: !313, line: 285, column: 3)
!645 = distinct !DILexicalBlock(scope: !312, file: !313, line: 285, column: 3)
!646 = !DILocation(line: 285, column: 3, scope: !644)
!647 = !DILocation(line: 285, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !313, line: 285, column: 3)
!649 = distinct !DILexicalBlock(scope: !643, file: !313, line: 285, column: 3)
!650 = !DILocation(line: 285, column: 3, scope: !649)
!651 = !DILocation(line: 285, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !313, line: 285, column: 3)
!653 = distinct !DILexicalBlock(scope: !648, file: !313, line: 285, column: 3)
!654 = !{!564, !557, i64 1544}
!655 = !DILocation(line: 285, column: 3, scope: !653)
!656 = !DILocation(line: 285, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !652, file: !313, line: 285, column: 3)
!658 = !DILocation(line: 285, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !648, file: !313, line: 285, column: 3)
!660 = !DILocation(line: 285, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !659, file: !313, line: 285, column: 3)
!662 = !DILocation(line: 285, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !313, line: 285, column: 3)
!664 = distinct !DILexicalBlock(scope: !661, file: !313, line: 285, column: 3)
!665 = !DILocation(line: 285, column: 3, scope: !664)
!666 = !DILocation(line: 285, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !313, line: 285, column: 3)
!668 = !DILocation(line: 286, column: 1, scope: !312)
!669 = distinct !DISubprogram(name: "TaoSetup_BMRM", scope: !313, file: !313, line: 203, type: !314, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !670)
!670 = !{!671, !672, !673}
!671 = !DILocalVariable(name: "tao", arg: 1, scope: !669, file: !313, line: 203, type: !316)
!672 = !DILocalVariable(name: "ierr", scope: !669, file: !313, line: 206, type: !98)
!673 = !DILocalVariable(name: "ierr__", scope: !674, file: !313, line: 211, type: !98)
!674 = distinct !DILexicalBlock(scope: !675, file: !313, line: 211, column: 56)
!675 = distinct !DILexicalBlock(scope: !676, file: !313, line: 210, column: 23)
!676 = distinct !DILexicalBlock(scope: !669, file: !313, line: 210, column: 7)
!677 = !DILocation(line: 0, scope: !669)
!678 = !DILocation(line: 208, column: 3, scope: !679)
!679 = distinct !DILexicalBlock(scope: !680, file: !313, line: 208, column: 3)
!680 = distinct !DILexicalBlock(scope: !681, file: !313, line: 208, column: 3)
!681 = distinct !DILexicalBlock(scope: !669, file: !313, line: 208, column: 3)
!682 = !DILocation(line: 208, column: 3, scope: !680)
!683 = !DILocation(line: 208, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !685, file: !313, line: 208, column: 3)
!685 = distinct !DILexicalBlock(scope: !679, file: !313, line: 208, column: 3)
!686 = !DILocation(line: 208, column: 3, scope: !685)
!687 = !DILocation(line: 208, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !684, file: !313, line: 208, column: 3)
!689 = !DILocation(line: 210, column: 13, scope: !676)
!690 = !{!603, !556, i64 1168}
!691 = !DILocation(line: 210, column: 8, scope: !676)
!692 = !DILocation(line: 210, column: 7, scope: !669)
!693 = !DILocation(line: 211, column: 30, scope: !675)
!694 = !{!603, !556, i64 1160}
!695 = !DILocation(line: 211, column: 12, scope: !675)
!696 = !DILocation(line: 0, scope: !674)
!697 = !DILocation(line: 211, column: 56, scope: !698)
!698 = distinct !DILexicalBlock(scope: !674, file: !313, line: 211, column: 56)
!699 = !DILocation(line: 211, column: 56, scope: !674)
!700 = !DILocation(line: 213, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !313, line: 213, column: 3)
!702 = distinct !DILexicalBlock(scope: !703, file: !313, line: 213, column: 3)
!703 = distinct !DILexicalBlock(scope: !669, file: !313, line: 213, column: 3)
!704 = !DILocation(line: 213, column: 3, scope: !702)
!705 = !DILocation(line: 213, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !313, line: 213, column: 3)
!707 = distinct !DILexicalBlock(scope: !701, file: !313, line: 213, column: 3)
!708 = !DILocation(line: 213, column: 3, scope: !707)
!709 = !DILocation(line: 213, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !313, line: 213, column: 3)
!711 = distinct !DILexicalBlock(scope: !706, file: !313, line: 213, column: 3)
!712 = !DILocation(line: 213, column: 3, scope: !711)
!713 = !DILocation(line: 213, column: 3, scope: !714)
!714 = distinct !DILexicalBlock(scope: !710, file: !313, line: 213, column: 3)
!715 = !DILocation(line: 213, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !706, file: !313, line: 213, column: 3)
!717 = !DILocation(line: 213, column: 3, scope: !718)
!718 = distinct !DILexicalBlock(scope: !716, file: !313, line: 213, column: 3)
!719 = !DILocation(line: 213, column: 3, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !313, line: 213, column: 3)
!721 = distinct !DILexicalBlock(scope: !718, file: !313, line: 213, column: 3)
!722 = !DILocation(line: 213, column: 3, scope: !721)
!723 = !DILocation(line: 213, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !313, line: 213, column: 3)
!725 = !DILocation(line: 214, column: 1, scope: !669)
!726 = distinct !DISubprogram(name: "TaoSolve_BMRM", scope: !313, file: !313, line: 47, type: !314, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !727)
!727 = !{!728, !729, !730, !759, !760, !761, !762, !763, !764, !765, !772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !788, !790, !796, !797, !801, !803, !805, !807, !809, !811, !813, !815, !820, !822, !824, !826, !830, !832, !837, !841, !843, !848, !850, !852, !854, !856, !858, !861, !862, !864, !867, !868, !870, !872, !874, !878, !880, !882}
!728 = !DILocalVariable(name: "tao", arg: 1, scope: !726, file: !313, line: 47, type: !316)
!729 = !DILocalVariable(name: "ierr", scope: !726, file: !313, line: 49, type: !98)
!730 = !DILocalVariable(name: "df", scope: !726, file: !313, line: 50, type: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_DF", file: !289, line: 62, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 29, size: 1472, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "maxProjIter", scope: !732, file: !289, line: 30, baseType: !144, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "maxPGMIter", scope: !732, file: !289, line: 31, baseType: !144, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ipt", scope: !732, file: !289, line: 32, baseType: !190, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ipt2", scope: !732, file: !289, line: 32, baseType: !190, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !732, file: !289, line: 32, baseType: !190, size: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tempv", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Qd", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "xplus", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tplus", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "yk", scope: !732, file: !289, line: 33, baseType: !198, size: 64, offset: 832)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !732, file: !289, line: 35, baseType: !144, size: 32, offset: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cur_num_cp", scope: !732, file: !289, line: 37, baseType: !144, size: 32, offset: 928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !732, file: !289, line: 40, baseType: !198, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !732, file: !289, line: 43, baseType: !198, size: 64, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !732, file: !289, line: 46, baseType: !201, size: 64, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !732, file: !289, line: 49, baseType: !198, size: 64, offset: 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !732, file: !289, line: 52, baseType: !199, size: 64, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !732, file: !289, line: 55, baseType: !198, size: 64, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !732, file: !289, line: 58, baseType: !198, size: 64, offset: 1344)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !732, file: !289, line: 61, baseType: !199, size: 64, offset: 1408)
!759 = !DILocalVariable(name: "bmrm", scope: !726, file: !313, line: 51, type: !287)
!760 = !DILocalVariable(name: "f", scope: !726, file: !313, line: 54, type: !199)
!761 = !DILocalVariable(name: "W", scope: !726, file: !313, line: 55, type: !299)
!762 = !DILocalVariable(name: "G", scope: !726, file: !313, line: 56, type: !299)
!763 = !DILocalVariable(name: "lambda", scope: !726, file: !313, line: 57, type: !199)
!764 = !DILocalVariable(name: "bt", scope: !726, file: !313, line: 58, type: !199)
!765 = !DILocalVariable(name: "grad_list", scope: !726, file: !313, line: 59, type: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_Chain", file: !289, line: 26, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec_Chain", file: !289, line: 23, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !767, file: !289, line: 24, baseType: !299, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !289, line: 25, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!772 = !DILocalVariable(name: "tail_glist", scope: !726, file: !313, line: 59, type: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!774 = !DILocalVariable(name: "pgrad", scope: !726, file: !313, line: 59, type: !773)
!775 = !DILocalVariable(name: "i", scope: !726, file: !313, line: 60, type: !144)
!776 = !DILocalVariable(name: "rank", scope: !726, file: !313, line: 61, type: !161)
!777 = !DILocalVariable(name: "reg", scope: !726, file: !313, line: 64, type: !199)
!778 = !DILocalVariable(name: "jtwt", scope: !726, file: !313, line: 65, type: !199)
!779 = !DILocalVariable(name: "max_jtwt", scope: !726, file: !313, line: 65, type: !199)
!780 = !DILocalVariable(name: "pre_epsilon", scope: !726, file: !313, line: 65, type: !199)
!781 = !DILocalVariable(name: "epsilon", scope: !726, file: !313, line: 65, type: !199)
!782 = !DILocalVariable(name: "jw", scope: !726, file: !313, line: 65, type: !199)
!783 = !DILocalVariable(name: "min_jw", scope: !726, file: !313, line: 65, type: !199)
!784 = !DILocalVariable(name: "innerSolverTol", scope: !726, file: !313, line: 66, type: !199)
!785 = !DILocalVariable(name: "comm", scope: !726, file: !313, line: 67, type: !100)
!786 = !DILocalVariable(name: "ierr__", scope: !787, file: !313, line: 70, type: !98)
!787 = distinct !DILexicalBlock(scope: !726, file: !313, line: 70, column: 53)
!788 = !DILocalVariable(name: "_7_errorcode", scope: !789, file: !313, line: 71, type: !98)
!789 = distinct !DILexicalBlock(scope: !726, file: !313, line: 71, column: 37)
!790 = !DILocalVariable(name: "_7_errorstring", scope: !791, file: !313, line: 71, type: !793)
!791 = distinct !DILexicalBlock(scope: !792, file: !313, line: 71, column: 37)
!792 = distinct !DILexicalBlock(scope: !789, file: !313, line: 71, column: 37)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 256)
!796 = !DILocalVariable(name: "_7_resultlen", scope: !791, file: !313, line: 71, type: !161)
!797 = !DILocalVariable(name: "ierr__", scope: !798, file: !313, line: 82, type: !98)
!798 = distinct !DILexicalBlock(scope: !799, file: !313, line: 82, column: 32)
!799 = distinct !DILexicalBlock(scope: !800, file: !313, line: 81, column: 14)
!800 = distinct !DILexicalBlock(scope: !726, file: !313, line: 81, column: 7)
!801 = !DILocalVariable(name: "ierr__", scope: !802, file: !313, line: 92, type: !98)
!802 = distinct !DILexicalBlock(scope: !726, file: !313, line: 92, column: 68)
!803 = !DILocalVariable(name: "ierr__", scope: !804, file: !313, line: 93, type: !98)
!804 = distinct !DILexicalBlock(scope: !726, file: !313, line: 93, column: 42)
!805 = !DILocalVariable(name: "ierr__", scope: !806, file: !313, line: 94, type: !98)
!806 = distinct !DILexicalBlock(scope: !726, file: !313, line: 94, column: 40)
!807 = !DILocalVariable(name: "ierr__", scope: !808, file: !313, line: 97, type: !98)
!808 = distinct !DILexicalBlock(scope: !726, file: !313, line: 97, column: 56)
!809 = !DILocalVariable(name: "ierr__", scope: !810, file: !313, line: 98, type: !98)
!810 = distinct !DILexicalBlock(scope: !726, file: !313, line: 98, column: 63)
!811 = !DILocalVariable(name: "ierr__", scope: !812, file: !313, line: 99, type: !98)
!812 = distinct !DILexicalBlock(scope: !726, file: !313, line: 99, column: 57)
!813 = !DILocalVariable(name: "ierr__", scope: !814, file: !313, line: 100, type: !98)
!814 = distinct !DILexicalBlock(scope: !726, file: !313, line: 100, column: 54)
!815 = !DILocalVariable(name: "ierr__", scope: !816, file: !313, line: 105, type: !98)
!816 = distinct !DILexicalBlock(scope: !817, file: !313, line: 105, column: 69)
!817 = distinct !DILexicalBlock(scope: !818, file: !313, line: 104, column: 27)
