; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesj.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 442, baseType: !26, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!74 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!75 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!76 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!77 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!78 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!79 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!80 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!81 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!82 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!83 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!84 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!85 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!86 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!87 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!88 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!89 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!90 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!91 = !DIEnumerator(name: "MAT_SPD", value: 15)
!92 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!93 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!94 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!95 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!96 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!97 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!98 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!99 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!100 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!101 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 663, baseType: !5, size: 32, elements: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 155, baseType: !5, size: 32, elements: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126}
!118 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!122 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!124 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!125 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!126 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 424, baseType: !5, size: 32, elements: !128)
!128 = !{!129, !130}
!129 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!131 = !{!132, !136, !137, !222, !26, !340, !172}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !133, line: 330, baseType: !134)
!133 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !133, line: 330, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !140, line: 73, size: 4480, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !144, !193, !194, !196, !199, !200, !201, !202, !210, !211, !213, !217, !221, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !234, !235, !236, !238, !239, !241, !243, !244, !245, !246, !247, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !273, !275, !276, !280, !281, !330, !335, !337, !338, !339}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !139, file: !140, line: 74, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !139, file: !140, line: 75, baseType: !145, size: 448, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 448, elements: !191)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !140, line: 53, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 45, size: 448, elements: !148)
!148 = !{!149, !155, !163, !168, !175, !179, !186}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !147, file: !140, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !147, file: !140, line: 47, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!153, !137, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !160, line: 16, baseType: !161)
!160 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !160, line: 16, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !140, line: 48, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!153, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !147, file: !140, line: 49, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!153, !137, !172, !137}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !147, file: !140, line: 50, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!153, !137, !172, !167}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !147, file: !140, line: 51, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!153, !137, !172, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !147, file: !140, line: 52, baseType: !187, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!153, !137, !172, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!191 = !{!192}
!192 = !DISubrange(count: 1)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !139, file: !140, line: 76, baseType: !132, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !140, line: 77, baseType: !195, size: 32, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !198)
!198 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !139, file: !140, line: 78, baseType: !197, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 79, baseType: !203, size: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !206, line: 27, baseType: !207)
!206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !208, line: 43, baseType: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!209 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !139, file: !140, line: 80, baseType: !195, size: 32, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !140, line: 81, baseType: !212, size: 32, offset: 992)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !139, file: !140, line: 82, baseType: !214, size: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !139, file: !140, line: 83, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !140, line: 84, baseType: !222, size: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !140, line: 85, baseType: !222, size: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !139, file: !140, line: 86, baseType: !222, size: 64, offset: 1280)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !139, file: !140, line: 87, baseType: !222, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 88, baseType: !137, size: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !139, file: !140, line: 89, baseType: !203, size: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 90, baseType: !222, size: 64, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !139, file: !140, line: 91, baseType: !222, size: 64, offset: 1600)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !139, file: !140, line: 92, baseType: !195, size: 32, offset: 1664)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !139, file: !140, line: 93, baseType: !136, size: 64, offset: 1728)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 94, baseType: !233, size: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !204)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !139, file: !140, line: 95, baseType: !195, size: 32, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !139, file: !140, line: 95, baseType: !195, size: 32, offset: 1888)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !139, file: !140, line: 96, baseType: !237, size: 64, offset: 1920)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !139, file: !140, line: 96, baseType: !237, size: 64, offset: 1984)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !139, file: !140, line: 97, baseType: !240, size: 64, offset: 2048)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !139, file: !140, line: 97, baseType: !242, size: 64, offset: 2112)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !139, file: !140, line: 98, baseType: !195, size: 32, offset: 2176)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !139, file: !140, line: 98, baseType: !195, size: 32, offset: 2208)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !139, file: !140, line: 99, baseType: !237, size: 64, offset: 2240)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !139, file: !140, line: 99, baseType: !237, size: 64, offset: 2304)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !139, file: !140, line: 100, baseType: !248, size: 64, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !198)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !139, file: !140, line: 100, baseType: !251, size: 64, offset: 2432)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !139, file: !140, line: 101, baseType: !195, size: 32, offset: 2496)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !139, file: !140, line: 101, baseType: !195, size: 32, offset: 2528)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !139, file: !140, line: 102, baseType: !237, size: 64, offset: 2560)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !139, file: !140, line: 102, baseType: !237, size: 64, offset: 2624)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !139, file: !140, line: 103, baseType: !257, size: 64, offset: 2688)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !249)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !139, file: !140, line: 103, baseType: !260, size: 64, offset: 2752)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !139, file: !140, line: 104, baseType: !190, size: 64, offset: 2816)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !139, file: !140, line: 105, baseType: !195, size: 32, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !139, file: !140, line: 106, baseType: !264, size: 128, offset: 2944)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 128, elements: !271)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !140, line: 64, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 61, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !267, file: !140, line: 62, baseType: !183, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !267, file: !140, line: 63, baseType: !136, size: 64, offset: 64)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !139, file: !140, line: 107, baseType: !274, size: 64, offset: 3072)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !139, file: !140, line: 108, baseType: !136, size: 64, offset: 3136)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !139, file: !140, line: 109, baseType: !277, size: 64, offset: 3200)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!153, !136}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !139, file: !140, line: 111, baseType: !195, size: 32, offset: 3264)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !139, file: !140, line: 112, baseType: !282, size: 320, offset: 3328)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !328)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!153, !286, !137, !136}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !289)
!289 = !{!290, !291, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !288, file: !10, line: 100, baseType: !195, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 101, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !303, !304, !305, !309, !311, !313, !314, !315}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !294, file: !10, line: 84, baseType: !222, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !294, file: !10, line: 85, baseType: !222, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !10, line: 86, baseType: !136, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !294, file: !10, line: 87, baseType: !214, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !294, file: !10, line: 88, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !294, file: !10, line: 89, baseType: !174, size: 8, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !294, file: !10, line: 90, baseType: !222, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !294, file: !10, line: 91, baseType: !306, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !307, line: 46, baseType: !308)
!307 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!308 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !294, file: !10, line: 92, baseType: !310, size: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !10, line: 93, baseType: !312, size: 32, offset: 544)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !10, line: 94, baseType: !292, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !294, file: !10, line: 95, baseType: !222, size: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !294, file: !10, line: 96, baseType: !136, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !288, file: !10, line: 102, baseType: !222, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !288, file: !10, line: 102, baseType: !222, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !288, file: !10, line: 103, baseType: !222, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !288, file: !10, line: 104, baseType: !132, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !288, file: !10, line: 105, baseType: !310, size: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !288, file: !10, line: 105, baseType: !310, size: 32, offset: 416)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !288, file: !10, line: 105, baseType: !310, size: 32, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !288, file: !10, line: 106, baseType: !137, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !288, file: !10, line: 107, baseType: !325, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!328 = !{!329}
!329 = !DISubrange(count: 5)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !139, file: !140, line: 113, baseType: !331, size: 320, offset: 3648)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 320, elements: !328)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!153, !137, !136}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !139, file: !140, line: 114, baseType: !336, size: 320, offset: 3968)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 320, elements: !328)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !139, file: !140, line: 115, baseType: !310, size: 32, offset: 4288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 120, baseType: !325, size: 64, offset: 4352)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !139, file: !140, line: 121, baseType: !310, size: 32, offset: 4416)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !133, line: 331, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !133, line: 331, flags: DIFlagFwdDecl)
!343 = !{i32 7, !"Dwarf Version", i32 4}
!344 = !{i32 2, !"Debug Info Version", i32 3}
!345 = !{i32 1, !"wchar_size", i32 4}
!346 = !{i32 7, !"PIC Level", i32 2}
!347 = !{i32 7, !"uwtable", i32 1}
!348 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!349 = distinct !DISubprogram(name: "SNESComputeJacobianDefault", scope: !350, file: !350, line: 41, type: !351, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !540)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesj.c", directory: "/home/users/ndemeye/xSDK")
!351 = !DISubroutineType(types: !352)
!352 = !{!153, !353, !368, !436, !436, !136}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !356, line: 38, size: 11648, elements: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!357 = !{!358, !360, !421, !426, !427, !428, !430, !431, !432, !433, !434, !435, !439, !440, !441, !442, !447, !451, !452, !454, !455, !456, !457, !458, !463, !465, !466, !467, !468, !469, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !505, !507, !508, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !355, file: !356, line: 39, baseType: !359, size: 4480)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !140, line: 122, baseType: !139)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !355, file: !356, line: 39, baseType: !361, size: 1088, offset: 4480)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 1088, elements: !191)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !356, line: 12, size: 1088, elements: !363)
!363 = !{!364, !371, !375, !379, !385, !386, !390, !391, !395, !399, !400, !401, !406, !410, !414, !418, !420}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !362, file: !356, line: 13, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!153, !353, !368, !136}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !109, line: 21, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !109, line: 21, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !362, file: !356, line: 14, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!153, !368, !368, !136}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !362, file: !356, line: 15, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!153, !353, !195}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !362, file: !356, line: 16, baseType: !380, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!153, !353, !195, !249, !249, !249, !383, !136}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !362, file: !356, line: 17, baseType: !277, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !362, file: !356, line: 18, baseType: !387, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!153, !353}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !362, file: !356, line: 19, baseType: !387, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !362, file: !356, line: 20, baseType: !392, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!153, !353, !159}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !362, file: !356, line: 21, baseType: !396, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!153, !286, !353}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !362, file: !356, line: 22, baseType: !387, size: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !362, file: !356, line: 23, baseType: !387, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !362, file: !356, line: 24, baseType: !402, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!153, !353, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !362, file: !356, line: 25, baseType: !407, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!153, !405}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !362, file: !356, line: 26, baseType: !411, size: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!153, !353, !368, !368}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !362, file: !356, line: 27, baseType: !415, size: 64, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!153, !353, !368, !368, !136}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !362, file: !356, line: 28, baseType: !419, size: 64, offset: 960)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !362, file: !356, line: 29, baseType: !392, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !355, file: !356, line: 40, baseType: !422, size: 64, offset: 5568)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !423, line: 14, baseType: !424)
!423 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !423, line: 14, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !355, file: !356, line: 41, baseType: !310, size: 32, offset: 5632)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !355, file: !356, line: 42, baseType: !353, size: 64, offset: 5696)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !355, file: !356, line: 43, baseType: !429, size: 32, offset: 5760)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !355, file: !356, line: 44, baseType: !310, size: 32, offset: 5792)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !355, file: !356, line: 47, baseType: !136, size: 64, offset: 5824)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !355, file: !356, line: 49, baseType: !368, size: 64, offset: 5888)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !355, file: !356, line: 50, baseType: !368, size: 64, offset: 5952)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !355, file: !356, line: 52, baseType: !368, size: 64, offset: 6016)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !355, file: !356, line: 54, baseType: !436, size: 64, offset: 6080)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !355, file: !356, line: 55, baseType: !436, size: 64, offset: 6144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !355, file: !356, line: 56, baseType: !436, size: 64, offset: 6208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !355, file: !356, line: 57, baseType: !136, size: 64, offset: 6272)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !355, file: !356, line: 58, baseType: !443, size: 64, offset: 6336)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !444, line: 22, baseType: !445)
!444 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !444, line: 22, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !355, file: !356, line: 59, baseType: !448, size: 64, offset: 6400)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !355, file: !356, line: 60, baseType: !310, size: 32, offset: 6464)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !355, file: !356, line: 61, baseType: !453, size: 32, offset: 6496)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !355, file: !356, line: 63, baseType: !368, size: 64, offset: 6528)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !355, file: !356, line: 65, baseType: !368, size: 64, offset: 6592)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !355, file: !356, line: 66, baseType: !136, size: 64, offset: 6656)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !355, file: !356, line: 68, baseType: !249, size: 64, offset: 6720)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !355, file: !356, line: 74, baseType: !459, size: 320, offset: 6784)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 320, elements: !328)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!153, !353, !195, !249, !136}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !355, file: !356, line: 75, baseType: !464, size: 320, offset: 7104)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 320, elements: !328)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !355, file: !356, line: 76, baseType: !336, size: 320, offset: 7424)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !355, file: !356, line: 77, baseType: !195, size: 32, offset: 7744)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !355, file: !356, line: 78, baseType: !136, size: 64, offset: 7808)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !355, file: !356, line: 79, baseType: !384, size: 32, offset: 7872)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !355, file: !356, line: 80, baseType: !470, size: 320, offset: 7936)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 320, elements: !328)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!153, !353, !136}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !355, file: !356, line: 81, baseType: !464, size: 320, offset: 8256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !355, file: !356, line: 82, baseType: !336, size: 320, offset: 8576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !355, file: !356, line: 83, baseType: !195, size: 32, offset: 8896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !355, file: !356, line: 84, baseType: !310, size: 32, offset: 8928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !355, file: !356, line: 88, baseType: !310, size: 32, offset: 8960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !356, line: 89, baseType: !136, size: 64, offset: 9024)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !355, file: !356, line: 93, baseType: !195, size: 32, offset: 9088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !355, file: !356, line: 94, baseType: !195, size: 32, offset: 9120)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !355, file: !356, line: 95, baseType: !195, size: 32, offset: 9152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !355, file: !356, line: 96, baseType: !195, size: 32, offset: 9184)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !355, file: !356, line: 97, baseType: !195, size: 32, offset: 9216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !355, file: !356, line: 98, baseType: !249, size: 64, offset: 9280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !355, file: !356, line: 99, baseType: !249, size: 64, offset: 9344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !355, file: !356, line: 100, baseType: !249, size: 64, offset: 9408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !355, file: !356, line: 101, baseType: !249, size: 64, offset: 9472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !355, file: !356, line: 102, baseType: !249, size: 64, offset: 9536)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !355, file: !356, line: 103, baseType: !249, size: 64, offset: 9600)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !355, file: !356, line: 104, baseType: !249, size: 64, offset: 9664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !355, file: !356, line: 105, baseType: !249, size: 64, offset: 9728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !355, file: !356, line: 106, baseType: !310, size: 32, offset: 9792)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !355, file: !356, line: 107, baseType: !195, size: 32, offset: 9824)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !355, file: !356, line: 108, baseType: !195, size: 32, offset: 9856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !355, file: !356, line: 109, baseType: !195, size: 32, offset: 9888)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !355, file: !356, line: 110, baseType: !310, size: 32, offset: 9920)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !355, file: !356, line: 111, baseType: !195, size: 32, offset: 9952)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !355, file: !356, line: 112, baseType: !310, size: 32, offset: 9984)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !355, file: !356, line: 113, baseType: !195, size: 32, offset: 10016)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !355, file: !356, line: 115, baseType: !310, size: 32, offset: 10048)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !355, file: !356, line: 117, baseType: !310, size: 32, offset: 10080)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !355, file: !356, line: 119, baseType: !504, size: 32, offset: 10112)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !355, file: !356, line: 120, baseType: !506, size: 32, offset: 10144)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !355, file: !356, line: 124, baseType: !195, size: 32, offset: 10176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !355, file: !356, line: 125, baseType: !509, size: 64, offset: 10240)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !355, file: !356, line: 129, baseType: !195, size: 32, offset: 10304)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !355, file: !356, line: 130, baseType: !248, size: 64, offset: 10368)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !355, file: !356, line: 132, baseType: !240, size: 64, offset: 10432)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !355, file: !356, line: 133, baseType: !195, size: 32, offset: 10496)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !355, file: !356, line: 134, baseType: !195, size: 32, offset: 10528)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !355, file: !356, line: 135, baseType: !310, size: 32, offset: 10560)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !355, file: !356, line: 136, baseType: !310, size: 32, offset: 10592)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !355, file: !356, line: 137, baseType: !310, size: 32, offset: 10624)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !355, file: !356, line: 140, baseType: !195, size: 32, offset: 10656)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !355, file: !356, line: 141, baseType: !195, size: 32, offset: 10688)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !355, file: !356, line: 143, baseType: !195, size: 32, offset: 10720)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !355, file: !356, line: 144, baseType: !195, size: 32, offset: 10752)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !355, file: !356, line: 146, baseType: !310, size: 32, offset: 10784)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !355, file: !356, line: 147, baseType: !310, size: 32, offset: 10816)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !355, file: !356, line: 148, baseType: !310, size: 32, offset: 10848)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !355, file: !356, line: 150, baseType: !310, size: 32, offset: 10880)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !355, file: !356, line: 151, baseType: !136, size: 64, offset: 10944)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !355, file: !356, line: 154, baseType: !249, size: 64, offset: 11008)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !355, file: !356, line: 155, baseType: !249, size: 64, offset: 11072)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !355, file: !356, line: 157, baseType: !509, size: 64, offset: 11136)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !355, file: !356, line: 158, baseType: !195, size: 32, offset: 11200)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !355, file: !356, line: 160, baseType: !310, size: 32, offset: 11232)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !355, file: !356, line: 161, baseType: !310, size: 32, offset: 11264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !355, file: !356, line: 162, baseType: !195, size: 32, offset: 11296)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !355, file: !356, line: 164, baseType: !249, size: 64, offset: 11328)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !355, file: !356, line: 165, baseType: !368, size: 64, offset: 11392)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !355, file: !356, line: 165, baseType: !368, size: 64, offset: 11456)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !355, file: !356, line: 166, baseType: !195, size: 32, offset: 11520)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !355, file: !356, line: 167, baseType: !310, size: 32, offset: 11552)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !355, file: !356, line: 169, baseType: !310, size: 32, offset: 11584)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !575, !576, !579, !580, !616, !618, !620, !622, !624, !630, !631, !633, !637, !643, !645, !647, !650, !652, !657, !659, !661, !663, !665, !667, !671, !674, !676, !677, !681, !683, !685, !687, !689, !691, !695, !700, !704, !706, !708, !710, !712, !716, !719, !721, !723, !725, !728, !729, !731, !733, !735, !742, !744, !748, !750, !752, !754, !756, !760}
!541 = !DILocalVariable(name: "snes", arg: 1, scope: !349, file: !350, line: 41, type: !353)
!542 = !DILocalVariable(name: "x1", arg: 2, scope: !349, file: !350, line: 41, type: !368)
!543 = !DILocalVariable(name: "J", arg: 3, scope: !349, file: !350, line: 41, type: !436)
!544 = !DILocalVariable(name: "B", arg: 4, scope: !349, file: !350, line: 41, type: !436)
!545 = !DILocalVariable(name: "ctx", arg: 5, scope: !349, file: !350, line: 41, type: !136)
!546 = !DILocalVariable(name: "j1a", scope: !349, file: !350, line: 43, type: !368)
!547 = !DILocalVariable(name: "j2a", scope: !349, file: !350, line: 43, type: !368)
!548 = !DILocalVariable(name: "x2", scope: !349, file: !350, line: 43, type: !368)
!549 = !DILocalVariable(name: "ierr", scope: !349, file: !350, line: 44, type: !153)
!550 = !DILocalVariable(name: "i", scope: !349, file: !350, line: 45, type: !195)
!551 = !DILocalVariable(name: "N", scope: !349, file: !350, line: 45, type: !195)
!552 = !DILocalVariable(name: "start", scope: !349, file: !350, line: 45, type: !195)
!553 = !DILocalVariable(name: "end", scope: !349, file: !350, line: 45, type: !195)
!554 = !DILocalVariable(name: "j", scope: !349, file: !350, line: 45, type: !195)
!555 = !DILocalVariable(name: "value", scope: !349, file: !350, line: 45, type: !195)
!556 = !DILocalVariable(name: "root", scope: !349, file: !350, line: 45, type: !195)
!557 = !DILocalVariable(name: "max_funcs", scope: !349, file: !350, line: 45, type: !195)
!558 = !DILocalVariable(name: "dx", scope: !349, file: !350, line: 46, type: !258)
!559 = !DILocalVariable(name: "y", scope: !349, file: !350, line: 46, type: !257)
!560 = !DILocalVariable(name: "wscale", scope: !349, file: !350, line: 46, type: !258)
!561 = !DILocalVariable(name: "xx", scope: !349, file: !350, line: 47, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!564 = !DILocalVariable(name: "amax", scope: !349, file: !350, line: 48, type: !249)
!565 = !DILocalVariable(name: "epsilon", scope: !349, file: !350, line: 48, type: !249)
!566 = !DILocalVariable(name: "dx_min", scope: !349, file: !350, line: 49, type: !249)
!567 = !DILocalVariable(name: "dx_par", scope: !349, file: !350, line: 49, type: !249)
!568 = !DILocalVariable(name: "unorm", scope: !349, file: !350, line: 49, type: !249)
!569 = !DILocalVariable(name: "comm", scope: !349, file: !350, line: 50, type: !132)
!570 = !DILocalVariable(name: "assembled", scope: !349, file: !350, line: 51, type: !310)
!571 = !DILocalVariable(name: "use_wp", scope: !349, file: !350, line: 51, type: !310)
!572 = !DILocalVariable(name: "flg", scope: !349, file: !350, line: 51, type: !310)
!573 = !DILocalVariable(name: "list", scope: !349, file: !350, line: 52, type: !574)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 128, elements: !271)
!575 = !DILocalVariable(name: "size", scope: !349, file: !350, line: 53, type: !212)
!576 = !DILocalVariable(name: "ranges", scope: !349, file: !350, line: 54, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!579 = !DILocalVariable(name: "dm", scope: !349, file: !350, line: 55, type: !422)
!580 = !DILocalVariable(name: "dms", scope: !349, file: !350, line: 56, type: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSNES", file: !356, line: 176, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSNES", file: !356, line: 197, size: 5568, elements: !584)
!584 = !{!585, !586, !608, !609, !610, !611, !612, !613, !614, !615}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !583, file: !356, line: 198, baseType: !359, size: 4480)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !583, file: !356, line: 198, baseType: !587, size: 576, offset: 4480)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 576, elements: !191)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSNESOps", file: !356, line: 178, size: 576, elements: !589)
!589 = !{!590, !591, !592, !593, !597, !598, !599, !600, !604}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "computefunction", scope: !588, file: !356, line: 179, baseType: !415, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "computemffunction", scope: !588, file: !356, line: 180, baseType: !415, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !588, file: !356, line: 181, baseType: !419, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !588, file: !356, line: 184, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!153, !353, !368, !248, !136}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !588, file: !356, line: 187, baseType: !415, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !588, file: !356, line: 188, baseType: !419, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "computegs", scope: !588, file: !356, line: 191, baseType: !415, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !588, file: !356, line: 193, baseType: !601, size: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!153, !581}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !588, file: !356, line: 194, baseType: !605, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!153, !581, !581}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "functionctx", scope: !583, file: !356, line: 199, baseType: !136, size: 64, offset: 5056)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mffunctionctx", scope: !583, file: !356, line: 200, baseType: !136, size: 64, offset: 5120)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gsctx", scope: !583, file: !356, line: 201, baseType: !136, size: 64, offset: 5184)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !583, file: !356, line: 202, baseType: !136, size: 64, offset: 5248)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "jacobianctx", scope: !583, file: !356, line: 203, baseType: !136, size: 64, offset: 5312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "objectivectx", scope: !583, file: !356, line: 204, baseType: !136, size: 64, offset: 5376)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !583, file: !356, line: 206, baseType: !136, size: 64, offset: 5440)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "originaldm", scope: !583, file: !356, line: 215, baseType: !422, size: 64, offset: 5504)
!616 = !DILocalVariable(name: "ierr__", scope: !617, file: !350, line: 61, type: !153)
!617 = distinct !DILexicalBlock(scope: !349, file: !350, line: 61, column: 70)
!618 = !DILocalVariable(name: "ierr__", scope: !619, file: !350, line: 62, type: !153)
!619 = distinct !DILexicalBlock(scope: !349, file: !350, line: 62, column: 119)
!620 = !DILocalVariable(name: "ierr__", scope: !621, file: !350, line: 64, type: !153)
!621 = distinct !DILexicalBlock(scope: !349, file: !350, line: 64, column: 52)
!622 = !DILocalVariable(name: "_7_errorcode", scope: !623, file: !350, line: 65, type: !153)
!623 = distinct !DILexicalBlock(scope: !349, file: !350, line: 65, column: 36)
!624 = !DILocalVariable(name: "_7_errorstring", scope: !625, file: !350, line: 65, type: !627)
!625 = distinct !DILexicalBlock(scope: !626, file: !350, line: 65, column: 36)
!626 = distinct !DILexicalBlock(scope: !623, file: !350, line: 65, column: 36)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 2048, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 256)
!630 = !DILocalVariable(name: "_7_resultlen", scope: !625, file: !350, line: 65, type: !212)
!631 = !DILocalVariable(name: "ierr__", scope: !632, file: !350, line: 66, type: !153)
!632 = distinct !DILexicalBlock(scope: !349, file: !350, line: 66, column: 37)
!633 = !DILocalVariable(name: "ierr__", scope: !634, file: !350, line: 68, type: !153)
!634 = distinct !DILexicalBlock(scope: !635, file: !350, line: 68, column: 30)
!635 = distinct !DILexicalBlock(scope: !636, file: !350, line: 67, column: 18)
!636 = distinct !DILexicalBlock(scope: !349, file: !350, line: 67, column: 7)
!637 = !DILocalVariable(name: "ierr__", scope: !638, file: !350, line: 72, type: !153)
!638 = distinct !DILexicalBlock(scope: !639, file: !350, line: 72, column: 47)
!639 = distinct !DILexicalBlock(scope: !640, file: !350, line: 71, column: 19)
!640 = distinct !DILexicalBlock(scope: !641, file: !350, line: 71, column: 9)
!641 = distinct !DILexicalBlock(scope: !642, file: !350, line: 70, column: 22)
!642 = distinct !DILexicalBlock(scope: !349, file: !350, line: 70, column: 7)
!643 = !DILocalVariable(name: "ierr__", scope: !644, file: !350, line: 73, type: !153)
!644 = distinct !DILexicalBlock(scope: !639, file: !350, line: 73, column: 47)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !350, line: 74, type: !153)
!646 = distinct !DILexicalBlock(scope: !639, file: !350, line: 74, column: 46)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !350, line: 77, type: !153)
!648 = distinct !DILexicalBlock(scope: !649, file: !350, line: 77, column: 61)
!649 = distinct !DILexicalBlock(scope: !640, file: !350, line: 75, column: 12)
!650 = !DILocalVariable(name: "_i", scope: !651, file: !350, line: 78, type: !26)
!651 = distinct !DILexicalBlock(scope: !649, file: !350, line: 78, column: 14)
!652 = !DILocalVariable(name: "ierr__", scope: !653, file: !350, line: 78, type: !153)
!653 = distinct !DILexicalBlock(scope: !654, file: !350, line: 78, column: 14)
!654 = distinct !DILexicalBlock(scope: !655, file: !350, line: 78, column: 14)
!655 = distinct !DILexicalBlock(scope: !656, file: !350, line: 78, column: 14)
!656 = distinct !DILexicalBlock(scope: !651, file: !350, line: 78, column: 14)
!657 = !DILocalVariable(name: "ierr__", scope: !658, file: !350, line: 78, type: !153)
!658 = distinct !DILexicalBlock(scope: !649, file: !350, line: 78, column: 67)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !350, line: 83, type: !153)
!660 = distinct !DILexicalBlock(scope: !349, file: !350, line: 83, column: 28)
!661 = !DILocalVariable(name: "ierr__", scope: !662, file: !350, line: 84, type: !153)
!662 = distinct !DILexicalBlock(scope: !349, file: !350, line: 84, column: 47)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !350, line: 85, type: !153)
