; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/interface/viewregall.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/interface/viewregall.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscViewer = type { %struct._p_PetscObject, [1 x %struct._PetscViewerOps], i32, [25 x i32], i32, i8*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!185 = distinct !DILexicalBlock(scope: !181, file: !107, line: 33, column: 37)
!186 = !DILocation(line: 34, column: 32, scope: !115)
!187 = !DILocation(line: 36, column: 10, scope: !115)
!188 = !DILocation(line: 0, scope: !115)
!189 = !DILocation(line: 0, scope: !123)
!190 = !DILocation(line: 36, column: 78, scope: !191)
!191 = distinct !DILexicalBlock(scope: !123, file: !107, line: 36, column: 78)
!192 = !DILocation(line: 36, column: 78, scope: !123)
!193 = !{!"branch_weights", i32 2000, i32 1}
!194 = !DILocation(line: 37, column: 10, scope: !115)
!195 = !DILocation(line: 0, scope: !125)
!196 = !DILocation(line: 37, column: 79, scope: !197)
!197 = distinct !DILexicalBlock(scope: !125, file: !107, line: 37, column: 79)
!198 = !DILocation(line: 37, column: 79, scope: !125)
!199 = !DILocation(line: 38, column: 10, scope: !115)
!200 = !DILocation(line: 0, scope: !127)
!201 = !DILocation(line: 38, column: 79, scope: !202)
!202 = distinct !DILexicalBlock(scope: !127, file: !107, line: 38, column: 79)
!203 = !DILocation(line: 38, column: 79, scope: !127)
!204 = !DILocation(line: 39, column: 10, scope: !115)
!205 = !DILocation(line: 0, scope: !129)
!206 = !DILocation(line: 39, column: 77, scope: !207)
!207 = distinct !DILexicalBlock(scope: !129, file: !107, line: 39, column: 77)
!208 = !DILocation(line: 39, column: 77, scope: !129)
!209 = !DILocation(line: 41, column: 10, scope: !115)
!210 = !DILocation(line: 0, scope: !131)
!211 = !DILocation(line: 41, column: 79, scope: !212)
!212 = distinct !DILexicalBlock(scope: !131, file: !107, line: 41, column: 79)
!213 = !DILocation(line: 41, column: 79, scope: !131)
!214 = !DILocation(line: 46, column: 10, scope: !115)
!215 = !DILocation(line: 0, scope: !133)
!216 = !DILocation(line: 46, column: 75, scope: !217)
!217 = distinct !DILexicalBlock(scope: !133, file: !107, line: 46, column: 75)
!218 = !DILocation(line: 46, column: 75, scope: !133)
!219 = !DILocation(line: 56, column: 10, scope: !115)
!220 = !DILocation(line: 0, scope: !135)
!221 = !DILocation(line: 56, column: 76, scope: !222)
!222 = distinct !DILexicalBlock(scope: !135, file: !107, line: 56, column: 76)
!223 = !DILocation(line: 56, column: 76, scope: !135)
!224 = !DILocation(line: 57, column: 10, scope: !115)
!225 = !DILocation(line: 0, scope: !137)
!226 = !DILocation(line: 57, column: 78, scope: !227)
!227 = distinct !DILexicalBlock(scope: !137, file: !107, line: 57, column: 78)
!228 = !DILocation(line: 57, column: 78, scope: !137)
!229 = !DILocation(line: 64, column: 3, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !107, line: 64, column: 3)
!231 = distinct !DILexicalBlock(scope: !232, file: !107, line: 64, column: 3)
!232 = distinct !DILexicalBlock(scope: !115, file: !107, line: 64, column: 3)
!233 = !DILocation(line: 64, column: 3, scope: !231)
!234 = !DILocation(line: 64, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !107, line: 64, column: 3)
!236 = distinct !DILexicalBlock(scope: !230, file: !107, line: 64, column: 3)
!237 = !DILocation(line: 64, column: 3, scope: !236)
!238 = !DILocation(line: 64, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !107, line: 64, column: 3)
!240 = distinct !DILexicalBlock(scope: !235, file: !107, line: 64, column: 3)
!241 = !DILocation(line: 64, column: 3, scope: !240)
!242 = !DILocation(line: 64, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !107, line: 64, column: 3)
!244 = !DILocation(line: 64, column: 3, scope: !245)
!245 = distinct !DILexicalBlock(scope: !235, file: !107, line: 64, column: 3)
!246 = !DILocation(line: 64, column: 3, scope: !247)
!247 = distinct !DILexicalBlock(scope: !245, file: !107, line: 64, column: 3)
!248 = !DILocation(line: 64, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !107, line: 64, column: 3)
!250 = distinct !DILexicalBlock(scope: !247, file: !107, line: 64, column: 3)
!251 = !DILocation(line: 64, column: 3, scope: !250)
!252 = !DILocation(line: 64, column: 3, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !107, line: 64, column: 3)
!254 = !DILocation(line: 65, column: 1, scope: !115)
!255 = !DISubprogram(name: "PetscViewerRegister", scope: !47, file: !47, line: 40, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!256 = !DISubroutineType(types: !257)
!257 = !{!119, !98, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!119, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !263, line: 28, size: 6016, elements: !264)
!263 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/viewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!264 = !{!265, !463, !492, !494, !498, !499, !500}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !262, file: !263, line: 29, baseType: !266, size: 4480)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !267, line: 122, baseType: !268)
!267 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !267, line: 73, size: 4480, elements: !269)
!269 = !{!270, !272, !317, !318, !320, !323, !324, !325, !326, !334, !335, !337, !341, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !358, !359, !360, !362, !363, !365, !367, !368, !369, !370, !371, !374, !376, !377, !378, !379, !380, !383, !385, !386, !387, !397, !399, !400, !404, !405, !453, !458, !460, !461, !462}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !268, file: !267, line: 74, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !119)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !268, file: !267, line: 75, baseType: !273, size: 448, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 448, elements: !315)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !267, line: 53, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 45, size: 448, elements: !276)
!276 = !{!277, !284, !290, !295, !299, !303, !310}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !275, file: !267, line: 46, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!118, !281, !283}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !275, file: !267, line: 47, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!118, !281, !288}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !289, line: 16, baseType: !261)
!289 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !275, file: !267, line: 48, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!118, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !275, file: !267, line: 49, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!118, !281, !98, !281}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !275, file: !267, line: 50, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!118, !281, !98, !294}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !275, file: !267, line: 51, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!118, !281, !98, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !275, file: !267, line: 52, baseType: !311, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!118, !281, !98, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !268, file: !267, line: 76, baseType: !101, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !267, line: 77, baseType: !319, size: 32, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !119)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !268, file: !267, line: 78, baseType: !321, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !322)
!322 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !268, file: !267, line: 78, baseType: !321, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !268, file: !267, line: 78, baseType: !321, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !268, file: !267, line: 78, baseType: !321, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !268, file: !267, line: 79, baseType: !327, size: 64, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !330, line: 27, baseType: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !332, line: 43, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!333 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !268, file: !267, line: 80, baseType: !319, size: 32, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !268, file: !267, line: 81, baseType: !336, size: 32, offset: 992)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !119)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !268, file: !267, line: 82, baseType: !338, size: 64, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !268, file: !267, line: 83, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !268, file: !267, line: 84, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !267, line: 85, baseType: !346, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !268, file: !267, line: 86, baseType: !346, size: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !268, file: !267, line: 87, baseType: !346, size: 64, offset: 1344)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !268, file: !267, line: 88, baseType: !281, size: 64, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !268, file: !267, line: 89, baseType: !327, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !267, line: 90, baseType: !346, size: 64, offset: 1536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !268, file: !267, line: 91, baseType: !346, size: 64, offset: 1600)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !268, file: !267, line: 92, baseType: !319, size: 32, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !268, file: !267, line: 93, baseType: !105, size: 64, offset: 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !268, file: !267, line: 94, baseType: !357, size: 64, offset: 1792)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !268, file: !267, line: 95, baseType: !319, size: 32, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !268, file: !267, line: 95, baseType: !319, size: 32, offset: 1888)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !268, file: !267, line: 96, baseType: !361, size: 64, offset: 1920)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !268, file: !267, line: 96, baseType: !361, size: 64, offset: 1984)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !268, file: !267, line: 97, baseType: !364, size: 64, offset: 2048)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !268, file: !267, line: 97, baseType: !366, size: 64, offset: 2112)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !268, file: !267, line: 98, baseType: !319, size: 32, offset: 2176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !268, file: !267, line: 98, baseType: !319, size: 32, offset: 2208)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !268, file: !267, line: 99, baseType: !361, size: 64, offset: 2240)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !268, file: !267, line: 99, baseType: !361, size: 64, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !268, file: !267, line: 100, baseType: !372, size: 64, offset: 2368)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !322)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !268, file: !267, line: 100, baseType: !375, size: 64, offset: 2432)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !268, file: !267, line: 101, baseType: !319, size: 32, offset: 2496)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !268, file: !267, line: 101, baseType: !319, size: 32, offset: 2528)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !268, file: !267, line: 102, baseType: !361, size: 64, offset: 2560)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !268, file: !267, line: 102, baseType: !361, size: 64, offset: 2624)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !268, file: !267, line: 103, baseType: !381, size: 64, offset: 2688)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !373)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !268, file: !267, line: 103, baseType: !384, size: 64, offset: 2752)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !268, file: !267, line: 104, baseType: !314, size: 64, offset: 2816)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !268, file: !267, line: 105, baseType: !319, size: 32, offset: 2880)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !268, file: !267, line: 106, baseType: !388, size: 128, offset: 2944)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !395)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !267, line: 64, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 61, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !391, file: !267, line: 62, baseType: !307, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !391, file: !267, line: 63, baseType: !105, size: 64, offset: 64)
!395 = !{!396}
!396 = !DISubrange(count: 2)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !268, file: !267, line: 107, baseType: !398, size: 64, offset: 3072)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !395)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !268, file: !267, line: 108, baseType: !105, size: 64, offset: 3136)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !268, file: !267, line: 109, baseType: !401, size: 64, offset: 3200)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!118, !105}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !268, file: !267, line: 111, baseType: !319, size: 32, offset: 3264)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !268, file: !267, line: 112, baseType: !406, size: 320, offset: 3328)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 320, elements: !451)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!118, !410, !281, !105}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !413)
!413 = !{!414, !415, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !412, file: !12, line: 100, baseType: !319, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !12, line: 101, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !427, !428, !429, !433, !434, !436, !437, !438}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !418, file: !12, line: 84, baseType: !346, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !418, file: !12, line: 85, baseType: !346, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !12, line: 86, baseType: !105, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !418, file: !12, line: 87, baseType: !338, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !418, file: !12, line: 88, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !418, file: !12, line: 89, baseType: !100, size: 8, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !418, file: !12, line: 90, baseType: !346, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !418, file: !12, line: 91, baseType: !430, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !431, line: 46, baseType: !432)
!431 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!432 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !418, file: !12, line: 92, baseType: !108, size: 32, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !12, line: 93, baseType: !435, size: 32, offset: 544)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !12, line: 94, baseType: !416, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !418, file: !12, line: 95, baseType: !346, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !418, file: !12, line: 96, baseType: !105, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !412, file: !12, line: 102, baseType: !346, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !412, file: !12, line: 102, baseType: !346, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !412, file: !12, line: 103, baseType: !346, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !412, file: !12, line: 104, baseType: !101, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !412, file: !12, line: 105, baseType: !108, size: 32, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !412, file: !12, line: 105, baseType: !108, size: 32, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !412, file: !12, line: 105, baseType: !108, size: 32, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !412, file: !12, line: 106, baseType: !281, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !412, file: !12, line: 107, baseType: !448, size: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!451 = !{!452}
!452 = !DISubrange(count: 5)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !268, file: !267, line: 113, baseType: !454, size: 320, offset: 3648)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 320, elements: !451)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!118, !281, !105}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !268, file: !267, line: 114, baseType: !459, size: 320, offset: 3968)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 320, elements: !451)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !268, file: !267, line: 115, baseType: !108, size: 32, offset: 4288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !268, file: !267, line: 120, baseType: !448, size: 64, offset: 4352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !268, file: !267, line: 121, baseType: !108, size: 32, offset: 4416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !262, file: !263, line: 29, baseType: !464, size: 512, offset: 4480)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 512, elements: !315)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscViewerOps", file: !263, line: 11, size: 512, elements: !466)
!466 = !{!467, !471, !475, !476, !481, !482, !487, !491}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !465, file: !263, line: 12, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!118, !288}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !465, file: !263, line: 13, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!118, !288, !288}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !465, file: !263, line: 14, baseType: !468, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "getsubviewer", scope: !465, file: !263, line: 15, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!118, !288, !101, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubviewer", scope: !465, file: !263, line: 16, baseType: !477, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !465, file: !263, line: 17, baseType: !483, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!118, !288, !105, !319, !364, !486}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !6, line: 389, baseType: !26)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !465, file: !263, line: 18, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!118, !410, !288}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !465, file: !263, line: 19, baseType: !468, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !262, file: !263, line: 30, baseType: !493, size: 32, offset: 4992)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !47, line: 162, baseType: !46)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !262, file: !263, line: 30, baseType: !495, size: 800, offset: 5024)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 800, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 25)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !262, file: !263, line: 31, baseType: !119, size: 32, offset: 5824)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !263, line: 32, baseType: !105, size: 64, offset: 5888)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !262, file: !263, line: 33, baseType: !108, size: 32, offset: 5952)
!501 = !{}
!502 = !DISubprogram(name: "PetscError", scope: !92, file: !92, line: 668, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!503 = !DISubroutineType(types: !504)
!504 = !{!118, !103, !119, !98, !98, !119, !91, !98, null}
