; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ksponly/ksponly.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ksponly/ksponly.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque

!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 85, baseType: !26, size: 32, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!49 = !DIEnumerator(name: "PC_LEFT", value: 0)
!50 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 155, baseType: !5, size: 32, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 517, baseType: !26, size: 32, elements: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!89 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!90 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!91 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!92 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!93 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!94 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!95 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!96 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!97 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!98 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!99 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!100 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!101 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!102 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!103 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!104 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!105 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!106 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!107 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!108 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!109 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!110 = !{!111, !114, !132, !213, !153, !319, !193, !325, !328, !203, !26, !5}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 46, baseType: !113)
!112 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!113 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !117, line: 73, size: 4480, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !121, !174, !175, !177, !180, !181, !182, !183, !191, !192, !194, !198, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !216, !217, !218, !220, !221, !223, !225, !226, !227, !228, !229, !232, !234, !235, !236, !237, !238, !241, !243, !244, !245, !255, !257, !258, !262, !263, !309, !314, !316, !317, !318}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !116, file: !117, line: 74, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !116, file: !117, line: 75, baseType: !122, size: 448, offset: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 448, elements: !172)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !117, line: 53, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 45, size: 448, elements: !125)
!125 = !{!126, !136, !144, !149, !156, !160, !167}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !124, file: !117, line: 46, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !114, !131}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !133, line: 330, baseType: !134)
!133 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !133, line: 330, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !124, file: !117, line: 47, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!130, !114, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !141, line: 16, baseType: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !141, line: 16, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !124, file: !117, line: 48, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!130, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !124, file: !117, line: 49, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!130, !114, !153, !114}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !124, file: !117, line: 50, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!130, !114, !153, !148}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !124, file: !117, line: 51, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!130, !114, !153, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !124, file: !117, line: 52, baseType: !168, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!130, !114, !153, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !116, file: !117, line: 76, baseType: !132, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !117, line: 77, baseType: !176, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !116, file: !117, line: 78, baseType: !178, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !179)
!179 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !116, file: !117, line: 78, baseType: !178, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !116, file: !117, line: 78, baseType: !178, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !116, file: !117, line: 78, baseType: !178, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !117, line: 79, baseType: !184, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !187, line: 27, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !189, line: 43, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!190 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !116, file: !117, line: 80, baseType: !176, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !116, file: !117, line: 81, baseType: !193, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !116, file: !117, line: 82, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !116, file: !117, line: 83, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !116, file: !117, line: 84, baseType: !203, size: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !116, file: !117, line: 85, baseType: !203, size: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !116, file: !117, line: 86, baseType: !203, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !116, file: !117, line: 87, baseType: !203, size: 64, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !117, line: 88, baseType: !114, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !116, file: !117, line: 89, baseType: !184, size: 64, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 90, baseType: !203, size: 64, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !116, file: !117, line: 91, baseType: !203, size: 64, offset: 1600)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !116, file: !117, line: 92, baseType: !176, size: 32, offset: 1664)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !116, file: !117, line: 93, baseType: !213, size: 64, offset: 1728)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !116, file: !117, line: 94, baseType: !215, size: 64, offset: 1792)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !185)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !116, file: !117, line: 95, baseType: !176, size: 32, offset: 1856)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !116, file: !117, line: 95, baseType: !176, size: 32, offset: 1888)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !116, file: !117, line: 96, baseType: !219, size: 64, offset: 1920)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !116, file: !117, line: 96, baseType: !219, size: 64, offset: 1984)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !116, file: !117, line: 97, baseType: !222, size: 64, offset: 2048)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !116, file: !117, line: 97, baseType: !224, size: 64, offset: 2112)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !116, file: !117, line: 98, baseType: !176, size: 32, offset: 2176)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !116, file: !117, line: 98, baseType: !176, size: 32, offset: 2208)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !116, file: !117, line: 99, baseType: !219, size: 64, offset: 2240)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !116, file: !117, line: 99, baseType: !219, size: 64, offset: 2304)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !116, file: !117, line: 100, baseType: !230, size: 64, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !179)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !116, file: !117, line: 100, baseType: !233, size: 64, offset: 2432)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !116, file: !117, line: 101, baseType: !176, size: 32, offset: 2496)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !116, file: !117, line: 101, baseType: !176, size: 32, offset: 2528)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !116, file: !117, line: 102, baseType: !219, size: 64, offset: 2560)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !116, file: !117, line: 102, baseType: !219, size: 64, offset: 2624)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !116, file: !117, line: 103, baseType: !239, size: 64, offset: 2688)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !231)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !116, file: !117, line: 103, baseType: !242, size: 64, offset: 2752)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !116, file: !117, line: 104, baseType: !171, size: 64, offset: 2816)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !116, file: !117, line: 105, baseType: !176, size: 32, offset: 2880)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !116, file: !117, line: 106, baseType: !246, size: 128, offset: 2944)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, elements: !253)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !117, line: 64, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 61, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !249, file: !117, line: 62, baseType: !164, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !249, file: !117, line: 63, baseType: !213, size: 64, offset: 64)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !116, file: !117, line: 107, baseType: !256, size: 64, offset: 3072)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !253)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !116, file: !117, line: 108, baseType: !213, size: 64, offset: 3136)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !116, file: !117, line: 109, baseType: !259, size: 64, offset: 3200)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!130, !213}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !116, file: !117, line: 111, baseType: !176, size: 32, offset: 3264)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !116, file: !117, line: 112, baseType: !264, size: 320, offset: 3328)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 320, elements: !307)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!130, !268, !114, !213}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !271)
!271 = !{!272, !273, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !10, line: 100, baseType: !176, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !10, line: 101, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !285, !286, !287, !288, !290, !292, !293, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !276, file: !10, line: 84, baseType: !203, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !276, file: !10, line: 85, baseType: !203, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !10, line: 86, baseType: !213, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !276, file: !10, line: 87, baseType: !195, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !276, file: !10, line: 88, baseType: !283, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !276, file: !10, line: 89, baseType: !155, size: 8, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !276, file: !10, line: 90, baseType: !203, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !276, file: !10, line: 91, baseType: !111, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !276, file: !10, line: 92, baseType: !289, size: 32, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !10, line: 93, baseType: !291, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !10, line: 94, baseType: !274, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !276, file: !10, line: 95, baseType: !203, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !276, file: !10, line: 96, baseType: !213, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !270, file: !10, line: 102, baseType: !203, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !270, file: !10, line: 102, baseType: !203, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !270, file: !10, line: 103, baseType: !203, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !270, file: !10, line: 104, baseType: !132, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !270, file: !10, line: 105, baseType: !289, size: 32, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !270, file: !10, line: 105, baseType: !289, size: 32, offset: 416)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !270, file: !10, line: 105, baseType: !289, size: 32, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !270, file: !10, line: 106, baseType: !114, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !270, file: !10, line: 107, baseType: !304, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!307 = !{!308}
!308 = !DISubrange(count: 5)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !116, file: !117, line: 113, baseType: !310, size: 320, offset: 3648)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 320, elements: !307)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!130, !114, !213}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !116, file: !117, line: 114, baseType: !315, size: 320, offset: 3968)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 320, elements: !307)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !116, file: !117, line: 115, baseType: !289, size: 32, offset: 4288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !116, file: !117, line: 120, baseType: !304, size: 64, offset: 4352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !116, file: !117, line: 121, baseType: !289, size: 32, offset: 4416)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_KSPONLY", file: !321, line: 5, baseType: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ksponly/ksponly.c", directory: "/home/users/ndemeye/xSDK")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 3, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !322, file: !321, line: 4, baseType: !289, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !133, line: 331, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !133, line: 331, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !133, line: 338, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !133, line: 338, flags: DIFlagFwdDecl)
!331 = !{i32 7, !"Dwarf Version", i32 4}
!332 = !{i32 2, !"Debug Info Version", i32 3}
!333 = !{i32 1, !"wchar_size", i32 4}
!334 = !{i32 7, !"PIC Level", i32 2}
!335 = !{i32 7, !"uwtable", i32 1}
!336 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!337 = distinct !DISubprogram(name: "SNESCreate_KSPONLY", scope: !321, file: !321, line: 99, type: !338, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !526)
!338 = !DISubroutineType(types: !339)
!339 = !{!130, !340}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !343, line: 38, size: 11648, elements: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!344 = !{!345, !347, !411, !416, !417, !418, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !433, !437, !438, !440, !441, !442, !443, !444, !449, !451, !452, !453, !454, !455, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !493, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !342, file: !343, line: 39, baseType: !346, size: 4480)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !117, line: 122, baseType: !116)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !343, line: 39, baseType: !348, size: 1088, offset: 4480)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1088, elements: !172)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !343, line: 12, size: 1088, elements: !350)
!350 = !{!351, !358, !362, !366, !372, !373, !375, !376, !380, !384, !385, !386, !391, !395, !399, !403, !410}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !349, file: !343, line: 13, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!130, !340, !355, !213}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !79, line: 21, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !79, line: 21, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !349, file: !343, line: 14, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!130, !355, !355, !213}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !349, file: !343, line: 15, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!130, !340, !176}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !349, file: !343, line: 16, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!130, !340, !176, !231, !231, !231, !370, !213}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !349, file: !343, line: 17, baseType: !259, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !349, file: !343, line: 18, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !349, file: !343, line: 19, baseType: !374, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !343, line: 20, baseType: !377, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!130, !340, !140}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !349, file: !343, line: 21, baseType: !381, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!130, !268, !340}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !349, file: !343, line: 22, baseType: !374, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !349, file: !343, line: 23, baseType: !374, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !349, file: !343, line: 24, baseType: !387, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!130, !340, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !349, file: !343, line: 25, baseType: !392, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!130, !390}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !349, file: !343, line: 26, baseType: !396, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!130, !340, !355, !355}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !349, file: !343, line: 27, baseType: !400, size: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!130, !340, !355, !355, !213}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !349, file: !343, line: 28, baseType: !404, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!130, !340, !355, !407, !407, !213}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !349, file: !343, line: 29, baseType: !377, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !342, file: !343, line: 40, baseType: !412, size: 64, offset: 5568)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !413, line: 14, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !413, line: 14, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !342, file: !343, line: 41, baseType: !289, size: 32, offset: 5632)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !342, file: !343, line: 42, baseType: !340, size: 64, offset: 5696)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !342, file: !343, line: 43, baseType: !419, size: 32, offset: 5760)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !342, file: !343, line: 44, baseType: !289, size: 32, offset: 5792)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !342, file: !343, line: 47, baseType: !213, size: 64, offset: 5824)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !342, file: !343, line: 49, baseType: !355, size: 64, offset: 5888)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !342, file: !343, line: 50, baseType: !355, size: 64, offset: 5952)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !342, file: !343, line: 52, baseType: !355, size: 64, offset: 6016)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !342, file: !343, line: 54, baseType: !407, size: 64, offset: 6080)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !342, file: !343, line: 55, baseType: !407, size: 64, offset: 6144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !342, file: !343, line: 56, baseType: !407, size: 64, offset: 6208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !342, file: !343, line: 57, baseType: !213, size: 64, offset: 6272)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !342, file: !343, line: 58, baseType: !430, size: 64, offset: 6336)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !87, line: 22, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !87, line: 22, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !342, file: !343, line: 59, baseType: !434, size: 64, offset: 6400)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !342, file: !343, line: 60, baseType: !289, size: 32, offset: 6464)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !342, file: !343, line: 61, baseType: !439, size: 32, offset: 6496)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !342, file: !343, line: 63, baseType: !355, size: 64, offset: 6528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !342, file: !343, line: 65, baseType: !355, size: 64, offset: 6592)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !342, file: !343, line: 66, baseType: !213, size: 64, offset: 6656)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !342, file: !343, line: 68, baseType: !231, size: 64, offset: 6720)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !342, file: !343, line: 74, baseType: !445, size: 320, offset: 6784)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 320, elements: !307)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!130, !340, !176, !231, !213}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !342, file: !343, line: 75, baseType: !450, size: 320, offset: 7104)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 320, elements: !307)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !342, file: !343, line: 76, baseType: !315, size: 320, offset: 7424)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !342, file: !343, line: 77, baseType: !176, size: 32, offset: 7744)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !342, file: !343, line: 78, baseType: !213, size: 64, offset: 7808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !342, file: !343, line: 79, baseType: !371, size: 32, offset: 7872)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !342, file: !343, line: 80, baseType: !456, size: 320, offset: 7936)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !307)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!130, !340, !213}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !342, file: !343, line: 81, baseType: !450, size: 320, offset: 8256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !342, file: !343, line: 82, baseType: !315, size: 320, offset: 8576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !342, file: !343, line: 83, baseType: !176, size: 32, offset: 8896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !342, file: !343, line: 84, baseType: !289, size: 32, offset: 8928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !342, file: !343, line: 88, baseType: !289, size: 32, offset: 8960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !343, line: 89, baseType: !213, size: 64, offset: 9024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !342, file: !343, line: 93, baseType: !176, size: 32, offset: 9088)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !342, file: !343, line: 94, baseType: !176, size: 32, offset: 9120)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !342, file: !343, line: 95, baseType: !176, size: 32, offset: 9152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !342, file: !343, line: 96, baseType: !176, size: 32, offset: 9184)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !342, file: !343, line: 97, baseType: !176, size: 32, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !342, file: !343, line: 98, baseType: !231, size: 64, offset: 9280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !342, file: !343, line: 99, baseType: !231, size: 64, offset: 9344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !342, file: !343, line: 100, baseType: !231, size: 64, offset: 9408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !342, file: !343, line: 101, baseType: !231, size: 64, offset: 9472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !342, file: !343, line: 102, baseType: !231, size: 64, offset: 9536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !342, file: !343, line: 103, baseType: !231, size: 64, offset: 9600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !342, file: !343, line: 104, baseType: !231, size: 64, offset: 9664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !342, file: !343, line: 105, baseType: !231, size: 64, offset: 9728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !342, file: !343, line: 106, baseType: !289, size: 32, offset: 9792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !342, file: !343, line: 107, baseType: !176, size: 32, offset: 9824)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !342, file: !343, line: 108, baseType: !176, size: 32, offset: 9856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !342, file: !343, line: 109, baseType: !176, size: 32, offset: 9888)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !342, file: !343, line: 110, baseType: !289, size: 32, offset: 9920)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !342, file: !343, line: 111, baseType: !176, size: 32, offset: 9952)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !342, file: !343, line: 112, baseType: !289, size: 32, offset: 9984)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !342, file: !343, line: 113, baseType: !176, size: 32, offset: 10016)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !342, file: !343, line: 115, baseType: !289, size: 32, offset: 10048)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !342, file: !343, line: 117, baseType: !289, size: 32, offset: 10080)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !342, file: !343, line: 119, baseType: !490, size: 32, offset: 10112)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !342, file: !343, line: 120, baseType: !492, size: 32, offset: 10144)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !342, file: !343, line: 124, baseType: !176, size: 32, offset: 10176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !342, file: !343, line: 125, baseType: !495, size: 64, offset: 10240)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !342, file: !343, line: 129, baseType: !176, size: 32, offset: 10304)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !342, file: !343, line: 130, baseType: !230, size: 64, offset: 10368)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !342, file: !343, line: 132, baseType: !222, size: 64, offset: 10432)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !342, file: !343, line: 133, baseType: !176, size: 32, offset: 10496)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !342, file: !343, line: 134, baseType: !176, size: 32, offset: 10528)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !342, file: !343, line: 135, baseType: !289, size: 32, offset: 10560)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !342, file: !343, line: 136, baseType: !289, size: 32, offset: 10592)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !342, file: !343, line: 137, baseType: !289, size: 32, offset: 10624)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !342, file: !343, line: 140, baseType: !176, size: 32, offset: 10656)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !342, file: !343, line: 141, baseType: !176, size: 32, offset: 10688)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !342, file: !343, line: 143, baseType: !176, size: 32, offset: 10720)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !342, file: !343, line: 144, baseType: !176, size: 32, offset: 10752)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !342, file: !343, line: 146, baseType: !289, size: 32, offset: 10784)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !342, file: !343, line: 147, baseType: !289, size: 32, offset: 10816)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !342, file: !343, line: 148, baseType: !289, size: 32, offset: 10848)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !342, file: !343, line: 150, baseType: !289, size: 32, offset: 10880)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !342, file: !343, line: 151, baseType: !213, size: 64, offset: 10944)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !342, file: !343, line: 154, baseType: !231, size: 64, offset: 11008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !342, file: !343, line: 155, baseType: !231, size: 64, offset: 11072)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !342, file: !343, line: 157, baseType: !495, size: 64, offset: 11136)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !342, file: !343, line: 158, baseType: !176, size: 32, offset: 11200)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !342, file: !343, line: 160, baseType: !289, size: 32, offset: 11232)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !342, file: !343, line: 161, baseType: !289, size: 32, offset: 11264)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !342, file: !343, line: 162, baseType: !176, size: 32, offset: 11296)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !342, file: !343, line: 164, baseType: !231, size: 64, offset: 11328)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !342, file: !343, line: 165, baseType: !355, size: 64, offset: 11392)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !342, file: !343, line: 165, baseType: !355, size: 64, offset: 11456)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !342, file: !343, line: 166, baseType: !176, size: 32, offset: 11520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !342, file: !343, line: 167, baseType: !289, size: 32, offset: 11552)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !342, file: !343, line: 169, baseType: !289, size: 32, offset: 11584)
!526 = !{!527, !528, !529, !530}
!527 = !DILocalVariable(name: "snes", arg: 1, scope: !337, file: !321, line: 99, type: !340)
!528 = !DILocalVariable(name: "ksponly", scope: !337, file: !321, line: 101, type: !319)
!529 = !DILocalVariable(name: "ierr", scope: !337, file: !321, line: 102, type: !130)
!530 = !DILocalVariable(name: "ierr__", scope: !531, file: !321, line: 117, type: !130)
!531 = distinct !DILexicalBlock(scope: !337, file: !321, line: 117, column: 37)
!532 = !DILocation(line: 0, scope: !337)
!533 = !DILocation(line: 101, column: 3, scope: !337)
!534 = !DILocation(line: 104, column: 3, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !321, line: 104, column: 3)
!536 = distinct !DILexicalBlock(scope: !537, file: !321, line: 104, column: 3)
!537 = distinct !DILexicalBlock(scope: !337, file: !321, line: 104, column: 3)
!538 = !{!539, !539, i64 0}
!539 = !{!"any pointer", !540, i64 0}
!540 = !{!"omnipotent char", !541, i64 0}
!541 = !{!"Simple C/C++ TBAA"}
!542 = !DILocation(line: 104, column: 3, scope: !536)
!543 = !DILocation(line: 104, column: 3, scope: !544)
!544 = distinct !DILexicalBlock(scope: !545, file: !321, line: 104, column: 3)
!545 = distinct !DILexicalBlock(scope: !535, file: !321, line: 104, column: 3)
!546 = !{!547, !548, i64 1536}
!547 = !{!"", !540, i64 0, !540, i64 512, !540, i64 1024, !540, i64 1280, !548, i64 1536, !548, i64 1540, !540, i64 1544}
!548 = !{!"int", !540, i64 0}
!549 = !DILocation(line: 104, column: 3, scope: !545)
!550 = !DILocation(line: 104, column: 3, scope: !551)
!551 = distinct !DILexicalBlock(scope: !544, file: !321, line: 104, column: 3)
!552 = !{!548, !548, i64 0}
!553 = !{!547, !548, i64 1540}
!554 = !DILocation(line: 105, column: 14, scope: !337)
!555 = !DILocation(line: 105, column: 29, scope: !337)
!556 = !{!557, !539, i64 40}
!557 = !{!"_SNESOps", !539, i64 0, !539, i64 8, !539, i64 16, !539, i64 24, !539, i64 32, !539, i64 40, !539, i64 48, !539, i64 56, !539, i64 64, !539, i64 72, !539, i64 80, !539, i64 88, !539, i64 96, !539, i64 104, !539, i64 112, !539, i64 120, !539, i64 128}
!558 = !DILocation(line: 106, column: 14, scope: !337)
!559 = !DILocation(line: 106, column: 29, scope: !337)
!560 = !{!557, !539, i64 48}
!561 = !DILocation(line: 107, column: 14, scope: !337)
!562 = !DILocation(line: 107, column: 29, scope: !337)
!563 = !{!557, !539, i64 72}
!564 = !DILocation(line: 109, column: 14, scope: !337)
!565 = !DILocation(line: 110, column: 14, scope: !337)
!566 = !DILocation(line: 110, column: 29, scope: !337)
!567 = !{!557, !539, i64 80}
!568 = !DILocation(line: 112, column: 9, scope: !337)
!569 = !DILocation(line: 112, column: 17, scope: !337)
!570 = !DILocation(line: 109, column: 29, scope: !337)
!571 = !{!572, !540, i64 808}
