; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redundant/redundant.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redundant/redundant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!301 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!306 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1265, baseType: !5, size: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!310 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!311 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !313)
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 187, baseType: !5, size: 32, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327}
!321 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!324 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!325 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!326 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!327 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !329, line: 213, baseType: !5, size: 32, elements: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!330 = !{!331, !332}
!331 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!335 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 30, baseType: !5, size: 32, elements: !354)
!354 = !{!355, !356, !357, !358, !359}
!355 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!356 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!357 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!358 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!359 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!365 = !{!366, !402, !483, !423, !399, !1478, !558, !473, !26, !1479, !627}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Redundant", file: !368, line: 20, baseType: !369)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redundant/redundant.c", directory: "/home/users/ndemeye/xSDK")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 8, size: 832, elements: !370)
!370 = !{!371, !376, !1446, !1447, !1448, !1449, !1450, !1451, !1457, !1458, !1459, !1474, !1475, !1476}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !369, file: !368, line: 9, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !373, line: 22, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !373, line: 22, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !369, file: !368, line: 10, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !380, line: 37, size: 6720, elements: !381)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!381 = !{!382, !592, !1417, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1439, !1440, !1441, !1442, !1443, !1445}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !379, file: !380, line: 38, baseType: !383, size: 4480)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !384, line: 122, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !384, line: 73, size: 4480, elements: !386)
!386 = !{!387, !389, !444, !445, !447, !450, !451, !452, !453, !461, !462, !464, !468, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !486, !487, !488, !490, !491, !493, !495, !496, !497, !498, !499, !502, !504, !505, !506, !507, !508, !511, !513, !514, !515, !525, !527, !528, !532, !533, !582, !587, !589, !590, !591}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !385, file: !384, line: 74, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !385, file: !384, line: 75, baseType: !390, size: 448, offset: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 448, elements: !442)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !384, line: 53, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 45, size: 448, elements: !393)
!393 = !{!394, !406, !414, !419, !426, !430, !437}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !392, file: !384, line: 46, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !399, !401}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !403, line: 330, baseType: !404)
!403 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !403, line: 330, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !392, file: !384, line: 47, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!398, !399, !410}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !411, line: 16, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !411, line: 16, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !392, file: !384, line: 48, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!398, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !392, file: !384, line: 49, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!398, !399, !423, !399}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !392, file: !384, line: 50, baseType: !427, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!398, !399, !423, !418}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !392, file: !384, line: 51, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!398, !399, !423, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !392, file: !384, line: 52, baseType: !438, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!398, !399, !423, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!442 = !{!443}
!443 = !DISubrange(count: 1)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !385, file: !384, line: 76, baseType: !402, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !384, line: 77, baseType: !446, size: 32, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !385, file: !384, line: 78, baseType: !448, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !449)
!449 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !385, file: !384, line: 78, baseType: !448, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !385, file: !384, line: 78, baseType: !448, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !385, file: !384, line: 78, baseType: !448, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !385, file: !384, line: 79, baseType: !454, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !457, line: 27, baseType: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !459, line: 43, baseType: !460)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!460 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !385, file: !384, line: 80, baseType: !446, size: 32, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !385, file: !384, line: 81, baseType: !463, size: 32, offset: 992)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !385, file: !384, line: 82, baseType: !465, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !385, file: !384, line: 83, baseType: !469, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !385, file: !384, line: 84, baseType: !473, size: 64, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !385, file: !384, line: 85, baseType: !473, size: 64, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !385, file: !384, line: 86, baseType: !473, size: 64, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !385, file: !384, line: 87, baseType: !473, size: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !385, file: !384, line: 88, baseType: !399, size: 64, offset: 1408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !385, file: !384, line: 89, baseType: !454, size: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !384, line: 90, baseType: !473, size: 64, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !385, file: !384, line: 91, baseType: !473, size: 64, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !385, file: !384, line: 92, baseType: !446, size: 32, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !385, file: !384, line: 93, baseType: !483, size: 64, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !384, line: 94, baseType: !485, size: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !455)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !385, file: !384, line: 95, baseType: !446, size: 32, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !385, file: !384, line: 95, baseType: !446, size: 32, offset: 1888)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !385, file: !384, line: 96, baseType: !489, size: 64, offset: 1920)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !385, file: !384, line: 96, baseType: !489, size: 64, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !385, file: !384, line: 97, baseType: !492, size: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !385, file: !384, line: 97, baseType: !494, size: 64, offset: 2112)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !385, file: !384, line: 98, baseType: !446, size: 32, offset: 2176)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !385, file: !384, line: 98, baseType: !446, size: 32, offset: 2208)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !385, file: !384, line: 99, baseType: !489, size: 64, offset: 2240)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !385, file: !384, line: 99, baseType: !489, size: 64, offset: 2304)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !385, file: !384, line: 100, baseType: !500, size: 64, offset: 2368)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !449)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !385, file: !384, line: 100, baseType: !503, size: 64, offset: 2432)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !385, file: !384, line: 101, baseType: !446, size: 32, offset: 2496)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !385, file: !384, line: 101, baseType: !446, size: 32, offset: 2528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !385, file: !384, line: 102, baseType: !489, size: 64, offset: 2560)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !385, file: !384, line: 102, baseType: !489, size: 64, offset: 2624)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !385, file: !384, line: 103, baseType: !509, size: 64, offset: 2688)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !501)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !385, file: !384, line: 103, baseType: !512, size: 64, offset: 2752)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !385, file: !384, line: 104, baseType: !441, size: 64, offset: 2816)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !385, file: !384, line: 105, baseType: !446, size: 32, offset: 2880)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !385, file: !384, line: 106, baseType: !516, size: 128, offset: 2944)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 128, elements: !523)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !384, line: 64, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 61, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !519, file: !384, line: 62, baseType: !434, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !519, file: !384, line: 63, baseType: !483, size: 64, offset: 64)
!523 = !{!524}
!524 = !DISubrange(count: 2)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !385, file: !384, line: 107, baseType: !526, size: 64, offset: 3072)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 64, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !385, file: !384, line: 108, baseType: !483, size: 64, offset: 3136)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !385, file: !384, line: 109, baseType: !529, size: 64, offset: 3200)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!398, !483}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !385, file: !384, line: 111, baseType: !446, size: 32, offset: 3264)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !385, file: !384, line: 112, baseType: !534, size: 320, offset: 3328)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 320, elements: !580)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!398, !538, !399, !483}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !541)
!541 = !{!542, !543, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !540, file: !10, line: 100, baseType: !446, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !10, line: 101, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !555, !556, !557, !561, !563, !565, !566, !567}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !546, file: !10, line: 84, baseType: !473, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !546, file: !10, line: 85, baseType: !473, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !10, line: 86, baseType: !483, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !546, file: !10, line: 87, baseType: !465, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !546, file: !10, line: 88, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !546, file: !10, line: 89, baseType: !425, size: 8, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !546, file: !10, line: 90, baseType: !473, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !546, file: !10, line: 91, baseType: !558, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !559, line: 46, baseType: !560)
!559 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!560 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !546, file: !10, line: 92, baseType: !562, size: 32, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !10, line: 93, baseType: !564, size: 32, offset: 544)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !10, line: 94, baseType: !544, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !546, file: !10, line: 95, baseType: !473, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !546, file: !10, line: 96, baseType: !483, size: 64, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !540, file: !10, line: 102, baseType: !473, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !540, file: !10, line: 102, baseType: !473, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !540, file: !10, line: 103, baseType: !473, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !540, file: !10, line: 104, baseType: !402, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !540, file: !10, line: 105, baseType: !562, size: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !540, file: !10, line: 105, baseType: !562, size: 32, offset: 416)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !540, file: !10, line: 105, baseType: !562, size: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !540, file: !10, line: 106, baseType: !399, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !540, file: !10, line: 107, baseType: !577, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!580 = !{!581}
!581 = !DISubrange(count: 5)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !385, file: !384, line: 113, baseType: !583, size: 320, offset: 3648)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 320, elements: !580)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!398, !399, !483}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !385, file: !384, line: 114, baseType: !588, size: 320, offset: 3968)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 320, elements: !580)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !385, file: !384, line: 115, baseType: !562, size: 32, offset: 4288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !385, file: !384, line: 120, baseType: !577, size: 64, offset: 4352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !385, file: !384, line: 121, baseType: !562, size: 32, offset: 4416)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !379, file: !380, line: 38, baseType: !593, size: 1152, offset: 4480)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 1152, elements: !442)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !380, line: 13, size: 1152, elements: !595)
!595 = !{!596, !600, !607, !1378, !1384, !1389, !1390, !1394, !1398, !1402, !1403, !1407, !1408, !1409, !1410, !1411, !1415, !1416}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !594, file: !380, line: 14, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!398, !377}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !594, file: !380, line: 15, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!398, !377, !604, !604}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !106, line: 21, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !106, line: 21, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !594, file: !380, line: 16, baseType: !608, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!398, !377, !611, !611}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !614, line: 436, size: 23424, elements: !615)
!614 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!615 = !{!616, !617, !1121, !1141, !1142, !1143, !1145, !1146, !1147, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1274, !1275, !1291, !1292, !1293, !1294, !1295, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1330, !1350, !1351, !1353, !1354, !1355, !1356, !1357, !1358, !1376, !1377}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !613, file: !614, line: 437, baseType: !383, size: 4480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !613, file: !614, line: 437, baseType: !618, size: 9472, offset: 4480)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 9472, elements: !442)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !614, line: 32, size: 9472, elements: !620)
!620 = !{!621, !630, !634, !635, !639, !643, !644, !645, !646, !647, !648, !649, !673, !677, !682, !688, !707, !712, !716, !717, !722, !727, !728, !733, !737, !741, !745, !749, !753, !754, !755, !756, !757, !761, !762, !767, !768, !769, !770, !771, !776, !783, !788, !792, !796, !800, !804, !805, !809, !810, !817, !822, !823, !824, !825, !887, !895, !896, !900, !901, !905, !906, !910, !915, !916, !920, !924, !931, !932, !933, !934, !935, !936, !941, !942, !946, !950, !954, !955, !956, !960, !970, !971, !975, !976, !980, !981, !985, !986, !991, !992, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1013, !1014, !1015, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1030, !1034, !1035, !1036, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1050, !1051, !1052, !1057, !1061, !1062, !1066, !1067, !1068, !1069, !1095, !1099, !1100, !1101, !1102, !1103, !1107, !1108, !1109, !1110, !1111, !1115, !1119, !1120}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !619, file: !614, line: 34, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!398, !611, !446, !625, !446, !625, !627, !629}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !71)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !619, file: !614, line: 35, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!398, !611, !446, !492, !494, !512}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !619, file: !614, line: 36, baseType: !631, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !619, file: !614, line: 37, baseType: !636, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!398, !611, !604, !604}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !619, file: !614, line: 38, baseType: !640, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!398, !611, !604, !604, !604}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !619, file: !614, line: 40, baseType: !636, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !619, file: !614, line: 41, baseType: !640, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !619, file: !614, line: 42, baseType: !636, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !619, file: !614, line: 43, baseType: !640, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !619, file: !614, line: 44, baseType: !636, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !619, file: !614, line: 46, baseType: !640, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !619, file: !614, line: 47, baseType: !650, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!398, !611, !653, !653, !657}
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !654, line: 11, baseType: !655)
!654 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !654, line: 11, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !39, line: 1239, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 1226, size: 704, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !660, file: !39, line: 1227, baseType: !501, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !660, file: !39, line: 1228, baseType: !501, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !660, file: !39, line: 1229, baseType: !501, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !660, file: !39, line: 1230, baseType: !501, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !660, file: !39, line: 1231, baseType: !501, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !660, file: !39, line: 1232, baseType: !501, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !660, file: !39, line: 1233, baseType: !501, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !660, file: !39, line: 1234, baseType: !501, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !660, file: !39, line: 1236, baseType: !501, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !660, file: !39, line: 1237, baseType: !501, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !660, file: !39, line: 1238, baseType: !501, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !619, file: !614, line: 48, baseType: !674, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!398, !611, !653, !657}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !619, file: !614, line: 49, baseType: !678, size: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!398, !611, !604, !501, !681, !501, !446, !446, !604}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !39, line: 1291, baseType: !82)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !619, file: !614, line: 50, baseType: !683, size: 64, offset: 896)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!398, !611, !686, !687}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !39, line: 238, baseType: !94)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !619, file: !614, line: 52, baseType: !689, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!398, !611, !692, !693}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !39, line: 612, baseType: !100)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !39, line: 600, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 592, size: 640, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !695, file: !39, line: 593, baseType: !448, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !695, file: !39, line: 594, baseType: !448, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !695, file: !39, line: 594, baseType: !448, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !695, file: !39, line: 594, baseType: !448, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !695, file: !39, line: 595, baseType: !448, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !695, file: !39, line: 596, baseType: !448, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !695, file: !39, line: 597, baseType: !448, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !695, file: !39, line: 598, baseType: !448, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !695, file: !39, line: 598, baseType: !448, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !695, file: !39, line: 599, baseType: !448, size: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !619, file: !614, line: 53, baseType: !708, size: 64, offset: 1024)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!398, !611, !611, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !619, file: !614, line: 54, baseType: !713, size: 64, offset: 1088)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!398, !611, !604}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !619, file: !614, line: 55, baseType: !636, size: 64, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !619, file: !614, line: 56, baseType: !718, size: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!398, !611, !721, !500}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !106, line: 155, baseType: !105)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !619, file: !614, line: 58, baseType: !723, size: 64, offset: 1280)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!398, !611, !726}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !39, line: 424, baseType: !113)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !619, file: !614, line: 59, baseType: !723, size: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !619, file: !614, line: 60, baseType: !729, size: 64, offset: 1408)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!398, !611, !732, !562}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !39, line: 469, baseType: !117)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !619, file: !614, line: 61, baseType: !734, size: 64, offset: 1472)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!398, !611}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !619, file: !614, line: 63, baseType: !738, size: 64, offset: 1536)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!398, !611, !446, !625, !510, !604, !604}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !619, file: !614, line: 64, baseType: !742, size: 64, offset: 1600)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!398, !611, !611, !653, !653, !657}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !619, file: !614, line: 65, baseType: !746, size: 64, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!398, !611, !611, !657}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !619, file: !614, line: 66, baseType: !750, size: 64, offset: 1728)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!398, !611, !611, !653, !657}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !619, file: !614, line: 67, baseType: !746, size: 64, offset: 1792)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !619, file: !614, line: 69, baseType: !734, size: 64, offset: 1856)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !619, file: !614, line: 70, baseType: !742, size: 64, offset: 1920)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !619, file: !614, line: 71, baseType: !750, size: 64, offset: 1984)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !619, file: !614, line: 72, baseType: !758, size: 64, offset: 2048)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!398, !611, !687}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !619, file: !614, line: 73, baseType: !734, size: 64, offset: 2112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !619, file: !614, line: 75, baseType: !763, size: 64, offset: 2176)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!398, !611, !766, !687}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !39, line: 563, baseType: !147)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !619, file: !614, line: 76, baseType: !636, size: 64, offset: 2240)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !619, file: !614, line: 77, baseType: !636, size: 64, offset: 2304)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !619, file: !614, line: 78, baseType: !650, size: 64, offset: 2368)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !619, file: !614, line: 79, baseType: !674, size: 64, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !619, file: !614, line: 81, baseType: !772, size: 64, offset: 2496)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!398, !611, !510, !611, !775}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !619, file: !614, line: 82, baseType: !777, size: 64, offset: 2560)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!398, !611, !446, !780, !780, !686, !782}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !619, file: !614, line: 83, baseType: !784, size: 64, offset: 2624)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!398, !611, !446, !787, !446}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !619, file: !614, line: 84, baseType: !789, size: 64, offset: 2688)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!398, !611, !446, !625, !446, !625, !509}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !619, file: !614, line: 85, baseType: !793, size: 64, offset: 2752)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!398, !611, !611, !775}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !619, file: !614, line: 87, baseType: !797, size: 64, offset: 2816)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!398, !611, !604, !492}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !619, file: !614, line: 88, baseType: !801, size: 64, offset: 2880)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!398, !611, !510}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !619, file: !614, line: 89, baseType: !801, size: 64, offset: 2944)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !619, file: !614, line: 90, baseType: !806, size: 64, offset: 3008)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!398, !611, !604, !629}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !619, file: !614, line: 91, baseType: !738, size: 64, offset: 3072)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !619, file: !614, line: 93, baseType: !811, size: 64, offset: 3136)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!398, !611, !814}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !619, file: !614, line: 94, baseType: !818, size: 64, offset: 3200)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!398, !611, !446, !562, !562, !492, !821, !821, !711}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !619, file: !614, line: 95, baseType: !818, size: 64, offset: 3264)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !619, file: !614, line: 96, baseType: !818, size: 64, offset: 3328)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !619, file: !614, line: 97, baseType: !818, size: 64, offset: 3392)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !619, file: !614, line: 99, baseType: !826, size: 64, offset: 3456)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!398, !611, !829, !832}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !654, line: 51, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !654, line: 51, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !39, line: 1378, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !614, line: 609, size: 6208, elements: !835)
!835 = !{!836, !837, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !856, !863, !864, !865, !866, !867, !868, !869, !870, !874, !875, !876, !877, !878, !880, !881, !882, !883, !884, !885, !886}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !834, file: !614, line: 610, baseType: !383, size: 4480)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !834, file: !614, line: 610, baseType: !838, size: 32, offset: 4480)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !442)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !834, file: !614, line: 611, baseType: !446, size: 32, offset: 4512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !834, file: !614, line: 611, baseType: !446, size: 32, offset: 4544)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !834, file: !614, line: 611, baseType: !446, size: 32, offset: 4576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !834, file: !614, line: 612, baseType: !446, size: 32, offset: 4608)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !834, file: !614, line: 613, baseType: !446, size: 32, offset: 4640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !834, file: !614, line: 614, baseType: !492, size: 64, offset: 4672)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !834, file: !614, line: 615, baseType: !494, size: 64, offset: 4736)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !834, file: !614, line: 616, baseType: !787, size: 64, offset: 4800)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !834, file: !614, line: 617, baseType: !492, size: 64, offset: 4864)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !834, file: !614, line: 618, baseType: !849, size: 64, offset: 4928)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !614, line: 602, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 598, size: 128, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !851, file: !614, line: 599, baseType: !446, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !851, file: !614, line: 600, baseType: !446, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !851, file: !614, line: 601, baseType: !509, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !834, file: !614, line: 619, baseType: !857, size: 64, offset: 4992)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !614, line: 607, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 604, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !859, file: !614, line: 605, baseType: !446, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !859, file: !614, line: 606, baseType: !509, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !834, file: !614, line: 620, baseType: !509, size: 64, offset: 5056)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !834, file: !614, line: 621, baseType: !501, size: 64, offset: 5120)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !834, file: !614, line: 622, baseType: !501, size: 64, offset: 5184)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !834, file: !614, line: 623, baseType: !604, size: 64, offset: 5248)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !834, file: !614, line: 623, baseType: !604, size: 64, offset: 5312)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !834, file: !614, line: 623, baseType: !604, size: 64, offset: 5376)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !834, file: !614, line: 624, baseType: !562, size: 32, offset: 5440)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !834, file: !614, line: 625, baseType: !871, size: 64, offset: 5504)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!398}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !834, file: !614, line: 626, baseType: !483, size: 64, offset: 5568)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !834, file: !614, line: 627, baseType: !604, size: 64, offset: 5632)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !834, file: !614, line: 628, baseType: !446, size: 32, offset: 5696)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !834, file: !614, line: 629, baseType: !423, size: 64, offset: 5760)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !834, file: !614, line: 630, baseType: !879, size: 32, offset: 5824)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !329, line: 213, baseType: !328)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !834, file: !614, line: 631, baseType: !446, size: 32, offset: 5856)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !834, file: !614, line: 631, baseType: !446, size: 32, offset: 5888)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !834, file: !614, line: 632, baseType: !562, size: 32, offset: 5920)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !834, file: !614, line: 633, baseType: !562, size: 32, offset: 5952)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !834, file: !614, line: 634, baseType: !434, size: 64, offset: 6016)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !834, file: !614, line: 634, baseType: !483, size: 64, offset: 6080)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !834, file: !614, line: 635, baseType: !454, size: 64, offset: 6144)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !619, file: !614, line: 100, baseType: !888, size: 64, offset: 3520)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!398, !611, !446, !446, !891, !894}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !329, line: 215, baseType: !893)
!893 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !619, file: !614, line: 101, baseType: !734, size: 64, offset: 3584)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !619, file: !614, line: 102, baseType: !897, size: 64, offset: 3648)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!398, !611, !653, !653, !687}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !619, file: !614, line: 103, baseType: !622, size: 64, offset: 3712)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !619, file: !614, line: 105, baseType: !902, size: 64, offset: 3776)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!398, !611, !653, !653, !686, !687}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !619, file: !614, line: 106, baseType: !734, size: 64, offset: 3840)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !619, file: !614, line: 107, baseType: !907, size: 64, offset: 3904)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!398, !611, !410}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !619, file: !614, line: 108, baseType: !911, size: 64, offset: 3968)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!398, !611, !914, !686, !687}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !39, line: 25, baseType: !423)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !619, file: !614, line: 109, baseType: !871, size: 64, offset: 4032)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !619, file: !614, line: 111, baseType: !917, size: 64, offset: 4096)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!398, !611, !611, !611, !501, !611}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !619, file: !614, line: 112, baseType: !921, size: 64, offset: 4160)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!398, !611, !611, !611, !611}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !619, file: !614, line: 113, baseType: !925, size: 64, offset: 4224)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!398, !611, !928, !928}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !654, line: 30, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !654, line: 30, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !619, file: !614, line: 114, baseType: !622, size: 64, offset: 4288)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !619, file: !614, line: 115, baseType: !738, size: 64, offset: 4352)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !619, file: !614, line: 117, baseType: !797, size: 64, offset: 4416)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !619, file: !614, line: 118, baseType: !797, size: 64, offset: 4480)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !619, file: !614, line: 119, baseType: !911, size: 64, offset: 4544)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !619, file: !614, line: 120, baseType: !937, size: 64, offset: 4608)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!398, !611, !940, !711}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !39, line: 1675, baseType: !152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !619, file: !614, line: 121, baseType: !871, size: 64, offset: 4672)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !619, file: !614, line: 123, baseType: !943, size: 64, offset: 4736)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!398, !611, !446, !483}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !619, file: !614, line: 124, baseType: !947, size: 64, offset: 4800)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!398, !611, !832, !604, !483}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !619, file: !614, line: 125, baseType: !951, size: 64, offset: 4864)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!398, !538, !611}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !619, file: !614, line: 126, baseType: !636, size: 64, offset: 4928)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !619, file: !614, line: 127, baseType: !636, size: 64, offset: 4992)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !619, file: !614, line: 129, baseType: !957, size: 64, offset: 5056)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!398, !611, !787}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !619, file: !614, line: 130, baseType: !961, size: 64, offset: 5120)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!398, !611, !964, !964}
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !106, line: 654, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !106, line: 653, size: 128, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !966, file: !106, line: 653, baseType: !446, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !966, file: !106, line: 653, baseType: !604, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !619, file: !614, line: 131, baseType: !961, size: 64, offset: 5184)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !619, file: !614, line: 132, baseType: !972, size: 64, offset: 5248)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!398, !611, !492, !492, !492}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !619, file: !614, line: 133, baseType: !907, size: 64, offset: 5312)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !619, file: !614, line: 135, baseType: !977, size: 64, offset: 5376)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!398, !611, !501, !711}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !619, file: !614, line: 136, baseType: !977, size: 64, offset: 5440)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !619, file: !614, line: 137, baseType: !982, size: 64, offset: 5504)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!398, !611, !711}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !619, file: !614, line: 138, baseType: !622, size: 64, offset: 5568)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !619, file: !614, line: 139, baseType: !987, size: 64, offset: 5632)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!398, !611, !990, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !619, file: !614, line: 141, baseType: !871, size: 64, offset: 5696)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !619, file: !614, line: 142, baseType: !993, size: 64, offset: 5760)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!398, !611, !611, !501, !611}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !619, file: !614, line: 143, baseType: !997, size: 64, offset: 5824)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!398, !611, !611, !611}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !619, file: !614, line: 144, baseType: !871, size: 64, offset: 5888)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !619, file: !614, line: 145, baseType: !993, size: 64, offset: 5952)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !619, file: !614, line: 147, baseType: !997, size: 64, offset: 6016)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !619, file: !614, line: 148, baseType: !871, size: 64, offset: 6080)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !619, file: !614, line: 149, baseType: !993, size: 64, offset: 6144)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !619, file: !614, line: 150, baseType: !997, size: 64, offset: 6208)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !619, file: !614, line: 151, baseType: !1007, size: 64, offset: 6272)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!398, !611, !562}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !619, file: !614, line: 153, baseType: !734, size: 64, offset: 6336)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !619, file: !614, line: 154, baseType: !734, size: 64, offset: 6400)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !619, file: !614, line: 155, baseType: !734, size: 64, offset: 6464)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !619, file: !614, line: 156, baseType: !734, size: 64, offset: 6528)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !619, file: !614, line: 157, baseType: !907, size: 64, offset: 6592)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !619, file: !614, line: 159, baseType: !1016, size: 64, offset: 6656)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!398, !611, !446, !627}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !619, file: !614, line: 160, baseType: !734, size: 64, offset: 6720)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !619, file: !614, line: 161, baseType: !734, size: 64, offset: 6784)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !619, file: !614, line: 162, baseType: !734, size: 64, offset: 6848)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !619, file: !614, line: 163, baseType: !734, size: 64, offset: 6912)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !619, file: !614, line: 165, baseType: !997, size: 64, offset: 6976)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !619, file: !614, line: 166, baseType: !997, size: 64, offset: 7040)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !619, file: !614, line: 167, baseType: !797, size: 64, offset: 7104)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !619, file: !614, line: 168, baseType: !1027, size: 64, offset: 7168)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!398, !611, !604, !446}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !619, file: !614, line: 169, baseType: !1031, size: 64, offset: 7232)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!398, !611, !711, !492}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !619, file: !614, line: 171, baseType: !758, size: 64, offset: 7296)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !619, file: !614, line: 172, baseType: !734, size: 64, offset: 7360)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !619, file: !614, line: 173, baseType: !1037, size: 64, offset: 7424)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!398, !611, !492, !821}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !619, file: !614, line: 174, baseType: !897, size: 64, offset: 7488)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !619, file: !614, line: 175, baseType: !897, size: 64, offset: 7552)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !619, file: !614, line: 177, baseType: !636, size: 64, offset: 7616)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !619, file: !614, line: 178, baseType: !683, size: 64, offset: 7680)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !619, file: !614, line: 179, baseType: !636, size: 64, offset: 7744)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !619, file: !614, line: 180, baseType: !640, size: 64, offset: 7808)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !619, file: !614, line: 181, baseType: !1047, size: 64, offset: 7872)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!398, !611, !402, !686, !687}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !619, file: !614, line: 183, baseType: !957, size: 64, offset: 7936)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !619, file: !614, line: 184, baseType: !718, size: 64, offset: 8000)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !619, file: !614, line: 185, baseType: !1053, size: 64, offset: 8064)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!398, !611, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !619, file: !614, line: 186, baseType: !1058, size: 64, offset: 8128)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!398, !611, !446, !625, !509}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !619, file: !614, line: 187, baseType: !777, size: 64, offset: 8192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !619, file: !614, line: 189, baseType: !1063, size: 64, offset: 8256)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!398, !611, !446, !446, !492, !627}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !619, file: !614, line: 190, baseType: !871, size: 64, offset: 8320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !619, file: !614, line: 191, baseType: !993, size: 64, offset: 8384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !619, file: !614, line: 192, baseType: !997, size: 64, offset: 8448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !619, file: !614, line: 193, baseType: !1070, size: 64, offset: 8512)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!398, !611, !829, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !39, line: 1401, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !614, line: 660, size: 5312, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1075, file: !614, line: 661, baseType: !383, size: 4480)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1075, file: !614, line: 661, baseType: !838, size: 32, offset: 4480)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1075, file: !614, line: 662, baseType: !446, size: 32, offset: 4512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1075, file: !614, line: 662, baseType: !446, size: 32, offset: 4544)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1075, file: !614, line: 662, baseType: !446, size: 32, offset: 4576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1075, file: !614, line: 663, baseType: !446, size: 32, offset: 4608)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1075, file: !614, line: 664, baseType: !446, size: 32, offset: 4640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1075, file: !614, line: 665, baseType: !492, size: 64, offset: 4672)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1075, file: !614, line: 666, baseType: !492, size: 64, offset: 4736)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1075, file: !614, line: 667, baseType: !446, size: 32, offset: 4800)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1075, file: !614, line: 668, baseType: !879, size: 32, offset: 4832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1075, file: !614, line: 670, baseType: !492, size: 64, offset: 4864)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1075, file: !614, line: 670, baseType: !492, size: 64, offset: 4928)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1075, file: !614, line: 671, baseType: !492, size: 64, offset: 4992)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1075, file: !614, line: 672, baseType: !492, size: 64, offset: 5056)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1075, file: !614, line: 673, baseType: !492, size: 64, offset: 5120)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1075, file: !614, line: 674, baseType: !446, size: 32, offset: 5184)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1075, file: !614, line: 675, baseType: !492, size: 64, offset: 5248)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !619, file: !614, line: 195, baseType: !1096, size: 64, offset: 8576)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!398, !1073, !611, !611}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !619, file: !614, line: 196, baseType: !1096, size: 64, offset: 8640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !619, file: !614, line: 197, baseType: !871, size: 64, offset: 8704)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !619, file: !614, line: 198, baseType: !993, size: 64, offset: 8768)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !619, file: !614, line: 199, baseType: !997, size: 64, offset: 8832)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !619, file: !614, line: 201, baseType: !1104, size: 64, offset: 8896)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!398, !611, !446, !446}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !619, file: !614, line: 202, baseType: !772, size: 64, offset: 8960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !619, file: !614, line: 203, baseType: !640, size: 64, offset: 9024)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !619, file: !614, line: 204, baseType: !826, size: 64, offset: 9088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !619, file: !614, line: 205, baseType: !957, size: 64, offset: 9152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !619, file: !614, line: 206, baseType: !1112, size: 64, offset: 9216)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!398, !402, !611, !446, !686, !687}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !619, file: !614, line: 208, baseType: !1116, size: 64, offset: 9280)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!398, !446, !782}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !619, file: !614, line: 209, baseType: !997, size: 64, offset: 9344)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !619, file: !614, line: 210, baseType: !789, size: 64, offset: 9408)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !613, file: !614, line: 438, baseType: !1122, size: 64, offset: 13952)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !654, line: 60, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !329, line: 240, size: 640, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1124, file: !329, line: 241, baseType: !402, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !329, line: 242, baseType: !463, size: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1124, file: !329, line: 243, baseType: !446, size: 32, offset: 96)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1124, file: !329, line: 243, baseType: !446, size: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1124, file: !329, line: 244, baseType: !446, size: 32, offset: 160)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1124, file: !329, line: 244, baseType: !446, size: 32, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1124, file: !329, line: 245, baseType: !492, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1124, file: !329, line: 246, baseType: !562, size: 32, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1124, file: !329, line: 247, baseType: !446, size: 32, offset: 352)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1124, file: !329, line: 251, baseType: !446, size: 32, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1124, file: !329, line: 252, baseType: !928, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1124, file: !329, line: 253, baseType: !562, size: 32, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1124, file: !329, line: 254, baseType: !446, size: 32, offset: 544)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1124, file: !329, line: 254, baseType: !446, size: 32, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1124, file: !329, line: 255, baseType: !446, size: 32, offset: 608)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !613, file: !614, line: 438, baseType: !1122, size: 64, offset: 14016)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !614, line: 439, baseType: !483, size: 64, offset: 14080)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !613, file: !614, line: 440, baseType: !1144, size: 32, offset: 14144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !39, line: 161, baseType: !297)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !613, file: !614, line: 441, baseType: !562, size: 32, offset: 14176)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !613, file: !614, line: 442, baseType: !562, size: 32, offset: 14208)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !613, file: !614, line: 443, baseType: !1148, size: 448, offset: 14272)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 448, elements: !1150)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !39, line: 1159, baseType: !423)
!1150 = !{!1151}
!1151 = !DISubrange(count: 7)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !613, file: !614, line: 444, baseType: !562, size: 32, offset: 14720)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !613, file: !614, line: 445, baseType: !562, size: 32, offset: 14752)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !613, file: !614, line: 446, baseType: !446, size: 32, offset: 14784)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !613, file: !614, line: 447, baseType: !485, size: 64, offset: 14848)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !613, file: !614, line: 448, baseType: !485, size: 64, offset: 14912)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !613, file: !614, line: 449, baseType: !694, size: 640, offset: 14976)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !613, file: !614, line: 450, baseType: !629, size: 32, offset: 15616)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !613, file: !614, line: 451, baseType: !1160, size: 2880, offset: 15680)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !614, line: 318, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !614, line: 319, size: 2880, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1182, !1183, !1188, !1193, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1208, !1209, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1241, !1242, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1265, !1266, !1267, !1271, !1272}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1161, file: !614, line: 320, baseType: !446, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1161, file: !614, line: 321, baseType: !446, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1161, file: !614, line: 322, baseType: !446, size: 32, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1161, file: !614, line: 323, baseType: !446, size: 32, offset: 96)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1161, file: !614, line: 324, baseType: !446, size: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1161, file: !614, line: 325, baseType: !446, size: 32, offset: 160)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1161, file: !614, line: 326, baseType: !1170, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !614, line: 293, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !614, line: 295, size: 448, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1172, file: !614, line: 296, baseType: !1170, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1172, file: !614, line: 297, baseType: !509, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1172, file: !614, line: 297, baseType: !509, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1172, file: !614, line: 298, baseType: !492, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1172, file: !614, line: 298, baseType: !492, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1172, file: !614, line: 299, baseType: !446, size: 32, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1172, file: !614, line: 300, baseType: !446, size: 32, offset: 352)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1172, file: !614, line: 301, baseType: !446, size: 32, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1161, file: !614, line: 326, baseType: !1170, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1161, file: !614, line: 328, baseType: !1184, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!398, !611, !1187, !492}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1161, file: !614, line: 329, baseType: !1189, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!398, !1187, !1192, !494, !494, !512, !492}
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1161, file: !614, line: 330, baseType: !1194, size: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!398, !1187}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1161, file: !614, line: 331, baseType: !1194, size: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1161, file: !614, line: 334, baseType: !402, size: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !614, line: 335, baseType: !463, size: 32, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1161, file: !614, line: 335, baseType: !463, size: 32, offset: 672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1161, file: !614, line: 336, baseType: !463, size: 32, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1161, file: !614, line: 336, baseType: !463, size: 32, offset: 736)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1161, file: !614, line: 337, baseType: !1204, size: 64, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !403, line: 339, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !403, line: 339, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1161, file: !614, line: 338, baseType: !1204, size: 64, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1161, file: !614, line: 339, baseType: !1210, size: 64, offset: 896)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !403, line: 341, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !403, line: 351, size: 192, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1212, file: !403, line: 354, baseType: !26, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1212, file: !403, line: 355, baseType: !26, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1212, file: !403, line: 356, baseType: !26, size: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1212, file: !403, line: 361, baseType: !26, size: 32, offset: 96)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1212, file: !403, line: 362, baseType: !558, size: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1161, file: !614, line: 340, baseType: !446, size: 32, offset: 960)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1161, file: !614, line: 340, baseType: !446, size: 32, offset: 992)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1161, file: !614, line: 341, baseType: !509, size: 64, offset: 1024)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1161, file: !614, line: 342, baseType: !492, size: 64, offset: 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1161, file: !614, line: 343, baseType: !512, size: 64, offset: 1152)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1161, file: !614, line: 344, baseType: !494, size: 64, offset: 1216)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1161, file: !614, line: 345, baseType: !446, size: 32, offset: 1280)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1161, file: !614, line: 346, baseType: !1192, size: 64, offset: 1344)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1161, file: !614, line: 347, baseType: !562, size: 32, offset: 1408)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1161, file: !614, line: 348, baseType: !446, size: 32, offset: 1440)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1161, file: !614, line: 351, baseType: !562, size: 32, offset: 1472)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1161, file: !614, line: 352, baseType: !562, size: 32, offset: 1504)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1161, file: !614, line: 353, baseType: !463, size: 32, offset: 1536)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1161, file: !614, line: 354, baseType: !463, size: 32, offset: 1568)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1161, file: !614, line: 355, baseType: !1192, size: 64, offset: 1600)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1161, file: !614, line: 356, baseType: !1192, size: 64, offset: 1664)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1161, file: !614, line: 357, baseType: !1236, size: 64, offset: 1728)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !614, line: 310, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 308, size: 32, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1238, file: !614, line: 309, baseType: !446, size: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1161, file: !614, line: 357, baseType: !1236, size: 64, offset: 1792)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1161, file: !614, line: 358, baseType: !1243, size: 64, offset: 1856)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !614, line: 316, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 312, size: 128, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1245, file: !614, line: 313, baseType: !483, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1245, file: !614, line: 314, baseType: !446, size: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1245, file: !614, line: 315, baseType: !425, size: 8, offset: 96)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1161, file: !614, line: 359, baseType: !1243, size: 64, offset: 1920)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1161, file: !614, line: 360, baseType: !1243, size: 64, offset: 1984)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1161, file: !614, line: 361, baseType: !446, size: 32, offset: 2048)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1161, file: !614, line: 362, baseType: !463, size: 32, offset: 2080)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1161, file: !614, line: 363, baseType: !446, size: 32, offset: 2112)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1161, file: !614, line: 364, baseType: !1192, size: 64, offset: 2176)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1161, file: !614, line: 365, baseType: !1210, size: 64, offset: 2240)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1161, file: !614, line: 366, baseType: !463, size: 32, offset: 2304)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1161, file: !614, line: 367, baseType: !463, size: 32, offset: 2336)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1161, file: !614, line: 368, baseType: !1204, size: 64, offset: 2368)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1161, file: !614, line: 369, baseType: !1204, size: 64, offset: 2432)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1161, file: !614, line: 370, baseType: !1262, size: 64, offset: 2496)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1161, file: !614, line: 371, baseType: !1262, size: 64, offset: 2560)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1161, file: !614, line: 372, baseType: !1262, size: 64, offset: 2624)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1161, file: !614, line: 373, baseType: !1268, size: 64, offset: 2688)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !403, line: 331, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !403, line: 331, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1161, file: !614, line: 374, baseType: !558, size: 64, offset: 2752)
