; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfmpi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfmpi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_request_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 24, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !{!71, !369, !126, !160, !608, !229, !78, !129, !157, !430, !181, !205, !366, !620}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Basic", file: !73, line: 41, baseType: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 26, size: 1152, elements: !75)
!75 = !{!76, !79, !80, !82, !84, !86, !87, !91, !93, !96, !97, !112, !113, !114, !115, !619}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !74, file: !73, line: 27, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !78)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !74, file: !73, line: 27, baseType: !77, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !74, file: !73, line: 27, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !74, file: !73, line: 27, baseType: !83, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !78)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !74, file: !73, line: 27, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !74, file: !73, line: 27, baseType: !85, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !74, file: !73, line: 27, baseType: !88, size: 128, offset: 320)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !74, file: !73, line: 27, baseType: !92, size: 64, offset: 448)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !89)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !74, file: !73, line: 27, baseType: !94, size: 64, offset: 512)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !89)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !74, file: !73, line: 27, baseType: !92, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !74, file: !73, line: 27, baseType: !98, size: 128, offset: 640)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !89)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !60, line: 41, size: 576, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !101, file: !60, line: 42, baseType: !85, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !101, file: !60, line: 43, baseType: !83, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !101, file: !60, line: 44, baseType: !85, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !101, file: !60, line: 45, baseType: !85, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !101, file: !60, line: 46, baseType: !85, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !101, file: !60, line: 46, baseType: !85, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !101, file: !60, line: 46, baseType: !85, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !101, file: !60, line: 47, baseType: !85, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !101, file: !60, line: 47, baseType: !85, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !74, file: !73, line: 27, baseType: !98, size: 128, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !74, file: !73, line: 27, baseType: !94, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !74, file: !73, line: 27, baseType: !83, size: 32, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !74, file: !73, line: 27, baseType: !116, size: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !73, line: 6, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !60, line: 52, size: 6592, elements: !119)
!119 = !{!120, !132, !521, !522, !523, !524, !528, !529, !533, !534, !535, !539, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !559, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !599, !600, !602, !603, !604, !605, !612, !613, !615, !616, !617, !618}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !118, file: !60, line: 53, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !116, !125, !126, !125, !127, !129}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !78)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !118, file: !60, line: 54, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!124, !136, !116, !520}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !137, line: 15, baseType: !138)
!137 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !140)
!140 = !{!141, !339, !435, !450, !451, !452, !453, !454, !455, !456, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !482, !483, !484, !485, !487, !488, !513, !514, !515, !516, !517, !519}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !139, file: !44, line: 67, baseType: !142, size: 4480)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !143, line: 122, baseType: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !143, line: 73, size: 4480, elements: !145)
!145 = !{!146, !148, !202, !203, !204, !207, !208, !209, !210, !218, !219, !220, !224, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !241, !242, !243, !245, !246, !247, !249, !250, !251, !252, !253, !256, !258, !259, !260, !261, !262, !265, !267, !268, !269, !277, !278, !279, !283, !284, !329, !334, !336, !337, !338}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !144, file: !143, line: 74, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !78)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !144, file: !143, line: 75, baseType: !149, size: 448, offset: 64)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 448, elements: !200)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !143, line: 53, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 45, size: 448, elements: !152)
!152 = !{!153, !164, !172, !177, !184, !188, !195}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !151, file: !143, line: 46, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!124, !157, !159}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !161, line: 330, baseType: !162)
!161 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !161, line: 330, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !151, file: !143, line: 47, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!124, !157, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !169, line: 16, baseType: !170)
!169 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !169, line: 16, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !151, file: !143, line: 48, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!124, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !151, file: !143, line: 49, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!124, !157, !181, !157}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !151, file: !143, line: 50, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!124, !157, !181, !176}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !151, file: !143, line: 51, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!124, !157, !181, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !151, file: !143, line: 52, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!124, !157, !181, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !144, file: !143, line: 76, baseType: !160, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !143, line: 77, baseType: !83, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !144, file: !143, line: 78, baseType: !205, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !206)
!206 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !144, file: !143, line: 78, baseType: !205, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !144, file: !143, line: 78, baseType: !205, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !144, file: !143, line: 78, baseType: !205, size: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !144, file: !143, line: 79, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !214, line: 27, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !216, line: 43, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !144, file: !143, line: 80, baseType: !83, size: 32, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !144, file: !143, line: 81, baseType: !77, size: 32, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !144, file: !143, line: 82, baseType: !221, size: 64, offset: 1024)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !144, file: !143, line: 83, baseType: !225, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !144, file: !143, line: 84, baseType: !229, size: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !144, file: !143, line: 85, baseType: !229, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !144, file: !143, line: 86, baseType: !229, size: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !144, file: !143, line: 87, baseType: !229, size: 64, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !144, file: !143, line: 88, baseType: !157, size: 64, offset: 1408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !144, file: !143, line: 89, baseType: !211, size: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !143, line: 90, baseType: !229, size: 64, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !144, file: !143, line: 91, baseType: !229, size: 64, offset: 1600)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !144, file: !143, line: 92, baseType: !83, size: 32, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !144, file: !143, line: 93, baseType: !126, size: 64, offset: 1728)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !144, file: !143, line: 94, baseType: !240, size: 64, offset: 1792)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !212)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !144, file: !143, line: 95, baseType: !83, size: 32, offset: 1856)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !144, file: !143, line: 95, baseType: !83, size: 32, offset: 1888)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !144, file: !143, line: 96, baseType: !244, size: 64, offset: 1920)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !144, file: !143, line: 96, baseType: !244, size: 64, offset: 1984)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !144, file: !143, line: 97, baseType: !85, size: 64, offset: 2048)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !144, file: !143, line: 97, baseType: !248, size: 64, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !144, file: !143, line: 98, baseType: !83, size: 32, offset: 2176)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !144, file: !143, line: 98, baseType: !83, size: 32, offset: 2208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !144, file: !143, line: 99, baseType: !244, size: 64, offset: 2240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !144, file: !143, line: 99, baseType: !244, size: 64, offset: 2304)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !144, file: !143, line: 100, baseType: !254, size: 64, offset: 2368)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !206)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !144, file: !143, line: 100, baseType: !257, size: 64, offset: 2432)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !144, file: !143, line: 101, baseType: !83, size: 32, offset: 2496)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !144, file: !143, line: 101, baseType: !83, size: 32, offset: 2528)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !144, file: !143, line: 102, baseType: !244, size: 64, offset: 2560)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !144, file: !143, line: 102, baseType: !244, size: 64, offset: 2624)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !144, file: !143, line: 103, baseType: !263, size: 64, offset: 2688)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !255)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !144, file: !143, line: 103, baseType: !266, size: 64, offset: 2752)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !144, file: !143, line: 104, baseType: !199, size: 64, offset: 2816)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !144, file: !143, line: 105, baseType: !83, size: 32, offset: 2880)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !144, file: !143, line: 106, baseType: !270, size: 128, offset: 2944)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !89)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !143, line: 64, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 61, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !273, file: !143, line: 62, baseType: !192, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !273, file: !143, line: 63, baseType: !126, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !144, file: !143, line: 107, baseType: !92, size: 64, offset: 3072)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !144, file: !143, line: 108, baseType: !126, size: 64, offset: 3136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !144, file: !143, line: 109, baseType: !280, size: 64, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!124, !126}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !144, file: !143, line: 111, baseType: !83, size: 32, offset: 3264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !144, file: !143, line: 112, baseType: !285, size: 320, offset: 3328)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !327)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!124, !289, !157, !126}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !292)
!292 = !{!293, !294, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !291, file: !10, line: 100, baseType: !83, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !10, line: 101, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !306, !307, !308, !309, !310, !312, !313, !314}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !297, file: !10, line: 84, baseType: !229, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !297, file: !10, line: 85, baseType: !229, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !10, line: 86, baseType: !126, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !297, file: !10, line: 87, baseType: !221, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !10, line: 88, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !297, file: !10, line: 89, baseType: !183, size: 8, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !297, file: !10, line: 90, baseType: !229, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !297, file: !10, line: 91, baseType: !129, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !297, file: !10, line: 92, baseType: !95, size: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !10, line: 93, baseType: !311, size: 32, offset: 544)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 94, baseType: !295, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !297, file: !10, line: 95, baseType: !229, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !297, file: !10, line: 96, baseType: !126, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !10, line: 102, baseType: !229, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !291, file: !10, line: 102, baseType: !229, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !291, file: !10, line: 103, baseType: !229, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !291, file: !10, line: 104, baseType: !160, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !291, file: !10, line: 105, baseType: !95, size: 32, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !291, file: !10, line: 105, baseType: !95, size: 32, offset: 416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !291, file: !10, line: 105, baseType: !95, size: 32, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !291, file: !10, line: 106, baseType: !157, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !291, file: !10, line: 107, baseType: !324, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!327 = !{!328}
!328 = !DISubrange(count: 5)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !144, file: !143, line: 113, baseType: !330, size: 320, offset: 3648)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 320, elements: !327)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!124, !157, !126}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !144, file: !143, line: 114, baseType: !335, size: 320, offset: 3968)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !327)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !144, file: !143, line: 115, baseType: !95, size: 32, offset: 4288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !144, file: !143, line: 120, baseType: !324, size: 64, offset: 4352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !144, file: !143, line: 121, baseType: !95, size: 32, offset: 4416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !139, file: !44, line: 67, baseType: !340, size: 1344, offset: 4480)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 1344, elements: !200)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !342)
!342 = !{!343, !347, !348, !349, !353, !357, !362, !372, !376, !377, !378, !382, !386, !390, !400, !404, !409, !421, !425, !426, !431}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !341, file: !44, line: 40, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!124, !136}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !341, file: !44, line: 41, baseType: !344, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !341, file: !44, line: 42, baseType: !344, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !341, file: !44, line: 43, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!124, !289, !136}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !341, file: !44, line: 44, baseType: !354, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!124, !136, !168}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !341, file: !44, line: 45, baseType: !358, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!124, !136, !361, !136}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !341, file: !44, line: 46, baseType: !363, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!124, !136, !366, !125, !127, !125, !126, !369}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !161, line: 331, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !161, line: 331, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !161, line: 338, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !161, line: 338, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !341, file: !44, line: 47, baseType: !373, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!124, !136, !366, !127, !126, !369}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !341, file: !44, line: 48, baseType: !363, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !341, file: !44, line: 49, baseType: !373, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !341, file: !44, line: 50, baseType: !379, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!124, !136, !366, !125, !126, !125, !127, !126, !369}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !341, file: !44, line: 51, baseType: !383, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!124, !136, !366, !126, !127, !126, !369}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !341, file: !44, line: 52, baseType: !387, size: 64, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!124, !136, !366, !125, !127, !125, !126}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !341, file: !44, line: 53, baseType: !391, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!124, !136, !85, !394, !397, !397, !397}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !341, file: !44, line: 54, baseType: !401, size: 64, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!124, !136, !85, !394, !397, !397}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !341, file: !44, line: 55, baseType: !405, size: 64, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!124, !136, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !341, file: !44, line: 56, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!124, !136, !85, !85, !397, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !137, line: 49, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 46, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !417, file: !137, line: 47, baseType: !83, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !417, file: !137, line: 48, baseType: !83, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !341, file: !44, line: 57, baseType: !422, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!124, !136, !83, !398, !408}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !341, file: !44, line: 58, baseType: !422, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !341, file: !44, line: 60, baseType: !427, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!124, !125, !129, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !341, file: !44, line: 61, baseType: !432, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!124, !125, !126}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !139, file: !44, line: 78, baseType: !436, size: 512, offset: 5824)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !44, line: 68, size: 512, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !445, !446, !447, !448, !449}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !436, file: !44, line: 69, baseType: !83, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !436, file: !44, line: 69, baseType: !83, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !436, file: !44, line: 70, baseType: !95, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !436, file: !44, line: 71, baseType: !95, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !436, file: !44, line: 72, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !436, file: !44, line: 73, baseType: !263, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !436, file: !44, line: 74, baseType: !136, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !436, file: !44, line: 75, baseType: !83, size: 32, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !436, file: !44, line: 76, baseType: !366, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !436, file: !44, line: 77, baseType: !95, size: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !139, file: !44, line: 81, baseType: !83, size: 32, offset: 6336)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !139, file: !44, line: 82, baseType: !83, size: 32, offset: 6368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !139, file: !44, line: 83, baseType: !85, size: 64, offset: 6400)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !139, file: !44, line: 84, baseType: !85, size: 64, offset: 6464)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !139, file: !44, line: 85, baseType: !83, size: 32, offset: 6528)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !139, file: !44, line: 85, baseType: !83, size: 32, offset: 6560)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !139, file: !44, line: 86, baseType: !457, size: 64, offset: 6592)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !139, file: !44, line: 87, baseType: !457, size: 64, offset: 6656)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !139, file: !44, line: 88, baseType: !83, size: 32, offset: 6720)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !139, file: !44, line: 89, baseType: !83, size: 32, offset: 6752)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !139, file: !44, line: 90, baseType: !81, size: 64, offset: 6784)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !139, file: !44, line: 91, baseType: !85, size: 64, offset: 6848)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !139, file: !44, line: 92, baseType: !85, size: 64, offset: 6912)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !139, file: !44, line: 93, baseType: !88, size: 128, offset: 6976)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !139, file: !44, line: 96, baseType: !92, size: 64, offset: 7104)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !139, file: !44, line: 97, baseType: !94, size: 64, offset: 7168)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !139, file: !44, line: 98, baseType: !92, size: 64, offset: 7232)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !139, file: !44, line: 99, baseType: !98, size: 128, offset: 7296)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !139, file: !44, line: 100, baseType: !98, size: 128, offset: 7424)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !139, file: !44, line: 101, baseType: !94, size: 64, offset: 7552)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !139, file: !44, line: 103, baseType: !83, size: 32, offset: 7616)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !139, file: !44, line: 104, baseType: !85, size: 64, offset: 7680)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !139, file: !44, line: 105, baseType: !95, size: 32, offset: 7744)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !139, file: !44, line: 106, baseType: !85, size: 64, offset: 7808)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !139, file: !44, line: 107, baseType: !85, size: 64, offset: 7872)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !139, file: !44, line: 108, baseType: !95, size: 32, offset: 7936)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !139, file: !44, line: 109, baseType: !478, size: 64, offset: 8000)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !161, line: 336, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !161, line: 336, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !139, file: !44, line: 110, baseType: !478, size: 64, offset: 8064)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !139, file: !44, line: 111, baseType: !136, size: 64, offset: 8128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !139, file: !44, line: 112, baseType: !95, size: 32, offset: 8192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !139, file: !44, line: 113, baseType: !95, size: 32, offset: 8224)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !139, file: !44, line: 114, baseType: !486, size: 32, offset: 8256)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !139, file: !44, line: 115, baseType: !95, size: 32, offset: 8288)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !139, file: !44, line: 116, baseType: !489, size: 64, offset: 8320)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !490, line: 60, baseType: !491)
!490 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !493, line: 240, size: 640, elements: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !509, !510, !511, !512}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !492, file: !493, line: 241, baseType: !160, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !493, line: 242, baseType: !77, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !492, file: !493, line: 243, baseType: !83, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !492, file: !493, line: 243, baseType: !83, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !492, file: !493, line: 244, baseType: !83, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !492, file: !493, line: 244, baseType: !83, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !492, file: !493, line: 245, baseType: !85, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !492, file: !493, line: 246, baseType: !95, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !492, file: !493, line: 247, baseType: !83, size: 32, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !492, file: !493, line: 251, baseType: !83, size: 32, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !492, file: !493, line: 252, baseType: !506, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !490, line: 30, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !490, line: 30, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !492, file: !493, line: 253, baseType: !95, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !492, file: !493, line: 254, baseType: !83, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !492, file: !493, line: 254, baseType: !83, size: 32, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !492, file: !493, line: 255, baseType: !83, size: 32, offset: 608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !139, file: !44, line: 117, baseType: !95, size: 32, offset: 8384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !139, file: !44, line: 118, baseType: !95, size: 32, offset: 8416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !139, file: !44, line: 119, baseType: !95, size: 32, offset: 8448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !139, file: !44, line: 120, baseType: !83, size: 32, offset: 8480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !139, file: !44, line: 121, baseType: !518, size: 32, offset: 8512)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !44, line: 122, baseType: !126, size: 64, offset: 8576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !55)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !118, file: !60, line: 55, baseType: !133, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !118, file: !60, line: 56, baseType: !133, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !118, file: !60, line: 57, baseType: !133, size: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !118, file: !60, line: 58, baseType: !525, size: 64, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!124, !116}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !118, file: !60, line: 59, baseType: !525, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !118, file: !60, line: 60, baseType: !530, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!124, !136, !116}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !118, file: !60, line: 62, baseType: !133, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !118, file: !60, line: 63, baseType: !133, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !118, file: !60, line: 65, baseType: !536, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!124, !116, !83, !83, !99, !398, !127, !126}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !118, file: !60, line: 66, baseType: !540, size: 64, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!124, !116, !83, !83, !99, !398, !126, !127}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !118, file: !60, line: 67, baseType: !540, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !118, file: !60, line: 68, baseType: !540, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !118, file: !60, line: 69, baseType: !540, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !118, file: !60, line: 70, baseType: !540, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !118, file: !60, line: 71, baseType: !540, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !118, file: !60, line: 72, baseType: !540, size: 64, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !118, file: !60, line: 73, baseType: !540, size: 64, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !118, file: !60, line: 74, baseType: !540, size: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !118, file: !60, line: 75, baseType: !540, size: 64, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !118, file: !60, line: 76, baseType: !540, size: 64, offset: 1344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !118, file: !60, line: 77, baseType: !540, size: 64, offset: 1408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !118, file: !60, line: 78, baseType: !540, size: 64, offset: 1472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !118, file: !60, line: 79, baseType: !556, size: 64, offset: 1536)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!124, !116, !83, !83, !99, !398, !126, !126}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !118, file: !60, line: 81, baseType: !560, size: 64, offset: 1600)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!124, !116, !83, !83, !99, !398, !127, !83, !99, !398, !126}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !118, file: !60, line: 82, baseType: !560, size: 64, offset: 1664)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !118, file: !60, line: 83, baseType: !560, size: 64, offset: 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !118, file: !60, line: 84, baseType: !560, size: 64, offset: 1792)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !118, file: !60, line: 85, baseType: !560, size: 64, offset: 1856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !118, file: !60, line: 86, baseType: !560, size: 64, offset: 1920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !118, file: !60, line: 87, baseType: !560, size: 64, offset: 1984)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !118, file: !60, line: 88, baseType: !560, size: 64, offset: 2048)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !118, file: !60, line: 89, baseType: !560, size: 64, offset: 2112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !118, file: !60, line: 90, baseType: !560, size: 64, offset: 2176)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !118, file: !60, line: 91, baseType: !560, size: 64, offset: 2240)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !118, file: !60, line: 92, baseType: !560, size: 64, offset: 2304)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !118, file: !60, line: 93, baseType: !560, size: 64, offset: 2368)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !118, file: !60, line: 95, baseType: !576, size: 64, offset: 2432)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!124, !116, !83, !83, !99, !398, !126, !83, !99, !398, !127, !126}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !118, file: !60, line: 97, baseType: !95, size: 32, offset: 2496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !118, file: !60, line: 168, baseType: !77, size: 32, offset: 2528)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !118, file: !60, line: 169, baseType: !366, size: 64, offset: 2560)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !118, file: !60, line: 170, baseType: !366, size: 64, offset: 2624)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !118, file: !60, line: 171, baseType: !95, size: 32, offset: 2688)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !118, file: !60, line: 172, baseType: !129, size: 64, offset: 2752)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !118, file: !60, line: 173, baseType: !83, size: 32, offset: 2816)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !118, file: !60, line: 174, baseType: !127, size: 64, offset: 2880)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !118, file: !60, line: 174, baseType: !127, size: 64, offset: 2944)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !118, file: !60, line: 175, baseType: !125, size: 32, offset: 3008)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !118, file: !60, line: 175, baseType: !125, size: 32, offset: 3040)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !118, file: !60, line: 178, baseType: !125, size: 32, offset: 3072)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !118, file: !60, line: 178, baseType: !125, size: 32, offset: 3104)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !118, file: !60, line: 179, baseType: !94, size: 64, offset: 3136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !118, file: !60, line: 179, baseType: !94, size: 64, offset: 3200)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !118, file: !60, line: 180, baseType: !83, size: 32, offset: 3264)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !118, file: !60, line: 180, baseType: !83, size: 32, offset: 3296)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !118, file: !60, line: 181, baseType: !597, size: 256, offset: 3328)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 256, elements: !598)
!598 = !{!90, !90}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !118, file: !60, line: 182, baseType: !597, size: 256, offset: 3584)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !118, file: !60, line: 183, baseType: !601, size: 256, offset: 3840)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !598)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !118, file: !60, line: 185, baseType: !601, size: 256, offset: 4096)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !118, file: !60, line: 186, baseType: !601, size: 256, offset: 4352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !118, file: !60, line: 187, baseType: !601, size: 256, offset: 4608)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !118, file: !60, line: 188, baseType: !606, size: 512, offset: 4864)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 512, elements: !611)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !161, line: 339, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !161, line: 339, flags: DIFlagFwdDecl)
!611 = !{!90, !90, !90}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !118, file: !60, line: 189, baseType: !606, size: 512, offset: 5376)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !118, file: !60, line: 190, baseType: !614, size: 256, offset: 5888)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !611)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !118, file: !60, line: 191, baseType: !614, size: 256, offset: 6144)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !118, file: !60, line: 192, baseType: !607, size: 64, offset: 6400)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !60, line: 193, baseType: !116, size: 64, offset: 6464)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !118, file: !60, line: 195, baseType: !95, size: 32, offset: 6528)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !74, file: !73, line: 27, baseType: !116, size: 64, offset: 1088)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !161, line: 341, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !161, line: 351, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !622, file: !161, line: 354, baseType: !78, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !622, file: !161, line: 355, baseType: !78, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !622, file: !161, line: 356, baseType: !78, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !622, file: !161, line: 361, baseType: !78, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !622, file: !161, line: 362, baseType: !129, size: 64, offset: 128)
!629 = !{i32 7, !"Dwarf Version", i32 4}
!630 = !{i32 2, !"Debug Info Version", i32 3}
!631 = !{i32 1, !"wchar_size", i32 4}
!632 = !{i32 7, !"PIC Level", i32 2}
!633 = !{i32 7, !"uwtable", i32 1}
!634 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!635 = distinct !DISubprogram(name: "PetscSFLinkCreate_MPI", scope: !636, file: !636, line: 80, type: !637, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !641)
!636 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/sfmpi.c", directory: "/home/users/ndemeye/xSDK")
!637 = !DISubroutineType(types: !638)
!638 = !{!124, !136, !366, !125, !127, !125, !127, !369, !639, !640}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFOperation", file: !44, line: 35, baseType: !50)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !679, !690, !696, !697, !706, !709, !710, !712, !714, !716, !718, !729, !737}
!642 = !DILocalVariable(name: "sf", arg: 1, scope: !635, file: !636, line: 80, type: !136)
!643 = !DILocalVariable(name: "unit", arg: 2, scope: !635, file: !636, line: 80, type: !366)
!644 = !DILocalVariable(name: "xrootmtype", arg: 3, scope: !635, file: !636, line: 80, type: !125)
!645 = !DILocalVariable(name: "rootdata", arg: 4, scope: !635, file: !636, line: 80, type: !127)
!646 = !DILocalVariable(name: "xleafmtype", arg: 5, scope: !635, file: !636, line: 80, type: !125)
!647 = !DILocalVariable(name: "leafdata", arg: 6, scope: !635, file: !636, line: 80, type: !127)
!648 = !DILocalVariable(name: "op", arg: 7, scope: !635, file: !636, line: 80, type: !369)
!649 = !DILocalVariable(name: "sfop", arg: 8, scope: !635, file: !636, line: 80, type: !639)
!650 = !DILocalVariable(name: "mylink", arg: 9, scope: !635, file: !636, line: 80, type: !640)
!651 = !DILocalVariable(name: "ierr", scope: !635, file: !636, line: 82, type: !124)
!652 = !DILocalVariable(name: "bas", scope: !635, file: !636, line: 83, type: !71)
!653 = !DILocalVariable(name: "i", scope: !635, file: !636, line: 84, type: !83)
!654 = !DILocalVariable(name: "j", scope: !635, file: !636, line: 84, type: !83)
!655 = !DILocalVariable(name: "k", scope: !635, file: !636, line: 84, type: !83)
!656 = !DILocalVariable(name: "nrootreqs", scope: !635, file: !636, line: 84, type: !83)
!657 = !DILocalVariable(name: "nleafreqs", scope: !635, file: !636, line: 84, type: !83)
!658 = !DILocalVariable(name: "nreqs", scope: !635, file: !636, line: 84, type: !83)
!659 = !DILocalVariable(name: "p", scope: !635, file: !636, line: 85, type: !640)
!660 = !DILocalVariable(name: "link", scope: !635, file: !636, line: 85, type: !116)
!661 = !DILocalVariable(name: "direction", scope: !635, file: !636, line: 86, type: !520)
!662 = !DILocalVariable(name: "reqs", scope: !635, file: !636, line: 87, type: !607)
!663 = !DILocalVariable(name: "match", scope: !635, file: !636, line: 88, type: !95)
!664 = !DILocalVariable(name: "rootdirect", scope: !635, file: !636, line: 88, type: !94)
!665 = !DILocalVariable(name: "leafdirect", scope: !635, file: !636, line: 88, type: !94)
!666 = !DILocalVariable(name: "rootmtype", scope: !635, file: !636, line: 89, type: !125)
!667 = !DILocalVariable(name: "leafmtype", scope: !635, file: !636, line: 90, type: !125)
!668 = !DILocalVariable(name: "rootmtype_mpi", scope: !635, file: !636, line: 91, type: !125)
!669 = !DILocalVariable(name: "leafmtype_mpi", scope: !635, file: !636, line: 91, type: !125)
!670 = !DILocalVariable(name: "rootdirect_mpi", scope: !635, file: !636, line: 92, type: !83)
