; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/classlog.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/classlog.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._Action = type { i32, i32, i32, double, double, double, double, i32, i32, i32 }
%struct._Object = type { %struct._p_PetscObject*, i32, double, [64 x i8], [64 x i8] }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 663, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!17 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 81, baseType: !5, size: 32, elements: !37)
!36 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!44 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!45 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!46 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!48 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!49 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!50 = !{!51, !54, !58, !59, !62}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 46, baseType: !53)
!52 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !55, line: 330, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !55, line: 330, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!63 = !{i32 7, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{i32 7, !"PIC Level", i32 2}
!67 = !{i32 7, !"uwtable", i32 1}
!68 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!69 = distinct !DISubprogram(name: "PetscClassRegLogCreate", scope: !70, file: !70, line: 22, type: !71, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !91)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/logging/utils/classlog.c", directory: "/home/users/ndemeye/xSDK")
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !75}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !74)
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassRegLog", file: !77, line: 127, baseType: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscClassRegLog", file: !77, line: 128, size: 128, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "numClasses", scope: !79, file: !77, line: 129, baseType: !74, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "maxClasses", scope: !79, file: !77, line: 130, baseType: !74, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "classInfo", scope: !79, file: !77, line: 131, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassRegInfo", file: !77, line: 117, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 114, size: 128, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !77, line: 115, baseType: !62, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !86, file: !77, line: 116, baseType: !90, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !74)
!91 = !{!92, !93, !94, !95, !97}
!92 = !DILocalVariable(name: "classLog", arg: 1, scope: !69, file: !70, line: 22, type: !75)
!93 = !DILocalVariable(name: "l", scope: !69, file: !70, line: 24, type: !76)
!94 = !DILocalVariable(name: "ierr", scope: !69, file: !70, line: 25, type: !73)
!95 = !DILocalVariable(name: "ierr__", scope: !96, file: !70, line: 28, type: !73)
!96 = distinct !DILexicalBlock(scope: !69, file: !70, line: 28, column: 23)
!97 = !DILocalVariable(name: "ierr__", scope: !98, file: !70, line: 33, type: !73)
!98 = distinct !DILexicalBlock(scope: !69, file: !70, line: 33, column: 53)
!99 = !DILocation(line: 0, scope: !69)
!100 = !DILocation(line: 24, column: 3, scope: !69)
!101 = !DILocation(line: 27, column: 3, scope: !102)
!102 = distinct !DILexicalBlock(scope: !103, file: !70, line: 27, column: 3)
!103 = distinct !DILexicalBlock(scope: !104, file: !70, line: 27, column: 3)
!104 = distinct !DILexicalBlock(scope: !69, file: !70, line: 27, column: 3)
!105 = !{!106, !106, i64 0}
!106 = !{!"any pointer", !107, i64 0}
!107 = !{!"omnipotent char", !108, i64 0}
!108 = !{!"Simple C/C++ TBAA"}
!109 = !DILocation(line: 27, column: 3, scope: !103)
!110 = !DILocation(line: 27, column: 3, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !70, line: 27, column: 3)
!112 = distinct !DILexicalBlock(scope: !102, file: !70, line: 27, column: 3)
!113 = !{!114, !115, i64 1536}
!114 = !{!"", !107, i64 0, !107, i64 512, !107, i64 1024, !107, i64 1280, !115, i64 1536, !115, i64 1540, !107, i64 1544}
!115 = !{!"int", !107, i64 0}
!116 = !DILocation(line: 27, column: 3, scope: !112)
!117 = !DILocation(line: 27, column: 3, scope: !118)
!118 = distinct !DILexicalBlock(scope: !111, file: !70, line: 27, column: 3)
!119 = !{!115, !115, i64 0}
!120 = !{!114, !115, i64 1540}
!121 = !DILocation(line: 28, column: 10, scope: !69)
!122 = !DILocation(line: 0, scope: !96)
!123 = !DILocation(line: 28, column: 23, scope: !124)
!124 = distinct !DILexicalBlock(scope: !96, file: !70, line: 28, column: 23)
!125 = !DILocation(line: 28, column: 23, scope: !96)
!126 = !{!"branch_weights", i32 2000, i32 1}
!127 = !DILocation(line: 30, column: 3, scope: !69)
!128 = !DILocation(line: 30, column: 6, scope: !69)
!129 = !DILocation(line: 30, column: 17, scope: !69)
!130 = !{!131, !115, i64 0}
!131 = !{!"_n_PetscClassRegLog", !115, i64 0, !115, i64 4, !106, i64 8}
!132 = !DILocation(line: 31, column: 6, scope: !69)
!133 = !DILocation(line: 31, column: 17, scope: !69)
!134 = !{!131, !115, i64 4}
!135 = !DILocation(line: 33, column: 10, scope: !69)
!136 = !DILocation(line: 0, scope: !98)
!137 = !DILocation(line: 33, column: 53, scope: !138)
!138 = distinct !DILexicalBlock(scope: !98, file: !70, line: 33, column: 53)
!139 = !DILocation(line: 33, column: 53, scope: !98)
!140 = !DILocation(line: 35, column: 15, scope: !69)
!141 = !DILocation(line: 35, column: 13, scope: !69)
!142 = !DILocation(line: 36, column: 3, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !70, line: 36, column: 3)
!144 = distinct !DILexicalBlock(scope: !145, file: !70, line: 36, column: 3)
!145 = distinct !DILexicalBlock(scope: !69, file: !70, line: 36, column: 3)
!146 = !DILocation(line: 36, column: 3, scope: !144)
!147 = !DILocation(line: 36, column: 3, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !70, line: 36, column: 3)
!149 = distinct !DILexicalBlock(scope: !143, file: !70, line: 36, column: 3)
!150 = !DILocation(line: 36, column: 3, scope: !149)
!151 = !DILocation(line: 36, column: 3, scope: !152)
!152 = distinct !DILexicalBlock(scope: !153, file: !70, line: 36, column: 3)
!153 = distinct !DILexicalBlock(scope: !148, file: !70, line: 36, column: 3)
!154 = !{!114, !107, i64 1544}
!155 = !DILocation(line: 36, column: 3, scope: !153)
!156 = !DILocation(line: 36, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !152, file: !70, line: 36, column: 3)
!158 = !DILocation(line: 36, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !148, file: !70, line: 36, column: 3)
!160 = !DILocation(line: 36, column: 3, scope: !161)
!161 = distinct !DILexicalBlock(scope: !159, file: !70, line: 36, column: 3)
!162 = !DILocation(line: 36, column: 3, scope: !163)
!163 = distinct !DILexicalBlock(scope: !164, file: !70, line: 36, column: 3)
!164 = distinct !DILexicalBlock(scope: !161, file: !70, line: 36, column: 3)
!165 = !DILocation(line: 36, column: 3, scope: !164)
!166 = !DILocation(line: 36, column: 3, scope: !167)
!167 = distinct !DILexicalBlock(scope: !163, file: !70, line: 36, column: 3)
!168 = !DILocation(line: 37, column: 1, scope: !69)
!169 = !DISubprogram(name: "PetscMallocA", scope: !170, file: !170, line: 1288, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !173)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!171 = !DISubroutineType(types: !172)
!172 = !{!73, !74, !3, !74, !59, !59, !53, !58, null}
!173 = !{}
!174 = !DISubprogram(name: "PetscError", scope: !10, file: !10, line: 668, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !173)
!175 = !DISubroutineType(types: !176)
!176 = !{!73, !56, !74, !59, !59, !74, !9, !59, null}
!177 = distinct !DISubprogram(name: "PetscClassRegLogDestroy", scope: !70, file: !70, line: 51, type: !178, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!73, !76}
!180 = !{!181, !182, !183, !184, !189, !191}
!181 = !DILocalVariable(name: "classLog", arg: 1, scope: !177, file: !70, line: 51, type: !76)
!182 = !DILocalVariable(name: "c", scope: !177, file: !70, line: 53, type: !74)
!183 = !DILocalVariable(name: "ierr", scope: !177, file: !70, line: 54, type: !73)
!184 = !DILocalVariable(name: "ierr__", scope: !185, file: !70, line: 58, type: !73)
!185 = distinct !DILexicalBlock(scope: !186, file: !70, line: 58, column: 62)
!186 = distinct !DILexicalBlock(scope: !187, file: !70, line: 57, column: 46)
!187 = distinct !DILexicalBlock(scope: !188, file: !70, line: 57, column: 3)
!188 = distinct !DILexicalBlock(scope: !177, file: !70, line: 57, column: 3)
!189 = !DILocalVariable(name: "ierr__", scope: !190, file: !70, line: 60, type: !73)
!190 = distinct !DILexicalBlock(scope: !177, file: !70, line: 60, column: 41)
!191 = !DILocalVariable(name: "ierr__", scope: !192, file: !70, line: 61, type: !73)
!192 = distinct !DILexicalBlock(scope: !177, file: !70, line: 61, column: 30)
!193 = !DILocation(line: 0, scope: !177)
!194 = !DILocation(line: 56, column: 3, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !70, line: 56, column: 3)
!196 = distinct !DILexicalBlock(scope: !197, file: !70, line: 56, column: 3)
!197 = distinct !DILexicalBlock(scope: !177, file: !70, line: 56, column: 3)
!198 = !DILocation(line: 56, column: 3, scope: !196)
!199 = !DILocation(line: 56, column: 3, scope: !200)
!200 = distinct !DILexicalBlock(scope: !201, file: !70, line: 56, column: 3)
!201 = distinct !DILexicalBlock(scope: !195, file: !70, line: 56, column: 3)
!202 = !DILocation(line: 56, column: 3, scope: !201)
!203 = !DILocation(line: 56, column: 3, scope: !204)
!204 = distinct !DILexicalBlock(scope: !200, file: !70, line: 56, column: 3)
!205 = !DILocation(line: 57, column: 29, scope: !187)
!206 = !DILocation(line: 57, column: 17, scope: !187)
!207 = !DILocation(line: 57, column: 3, scope: !188)
!208 = distinct !{!208, !207, !209, !210}
!209 = !DILocation(line: 59, column: 3, scope: !188)
!210 = !{!"llvm.loop.mustprogress"}
!211 = !DILocation(line: 58, column: 48, scope: !186)
!212 = !{!131, !106, i64 8}
!213 = !DILocation(line: 58, column: 38, scope: !186)
!214 = !DILocation(line: 58, column: 12, scope: !186)
!215 = !DILocation(line: 0, scope: !185)
!216 = !DILocation(line: 58, column: 62, scope: !217)
!217 = distinct !DILexicalBlock(scope: !185, file: !70, line: 58, column: 62)
!218 = !DILocation(line: 57, column: 42, scope: !187)
!219 = !DILocation(line: 58, column: 62, scope: !185)
!220 = !DILocation(line: 60, column: 10, scope: !177)
!221 = !DILocation(line: 0, scope: !190)
!222 = !DILocation(line: 60, column: 41, scope: !223)
!223 = distinct !DILexicalBlock(scope: !190, file: !70, line: 60, column: 41)
!224 = !DILocation(line: 61, column: 10, scope: !177)
!225 = !DILocation(line: 0, scope: !192)
!226 = !DILocation(line: 61, column: 30, scope: !192)
!227 = !DILocation(line: 61, column: 30, scope: !228)
!228 = distinct !DILexicalBlock(scope: !192, file: !70, line: 61, column: 30)
!229 = !DILocation(line: 62, column: 3, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !70, line: 62, column: 3)
!231 = distinct !DILexicalBlock(scope: !232, file: !70, line: 62, column: 3)
!232 = distinct !DILexicalBlock(scope: !177, file: !70, line: 62, column: 3)
!233 = !DILocation(line: 62, column: 3, scope: !231)
!234 = !DILocation(line: 62, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !70, line: 62, column: 3)
!236 = distinct !DILexicalBlock(scope: !230, file: !70, line: 62, column: 3)
!237 = !DILocation(line: 62, column: 3, scope: !236)
!238 = !DILocation(line: 62, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !70, line: 62, column: 3)
!240 = distinct !DILexicalBlock(scope: !235, file: !70, line: 62, column: 3)
!241 = !DILocation(line: 62, column: 3, scope: !240)
!242 = !DILocation(line: 62, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !70, line: 62, column: 3)
!244 = !DILocation(line: 62, column: 3, scope: !245)
!245 = distinct !DILexicalBlock(scope: !235, file: !70, line: 62, column: 3)
!246 = !DILocation(line: 62, column: 3, scope: !247)
!247 = distinct !DILexicalBlock(scope: !245, file: !70, line: 62, column: 3)
!248 = !DILocation(line: 62, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !70, line: 62, column: 3)
!250 = distinct !DILexicalBlock(scope: !247, file: !70, line: 62, column: 3)
!251 = !DILocation(line: 62, column: 3, scope: !250)
!252 = !DILocation(line: 62, column: 3, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !70, line: 62, column: 3)
!254 = !DILocation(line: 63, column: 1, scope: !177)
!255 = distinct !DISubprogram(name: "PetscClassRegInfoDestroy", scope: !70, file: !70, line: 77, type: !256, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !258)
!256 = !DISubroutineType(types: !257)
!257 = !{!73, !84}
!258 = !{!259, !260, !261}
!259 = !DILocalVariable(name: "c", arg: 1, scope: !255, file: !70, line: 77, type: !84)
!260 = !DILocalVariable(name: "ierr", scope: !255, file: !70, line: 79, type: !73)
!261 = !DILocalVariable(name: "ierr__", scope: !262, file: !70, line: 82, type: !73)
!262 = distinct !DILexicalBlock(scope: !255, file: !70, line: 82, column: 29)
!263 = !DILocation(line: 0, scope: !255)
!264 = !DILocation(line: 81, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !70, line: 81, column: 3)
!266 = distinct !DILexicalBlock(scope: !267, file: !70, line: 81, column: 3)
!267 = distinct !DILexicalBlock(scope: !255, file: !70, line: 81, column: 3)
!268 = !DILocation(line: 81, column: 3, scope: !266)
!269 = !DILocation(line: 81, column: 3, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !70, line: 81, column: 3)
!271 = distinct !DILexicalBlock(scope: !265, file: !70, line: 81, column: 3)
!272 = !DILocation(line: 81, column: 3, scope: !271)
!273 = !DILocation(line: 81, column: 3, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !70, line: 81, column: 3)
!275 = !DILocation(line: 82, column: 10, scope: !255)
!276 = !{!277, !106, i64 0}
!277 = !{!"", !106, i64 0, !115, i64 8}
!278 = !DILocation(line: 0, scope: !262)
!279 = !DILocation(line: 82, column: 29, scope: !280)
!280 = distinct !DILexicalBlock(scope: !262, file: !70, line: 82, column: 29)
!281 = !DILocation(line: 83, column: 3, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !70, line: 83, column: 3)
!283 = distinct !DILexicalBlock(scope: !284, file: !70, line: 83, column: 3)
!284 = distinct !DILexicalBlock(scope: !255, file: !70, line: 83, column: 3)
!285 = !DILocation(line: 83, column: 3, scope: !283)
!286 = !DILocation(line: 83, column: 3, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !70, line: 83, column: 3)
!288 = distinct !DILexicalBlock(scope: !282, file: !70, line: 83, column: 3)
!289 = !DILocation(line: 83, column: 3, scope: !288)
!290 = !DILocation(line: 83, column: 3, scope: !291)
!291 = distinct !DILexicalBlock(scope: !292, file: !70, line: 83, column: 3)
!292 = distinct !DILexicalBlock(scope: !287, file: !70, line: 83, column: 3)
!293 = !DILocation(line: 83, column: 3, scope: !292)
!294 = !DILocation(line: 83, column: 3, scope: !295)
!295 = distinct !DILexicalBlock(scope: !291, file: !70, line: 83, column: 3)
!296 = !DILocation(line: 83, column: 3, scope: !297)
!297 = distinct !DILexicalBlock(scope: !287, file: !70, line: 83, column: 3)
!298 = !DILocation(line: 83, column: 3, scope: !299)
!299 = distinct !DILexicalBlock(scope: !297, file: !70, line: 83, column: 3)
!300 = !DILocation(line: 83, column: 3, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !70, line: 83, column: 3)
!302 = distinct !DILexicalBlock(scope: !299, file: !70, line: 83, column: 3)
!303 = !DILocation(line: 83, column: 3, scope: !302)
!304 = !DILocation(line: 83, column: 3, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !70, line: 83, column: 3)
!306 = !DILocation(line: 84, column: 1, scope: !255)
!307 = distinct !DISubprogram(name: "PetscClassPerfLogCreate", scope: !70, file: !70, line: 98, type: !308, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !329)
!308 = !DISubroutineType(types: !309)
!309 = !{!73, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassPerfLog", file: !77, line: 134, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscClassPerfLog", file: !77, line: 135, size: 128, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "numClasses", scope: !313, file: !77, line: 136, baseType: !74, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "maxClasses", scope: !313, file: !77, line: 137, baseType: !74, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "classInfo", scope: !313, file: !77, line: 138, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassPerfInfo", file: !77, line: 125, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 119, size: 256, elements: !321)
!321 = !{!322, !323, !324, !325, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !320, file: !77, line: 120, baseType: !90, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "creations", scope: !320, file: !77, line: 121, baseType: !74, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "destructions", scope: !320, file: !77, line: 122, baseType: !74, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !320, file: !77, line: 123, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !327)
!327 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "descMem", scope: !320, file: !77, line: 124, baseType: !326, size: 64, offset: 192)
!329 = !{!330, !331, !332, !333, !335}
!330 = !DILocalVariable(name: "classLog", arg: 1, scope: !307, file: !70, line: 98, type: !310)
!331 = !DILocalVariable(name: "l", scope: !307, file: !70, line: 100, type: !311)
!332 = !DILocalVariable(name: "ierr", scope: !307, file: !70, line: 101, type: !73)
!333 = !DILocalVariable(name: "ierr__", scope: !334, file: !70, line: 104, type: !73)
!334 = distinct !DILexicalBlock(scope: !307, file: !70, line: 104, column: 23)
!335 = !DILocalVariable(name: "ierr__", scope: !336, file: !70, line: 109, type: !73)
!336 = distinct !DILexicalBlock(scope: !307, file: !70, line: 109, column: 53)
!337 = !DILocation(line: 0, scope: !307)
!338 = !DILocation(line: 100, column: 3, scope: !307)
!339 = !DILocation(line: 103, column: 3, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !70, line: 103, column: 3)
!341 = distinct !DILexicalBlock(scope: !342, file: !70, line: 103, column: 3)
!342 = distinct !DILexicalBlock(scope: !307, file: !70, line: 103, column: 3)
!343 = !DILocation(line: 103, column: 3, scope: !341)
!344 = !DILocation(line: 103, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !70, line: 103, column: 3)
!346 = distinct !DILexicalBlock(scope: !340, file: !70, line: 103, column: 3)
!347 = !DILocation(line: 103, column: 3, scope: !346)
!348 = !DILocation(line: 103, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !345, file: !70, line: 103, column: 3)
!350 = !DILocation(line: 104, column: 10, scope: !307)
!351 = !DILocation(line: 0, scope: !334)
!352 = !DILocation(line: 104, column: 23, scope: !353)
!353 = distinct !DILexicalBlock(scope: !334, file: !70, line: 104, column: 23)
!354 = !DILocation(line: 104, column: 23, scope: !334)
!355 = !DILocation(line: 106, column: 3, scope: !307)
!356 = !DILocation(line: 106, column: 6, scope: !307)
!357 = !DILocation(line: 106, column: 17, scope: !307)
!358 = !{!359, !115, i64 0}
!359 = !{!"_n_PetscClassPerfLog", !115, i64 0, !115, i64 4, !106, i64 8}
!360 = !DILocation(line: 107, column: 6, scope: !307)
!361 = !DILocation(line: 107, column: 17, scope: !307)
!362 = !{!359, !115, i64 4}
!363 = !DILocation(line: 109, column: 10, scope: !307)
!364 = !DILocation(line: 0, scope: !336)
!365 = !DILocation(line: 109, column: 53, scope: !366)
!366 = distinct !DILexicalBlock(scope: !336, file: !70, line: 109, column: 53)
!367 = !DILocation(line: 109, column: 53, scope: !336)
!368 = !DILocation(line: 111, column: 15, scope: !307)
!369 = !DILocation(line: 111, column: 13, scope: !307)
!370 = !DILocation(line: 112, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !70, line: 112, column: 3)
!372 = distinct !DILexicalBlock(scope: !373, file: !70, line: 112, column: 3)
!373 = distinct !DILexicalBlock(scope: !307, file: !70, line: 112, column: 3)
!374 = !DILocation(line: 112, column: 3, scope: !372)
!375 = !DILocation(line: 112, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !70, line: 112, column: 3)
!377 = distinct !DILexicalBlock(scope: !371, file: !70, line: 112, column: 3)
!378 = !DILocation(line: 112, column: 3, scope: !377)
!379 = !DILocation(line: 112, column: 3, scope: !380)
!380 = distinct !DILexicalBlock(scope: !381, file: !70, line: 112, column: 3)
!381 = distinct !DILexicalBlock(scope: !376, file: !70, line: 112, column: 3)
!382 = !DILocation(line: 112, column: 3, scope: !381)
!383 = !DILocation(line: 112, column: 3, scope: !384)
!384 = distinct !DILexicalBlock(scope: !380, file: !70, line: 112, column: 3)
!385 = !DILocation(line: 112, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !376, file: !70, line: 112, column: 3)
!387 = !DILocation(line: 112, column: 3, scope: !388)
!388 = distinct !DILexicalBlock(scope: !386, file: !70, line: 112, column: 3)
!389 = !DILocation(line: 112, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !70, line: 112, column: 3)
!391 = distinct !DILexicalBlock(scope: !388, file: !70, line: 112, column: 3)
!392 = !DILocation(line: 112, column: 3, scope: !391)
!393 = !DILocation(line: 112, column: 3, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !70, line: 112, column: 3)
!395 = !DILocation(line: 113, column: 1, scope: !307)
!396 = distinct !DISubprogram(name: "PetscClassPerfLogDestroy", scope: !70, file: !70, line: 127, type: !397, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!73, !311}
!399 = !{!400, !401, !402, !404}
!400 = !DILocalVariable(name: "classLog", arg: 1, scope: !396, file: !70, line: 127, type: !311)
!401 = !DILocalVariable(name: "ierr", scope: !396, file: !70, line: 129, type: !73)
!402 = !DILocalVariable(name: "ierr__", scope: !403, file: !70, line: 132, type: !73)
!403 = distinct !DILexicalBlock(scope: !396, file: !70, line: 132, column: 41)
!404 = !DILocalVariable(name: "ierr__", scope: !405, file: !70, line: 133, type: !73)
!405 = distinct !DILexicalBlock(scope: !396, file: !70, line: 133, column: 30)
!406 = !DILocation(line: 0, scope: !396)
!407 = !DILocation(line: 131, column: 3, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !70, line: 131, column: 3)
!409 = distinct !DILexicalBlock(scope: !410, file: !70, line: 131, column: 3)
!410 = distinct !DILexicalBlock(scope: !396, file: !70, line: 131, column: 3)
!411 = !DILocation(line: 131, column: 3, scope: !409)
!412 = !DILocation(line: 131, column: 3, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !70, line: 131, column: 3)
!414 = distinct !DILexicalBlock(scope: !408, file: !70, line: 131, column: 3)
!415 = !DILocation(line: 131, column: 3, scope: !414)
!416 = !DILocation(line: 131, column: 3, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !70, line: 131, column: 3)
!418 = !DILocation(line: 132, column: 10, scope: !396)
!419 = !{!359, !106, i64 8}
!420 = !DILocation(line: 0, scope: !403)
!421 = !DILocation(line: 132, column: 41, scope: !422)
!422 = distinct !DILexicalBlock(scope: !403, file: !70, line: 132, column: 41)
!423 = !DILocation(line: 133, column: 10, scope: !396)
!424 = !DILocation(line: 0, scope: !405)
!425 = !DILocation(line: 133, column: 30, scope: !405)
!426 = !DILocation(line: 133, column: 30, scope: !427)
!427 = distinct !DILexicalBlock(scope: !405, file: !70, line: 133, column: 30)
!428 = !DILocation(line: 134, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !70, line: 134, column: 3)
!430 = distinct !DILexicalBlock(scope: !431, file: !70, line: 134, column: 3)
!431 = distinct !DILexicalBlock(scope: !396, file: !70, line: 134, column: 3)
!432 = !DILocation(line: 134, column: 3, scope: !430)
!433 = !DILocation(line: 134, column: 3, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !70, line: 134, column: 3)
!435 = distinct !DILexicalBlock(scope: !429, file: !70, line: 134, column: 3)
!436 = !DILocation(line: 134, column: 3, scope: !435)
!437 = !DILocation(line: 134, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !70, line: 134, column: 3)
!439 = distinct !DILexicalBlock(scope: !434, file: !70, line: 134, column: 3)
!440 = !DILocation(line: 134, column: 3, scope: !439)
!441 = !DILocation(line: 134, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !70, line: 134, column: 3)
!443 = !DILocation(line: 134, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !434, file: !70, line: 134, column: 3)
!445 = !DILocation(line: 134, column: 3, scope: !446)
!446 = distinct !DILexicalBlock(scope: !444, file: !70, line: 134, column: 3)
!447 = !DILocation(line: 134, column: 3, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !70, line: 134, column: 3)
!449 = distinct !DILexicalBlock(scope: !446, file: !70, line: 134, column: 3)
!450 = !DILocation(line: 134, column: 3, scope: !449)
!451 = !DILocation(line: 134, column: 3, scope: !452)
!452 = distinct !DILexicalBlock(scope: !448, file: !70, line: 134, column: 3)
!453 = !DILocation(line: 135, column: 1, scope: !396)
!454 = distinct !DISubprogram(name: "PetscClassPerfInfoClear", scope: !70, file: !70, line: 150, type: !455, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!73, !318}
!457 = !{!458}
!458 = !DILocalVariable(name: "classInfo", arg: 1, scope: !454, file: !70, line: 150, type: !318)
!459 = !DILocation(line: 0, scope: !454)
!460 = !DILocation(line: 152, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !70, line: 152, column: 3)
!462 = distinct !DILexicalBlock(scope: !463, file: !70, line: 152, column: 3)
!463 = distinct !DILexicalBlock(scope: !454, file: !70, line: 152, column: 3)
!464 = !DILocation(line: 152, column: 3, scope: !462)
!465 = !DILocation(line: 152, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !70, line: 152, column: 3)
!467 = distinct !DILexicalBlock(scope: !461, file: !70, line: 152, column: 3)
!468 = !DILocation(line: 152, column: 3, scope: !467)
!469 = !DILocation(line: 152, column: 3, scope: !470)
!470 = distinct !DILexicalBlock(scope: !466, file: !70, line: 152, column: 3)
!471 = !DILocation(line: 158, column: 3, scope: !472)
!472 = distinct !DILexicalBlock(scope: !473, file: !70, line: 158, column: 3)
!473 = distinct !DILexicalBlock(scope: !474, file: !70, line: 158, column: 3)
!474 = distinct !DILexicalBlock(scope: !454, file: !70, line: 158, column: 3)
!475 = !DILocation(line: 153, column: 14, scope: !454)
!476 = !DILocation(line: 153, column: 27, scope: !454)
!477 = !{!478, !115, i64 0}
!478 = !{!"", !115, i64 0, !115, i64 4, !115, i64 8, !479, i64 16, !479, i64 24}
!479 = !{!"double", !107, i64 0}
!480 = !DILocation(line: 154, column: 14, scope: !454)
!481 = !DILocation(line: 154, column: 27, scope: !454)
!482 = !{!478, !115, i64 4}
!483 = !DILocation(line: 155, column: 14, scope: !454)
!484 = !DILocation(line: 155, column: 27, scope: !454)
!485 = !{!478, !115, i64 8}
!486 = !DILocation(line: 156, column: 14, scope: !454)
!487 = !DILocation(line: 158, column: 3, scope: !473)
!488 = !DILocation(line: 156, column: 27, scope: !454)
!489 = !DILocation(line: 158, column: 3, scope: !490)
!490 = distinct !DILexicalBlock(scope: !491, file: !70, line: 158, column: 3)
!491 = distinct !DILexicalBlock(scope: !472, file: !70, line: 158, column: 3)
!492 = !DILocation(line: 158, column: 3, scope: !491)
!493 = !DILocation(line: 158, column: 3, scope: !494)
!494 = distinct !DILexicalBlock(scope: !495, file: !70, line: 158, column: 3)
!495 = distinct !DILexicalBlock(scope: !490, file: !70, line: 158, column: 3)
!496 = !DILocation(line: 158, column: 3, scope: !495)
!497 = !DILocation(line: 158, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !70, line: 158, column: 3)
!499 = !DILocation(line: 158, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !490, file: !70, line: 158, column: 3)
!501 = !DILocation(line: 158, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !500, file: !70, line: 158, column: 3)
!503 = !DILocation(line: 158, column: 3, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !70, line: 158, column: 3)
!505 = distinct !DILexicalBlock(scope: !502, file: !70, line: 158, column: 3)
!506 = !DILocation(line: 158, column: 3, scope: !505)
!507 = !DILocation(line: 158, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !504, file: !70, line: 158, column: 3)
!509 = !DILocation(line: 158, column: 3, scope: !474)
!510 = distinct !DISubprogram(name: "PetscClassPerfLogEnsureSize", scope: !70, file: !70, line: 174, type: !511, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!73, !311, !74}
!513 = !{!514, !515, !516, !517, !518, !521, !523, !525}
!514 = !DILocalVariable(name: "classLog", arg: 1, scope: !510, file: !70, line: 174, type: !311)
!515 = !DILocalVariable(name: "size", arg: 2, scope: !510, file: !70, line: 174, type: !74)
!516 = !DILocalVariable(name: "classInfo", scope: !510, file: !70, line: 176, type: !318)
!517 = !DILocalVariable(name: "ierr", scope: !510, file: !70, line: 177, type: !73)
!518 = !DILocalVariable(name: "ierr__", scope: !519, file: !70, line: 181, type: !73)
!519 = distinct !DILexicalBlock(scope: !520, file: !70, line: 181, column: 61)
!520 = distinct !DILexicalBlock(scope: !510, file: !70, line: 180, column: 39)
!521 = !DILocalVariable(name: "ierr__", scope: !522, file: !70, line: 182, type: !73)
!522 = distinct !DILexicalBlock(scope: !520, file: !70, line: 182, column: 80)
!523 = !DILocalVariable(name: "ierr__", scope: !524, file: !70, line: 183, type: !73)
!524 = distinct !DILexicalBlock(scope: !520, file: !70, line: 183, column: 43)
!525 = !DILocalVariable(name: "ierr__", scope: !526, file: !70, line: 189, type: !73)
!526 = distinct !DILexicalBlock(scope: !527, file: !70, line: 189, column: 82)
!527 = distinct !DILexicalBlock(scope: !510, file: !70, line: 188, column: 39)
!528 = !DILocation(line: 0, scope: !510)
!529 = !DILocation(line: 176, column: 3, scope: !510)
!530 = !DILocation(line: 179, column: 3, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !70, line: 179, column: 3)
!532 = distinct !DILexicalBlock(scope: !533, file: !70, line: 179, column: 3)
!533 = distinct !DILexicalBlock(scope: !510, file: !70, line: 179, column: 3)
!534 = !DILocation(line: 179, column: 3, scope: !532)
!535 = !DILocation(line: 179, column: 3, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !70, line: 179, column: 3)
!537 = distinct !DILexicalBlock(scope: !531, file: !70, line: 179, column: 3)
!538 = !DILocation(line: 179, column: 3, scope: !537)
!539 = !DILocation(line: 179, column: 3, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !70, line: 179, column: 3)
!541 = !DILocation(line: 180, column: 27, scope: !510)
!542 = !DILocation(line: 180, column: 15, scope: !510)
!543 = !DILocation(line: 180, column: 3, scope: !510)
!544 = !DILocation(line: 188, column: 20, scope: !510)
!545 = !DILocation(line: 188, column: 31, scope: !510)
!546 = !DILocation(line: 188, column: 3, scope: !510)
!547 = !DILocation(line: 181, column: 12, scope: !520)
!548 = !DILocation(line: 0, scope: !519)
!549 = !DILocation(line: 181, column: 61, scope: !550)
!550 = distinct !DILexicalBlock(scope: !519, file: !70, line: 181, column: 61)
!551 = !DILocation(line: 181, column: 61, scope: !519)
!552 = !DILocation(line: 182, column: 12, scope: !520)
!553 = !DILocation(line: 0, scope: !522)
!554 = !DILocation(line: 182, column: 80, scope: !522)
!555 = !DILocation(line: 182, column: 80, scope: !556)
!556 = distinct !DILexicalBlock(scope: !522, file: !70, line: 182, column: 80)
!557 = !DILocation(line: 183, column: 12, scope: !520)
!558 = !DILocation(line: 0, scope: !524)
!559 = !DILocation(line: 183, column: 43, scope: !560)
!560 = distinct !DILexicalBlock(scope: !524, file: !70, line: 183, column: 43)
!561 = !DILocation(line: 185, column: 29, scope: !520)
!562 = !DILocation(line: 185, column: 27, scope: !520)
!563 = !DILocation(line: 186, column: 26, scope: !520)
!564 = distinct !{!564, !543, !565, !210}
!565 = !DILocation(line: 187, column: 3, scope: !510)
!566 = !DILocation(line: 189, column: 47, scope: !527)
!567 = !DILocation(line: 189, column: 77, scope: !527)
!568 = !DILocation(line: 189, column: 37, scope: !527)
!569 = !DILocation(line: 189, column: 12, scope: !527)
!570 = !DILocation(line: 191, column: 3, scope: !571)
!571 = distinct !DILexicalBlock(scope: !572, file: !70, line: 191, column: 3)
!572 = distinct !DILexicalBlock(scope: !573, file: !70, line: 191, column: 3)
!573 = distinct !DILexicalBlock(scope: !510, file: !70, line: 191, column: 3)
!574 = !DILocation(line: 191, column: 3, scope: !572)
!575 = !DILocation(line: 191, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !577, file: !70, line: 191, column: 3)
!577 = distinct !DILexicalBlock(scope: !571, file: !70, line: 191, column: 3)
!578 = !DILocation(line: 191, column: 3, scope: !577)
!579 = !DILocation(line: 191, column: 3, scope: !580)
!580 = distinct !DILexicalBlock(scope: !581, file: !70, line: 191, column: 3)
!581 = distinct !DILexicalBlock(scope: !576, file: !70, line: 191, column: 3)
!582 = !DILocation(line: 191, column: 3, scope: !581)
!583 = !DILocation(line: 191, column: 3, scope: !584)
!584 = distinct !DILexicalBlock(scope: !580, file: !70, line: 191, column: 3)
!585 = !DILocation(line: 191, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !576, file: !70, line: 191, column: 3)
!587 = !DILocation(line: 191, column: 3, scope: !588)
!588 = distinct !DILexicalBlock(scope: !586, file: !70, line: 191, column: 3)
!589 = !DILocation(line: 191, column: 3, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !70, line: 191, column: 3)
!591 = distinct !DILexicalBlock(scope: !588, file: !70, line: 191, column: 3)
!592 = !DILocation(line: 191, column: 3, scope: !591)
!593 = !DILocation(line: 191, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !590, file: !70, line: 191, column: 3)
!595 = !DILocation(line: 192, column: 1, scope: !510)
!596 = distinct !DISubprogram(name: "PetscMemcpy", scope: !170, file: !170, line: 1792, type: !597, scopeLine: 1793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !601)
!597 = !DISubroutineType(types: !598)
!598 = !{!73, !58, !599, !51}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!601 = !{!602, !603, !604, !605, !606, !607}
!602 = !DILocalVariable(name: "a", arg: 1, scope: !596, file: !170, line: 1792, type: !58)
!603 = !DILocalVariable(name: "b", arg: 2, scope: !596, file: !170, line: 1792, type: !599)
!604 = !DILocalVariable(name: "n", arg: 3, scope: !596, file: !170, line: 1792, type: !51)
!605 = !DILocalVariable(name: "al", scope: !596, file: !170, line: 1795, type: !51)
!606 = !DILocalVariable(name: "bl", scope: !596, file: !170, line: 1795, type: !51)
!607 = !DILocalVariable(name: "nl", scope: !596, file: !170, line: 1796, type: !51)
!608 = !DILocation(line: 0, scope: !596)
!609 = !DILocation(line: 1795, column: 15, scope: !596)
!610 = !DILocation(line: 1795, column: 31, scope: !596)
!611 = !DILocation(line: 1797, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !170, line: 1797, column: 3)
!613 = distinct !DILexicalBlock(scope: !614, file: !170, line: 1797, column: 3)
!614 = distinct !DILexicalBlock(scope: !596, file: !170, line: 1797, column: 3)
!615 = !DILocation(line: 1797, column: 3, scope: !613)
!616 = !DILocation(line: 1797, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !170, line: 1797, column: 3)
!618 = distinct !DILexicalBlock(scope: !612, file: !170, line: 1797, column: 3)
!619 = !DILocation(line: 1797, column: 3, scope: !618)
!620 = !DILocation(line: 1797, column: 3, scope: !621)
!621 = distinct !DILexicalBlock(scope: !617, file: !170, line: 1797, column: 3)
!622 = !DILocation(line: 1798, column: 9, scope: !623)
!623 = distinct !DILexicalBlock(scope: !596, file: !170, line: 1798, column: 7)
!624 = !DILocation(line: 1798, column: 13, scope: !623)
!625 = !DILocation(line: 1798, column: 20, scope: !623)
!626 = !DILocation(line: 1799, column: 13, scope: !627)
!627 = distinct !DILexicalBlock(scope: !596, file: !170, line: 1799, column: 7)
!628 = !DILocation(line: 1799, column: 20, scope: !627)
!629 = !DILocation(line: 1803, column: 9, scope: !630)
!630 = distinct !DILexicalBlock(scope: !596, file: !170, line: 1803, column: 7)
!631 = !DILocation(line: 1803, column: 14, scope: !630)
!632 = !DILocation(line: 1805, column: 13, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !170, line: 1805, column: 9)
!634 = distinct !DILexicalBlock(scope: !630, file: !170, line: 1803, column: 24)
!635 = !DILocation(line: 1805, column: 18, scope: !633)
!636 = !DILocation(line: 1805, column: 57, scope: !633)
!637 = !DILocation(line: 1828, column: 5, scope: !634)
!638 = !DILocation(line: 1831, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !170, line: 1831, column: 3)
!640 = distinct !DILexicalBlock(scope: !641, file: !170, line: 1831, column: 3)
!641 = distinct !DILexicalBlock(scope: !596, file: !170, line: 1831, column: 3)
!642 = !DILocation(line: 1830, column: 3, scope: !634)
!643 = !DILocation(line: 1831, column: 3, scope: !640)
!644 = !DILocation(line: 1831, column: 3, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !170, line: 1831, column: 3)
!646 = distinct !DILexicalBlock(scope: !639, file: !170, line: 1831, column: 3)
!647 = !DILocation(line: 1831, column: 3, scope: !646)
!648 = !DILocation(line: 1831, column: 3, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !170, line: 1831, column: 3)
!650 = distinct !DILexicalBlock(scope: !645, file: !170, line: 1831, column: 3)
!651 = !DILocation(line: 1831, column: 3, scope: !650)
!652 = !DILocation(line: 1831, column: 3, scope: !653)
!653 = distinct !DILexicalBlock(scope: !649, file: !170, line: 1831, column: 3)
!654 = !DILocation(line: 1831, column: 3, scope: !655)
!655 = distinct !DILexicalBlock(scope: !645, file: !170, line: 1831, column: 3)
!656 = !DILocation(line: 1831, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !655, file: !170, line: 1831, column: 3)
!658 = !DILocation(line: 1831, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !170, line: 1831, column: 3)
!660 = distinct !DILexicalBlock(scope: !657, file: !170, line: 1831, column: 3)
!661 = !DILocation(line: 1831, column: 3, scope: !660)
!662 = !DILocation(line: 1831, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !170, line: 1831, column: 3)
!664 = !DILocation(line: 1832, column: 1, scope: !596)
!665 = distinct !DISubprogram(name: "PetscClassRegLogRegister", scope: !70, file: !70, line: 211, type: !666, scopeLine: 212, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{!73, !76, !59, !90}
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !680, !682, !684}
!669 = !DILocalVariable(name: "classLog", arg: 1, scope: !665, file: !70, line: 211, type: !76)
!670 = !DILocalVariable(name: "cname", arg: 2, scope: !665, file: !70, line: 211, type: !59)
!671 = !DILocalVariable(name: "classid", arg: 3, scope: !665, file: !70, line: 211, type: !90)
!672 = !DILocalVariable(name: "classInfo", scope: !665, file: !70, line: 213, type: !84)
!673 = !DILocalVariable(name: "str", scope: !665, file: !70, line: 214, type: !62)
!674 = !DILocalVariable(name: "c", scope: !665, file: !70, line: 215, type: !74)
!675 = !DILocalVariable(name: "ierr", scope: !665, file: !70, line: 216, type: !73)
!676 = !DILocalVariable(name: "ierr__", scope: !677, file: !70, line: 222, type: !73)
!677 = distinct !DILexicalBlock(scope: !678, file: !70, line: 222, column: 61)
!678 = distinct !DILexicalBlock(scope: !679, file: !70, line: 221, column: 52)
!679 = distinct !DILexicalBlock(scope: !665, file: !70, line: 221, column: 7)
!680 = !DILocalVariable(name: "ierr__", scope: !681, file: !70, line: 223, type: !73)
!681 = distinct !DILexicalBlock(scope: !678, file: !70, line: 223, column: 80)
!682 = !DILocalVariable(name: "ierr__", scope: !683, file: !70, line: 224, type: !73)
!683 = distinct !DILexicalBlock(scope: !678, file: !70, line: 224, column: 43)
!684 = !DILocalVariable(name: "ierr__", scope: !685, file: !70, line: 229, type: !73)
!685 = distinct !DILexicalBlock(scope: !665, file: !70, line: 229, column: 39)
!686 = !DILocation(line: 0, scope: !665)
!687 = !DILocation(line: 213, column: 3, scope: !665)
!688 = !DILocation(line: 214, column: 3, scope: !665)
!689 = !DILocation(line: 218, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !70, line: 218, column: 3)
!691 = distinct !DILexicalBlock(scope: !692, file: !70, line: 218, column: 3)
!692 = distinct !DILexicalBlock(scope: !665, file: !70, line: 218, column: 3)
!693 = !DILocation(line: 218, column: 3, scope: !691)
!694 = !DILocation(line: 218, column: 3, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !70, line: 218, column: 3)
!696 = distinct !DILexicalBlock(scope: !690, file: !70, line: 218, column: 3)
!697 = !DILocation(line: 218, column: 3, scope: !696)
!698 = !DILocation(line: 218, column: 3, scope: !699)
!699 = distinct !DILexicalBlock(scope: !695, file: !70, line: 218, column: 3)
!700 = !DILocation(line: 219, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !70, line: 219, column: 3)
!702 = distinct !DILexicalBlock(scope: !665, file: !70, line: 219, column: 3)
!703 = !DILocation(line: 219, column: 3, scope: !702)
!704 = !DILocation(line: 219, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !70, line: 219, column: 3)
!706 = !DILocation(line: 220, column: 17, scope: !665)
!707 = !DILocation(line: 220, column: 27, scope: !665)
!708 = !DILocation(line: 221, column: 40, scope: !679)
!709 = !DILocation(line: 221, column: 28, scope: !679)
!710 = !DILocation(line: 221, column: 7, scope: !665)
!711 = !DILocation(line: 222, column: 12, scope: !678)
!712 = !DILocation(line: 0, scope: !677)
!713 = !DILocation(line: 222, column: 61, scope: !714)
!714 = distinct !DILexicalBlock(scope: !677, file: !70, line: 222, column: 61)
!715 = !DILocation(line: 222, column: 61, scope: !677)
!716 = !DILocation(line: 223, column: 12, scope: !678)
!717 = !DILocation(line: 0, scope: !681)
!718 = !DILocation(line: 223, column: 80, scope: !681)
!719 = !DILocation(line: 223, column: 80, scope: !720)
!720 = distinct !DILexicalBlock(scope: !681, file: !70, line: 223, column: 80)
!721 = !DILocation(line: 224, column: 12, scope: !678)
!722 = !DILocation(line: 0, scope: !683)
!723 = !DILocation(line: 224, column: 43, scope: !724)
!724 = distinct !DILexicalBlock(scope: !683, file: !70, line: 224, column: 43)
!725 = !DILocation(line: 226, column: 29, scope: !678)
!726 = !DILocation(line: 226, column: 27, scope: !678)
!727 = !DILocation(line: 227, column: 26, scope: !678)
!728 = !DILocation(line: 228, column: 3, scope: !678)
!729 = !DILocation(line: 229, column: 10, scope: !665)
!730 = !DILocation(line: 0, scope: !685)
!731 = !DILocation(line: 229, column: 39, scope: !732)
!732 = distinct !DILexicalBlock(scope: !685, file: !70, line: 229, column: 39)
!733 = !DILocation(line: 229, column: 39, scope: !685)
!734 = !DILocation(line: 231, column: 36, scope: !665)
!735 = !DILocation(line: 231, column: 13, scope: !665)
!736 = !DILocation(line: 231, column: 3, scope: !665)
!737 = !DILocation(line: 231, column: 26, scope: !665)
!738 = !DILocation(line: 231, column: 34, scope: !665)
!739 = !DILocation(line: 232, column: 26, scope: !665)
!740 = !DILocation(line: 232, column: 34, scope: !665)
!741 = !{!277, !115, i64 8}
!742 = !DILocation(line: 233, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !744, file: !70, line: 233, column: 3)
!744 = distinct !DILexicalBlock(scope: !745, file: !70, line: 233, column: 3)
!745 = distinct !DILexicalBlock(scope: !665, file: !70, line: 233, column: 3)
!746 = !DILocation(line: 233, column: 3, scope: !744)
!747 = !DILocation(line: 233, column: 3, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !70, line: 233, column: 3)
!749 = distinct !DILexicalBlock(scope: !743, file: !70, line: 233, column: 3)
!750 = !DILocation(line: 233, column: 3, scope: !749)
!751 = !DILocation(line: 233, column: 3, scope: !752)
!752 = distinct !DILexicalBlock(scope: !753, file: !70, line: 233, column: 3)
!753 = distinct !DILexicalBlock(scope: !748, file: !70, line: 233, column: 3)
!754 = !DILocation(line: 233, column: 3, scope: !753)
!755 = !DILocation(line: 233, column: 3, scope: !756)
!756 = distinct !DILexicalBlock(scope: !752, file: !70, line: 233, column: 3)
!757 = !DILocation(line: 233, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !748, file: !70, line: 233, column: 3)
!759 = !DILocation(line: 233, column: 3, scope: !760)
!760 = distinct !DILexicalBlock(scope: !758, file: !70, line: 233, column: 3)
!761 = !DILocation(line: 233, column: 3, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !70, line: 233, column: 3)
!763 = distinct !DILexicalBlock(scope: !760, file: !70, line: 233, column: 3)
!764 = !DILocation(line: 233, column: 3, scope: !763)
!765 = !DILocation(line: 233, column: 3, scope: !766)
!766 = distinct !DILexicalBlock(scope: !762, file: !70, line: 233, column: 3)
!767 = !DILocation(line: 234, column: 1, scope: !665)
!768 = !DISubprogram(name: "PetscCheckPointer", scope: !769, file: !769, line: 183, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !173)
!769 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!770 = !DISubroutineType(types: !771)
!771 = !{!3, !599, !15}
!772 = !DISubprogram(name: "PetscStrallocpy", scope: !170, file: !170, line: 1363, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !173)
!773 = !DISubroutineType(types: !774)
!774 = !{!74, !59, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!776 = distinct !DISubprogram(name: "PetscClassRegLogGetClass", scope: !70, file: !70, line: 253, type: !777, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !780)
!777 = !DISubroutineType(types: !778)
!778 = !{!73, !76, !90, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!780 = !{!781, !782, !783, !784}
!781 = !DILocalVariable(name: "classLog", arg: 1, scope: !776, file: !70, line: 253, type: !76)
!782 = !DILocalVariable(name: "classid", arg: 2, scope: !776, file: !70, line: 253, type: !90)
!783 = !DILocalVariable(name: "oclass", arg: 3, scope: !776, file: !70, line: 253, type: !779)
!784 = !DILocalVariable(name: "c", scope: !776, file: !70, line: 255, type: !74)
!785 = !DILocation(line: 0, scope: !776)
!786 = !DILocation(line: 257, column: 3, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !70, line: 257, column: 3)
!788 = distinct !DILexicalBlock(scope: !789, file: !70, line: 257, column: 3)
!789 = distinct !DILexicalBlock(scope: !776, file: !70, line: 257, column: 3)
!790 = !DILocation(line: 257, column: 3, scope: !788)
!791 = !DILocation(line: 257, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !70, line: 257, column: 3)
!793 = distinct !DILexicalBlock(scope: !787, file: !70, line: 257, column: 3)
!794 = !DILocation(line: 257, column: 3, scope: !793)
!795 = !DILocation(line: 257, column: 3, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !70, line: 257, column: 3)
!797 = !DILocation(line: 258, column: 3, scope: !798)
!798 = distinct !DILexicalBlock(scope: !799, file: !70, line: 258, column: 3)
!799 = distinct !DILexicalBlock(scope: !776, file: !70, line: 258, column: 3)
!800 = !DILocation(line: 258, column: 3, scope: !799)
!801 = !DILocation(line: 258, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !799, file: !70, line: 258, column: 3)
!803 = !DILocation(line: 259, column: 17, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !70, line: 259, column: 3)
!805 = distinct !DILexicalBlock(scope: !776, file: !70, line: 259, column: 3)
!806 = !DILocation(line: 259, column: 3, scope: !805)
!807 = !DILocation(line: 261, column: 32, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !70, line: 261, column: 9)
!809 = distinct !DILexicalBlock(scope: !804, file: !70, line: 259, column: 46)
!810 = !DILocation(line: 261, column: 40, scope: !808)
!811 = !DILocation(line: 261, column: 9, scope: !809)
!812 = !DILocation(line: 259, column: 42, scope: !804)
!813 = distinct !{!813, !806, !814, !210}
!814 = !DILocation(line: 262, column: 3, scope: !805)
!815 = !DILocation(line: 263, column: 34, scope: !816)
!816 = distinct !DILexicalBlock(scope: !776, file: !70, line: 263, column: 7)
!817 = !DILocation(line: 264, column: 11, scope: !776)
!818 = !DILocation(line: 265, column: 3, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !70, line: 265, column: 3)
!820 = distinct !DILexicalBlock(scope: !821, file: !70, line: 265, column: 3)
!821 = distinct !DILexicalBlock(scope: !776, file: !70, line: 265, column: 3)
!822 = !DILocation(line: 265, column: 3, scope: !820)
!823 = !DILocation(line: 265, column: 3, scope: !824)
!824 = distinct !DILexicalBlock(scope: !825, file: !70, line: 265, column: 3)
!825 = distinct !DILexicalBlock(scope: !819, file: !70, line: 265, column: 3)
!826 = !DILocation(line: 265, column: 3, scope: !825)
!827 = !DILocation(line: 265, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !70, line: 265, column: 3)
!829 = distinct !DILexicalBlock(scope: !824, file: !70, line: 265, column: 3)
!830 = !DILocation(line: 265, column: 3, scope: !829)
!831 = !DILocation(line: 265, column: 3, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !70, line: 265, column: 3)
!833 = !DILocation(line: 265, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !824, file: !70, line: 265, column: 3)
!835 = !DILocation(line: 265, column: 3, scope: !836)
!836 = distinct !DILexicalBlock(scope: !834, file: !70, line: 265, column: 3)
!837 = !DILocation(line: 265, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !70, line: 265, column: 3)
!839 = distinct !DILexicalBlock(scope: !836, file: !70, line: 265, column: 3)
!840 = !DILocation(line: 265, column: 3, scope: !839)
!841 = !DILocation(line: 265, column: 3, scope: !842)
!842 = distinct !DILexicalBlock(scope: !838, file: !70, line: 265, column: 3)
!843 = !DILocation(line: 266, column: 1, scope: !776)
!844 = distinct !DISubprogram(name: "PetscLogObjCreateDefault", scope: !70, file: !70, line: 270, type: !845, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1038)
!845 = !DISubroutineType(types: !846)
!846 = !{!73, !847}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !769, line: 73, size: 4480, elements: !850)
!850 = !{!851, !852, !897, !898, !900, !901, !902, !903, !904, !912, !913, !915, !919, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !935, !936, !937, !939, !940, !942, !944, !945, !946, !947, !948, !951, !953, !954, !955, !956, !957, !960, !962, !963, !964, !974, !976, !977, !981, !982, !1028, !1033, !1035, !1036, !1037}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !849, file: !769, line: 74, baseType: !90, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !849, file: !769, line: 75, baseType: !853, size: 448, offset: 64)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 448, elements: !895)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !769, line: 53, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 45, size: 448, elements: !856)
!856 = !{!857, !862, !870, !875, !879, !883, !890}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !855, file: !769, line: 46, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!73, !847, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !855, file: !769, line: 47, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!73, !847, !866}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !867, line: 16, baseType: !868)
!867 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !867, line: 16, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !855, file: !769, line: 48, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!73, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !855, file: !769, line: 49, baseType: !876, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!73, !847, !59, !847}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !855, file: !769, line: 50, baseType: !880, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!73, !847, !59, !874}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !855, file: !769, line: 51, baseType: !884, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!73, !847, !59, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !855, file: !769, line: 52, baseType: !891, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!73, !847, !59, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!895 = !{!896}
!896 = !DISubrange(count: 1)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !849, file: !769, line: 76, baseType: !54, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !849, file: !769, line: 77, baseType: !899, size: 32, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !74)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !849, file: !769, line: 78, baseType: !326, size: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !849, file: !769, line: 78, baseType: !326, size: 64, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !849, file: !769, line: 78, baseType: !326, size: 64, offset: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !849, file: !769, line: 78, baseType: !326, size: 64, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !849, file: !769, line: 79, baseType: !905, size: 64, offset: 896)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !908, line: 27, baseType: !909)
!908 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !910, line: 43, baseType: !911)
!910 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!911 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !849, file: !769, line: 80, baseType: !899, size: 32, offset: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !849, file: !769, line: 81, baseType: !914, size: 32, offset: 992)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !74)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !849, file: !769, line: 82, baseType: !916, size: 64, offset: 1024)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !849, file: !769, line: 83, baseType: !920, size: 64, offset: 1088)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !849, file: !769, line: 84, baseType: !62, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !849, file: !769, line: 85, baseType: !62, size: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !849, file: !769, line: 86, baseType: !62, size: 64, offset: 1280)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !849, file: !769, line: 87, baseType: !62, size: 64, offset: 1344)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !849, file: !769, line: 88, baseType: !847, size: 64, offset: 1408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !849, file: !769, line: 89, baseType: !905, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !769, line: 90, baseType: !62, size: 64, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !849, file: !769, line: 91, baseType: !62, size: 64, offset: 1600)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !849, file: !769, line: 92, baseType: !899, size: 32, offset: 1664)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !849, file: !769, line: 93, baseType: !58, size: 64, offset: 1728)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !849, file: !769, line: 94, baseType: !934, size: 64, offset: 1792)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !906)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !849, file: !769, line: 95, baseType: !899, size: 32, offset: 1856)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !849, file: !769, line: 95, baseType: !899, size: 32, offset: 1888)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !849, file: !769, line: 96, baseType: !938, size: 64, offset: 1920)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !849, file: !769, line: 96, baseType: !938, size: 64, offset: 1984)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !849, file: !769, line: 97, baseType: !941, size: 64, offset: 2048)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !849, file: !769, line: 97, baseType: !943, size: 64, offset: 2112)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !849, file: !769, line: 98, baseType: !899, size: 32, offset: 2176)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !849, file: !769, line: 98, baseType: !899, size: 32, offset: 2208)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !849, file: !769, line: 99, baseType: !938, size: 64, offset: 2240)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !849, file: !769, line: 99, baseType: !938, size: 64, offset: 2304)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !849, file: !769, line: 100, baseType: !949, size: 64, offset: 2368)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !327)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !849, file: !769, line: 100, baseType: !952, size: 64, offset: 2432)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !849, file: !769, line: 101, baseType: !899, size: 32, offset: 2496)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !849, file: !769, line: 101, baseType: !899, size: 32, offset: 2528)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !849, file: !769, line: 102, baseType: !938, size: 64, offset: 2560)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !849, file: !769, line: 102, baseType: !938, size: 64, offset: 2624)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !849, file: !769, line: 103, baseType: !958, size: 64, offset: 2688)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !950)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !849, file: !769, line: 103, baseType: !961, size: 64, offset: 2752)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !849, file: !769, line: 104, baseType: !894, size: 64, offset: 2816)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !849, file: !769, line: 105, baseType: !899, size: 32, offset: 2880)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !849, file: !769, line: 106, baseType: !965, size: 128, offset: 2944)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 128, elements: !972)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !769, line: 64, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 61, size: 128, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !968, file: !769, line: 62, baseType: !887, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !968, file: !769, line: 63, baseType: !58, size: 64, offset: 64)
!972 = !{!973}
!973 = !DISubrange(count: 2)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !849, file: !769, line: 107, baseType: !975, size: 64, offset: 3072)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 64, elements: !972)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !849, file: !769, line: 108, baseType: !58, size: 64, offset: 3136)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !849, file: !769, line: 109, baseType: !978, size: 64, offset: 3200)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!73, !58}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !849, file: !769, line: 111, baseType: !899, size: 32, offset: 3264)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !849, file: !769, line: 112, baseType: !983, size: 320, offset: 3328)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 320, elements: !1026)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!73, !987, !847, !58}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !36, line: 108, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !36, line: 99, size: 640, elements: !990)
!990 = !{!991, !992, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !989, file: !36, line: 100, baseType: !899, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !36, line: 101, baseType: !993, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !36, line: 82, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !36, line: 83, size: 768, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1004, !1005, !1006, !1007, !1009, !1011, !1012, !1013}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !995, file: !36, line: 84, baseType: !62, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !995, file: !36, line: 85, baseType: !62, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !995, file: !36, line: 86, baseType: !58, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !995, file: !36, line: 87, baseType: !916, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !995, file: !36, line: 88, baseType: !1002, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !995, file: !36, line: 89, baseType: !61, size: 8, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !995, file: !36, line: 90, baseType: !62, size: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !995, file: !36, line: 91, baseType: !51, size: 64, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !995, file: !36, line: 92, baseType: !1008, size: 32, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !36, line: 93, baseType: !1010, size: 32, offset: 544)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !36, line: 81, baseType: !35)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !36, line: 94, baseType: !993, size: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !995, file: !36, line: 95, baseType: !62, size: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !995, file: !36, line: 96, baseType: !58, size: 64, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !989, file: !36, line: 102, baseType: !62, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !989, file: !36, line: 102, baseType: !62, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !989, file: !36, line: 103, baseType: !62, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !989, file: !36, line: 104, baseType: !54, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !989, file: !36, line: 105, baseType: !1008, size: 32, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !989, file: !36, line: 105, baseType: !1008, size: 32, offset: 416)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !989, file: !36, line: 105, baseType: !1008, size: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !989, file: !36, line: 106, baseType: !847, size: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !989, file: !36, line: 107, baseType: !1023, size: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !36, line: 10, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !36, line: 10, flags: DIFlagFwdDecl)
!1026 = !{!1027}
!1027 = !DISubrange(count: 5)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !849, file: !769, line: 113, baseType: !1029, size: 320, offset: 3648)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 320, elements: !1026)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!73, !847, !58}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !849, file: !769, line: 114, baseType: !1034, size: 320, offset: 3968)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 320, elements: !1026)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !849, file: !769, line: 115, baseType: !1008, size: 32, offset: 4288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !849, file: !769, line: 120, baseType: !1023, size: 64, offset: 4352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !849, file: !769, line: 121, baseType: !1008, size: 32, offset: 4416)
!1038 = !{!1039, !1040, !1118, !1119, !1120, !1136, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1158, !1160, !1162, !1164, !1168, !1170, !1172, !1176, !1178, !1182, !1184, !1188, !1190}
!1039 = !DILocalVariable(name: "obj", arg: 1, scope: !844, file: !70, line: 270, type: !847)
!1040 = !DILocalVariable(name: "stageLog", scope: !844, file: !70, line: 272, type: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscStageLog", file: !77, line: 215, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscStageLog", file: !77, line: 216, size: 384, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1056, !1057, !1102, !1117}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "numStages", scope: !1043, file: !77, line: 217, baseType: !74, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "maxStages", scope: !1043, file: !77, line: 218, baseType: !74, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !1043, file: !77, line: 219, baseType: !1048, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscIntStack", file: !77, line: 104, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscIntStack", file: !1051, line: 5, size: 128, elements: !1052)
!1051 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/logimpl.h", directory: "/home/users/ndemeye/xSDK")
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1050, file: !1051, line: 6, baseType: !74, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1050, file: !1051, line: 7, baseType: !74, size: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !1050, file: !1051, line: 8, baseType: !779, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "curStage", scope: !1043, file: !77, line: 220, baseType: !74, size: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "stageInfo", scope: !1043, file: !77, line: 221, baseType: !1058, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscStageInfo", file: !77, line: 213, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscStageInfo", file: !77, line: 207, size: 2368, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1092, !1101}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !77, line: 208, baseType: !62, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1060, file: !77, line: 209, baseType: !1008, size: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "perfInfo", scope: !1060, file: !77, line: 210, baseType: !1065, size: 2112, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventPerfInfo", file: !77, line: 186, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 160, size: 2112, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1066, file: !77, line: 161, baseType: !74, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1066, file: !77, line: 162, baseType: !1008, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !1066, file: !77, line: 163, baseType: !1008, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1066, file: !77, line: 164, baseType: !74, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1066, file: !77, line: 165, baseType: !74, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !1066, file: !77, line: 166, baseType: !326, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flops2", scope: !1066, file: !77, line: 166, baseType: !326, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flopsTmp", scope: !1066, file: !77, line: 166, baseType: !326, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1066, file: !77, line: 167, baseType: !326, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "time2", scope: !1066, file: !77, line: 167, baseType: !326, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "timeTmp", scope: !1066, file: !77, line: 167, baseType: !326, size: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "syncTime", scope: !1066, file: !77, line: 168, baseType: !326, size: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !1066, file: !77, line: 169, baseType: !1081, size: 512, offset: 640)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 512, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 8)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !1066, file: !77, line: 170, baseType: !1081, size: 512, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "numMessages", scope: !1066, file: !77, line: 171, baseType: !326, size: 64, offset: 1664)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "messageLength", scope: !1066, file: !77, line: 172, baseType: !326, size: 64, offset: 1728)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "numReductions", scope: !1066, file: !77, line: 173, baseType: !326, size: 64, offset: 1792)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "memIncrease", scope: !1066, file: !77, line: 174, baseType: !326, size: 64, offset: 1856)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mallocIncrease", scope: !1066, file: !77, line: 175, baseType: !326, size: 64, offset: 1920)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mallocSpace", scope: !1066, file: !77, line: 176, baseType: !326, size: 64, offset: 1984)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mallocIncreaseEvent", scope: !1066, file: !77, line: 177, baseType: !326, size: 64, offset: 2048)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "eventLog", scope: !1060, file: !77, line: 211, baseType: !1093, size: 64, offset: 2240)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventPerfLog", file: !77, line: 195, baseType: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscEventPerfLog", file: !77, line: 196, size: 128, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "numEvents", scope: !1095, file: !77, line: 197, baseType: !74, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "maxEvents", scope: !1095, file: !77, line: 198, baseType: !74, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "eventInfo", scope: !1095, file: !77, line: 199, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "classLog", scope: !1060, file: !77, line: 212, baseType: !311, size: 64, offset: 2304)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "eventLog", scope: !1043, file: !77, line: 222, baseType: !1103, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventRegLog", file: !77, line: 188, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscEventRegLog", file: !77, line: 189, size: 128, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "numEvents", scope: !1105, file: !77, line: 190, baseType: !74, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "maxEvents", scope: !1105, file: !77, line: 191, baseType: !74, size: 32, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "eventInfo", scope: !1105, file: !77, line: 192, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEventRegInfo", file: !77, line: 158, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 150, size: 128, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !77, line: 151, baseType: !62, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !1112, file: !77, line: 152, baseType: !90, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "collective", scope: !1112, file: !77, line: 153, baseType: !1008, size: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "classLog", scope: !1043, file: !77, line: 223, baseType: !76, size: 64, offset: 320)
!1118 = !DILocalVariable(name: "classRegLog", scope: !844, file: !70, line: 273, type: !76)
!1119 = !DILocalVariable(name: "classPerfLog", scope: !844, file: !70, line: 274, type: !311)
!1120 = !DILocalVariable(name: "tmpAction", scope: !844, file: !70, line: 275, type: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "Action", file: !1051, line: 25, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Action", file: !1051, line: 16, size: 512, elements: !1124)
!1124 = !{!1125, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1123, file: !1051, line: 17, baseType: !74, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1123, file: !1051, line: 18, baseType: !1127, size: 32, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !77, line: 80, baseType: !74)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !1123, file: !1051, line: 19, baseType: !90, size: 32, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1123, file: !1051, line: 20, baseType: !326, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !1123, file: !1051, line: 21, baseType: !326, size: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1123, file: !1051, line: 22, baseType: !326, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "maxmem", scope: !1123, file: !1051, line: 23, baseType: !326, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "id1", scope: !1123, file: !1051, line: 24, baseType: !74, size: 32, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "id2", scope: !1123, file: !1051, line: 24, baseType: !74, size: 32, offset: 416)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "id3", scope: !1123, file: !1051, line: 24, baseType: !74, size: 32, offset: 448)
!1136 = !DILocalVariable(name: "tmpObjects", scope: !844, file: !70, line: 276, type: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !1051, line: 34, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Object", file: !1051, line: 28, size: 1216, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1148}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !1139, file: !1051, line: 29, baseType: !847, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1139, file: !1051, line: 30, baseType: !74, size: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1139, file: !1051, line: 31, baseType: !326, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1139, file: !1051, line: 32, baseType: !1145, size: 512, offset: 192)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1139, file: !1051, line: 33, baseType: !1145, size: 512, offset: 704)
!1149 = !DILocalVariable(name: "start", scope: !844, file: !70, line: 277, type: !326)
!1150 = !DILocalVariable(name: "end", scope: !844, file: !70, line: 277, type: !326)
!1151 = !DILocalVariable(name: "oclass", scope: !844, file: !70, line: 278, type: !74)
!1152 = !DILocalVariable(name: "stage", scope: !844, file: !70, line: 279, type: !74)
!1153 = !DILocalVariable(name: "ierr", scope: !844, file: !70, line: 280, type: !73)
!1154 = !DILocalVariable(name: "ierr__", scope: !1155, file: !70, line: 284, type: !73)
!1155 = distinct !DILexicalBlock(scope: !844, file: !70, line: 284, column: 41)
!1156 = !DILocalVariable(name: "ierr__", scope: !1157, file: !70, line: 285, type: !73)
!1157 = distinct !DILexicalBlock(scope: !844, file: !70, line: 285, column: 52)
!1158 = !DILocalVariable(name: "ierr__", scope: !1159, file: !70, line: 286, type: !73)
!1159 = distinct !DILexicalBlock(scope: !844, file: !70, line: 286, column: 62)
!1160 = !DILocalVariable(name: "ierr__", scope: !1161, file: !70, line: 287, type: !73)
!1161 = distinct !DILexicalBlock(scope: !844, file: !70, line: 287, column: 71)
!1162 = !DILocalVariable(name: "ierr__", scope: !1163, file: !70, line: 288, type: !73)
!1163 = distinct !DILexicalBlock(scope: !844, file: !70, line: 288, column: 71)
!1164 = !DILocalVariable(name: "ierr__", scope: !1165, file: !70, line: 293, type: !73)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !70, line: 293, column: 57)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !70, line: 291, column: 45)
!1167 = distinct !DILexicalBlock(scope: !844, file: !70, line: 291, column: 7)
!1168 = !DILocalVariable(name: "ierr__", scope: !1169, file: !70, line: 294, type: !73)
!1169 = distinct !DILexicalBlock(scope: !1166, file: !70, line: 294, column: 70)
!1170 = !DILocalVariable(name: "ierr__", scope: !1171, file: !70, line: 295, type: !73)
!1171 = distinct !DILexicalBlock(scope: !1166, file: !70, line: 295, column: 37)
!1172 = !DILocalVariable(name: "ierr__", scope: !1173, file: !70, line: 315, type: !73)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !70, line: 315, column: 77)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !70, line: 305, column: 25)
!1175 = distinct !DILexicalBlock(scope: !844, file: !70, line: 305, column: 7)
!1176 = !DILocalVariable(name: "ierr__", scope: !1177, file: !70, line: 316, type: !73)
!1177 = distinct !DILexicalBlock(scope: !1174, file: !70, line: 316, column: 80)
!1178 = !DILocalVariable(name: "ierr__", scope: !1179, file: !70, line: 324, type: !73)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !70, line: 324, column: 94)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !70, line: 320, column: 25)
!1181 = distinct !DILexicalBlock(scope: !844, file: !70, line: 320, column: 7)
!1182 = !DILocalVariable(name: "ierr__", scope: !1183, file: !70, line: 325, type: !73)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !70, line: 325, column: 94)
!1184 = !DILocalVariable(name: "ierr__", scope: !1185, file: !70, line: 330, type: !73)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !70, line: 330, column: 60)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !70, line: 328, column: 47)
!1187 = distinct !DILexicalBlock(scope: !1180, file: !70, line: 328, column: 9)
!1188 = !DILocalVariable(name: "ierr__", scope: !1189, file: !70, line: 331, type: !73)
!1189 = distinct !DILexicalBlock(scope: !1186, file: !70, line: 331, column: 73)
!1190 = !DILocalVariable(name: "ierr__", scope: !1191, file: !70, line: 332, type: !73)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !70, line: 332, column: 39)
!1192 = !DILocation(line: 0, scope: !844)
!1193 = !DILocation(line: 272, column: 3, scope: !844)
!1194 = !DILocation(line: 273, column: 3, scope: !844)
!1195 = !DILocation(line: 274, column: 3, scope: !844)
!1196 = !DILocation(line: 275, column: 3, scope: !844)
