; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/is/nn/nn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/is/nn/nn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!321 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327, !328}
!324 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!327 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!328 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 119, baseType: !5, size: 32, elements: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!332 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!374 = !{!375, !378, !396, !477, !417, !583, !1407, !1419, !1256, !467, !72, !442, !440, !628}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !376, line: 46, baseType: !377)
!376 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!377 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !381, line: 73, size: 4480, elements: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!382 = !{!383, !385, !438, !439, !441, !444, !445, !446, !447, !455, !456, !458, !462, !466, !468, !469, !470, !471, !472, !473, !474, !475, !476, !478, !480, !481, !482, !484, !485, !487, !489, !490, !491, !492, !493, !496, !498, !499, !500, !501, !502, !505, !507, !508, !509, !519, !521, !522, !526, !527, !573, !578, !580, !581, !582}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !380, file: !381, line: 74, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !380, file: !381, line: 75, baseType: !386, size: 448, offset: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 448, elements: !436)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !381, line: 53, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 45, size: 448, elements: !389)
!389 = !{!390, !400, !408, !413, !420, !424, !431}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !388, file: !381, line: 46, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !378, !395}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !397, line: 330, baseType: !398)
!397 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !397, line: 330, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !388, file: !381, line: 47, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!394, !378, !404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !405, line: 16, baseType: !406)
!405 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !405, line: 16, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !388, file: !381, line: 48, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!394, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !388, file: !381, line: 49, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!394, !378, !417, !378}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !388, file: !381, line: 50, baseType: !421, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!394, !378, !417, !412}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !388, file: !381, line: 51, baseType: !425, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!394, !378, !417, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !388, file: !381, line: 52, baseType: !432, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!394, !378, !417, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!436 = !{!437}
!437 = !DISubrange(count: 1)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !380, file: !381, line: 76, baseType: !396, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !381, line: 77, baseType: !440, size: 32, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !380, file: !381, line: 78, baseType: !442, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !443)
!443 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !380, file: !381, line: 78, baseType: !442, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !380, file: !381, line: 78, baseType: !442, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !380, file: !381, line: 78, baseType: !442, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !381, line: 79, baseType: !448, size: 64, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !451, line: 27, baseType: !452)
!451 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !453, line: 43, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!454 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !380, file: !381, line: 80, baseType: !440, size: 32, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !380, file: !381, line: 81, baseType: !457, size: 32, offset: 992)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !380, file: !381, line: 82, baseType: !459, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !380, file: !381, line: 83, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !380, file: !381, line: 84, baseType: !467, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !380, file: !381, line: 85, baseType: !467, size: 64, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !380, file: !381, line: 86, baseType: !467, size: 64, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !380, file: !381, line: 87, baseType: !467, size: 64, offset: 1344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !381, line: 88, baseType: !378, size: 64, offset: 1408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !380, file: !381, line: 89, baseType: !448, size: 64, offset: 1472)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !381, line: 90, baseType: !467, size: 64, offset: 1536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !380, file: !381, line: 91, baseType: !467, size: 64, offset: 1600)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !380, file: !381, line: 92, baseType: !440, size: 32, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !380, file: !381, line: 93, baseType: !477, size: 64, offset: 1728)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !381, line: 94, baseType: !479, size: 64, offset: 1792)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !449)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !380, file: !381, line: 95, baseType: !440, size: 32, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !380, file: !381, line: 95, baseType: !440, size: 32, offset: 1888)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !380, file: !381, line: 96, baseType: !483, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !380, file: !381, line: 96, baseType: !483, size: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !380, file: !381, line: 97, baseType: !486, size: 64, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !380, file: !381, line: 97, baseType: !488, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !380, file: !381, line: 98, baseType: !440, size: 32, offset: 2176)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !380, file: !381, line: 98, baseType: !440, size: 32, offset: 2208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !380, file: !381, line: 99, baseType: !483, size: 64, offset: 2240)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !380, file: !381, line: 99, baseType: !483, size: 64, offset: 2304)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !380, file: !381, line: 100, baseType: !494, size: 64, offset: 2368)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !443)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !380, file: !381, line: 100, baseType: !497, size: 64, offset: 2432)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !380, file: !381, line: 101, baseType: !440, size: 32, offset: 2496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !380, file: !381, line: 101, baseType: !440, size: 32, offset: 2528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !380, file: !381, line: 102, baseType: !483, size: 64, offset: 2560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !380, file: !381, line: 102, baseType: !483, size: 64, offset: 2624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !380, file: !381, line: 103, baseType: !503, size: 64, offset: 2688)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !495)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !380, file: !381, line: 103, baseType: !506, size: 64, offset: 2752)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !380, file: !381, line: 104, baseType: !435, size: 64, offset: 2816)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !380, file: !381, line: 105, baseType: !440, size: 32, offset: 2880)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !380, file: !381, line: 106, baseType: !510, size: 128, offset: 2944)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 128, elements: !517)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !381, line: 64, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 61, size: 128, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !513, file: !381, line: 62, baseType: !428, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !513, file: !381, line: 63, baseType: !477, size: 64, offset: 64)
!517 = !{!518}
!518 = !DISubrange(count: 2)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !380, file: !381, line: 107, baseType: !520, size: 64, offset: 3072)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !517)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !380, file: !381, line: 108, baseType: !477, size: 64, offset: 3136)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !380, file: !381, line: 109, baseType: !523, size: 64, offset: 3200)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!394, !477}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !380, file: !381, line: 111, baseType: !440, size: 32, offset: 3264)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !380, file: !381, line: 112, baseType: !528, size: 320, offset: 3328)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !571)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!394, !532, !378, !477}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !535)
!535 = !{!536, !537, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !534, file: !10, line: 100, baseType: !440, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !10, line: 101, baseType: !538, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !549, !550, !551, !552, !554, !556, !557, !558}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !540, file: !10, line: 84, baseType: !467, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !540, file: !10, line: 85, baseType: !467, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !10, line: 86, baseType: !477, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !540, file: !10, line: 87, baseType: !459, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !540, file: !10, line: 88, baseType: !547, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !540, file: !10, line: 89, baseType: !419, size: 8, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !540, file: !10, line: 90, baseType: !467, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !540, file: !10, line: 91, baseType: !375, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !540, file: !10, line: 92, baseType: !553, size: 32, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !10, line: 93, baseType: !555, size: 32, offset: 544)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !10, line: 94, baseType: !538, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !540, file: !10, line: 95, baseType: !467, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !540, file: !10, line: 96, baseType: !477, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !534, file: !10, line: 102, baseType: !467, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !534, file: !10, line: 102, baseType: !467, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !534, file: !10, line: 103, baseType: !467, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !534, file: !10, line: 104, baseType: !396, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !534, file: !10, line: 105, baseType: !553, size: 32, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !534, file: !10, line: 105, baseType: !553, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !534, file: !10, line: 105, baseType: !553, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !534, file: !10, line: 106, baseType: !378, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !534, file: !10, line: 107, baseType: !568, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!571 = !{!572}
!572 = !DISubrange(count: 5)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !380, file: !381, line: 113, baseType: !574, size: 320, offset: 3648)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !571)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!394, !378, !477}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !380, file: !381, line: 114, baseType: !579, size: 320, offset: 3968)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !571)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !380, file: !381, line: 115, baseType: !553, size: 32, offset: 4288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !380, file: !381, line: 120, baseType: !568, size: 64, offset: 4352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !380, file: !381, line: 121, baseType: !553, size: 32, offset: 4416)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !585, line: 78, baseType: !586)
!585 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 13, size: 2432, elements: !587)
!587 = !{!588, !589, !590, !595, !596, !597, !598, !1366, !1367, !1368, !1369, !1370, !1371, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !586, file: !585, line: 24, baseType: !440, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !586, file: !585, line: 25, baseType: !440, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !586, file: !585, line: 26, baseType: !591, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !592, line: 11, baseType: !593)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !592, line: 11, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !586, file: !585, line: 27, baseType: !591, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !586, file: !585, line: 28, baseType: !591, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !586, file: !585, line: 29, baseType: !591, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !586, file: !585, line: 31, baseType: !599, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !602, line: 436, size: 23424, elements: !603)
!602 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!603 = !{!604, !606, !1109, !1129, !1130, !1131, !1133, !1134, !1135, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1262, !1263, !1279, !1280, !1281, !1282, !1283, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1318, !1338, !1339, !1341, !1342, !1343, !1344, !1345, !1346, !1364, !1365}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !601, file: !602, line: 437, baseType: !605, size: 4480)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !381, line: 122, baseType: !380)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !601, file: !602, line: 437, baseType: !607, size: 9472, offset: 4480)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 9472, elements: !436)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !602, line: 32, size: 9472, elements: !609)
!609 = !{!610, !619, !623, !624, !631, !635, !636, !637, !638, !639, !640, !641, !661, !665, !670, !676, !695, !700, !704, !705, !710, !715, !716, !721, !725, !729, !733, !737, !741, !742, !743, !744, !745, !749, !750, !755, !756, !757, !758, !759, !764, !771, !776, !780, !784, !788, !792, !793, !797, !798, !805, !810, !811, !812, !813, !875, !883, !884, !888, !889, !893, !894, !898, !903, !904, !908, !912, !919, !920, !921, !922, !923, !924, !929, !930, !934, !938, !942, !943, !944, !948, !958, !959, !963, !964, !968, !969, !973, !974, !979, !980, !984, !988, !989, !990, !991, !992, !993, !994, !998, !999, !1000, !1001, !1002, !1003, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1018, !1022, !1023, !1024, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1038, !1039, !1040, !1045, !1049, !1050, !1054, !1055, !1056, !1057, !1083, !1087, !1088, !1089, !1090, !1091, !1095, !1096, !1097, !1098, !1099, !1103, !1107, !1108}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !608, file: !602, line: 34, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!394, !599, !440, !614, !440, !614, !616, !618}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !608, file: !602, line: 35, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!394, !599, !440, !486, !488, !506}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !608, file: !602, line: 36, baseType: !620, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !608, file: !602, line: 37, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!394, !599, !628, !628}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !608, file: !602, line: 38, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!394, !599, !628, !628, !628}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !608, file: !602, line: 40, baseType: !625, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !608, file: !602, line: 41, baseType: !632, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !608, file: !602, line: 42, baseType: !625, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !608, file: !602, line: 43, baseType: !632, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !608, file: !602, line: 44, baseType: !625, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !608, file: !602, line: 46, baseType: !632, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !608, file: !602, line: 47, baseType: !642, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!394, !599, !591, !591, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !648, file: !36, line: 1227, baseType: !495, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !648, file: !36, line: 1228, baseType: !495, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !648, file: !36, line: 1229, baseType: !495, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !648, file: !36, line: 1230, baseType: !495, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !648, file: !36, line: 1231, baseType: !495, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !648, file: !36, line: 1232, baseType: !495, size: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !648, file: !36, line: 1233, baseType: !495, size: 64, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !648, file: !36, line: 1234, baseType: !495, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !648, file: !36, line: 1236, baseType: !495, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !648, file: !36, line: 1237, baseType: !495, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !648, file: !36, line: 1238, baseType: !495, size: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !608, file: !602, line: 48, baseType: !662, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!394, !599, !591, !645}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !608, file: !602, line: 49, baseType: !666, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!394, !599, !628, !495, !669, !495, !440, !440, !628}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !608, file: !602, line: 50, baseType: !671, size: 64, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!394, !599, !674, !675}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !608, file: !602, line: 52, baseType: !677, size: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!394, !599, !680, !681}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !683, file: !36, line: 593, baseType: !442, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !683, file: !36, line: 594, baseType: !442, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !683, file: !36, line: 594, baseType: !442, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !683, file: !36, line: 594, baseType: !442, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !683, file: !36, line: 595, baseType: !442, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !683, file: !36, line: 596, baseType: !442, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !683, file: !36, line: 597, baseType: !442, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !683, file: !36, line: 598, baseType: !442, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !683, file: !36, line: 598, baseType: !442, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !683, file: !36, line: 599, baseType: !442, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !608, file: !602, line: 53, baseType: !696, size: 64, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!394, !599, !599, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !608, file: !602, line: 54, baseType: !701, size: 64, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!394, !599, !628}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !608, file: !602, line: 55, baseType: !625, size: 64, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !608, file: !602, line: 56, baseType: !706, size: 64, offset: 1216)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!394, !599, !709, !494}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !608, file: !602, line: 58, baseType: !711, size: 64, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!394, !599, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !608, file: !602, line: 59, baseType: !711, size: 64, offset: 1344)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !608, file: !602, line: 60, baseType: !717, size: 64, offset: 1408)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!394, !599, !720, !553}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !608, file: !602, line: 61, baseType: !722, size: 64, offset: 1472)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!394, !599}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !608, file: !602, line: 63, baseType: !726, size: 64, offset: 1536)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!394, !599, !440, !614, !504, !628, !628}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !608, file: !602, line: 64, baseType: !730, size: 64, offset: 1600)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!394, !599, !599, !591, !591, !645}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !608, file: !602, line: 65, baseType: !734, size: 64, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!394, !599, !599, !645}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !608, file: !602, line: 66, baseType: !738, size: 64, offset: 1728)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!394, !599, !599, !591, !645}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !608, file: !602, line: 67, baseType: !734, size: 64, offset: 1792)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !608, file: !602, line: 69, baseType: !722, size: 64, offset: 1856)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !608, file: !602, line: 70, baseType: !730, size: 64, offset: 1920)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !608, file: !602, line: 71, baseType: !738, size: 64, offset: 1984)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !608, file: !602, line: 72, baseType: !746, size: 64, offset: 2048)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!394, !599, !675}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !608, file: !602, line: 73, baseType: !722, size: 64, offset: 2112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !608, file: !602, line: 75, baseType: !751, size: 64, offset: 2176)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!394, !599, !754, !675}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !608, file: !602, line: 76, baseType: !625, size: 64, offset: 2240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !608, file: !602, line: 77, baseType: !625, size: 64, offset: 2304)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !608, file: !602, line: 78, baseType: !642, size: 64, offset: 2368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !608, file: !602, line: 79, baseType: !662, size: 64, offset: 2432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !608, file: !602, line: 81, baseType: !760, size: 64, offset: 2496)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!394, !599, !504, !599, !763}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !608, file: !602, line: 82, baseType: !765, size: 64, offset: 2560)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!394, !599, !440, !768, !768, !674, !770}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !608, file: !602, line: 83, baseType: !772, size: 64, offset: 2624)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!394, !599, !440, !775, !440}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !608, file: !602, line: 84, baseType: !777, size: 64, offset: 2688)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!394, !599, !440, !614, !440, !614, !503}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !608, file: !602, line: 85, baseType: !781, size: 64, offset: 2752)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!394, !599, !599, !763}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !608, file: !602, line: 87, baseType: !785, size: 64, offset: 2816)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!394, !599, !628, !486}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !608, file: !602, line: 88, baseType: !789, size: 64, offset: 2880)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!394, !599, !504}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !608, file: !602, line: 89, baseType: !789, size: 64, offset: 2944)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !608, file: !602, line: 90, baseType: !794, size: 64, offset: 3008)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!394, !599, !628, !618}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !608, file: !602, line: 91, baseType: !726, size: 64, offset: 3072)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !608, file: !602, line: 93, baseType: !799, size: 64, offset: 3136)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!394, !599, !802}
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !608, file: !602, line: 94, baseType: !806, size: 64, offset: 3200)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!394, !599, !440, !553, !553, !486, !809, !809, !699}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !608, file: !602, line: 95, baseType: !806, size: 64, offset: 3264)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !608, file: !602, line: 96, baseType: !806, size: 64, offset: 3328)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !608, file: !602, line: 97, baseType: !806, size: 64, offset: 3392)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !608, file: !602, line: 99, baseType: !814, size: 64, offset: 3456)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!394, !599, !817, !820}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !592, line: 51, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !592, line: 51, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !602, line: 609, size: 6208, elements: !823)
!823 = !{!824, !825, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !844, !851, !852, !853, !854, !855, !856, !857, !858, !862, !863, !864, !865, !866, !868, !869, !870, !871, !872, !873, !874}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !822, file: !602, line: 610, baseType: !605, size: 4480)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !822, file: !602, line: 610, baseType: !826, size: 32, offset: 4480)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !436)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !822, file: !602, line: 611, baseType: !440, size: 32, offset: 4512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !822, file: !602, line: 611, baseType: !440, size: 32, offset: 4544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !822, file: !602, line: 611, baseType: !440, size: 32, offset: 4576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !822, file: !602, line: 612, baseType: !440, size: 32, offset: 4608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !822, file: !602, line: 613, baseType: !440, size: 32, offset: 4640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !822, file: !602, line: 614, baseType: !486, size: 64, offset: 4672)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !822, file: !602, line: 615, baseType: !488, size: 64, offset: 4736)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !822, file: !602, line: 616, baseType: !775, size: 64, offset: 4800)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !822, file: !602, line: 617, baseType: !486, size: 64, offset: 4864)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !822, file: !602, line: 618, baseType: !837, size: 64, offset: 4928)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !602, line: 602, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 598, size: 128, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !839, file: !602, line: 599, baseType: !440, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !839, file: !602, line: 600, baseType: !440, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !839, file: !602, line: 601, baseType: !503, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !822, file: !602, line: 619, baseType: !845, size: 64, offset: 4992)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !602, line: 607, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 604, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !847, file: !602, line: 605, baseType: !440, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !847, file: !602, line: 606, baseType: !503, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !822, file: !602, line: 620, baseType: !503, size: 64, offset: 5056)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !822, file: !602, line: 621, baseType: !495, size: 64, offset: 5120)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !822, file: !602, line: 622, baseType: !495, size: 64, offset: 5184)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !822, file: !602, line: 623, baseType: !628, size: 64, offset: 5248)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !822, file: !602, line: 623, baseType: !628, size: 64, offset: 5312)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !822, file: !602, line: 623, baseType: !628, size: 64, offset: 5376)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !822, file: !602, line: 624, baseType: !553, size: 32, offset: 5440)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !822, file: !602, line: 625, baseType: !859, size: 64, offset: 5504)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!394}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !822, file: !602, line: 626, baseType: !477, size: 64, offset: 5568)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !822, file: !602, line: 627, baseType: !628, size: 64, offset: 5632)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !822, file: !602, line: 628, baseType: !440, size: 32, offset: 5696)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !822, file: !602, line: 629, baseType: !417, size: 64, offset: 5760)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !822, file: !602, line: 630, baseType: !867, size: 32, offset: 5824)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !822, file: !602, line: 631, baseType: !440, size: 32, offset: 5856)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !822, file: !602, line: 631, baseType: !440, size: 32, offset: 5888)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !822, file: !602, line: 632, baseType: !553, size: 32, offset: 5920)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !822, file: !602, line: 633, baseType: !553, size: 32, offset: 5952)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !822, file: !602, line: 634, baseType: !428, size: 64, offset: 6016)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !822, file: !602, line: 634, baseType: !477, size: 64, offset: 6080)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !822, file: !602, line: 635, baseType: !448, size: 64, offset: 6144)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !608, file: !602, line: 100, baseType: !876, size: 64, offset: 3520)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!394, !599, !440, !440, !879, !882}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !881)
!881 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !608, file: !602, line: 101, baseType: !722, size: 64, offset: 3584)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !608, file: !602, line: 102, baseType: !885, size: 64, offset: 3648)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!394, !599, !591, !591, !675}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !608, file: !602, line: 103, baseType: !611, size: 64, offset: 3712)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !608, file: !602, line: 105, baseType: !890, size: 64, offset: 3776)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!394, !599, !591, !591, !674, !675}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !608, file: !602, line: 106, baseType: !722, size: 64, offset: 3840)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !608, file: !602, line: 107, baseType: !895, size: 64, offset: 3904)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!394, !599, !404}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !608, file: !602, line: 108, baseType: !899, size: 64, offset: 3968)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!394, !599, !902, !674, !675}
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !417)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !608, file: !602, line: 109, baseType: !859, size: 64, offset: 4032)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !608, file: !602, line: 111, baseType: !905, size: 64, offset: 4096)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!394, !599, !599, !599, !495, !599}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !608, file: !602, line: 112, baseType: !909, size: 64, offset: 4160)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!394, !599, !599, !599, !599}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !608, file: !602, line: 113, baseType: !913, size: 64, offset: 4224)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!394, !599, !916, !916}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !592, line: 30, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !592, line: 30, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !608, file: !602, line: 114, baseType: !611, size: 64, offset: 4288)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !608, file: !602, line: 115, baseType: !726, size: 64, offset: 4352)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !608, file: !602, line: 117, baseType: !785, size: 64, offset: 4416)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !608, file: !602, line: 118, baseType: !785, size: 64, offset: 4480)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !608, file: !602, line: 119, baseType: !899, size: 64, offset: 4544)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !608, file: !602, line: 120, baseType: !925, size: 64, offset: 4608)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!394, !599, !928, !699}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !608, file: !602, line: 121, baseType: !859, size: 64, offset: 4672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !608, file: !602, line: 123, baseType: !931, size: 64, offset: 4736)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!394, !599, !440, !477}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !608, file: !602, line: 124, baseType: !935, size: 64, offset: 4800)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!394, !599, !820, !628, !477}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !608, file: !602, line: 125, baseType: !939, size: 64, offset: 4864)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!394, !532, !599}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !608, file: !602, line: 126, baseType: !625, size: 64, offset: 4928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !608, file: !602, line: 127, baseType: !625, size: 64, offset: 4992)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !608, file: !602, line: 129, baseType: !945, size: 64, offset: 5056)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!394, !599, !775}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !608, file: !602, line: 130, baseType: !949, size: 64, offset: 5120)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!394, !599, !952, !952}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !954, file: !60, line: 653, baseType: !440, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !954, file: !60, line: 653, baseType: !628, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !608, file: !602, line: 131, baseType: !949, size: 64, offset: 5184)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !608, file: !602, line: 132, baseType: !960, size: 64, offset: 5248)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!394, !599, !486, !486, !486}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !608, file: !602, line: 133, baseType: !895, size: 64, offset: 5312)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !608, file: !602, line: 135, baseType: !965, size: 64, offset: 5376)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!394, !599, !495, !699}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !608, file: !602, line: 136, baseType: !965, size: 64, offset: 5440)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !608, file: !602, line: 137, baseType: !970, size: 64, offset: 5504)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!394, !599, !699}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !608, file: !602, line: 138, baseType: !611, size: 64, offset: 5568)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !608, file: !602, line: 139, baseType: !975, size: 64, offset: 5632)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!394, !599, !978, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !608, file: !602, line: 141, baseType: !859, size: 64, offset: 5696)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !608, file: !602, line: 142, baseType: !981, size: 64, offset: 5760)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!394, !599, !599, !495, !599}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !608, file: !602, line: 143, baseType: !985, size: 64, offset: 5824)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!394, !599, !599, !599}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !608, file: !602, line: 144, baseType: !859, size: 64, offset: 5888)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !608, file: !602, line: 145, baseType: !981, size: 64, offset: 5952)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !608, file: !602, line: 147, baseType: !985, size: 64, offset: 6016)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !608, file: !602, line: 148, baseType: !859, size: 64, offset: 6080)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !608, file: !602, line: 149, baseType: !981, size: 64, offset: 6144)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !608, file: !602, line: 150, baseType: !985, size: 64, offset: 6208)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !608, file: !602, line: 151, baseType: !995, size: 64, offset: 6272)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!394, !599, !553}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !608, file: !602, line: 153, baseType: !722, size: 64, offset: 6336)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !608, file: !602, line: 154, baseType: !722, size: 64, offset: 6400)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !608, file: !602, line: 155, baseType: !722, size: 64, offset: 6464)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !608, file: !602, line: 156, baseType: !722, size: 64, offset: 6528)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !608, file: !602, line: 157, baseType: !895, size: 64, offset: 6592)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !608, file: !602, line: 159, baseType: !1004, size: 64, offset: 6656)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!394, !599, !440, !616}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !608, file: !602, line: 160, baseType: !722, size: 64, offset: 6720)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !608, file: !602, line: 161, baseType: !722, size: 64, offset: 6784)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !608, file: !602, line: 162, baseType: !722, size: 64, offset: 6848)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !608, file: !602, line: 163, baseType: !722, size: 64, offset: 6912)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !608, file: !602, line: 165, baseType: !985, size: 64, offset: 6976)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !608, file: !602, line: 166, baseType: !985, size: 64, offset: 7040)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !608, file: !602, line: 167, baseType: !785, size: 64, offset: 7104)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !608, file: !602, line: 168, baseType: !1015, size: 64, offset: 7168)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!394, !599, !628, !440}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !608, file: !602, line: 169, baseType: !1019, size: 64, offset: 7232)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!394, !599, !699, !486}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !608, file: !602, line: 171, baseType: !746, size: 64, offset: 7296)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !608, file: !602, line: 172, baseType: !722, size: 64, offset: 7360)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !608, file: !602, line: 173, baseType: !1025, size: 64, offset: 7424)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!394, !599, !486, !809}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !608, file: !602, line: 174, baseType: !885, size: 64, offset: 7488)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !608, file: !602, line: 175, baseType: !885, size: 64, offset: 7552)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !608, file: !602, line: 177, baseType: !625, size: 64, offset: 7616)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !608, file: !602, line: 178, baseType: !671, size: 64, offset: 7680)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !608, file: !602, line: 179, baseType: !625, size: 64, offset: 7744)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !608, file: !602, line: 180, baseType: !632, size: 64, offset: 7808)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !608, file: !602, line: 181, baseType: !1035, size: 64, offset: 7872)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!394, !599, !396, !674, !675}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !608, file: !602, line: 183, baseType: !945, size: 64, offset: 7936)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !608, file: !602, line: 184, baseType: !706, size: 64, offset: 8000)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !608, file: !602, line: 185, baseType: !1041, size: 64, offset: 8064)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!394, !599, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !608, file: !602, line: 186, baseType: !1046, size: 64, offset: 8128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!394, !599, !440, !614, !503}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !608, file: !602, line: 187, baseType: !765, size: 64, offset: 8192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !608, file: !602, line: 189, baseType: !1051, size: 64, offset: 8256)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!394, !599, !440, !440, !486, !616}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !608, file: !602, line: 190, baseType: !859, size: 64, offset: 8320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !608, file: !602, line: 191, baseType: !981, size: 64, offset: 8384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !608, file: !602, line: 192, baseType: !985, size: 64, offset: 8448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !608, file: !602, line: 193, baseType: !1058, size: 64, offset: 8512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!394, !599, !817, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !602, line: 660, size: 5312, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1063, file: !602, line: 661, baseType: !605, size: 4480)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1063, file: !602, line: 661, baseType: !826, size: 32, offset: 4480)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1063, file: !602, line: 662, baseType: !440, size: 32, offset: 4512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1063, file: !602, line: 662, baseType: !440, size: 32, offset: 4544)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1063, file: !602, line: 662, baseType: !440, size: 32, offset: 4576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1063, file: !602, line: 663, baseType: !440, size: 32, offset: 4608)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1063, file: !602, line: 664, baseType: !440, size: 32, offset: 4640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1063, file: !602, line: 665, baseType: !486, size: 64, offset: 4672)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1063, file: !602, line: 666, baseType: !486, size: 64, offset: 4736)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1063, file: !602, line: 667, baseType: !440, size: 32, offset: 4800)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1063, file: !602, line: 668, baseType: !867, size: 32, offset: 4832)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1063, file: !602, line: 670, baseType: !486, size: 64, offset: 4864)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1063, file: !602, line: 670, baseType: !486, size: 64, offset: 4928)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1063, file: !602, line: 671, baseType: !486, size: 64, offset: 4992)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1063, file: !602, line: 672, baseType: !486, size: 64, offset: 5056)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1063, file: !602, line: 673, baseType: !486, size: 64, offset: 5120)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1063, file: !602, line: 674, baseType: !440, size: 32, offset: 5184)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1063, file: !602, line: 675, baseType: !486, size: 64, offset: 5248)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !608, file: !602, line: 195, baseType: !1084, size: 64, offset: 8576)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!394, !1061, !599, !599}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !608, file: !602, line: 196, baseType: !1084, size: 64, offset: 8640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !608, file: !602, line: 197, baseType: !859, size: 64, offset: 8704)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !608, file: !602, line: 198, baseType: !981, size: 64, offset: 8768)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !608, file: !602, line: 199, baseType: !985, size: 64, offset: 8832)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !608, file: !602, line: 201, baseType: !1092, size: 64, offset: 8896)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!394, !599, !440, !440}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !608, file: !602, line: 202, baseType: !760, size: 64, offset: 8960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !608, file: !602, line: 203, baseType: !632, size: 64, offset: 9024)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !608, file: !602, line: 204, baseType: !814, size: 64, offset: 9088)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !608, file: !602, line: 205, baseType: !945, size: 64, offset: 9152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !608, file: !602, line: 206, baseType: !1100, size: 64, offset: 9216)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!394, !396, !599, !440, !674, !675}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !608, file: !602, line: 208, baseType: !1104, size: 64, offset: 9280)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!394, !440, !770}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !608, file: !602, line: 209, baseType: !985, size: 64, offset: 9344)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !608, file: !602, line: 210, baseType: !777, size: 64, offset: 9408)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !601, file: !602, line: 438, baseType: !1110, size: 64, offset: 13952)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !592, line: 60, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1112, file: !114, line: 241, baseType: !396, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !114, line: 242, baseType: !457, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1112, file: !114, line: 243, baseType: !440, size: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1112, file: !114, line: 243, baseType: !440, size: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1112, file: !114, line: 244, baseType: !440, size: 32, offset: 160)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1112, file: !114, line: 244, baseType: !440, size: 32, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1112, file: !114, line: 245, baseType: !486, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1112, file: !114, line: 246, baseType: !553, size: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1112, file: !114, line: 247, baseType: !440, size: 32, offset: 352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1112, file: !114, line: 251, baseType: !440, size: 32, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1112, file: !114, line: 252, baseType: !916, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1112, file: !114, line: 253, baseType: !553, size: 32, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1112, file: !114, line: 254, baseType: !440, size: 32, offset: 544)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1112, file: !114, line: 254, baseType: !440, size: 32, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1112, file: !114, line: 255, baseType: !440, size: 32, offset: 608)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !601, file: !602, line: 438, baseType: !1110, size: 64, offset: 14016)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !602, line: 439, baseType: !477, size: 64, offset: 14080)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !601, file: !602, line: 440, baseType: !1132, size: 32, offset: 14144)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !601, file: !602, line: 441, baseType: !553, size: 32, offset: 14176)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !601, file: !602, line: 442, baseType: !553, size: 32, offset: 14208)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !601, file: !602, line: 443, baseType: !1136, size: 448, offset: 14272)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 448, elements: !1138)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !417)
!1138 = !{!1139}
!1139 = !DISubrange(count: 7)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !601, file: !602, line: 444, baseType: !553, size: 32, offset: 14720)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !601, file: !602, line: 445, baseType: !553, size: 32, offset: 14752)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !601, file: !602, line: 446, baseType: !440, size: 32, offset: 14784)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !601, file: !602, line: 447, baseType: !479, size: 64, offset: 14848)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !601, file: !602, line: 448, baseType: !479, size: 64, offset: 14912)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !601, file: !602, line: 449, baseType: !682, size: 640, offset: 14976)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !601, file: !602, line: 450, baseType: !618, size: 32, offset: 15616)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !601, file: !602, line: 451, baseType: !1148, size: 2880, offset: 15680)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !602, line: 318, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !602, line: 319, size: 2880, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1157, !1170, !1171, !1176, !1181, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1196, !1197, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1229, !1230, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1255, !1259, !1260}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1149, file: !602, line: 320, baseType: !440, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1149, file: !602, line: 321, baseType: !440, size: 32, offset: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1149, file: !602, line: 322, baseType: !440, size: 32, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1149, file: !602, line: 323, baseType: !440, size: 32, offset: 96)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1149, file: !602, line: 324, baseType: !440, size: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1149, file: !602, line: 325, baseType: !440, size: 32, offset: 160)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1149, file: !602, line: 326, baseType: !1158, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !602, line: 293, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !602, line: 295, size: 448, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1160, file: !602, line: 296, baseType: !1158, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1160, file: !602, line: 297, baseType: !503, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1160, file: !602, line: 297, baseType: !503, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1160, file: !602, line: 298, baseType: !486, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1160, file: !602, line: 298, baseType: !486, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1160, file: !602, line: 299, baseType: !440, size: 32, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1160, file: !602, line: 300, baseType: !440, size: 32, offset: 352)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1160, file: !602, line: 301, baseType: !440, size: 32, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1149, file: !602, line: 326, baseType: !1158, size: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1149, file: !602, line: 328, baseType: !1172, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!394, !599, !1175, !486}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1149, file: !602, line: 329, baseType: !1177, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!394, !1175, !1180, !488, !488, !506, !486}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1149, file: !602, line: 330, baseType: !1182, size: 64, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!394, !1175}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1149, file: !602, line: 331, baseType: !1182, size: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1149, file: !602, line: 334, baseType: !396, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1149, file: !602, line: 335, baseType: !457, size: 32, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1149, file: !602, line: 335, baseType: !457, size: 32, offset: 672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1149, file: !602, line: 336, baseType: !457, size: 32, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1149, file: !602, line: 336, baseType: !457, size: 32, offset: 736)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1149, file: !602, line: 337, baseType: !1192, size: 64, offset: 768)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !397, line: 339, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !397, line: 339, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1149, file: !602, line: 338, baseType: !1192, size: 64, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1149, file: !602, line: 339, baseType: !1198, size: 64, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !397, line: 341, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !397, line: 351, size: 192, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1200, file: !397, line: 354, baseType: !72, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1200, file: !397, line: 355, baseType: !72, size: 32, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1200, file: !397, line: 356, baseType: !72, size: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1200, file: !397, line: 361, baseType: !72, size: 32, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1200, file: !397, line: 362, baseType: !375, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1149, file: !602, line: 340, baseType: !440, size: 32, offset: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1149, file: !602, line: 340, baseType: !440, size: 32, offset: 992)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1149, file: !602, line: 341, baseType: !503, size: 64, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1149, file: !602, line: 342, baseType: !486, size: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1149, file: !602, line: 343, baseType: !506, size: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1149, file: !602, line: 344, baseType: !488, size: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1149, file: !602, line: 345, baseType: !440, size: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1149, file: !602, line: 346, baseType: !1180, size: 64, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1149, file: !602, line: 347, baseType: !553, size: 32, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1149, file: !602, line: 348, baseType: !440, size: 32, offset: 1440)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1149, file: !602, line: 351, baseType: !553, size: 32, offset: 1472)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1149, file: !602, line: 352, baseType: !553, size: 32, offset: 1504)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1149, file: !602, line: 353, baseType: !457, size: 32, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1149, file: !602, line: 354, baseType: !457, size: 32, offset: 1568)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1149, file: !602, line: 355, baseType: !1180, size: 64, offset: 1600)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1149, file: !602, line: 356, baseType: !1180, size: 64, offset: 1664)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1149, file: !602, line: 357, baseType: !1224, size: 64, offset: 1728)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !602, line: 310, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 308, size: 32, elements: !1227)
!1227 = !{!1228}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1226, file: !602, line: 309, baseType: !440, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1149, file: !602, line: 357, baseType: !1224, size: 64, offset: 1792)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1149, file: !602, line: 358, baseType: !1231, size: 64, offset: 1856)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !602, line: 316, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 312, size: 128, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1233, file: !602, line: 313, baseType: !477, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1233, file: !602, line: 314, baseType: !440, size: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1233, file: !602, line: 315, baseType: !419, size: 8, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1149, file: !602, line: 359, baseType: !1231, size: 64, offset: 1920)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1149, file: !602, line: 360, baseType: !1231, size: 64, offset: 1984)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1149, file: !602, line: 361, baseType: !440, size: 32, offset: 2048)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1149, file: !602, line: 362, baseType: !457, size: 32, offset: 2080)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1149, file: !602, line: 363, baseType: !440, size: 32, offset: 2112)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1149, file: !602, line: 364, baseType: !1180, size: 64, offset: 2176)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1149, file: !602, line: 365, baseType: !1198, size: 64, offset: 2240)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1149, file: !602, line: 366, baseType: !457, size: 32, offset: 2304)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1149, file: !602, line: 367, baseType: !457, size: 32, offset: 2336)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1149, file: !602, line: 368, baseType: !1192, size: 64, offset: 2368)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1149, file: !602, line: 369, baseType: !1192, size: 64, offset: 2432)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1149, file: !602, line: 370, baseType: !1250, size: 64, offset: 2496)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1149, file: !602, line: 371, baseType: !1250, size: 64, offset: 2560)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1149, file: !602, line: 372, baseType: !1250, size: 64, offset: 2624)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1149, file: !602, line: 373, baseType: !1256, size: 64, offset: 2688)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !397, line: 331, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !397, line: 331, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1149, file: !602, line: 374, baseType: !375, size: 64, offset: 2752)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1149, file: !602, line: 375, baseType: !1261, size: 64, offset: 2816)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !601, file: !602, line: 451, baseType: !1148, size: 2880, offset: 18560)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !601, file: !602, line: 452, baseType: !1264, size: 64, offset: 21440)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !602, line: 681, size: 4864, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1266, file: !602, line: 682, baseType: !605, size: 4480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1266, file: !602, line: 682, baseType: !826, size: 32, offset: 4480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1266, file: !602, line: 683, baseType: !553, size: 32, offset: 4512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1266, file: !602, line: 684, baseType: !440, size: 32, offset: 4544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1266, file: !602, line: 685, baseType: !978, size: 64, offset: 4608)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1266, file: !602, line: 686, baseType: !503, size: 64, offset: 4672)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1266, file: !602, line: 687, baseType: !1275, size: 64, offset: 4736)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!394, !1264, !628, !477}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1266, file: !602, line: 688, baseType: !477, size: 64, offset: 4800)
