; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag3d.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag3d.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

!58 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 140, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 60, baseType: !5, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71}
!66 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 16, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!80 = !DIEnumerator(name: "DMSTAG_NULL_LOCATION", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_LEFT", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "DMSTAG_BACK_DOWN", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "DMSTAG_BACK_DOWN_RIGHT", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "DMSTAG_BACK_LEFT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "DMSTAG_BACK", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "DMSTAG_BACK_RIGHT", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "DMSTAG_BACK_UP_LEFT", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "DMSTAG_BACK_UP", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "DMSTAG_BACK_UP_RIGHT", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "DMSTAG_DOWN_LEFT", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "DMSTAG_DOWN", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "DMSTAG_DOWN_RIGHT", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "DMSTAG_LEFT", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "DMSTAG_ELEMENT", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "DMSTAG_RIGHT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "DMSTAG_UP_LEFT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "DMSTAG_UP", value: 17, isUnsigned: true)
!98 = !DIEnumerator(name: "DMSTAG_UP_RIGHT", value: 18, isUnsigned: true)
!99 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_LEFT", value: 19, isUnsigned: true)
!100 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN", value: 20, isUnsigned: true)
!101 = !DIEnumerator(name: "DMSTAG_FRONT_DOWN_RIGHT", value: 21, isUnsigned: true)
!102 = !DIEnumerator(name: "DMSTAG_FRONT_LEFT", value: 22, isUnsigned: true)
!103 = !DIEnumerator(name: "DMSTAG_FRONT", value: 23, isUnsigned: true)
!104 = !DIEnumerator(name: "DMSTAG_FRONT_RIGHT", value: 24, isUnsigned: true)
!105 = !DIEnumerator(name: "DMSTAG_FRONT_UP_LEFT", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "DMSTAG_FRONT_UP", value: 26, isUnsigned: true)
!107 = !DIEnumerator(name: "DMSTAG_FRONT_UP_RIGHT", value: 27, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 327, baseType: !5, size: 32, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!113 = !{!114, !118, !119, !122, !174, !280, !254, !130, !172, !337, !237, !129}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !115, line: 330, baseType: !116)
!115 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !115, line: 330, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Stag", file: !124, line: 47, baseType: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmstagimpl.h", directory: "/home/users/ndemeye/xSDK")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 13, size: 1792, elements: !126)
!126 = !{!127, !133, !134, !137, !141, !143, !144, !147, !148, !151, !152, !153, !154, !157, !159, !165, !166, !167, !168, !169, !170, !173}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !125, file: !124, line: 16, baseType: !128, size: 96)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, elements: !131)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !19, line: 102, baseType: !130)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !125, file: !124, line: 17, baseType: !128, size: 96, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !125, file: !124, line: 18, baseType: !135, size: 192, offset: 192)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 192, elements: !131)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !125, file: !124, line: 19, baseType: !138, size: 128, offset: 384)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "stencilType", scope: !125, file: !124, line: 20, baseType: !142, size: 32, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMStagStencilType", file: !13, line: 75, baseType: !12)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stencilWidth", scope: !125, file: !124, line: 21, baseType: !129, size: 32, offset: 544)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "boundaryType", scope: !125, file: !124, line: 22, baseType: !145, size: 96, offset: 576)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 96, elements: !131)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !4, line: 42, baseType: !3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nRanks", scope: !125, file: !124, line: 23, baseType: !128, size: 96, offset: 672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDMType", scope: !125, file: !124, line: 26, baseType: !149, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMType", file: !150, line: 26, baseType: !119)
!150 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nGhost", scope: !125, file: !124, line: 31, baseType: !128, size: 96, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !125, file: !124, line: 32, baseType: !128, size: 96, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "startGhost", scope: !125, file: !124, line: 33, baseType: !128, size: 96, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !125, file: !124, line: 34, baseType: !155, size: 96, offset: 1120)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 96, elements: !131)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !19, line: 49, baseType: !130)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !125, file: !124, line: 35, baseType: !158, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !125, file: !124, line: 36, baseType: !160, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !161, line: 59, baseType: !162)
!161 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !161, line: 15, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !161, line: 15, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ltog_injective", scope: !125, file: !124, line: 37, baseType: !160, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "locationOffsets", scope: !125, file: !124, line: 38, baseType: !136, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "entriesPerElement", scope: !125, file: !124, line: 41, baseType: !129, size: 32, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !125, file: !124, line: 42, baseType: !129, size: 32, offset: 1504)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "entriesGhost", scope: !125, file: !124, line: 43, baseType: !129, size: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "firstRank", scope: !125, file: !124, line: 44, baseType: !171, size: 96, offset: 1568)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 96, elements: !131)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !19, line: 170, baseType: !18)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "lastRank", scope: !125, file: !124, line: 45, baseType: !171, size: 96, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !19, line: 430, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !177, line: 73, size: 4480, elements: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!178 = !{!179, !181, !227, !228, !229, !232, !233, !234, !235, !243, !244, !245, !249, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268, !270, !271, !272, !274, !275, !276, !277, !278, !281, !283, !284, !285, !286, !287, !290, !292, !293, !294, !304, !306, !307, !311, !312, !360, !365, !367, !368, !369}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !176, file: !177, line: 74, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !19, line: 32, baseType: !130)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !176, file: !177, line: 75, baseType: !182, size: 448, offset: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 448, elements: !225)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !177, line: 53, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 45, size: 448, elements: !185)
!185 = !{!186, !192, !200, !205, !209, !213, !220}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !184, file: !177, line: 46, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !174, !191}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !19, line: 14, baseType: !130)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !184, file: !177, line: 47, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!190, !174, !196}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !197, line: 16, baseType: !198)
!197 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !197, line: 16, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !184, file: !177, line: 48, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!190, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !184, file: !177, line: 49, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!190, !174, !119, !174}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !184, file: !177, line: 50, baseType: !210, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!190, !174, !119, !204}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !184, file: !177, line: 51, baseType: !214, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!190, !174, !119, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !184, file: !177, line: 52, baseType: !221, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!190, !174, !119, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!225 = !{!226}
!226 = !DISubrange(count: 1)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !176, file: !177, line: 76, baseType: !114, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !177, line: 77, baseType: !129, size: 32, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !176, file: !177, line: 78, baseType: !230, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !19, line: 360, baseType: !231)
!231 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !176, file: !177, line: 78, baseType: !230, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !176, file: !177, line: 78, baseType: !230, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !176, file: !177, line: 78, baseType: !230, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !176, file: !177, line: 79, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !19, line: 442, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !19, line: 90, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !239, line: 27, baseType: !240)
!239 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !241, line: 43, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !176, file: !177, line: 80, baseType: !129, size: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !176, file: !177, line: 81, baseType: !156, size: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !176, file: !177, line: 82, baseType: !246, size: 64, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !19, line: 465, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !19, line: 465, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !176, file: !177, line: 83, baseType: !250, size: 64, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !19, line: 496, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !19, line: 496, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !176, file: !177, line: 84, baseType: !254, size: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !176, file: !177, line: 85, baseType: !254, size: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !176, file: !177, line: 86, baseType: !254, size: 64, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !176, file: !177, line: 87, baseType: !254, size: 64, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !176, file: !177, line: 88, baseType: !174, size: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !176, file: !177, line: 89, baseType: !236, size: 64, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !177, line: 90, baseType: !254, size: 64, offset: 1536)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !176, file: !177, line: 91, baseType: !254, size: 64, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !176, file: !177, line: 92, baseType: !129, size: 32, offset: 1664)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !176, file: !177, line: 93, baseType: !118, size: 64, offset: 1728)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !177, line: 94, baseType: !265, size: 64, offset: 1792)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !19, line: 455, baseType: !237)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !176, file: !177, line: 95, baseType: !129, size: 32, offset: 1856)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !176, file: !177, line: 95, baseType: !129, size: 32, offset: 1888)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !176, file: !177, line: 96, baseType: !269, size: 64, offset: 1920)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !176, file: !177, line: 96, baseType: !269, size: 64, offset: 1984)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !176, file: !177, line: 97, baseType: !136, size: 64, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !176, file: !177, line: 97, baseType: !273, size: 64, offset: 2112)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !176, file: !177, line: 98, baseType: !129, size: 32, offset: 2176)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !176, file: !177, line: 98, baseType: !129, size: 32, offset: 2208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !176, file: !177, line: 99, baseType: !269, size: 64, offset: 2240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !176, file: !177, line: 99, baseType: !269, size: 64, offset: 2304)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !176, file: !177, line: 100, baseType: !279, size: 64, offset: 2368)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !19, line: 189, baseType: !231)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !176, file: !177, line: 100, baseType: !282, size: 64, offset: 2432)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !176, file: !177, line: 101, baseType: !129, size: 32, offset: 2496)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !176, file: !177, line: 101, baseType: !129, size: 32, offset: 2528)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !176, file: !177, line: 102, baseType: !269, size: 64, offset: 2560)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !176, file: !177, line: 102, baseType: !269, size: 64, offset: 2624)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !176, file: !177, line: 103, baseType: !288, size: 64, offset: 2688)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !19, line: 305, baseType: !280)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !176, file: !177, line: 103, baseType: !291, size: 64, offset: 2752)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !176, file: !177, line: 104, baseType: !224, size: 64, offset: 2816)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !176, file: !177, line: 105, baseType: !129, size: 32, offset: 2880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !176, file: !177, line: 106, baseType: !295, size: 128, offset: 2944)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 128, elements: !302)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !177, line: 64, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 61, size: 128, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !298, file: !177, line: 62, baseType: !217, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !298, file: !177, line: 63, baseType: !118, size: 64, offset: 64)
!302 = !{!303}
!303 = !DISubrange(count: 2)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !176, file: !177, line: 107, baseType: !305, size: 64, offset: 3072)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 64, elements: !302)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !176, file: !177, line: 108, baseType: !118, size: 64, offset: 3136)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !176, file: !177, line: 109, baseType: !308, size: 64, offset: 3200)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!190, !118}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !176, file: !177, line: 111, baseType: !129, size: 32, offset: 3264)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !176, file: !177, line: 112, baseType: !313, size: 320, offset: 3328)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 320, elements: !358)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!190, !317, !174, !118}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !24, line: 108, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !24, line: 99, size: 640, elements: !320)
!320 = !{!321, !322, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !319, file: !24, line: 100, baseType: !129, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !24, line: 101, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !24, line: 82, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !24, line: 83, size: 768, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !334, !335, !336, !340, !341, !343, !344, !345}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !325, file: !24, line: 84, baseType: !254, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !325, file: !24, line: 85, baseType: !254, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !24, line: 86, baseType: !118, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !325, file: !24, line: 87, baseType: !246, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !325, file: !24, line: 88, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !325, file: !24, line: 89, baseType: !121, size: 8, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !325, file: !24, line: 90, baseType: !254, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !325, file: !24, line: 91, baseType: !337, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !338, line: 46, baseType: !339)
!338 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!339 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !325, file: !24, line: 92, baseType: !172, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !24, line: 93, baseType: !342, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !24, line: 81, baseType: !23)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !24, line: 94, baseType: !323, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !325, file: !24, line: 95, baseType: !254, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !325, file: !24, line: 96, baseType: !118, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !319, file: !24, line: 102, baseType: !254, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !319, file: !24, line: 102, baseType: !254, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !319, file: !24, line: 103, baseType: !254, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !319, file: !24, line: 104, baseType: !114, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !319, file: !24, line: 105, baseType: !172, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !319, file: !24, line: 105, baseType: !172, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !319, file: !24, line: 105, baseType: !172, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !319, file: !24, line: 106, baseType: !174, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !319, file: !24, line: 107, baseType: !355, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !24, line: 10, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !24, line: 10, flags: DIFlagFwdDecl)
!358 = !{!359}
!359 = !DISubrange(count: 5)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !176, file: !177, line: 113, baseType: !361, size: 320, offset: 3648)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 320, elements: !358)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!190, !174, !118}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !176, file: !177, line: 114, baseType: !366, size: 320, offset: 3968)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 320, elements: !358)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !176, file: !177, line: 115, baseType: !172, size: 32, offset: 4288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !176, file: !177, line: 120, baseType: !355, size: 64, offset: 4352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !176, file: !177, line: 121, baseType: !172, size: 32, offset: 4416)
!370 = !{i32 7, !"Dwarf Version", i32 4}
!371 = !{i32 2, !"Debug Info Version", i32 3}
!372 = !{i32 1, !"wchar_size", i32 4}
!373 = !{i32 7, !"PIC Level", i32 2}
!374 = !{i32 7, !"uwtable", i32 1}
!375 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!376 = distinct !DISubprogram(name: "DMStagCreate3d", scope: !377, file: !377, line: 47, type: !378, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1121)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/stag/stag3d.c", directory: "/home/users/ndemeye/xSDK")
!378 = !DISubroutineType(types: !379)
!379 = !{!190, !114, !146, !146, !146, !129, !129, !129, !129, !129, !129, !129, !129, !129, !129, !142, !129, !380, !380, !380, !382}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !4, line: 14, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !60, line: 202, size: 40000, elements: !386)
!386 = !{!387, !389, !617, !621, !622, !623, !624, !634, !635, !643, !644, !652, !653, !654, !655, !659, !660, !664, !666, !668, !669, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !697, !709, !721, !733, !742, !743, !766, !767, !768, !769, !770, !771, !773, !864, !865, !885, !886, !887, !888, !889, !890, !894, !895, !899, !900, !901, !902, !903, !904, !905, !906, !907, !909, !921, !922, !923, !932, !1020, !1021, !1109, !1110, !1111, !1112, !1114, !1116, !1117, !1118, !1119, !1120}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !385, file: !60, line: 203, baseType: !388, size: 4480)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !177, line: 122, baseType: !176)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !385, file: !60, line: 203, baseType: !390, size: 3456, offset: 4480)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 3456, elements: !225)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !60, line: 30, size: 3456, elements: !392)
!392 = !{!393, !397, !398, !402, !406, !410, !411, !412, !421, !422, !423, !435, !436, !444, !453, !462, !466, !470, !471, !476, !477, !481, !482, !486, !487, !495, !499, !504, !505, !506, !507, !508, !509, !510, !514, !518, !522, !527, !531, !537, !541, !546, !553, !557, !558, !563, !574, !578, !588, !592, !600, !604, !612, !613}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !391, file: !60, line: 31, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!190, !383, !196}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !391, file: !60, line: 32, baseType: !394, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !391, file: !60, line: 33, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!190, !383, !382}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !391, file: !60, line: 34, baseType: !403, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!190, !317, !383}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !391, file: !60, line: 35, baseType: !407, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!190, !383}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !391, file: !60, line: 36, baseType: !407, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !391, file: !60, line: 37, baseType: !407, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !391, file: !60, line: 38, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!190, !383, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !418, line: 21, baseType: !419)
!418 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !418, line: 21, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !391, file: !60, line: 39, baseType: !413, size: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !391, file: !60, line: 40, baseType: !407, size: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !391, file: !60, line: 41, baseType: !424, size: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!190, !383, !136, !427, !429}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !432, line: 11, baseType: !433)
!432 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !432, line: 11, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !391, file: !60, line: 42, baseType: !399, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !391, file: !60, line: 43, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!190, !383, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !4, line: 165, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !4, line: 165, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !391, file: !60, line: 45, baseType: !445, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!190, !383, !448, !449}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !39, line: 213, baseType: !38)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !432, line: 51, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !432, line: 51, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !391, file: !60, line: 46, baseType: !454, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!190, !383, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !459, line: 16, baseType: !460)
!459 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !459, line: 16, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !391, file: !60, line: 47, baseType: !463, size: 64, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!190, !383, !383, !457, !416}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !391, file: !60, line: 48, baseType: !467, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!190, !383, !383, !457}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !391, file: !60, line: 49, baseType: !467, size: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !391, file: !60, line: 50, baseType: !472, size: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!190, !383, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !391, file: !60, line: 51, baseType: !467, size: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !391, file: !60, line: 53, baseType: !478, size: 64, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!190, !383, !114, !382}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !391, file: !60, line: 54, baseType: !478, size: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !391, file: !60, line: 55, baseType: !483, size: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!190, !383, !129, !382}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !391, file: !60, line: 56, baseType: !483, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !391, file: !60, line: 57, baseType: !488, size: 64, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!190, !383, !491, !382}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !492, line: 12, baseType: !493)
!492 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !492, line: 12, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !391, file: !60, line: 58, baseType: !496, size: 64, offset: 1600)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!190, !383, !417, !491, !382}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !391, file: !60, line: 60, baseType: !500, size: 64, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!190, !383, !417, !503, !417}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !19, line: 580, baseType: !43)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !391, file: !60, line: 61, baseType: !500, size: 64, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !391, file: !60, line: 62, baseType: !500, size: 64, offset: 1792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !391, file: !60, line: 63, baseType: !500, size: 64, offset: 1856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !391, file: !60, line: 64, baseType: !500, size: 64, offset: 1920)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !391, file: !60, line: 65, baseType: !500, size: 64, offset: 1984)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !391, file: !60, line: 67, baseType: !407, size: 64, offset: 2048)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !391, file: !60, line: 69, baseType: !511, size: 64, offset: 2112)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!190, !383, !417, !417}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !391, file: !60, line: 71, baseType: !515, size: 64, offset: 2176)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!190, !383, !129, !380, !430, !382}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !391, file: !60, line: 72, baseType: !519, size: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!190, !382, !129, !429, !382}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !391, file: !60, line: 73, baseType: !523, size: 64, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!190, !383, !136, !427, !429, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !391, file: !60, line: 74, baseType: !528, size: 64, offset: 2368)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!190, !383, !136, !427, !429, !429, !526}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !391, file: !60, line: 75, baseType: !532, size: 64, offset: 2432)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!190, !383, !129, !382, !535, !535, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !391, file: !60, line: 77, baseType: !538, size: 64, offset: 2496)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!190, !383, !129, !136, !136}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !391, file: !60, line: 78, baseType: !542, size: 64, offset: 2560)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!190, !383, !417, !545, !162}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !4, line: 74, baseType: !54)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !391, file: !60, line: 79, baseType: !547, size: 64, offset: 2624)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!190, !383, !136, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !391, file: !60, line: 80, baseType: !554, size: 64, offset: 2688)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!190, !383, !279, !279}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !391, file: !60, line: 81, baseType: !554, size: 64, offset: 2752)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !391, file: !60, line: 82, baseType: !559, size: 64, offset: 2816)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!190, !383, !417, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !391, file: !60, line: 84, baseType: !564, size: 64, offset: 2880)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!190, !383, !280, !567, !573, !503, !417}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!190, !129, !280, !571, !129, !288, !118}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !391, file: !60, line: 85, baseType: !575, size: 64, offset: 2944)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!190, !383, !280, !491, !129, !380, !129, !380, !567, !573, !503, !417}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !391, file: !60, line: 86, baseType: !579, size: 64, offset: 3008)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!190, !383, !280, !417, !582, !503, !417}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !129, !129, !129, !380, !380, !586, !586, !586, !380, !380, !586, !586, !586, !280, !571, !129, !586, !288}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !391, file: !60, line: 87, baseType: !589, size: 64, offset: 3072)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!190, !383, !280, !491, !129, !380, !129, !380, !417, !582, !503, !417}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !391, file: !60, line: 88, baseType: !593, size: 64, offset: 3136)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!190, !383, !280, !491, !129, !380, !129, !380, !417, !596, !503, !417}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !129, !129, !129, !380, !380, !586, !586, !586, !380, !380, !586, !586, !586, !280, !571, !571, !129, !586, !288}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !391, file: !60, line: 89, baseType: !601, size: 64, offset: 3200)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!190, !383, !280, !567, !573, !417, !279}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !391, file: !60, line: 90, baseType: !605, size: 64, offset: 3264)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!190, !383, !280, !608, !573, !417, !571, !279}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!190, !129, !280, !571, !571, !129, !288, !118}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !391, file: !60, line: 91, baseType: !601, size: 64, offset: 3328)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !391, file: !60, line: 93, baseType: !614, size: 64, offset: 3392)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!190, !383, !383, !475, !475}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !385, file: !60, line: 204, baseType: !618, size: 6400, offset: 7936)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 6400, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 100)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !385, file: !60, line: 204, baseType: !618, size: 6400, offset: 14336)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !385, file: !60, line: 205, baseType: !618, size: 6400, offset: 20736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !385, file: !60, line: 205, baseType: !618, size: 6400, offset: 27136)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !385, file: !60, line: 206, baseType: !625, size: 64, offset: 33536)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !60, line: 141, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !60, line: 142, size: 256, elements: !628)
!628 = !{!629, !630, !631, !633}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !627, file: !60, line: 143, baseType: !417, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !60, line: 144, baseType: !254, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !627, file: !60, line: 145, baseType: !632, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !60, line: 140, baseType: !59)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !60, line: 146, baseType: !625, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !385, file: !60, line: 207, baseType: !625, size: 64, offset: 33600)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !385, file: !60, line: 208, baseType: !636, size: 64, offset: 33664)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !60, line: 149, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !60, line: 150, size: 192, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !638, file: !60, line: 151, baseType: !337, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !638, file: !60, line: 152, baseType: !118, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !60, line: 153, baseType: !636, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !385, file: !60, line: 208, baseType: !636, size: 64, offset: 33728)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !385, file: !60, line: 209, baseType: !645, size: 64, offset: 33792)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !60, line: 163, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !60, line: 158, size: 192, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !647, file: !60, line: 159, baseType: !491, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !647, file: !60, line: 160, baseType: !172, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !60, line: 161, baseType: !646, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !385, file: !60, line: 210, baseType: !491, size: 64, offset: 33856)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !385, file: !60, line: 211, baseType: !491, size: 64, offset: 33920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !385, file: !60, line: 212, baseType: !118, size: 64, offset: 33984)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !385, file: !60, line: 213, baseType: !656, size: 64, offset: 34048)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!190, !573}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !385, file: !60, line: 214, baseType: !448, size: 32, offset: 34112)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !385, file: !60, line: 215, baseType: !661, size: 64, offset: 34176)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !459, line: 1378, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !459, line: 1378, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !385, file: !60, line: 216, baseType: !665, size: 64, offset: 34240)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !418, line: 83, baseType: !119)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !385, file: !60, line: 217, baseType: !667, size: 64, offset: 34304)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !459, line: 25, baseType: !119)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !385, file: !60, line: 218, baseType: !129, size: 32, offset: 34368)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !385, file: !60, line: 219, baseType: !670, size: 64, offset: 34432)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !432, line: 30, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !432, line: 30, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !385, file: !60, line: 220, baseType: !172, size: 32, offset: 34496)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !385, file: !60, line: 221, baseType: !172, size: 32, offset: 34528)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !385, file: !60, line: 222, baseType: !129, size: 32, offset: 34560)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !385, file: !60, line: 222, baseType: !129, size: 32, offset: 34592)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !385, file: !60, line: 223, baseType: !172, size: 32, offset: 34624)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !385, file: !60, line: 224, baseType: !172, size: 32, offset: 34656)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !60, line: 225, baseType: !118, size: 64, offset: 34688)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !385, file: !60, line: 227, baseType: !383, size: 64, offset: 34752)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !385, file: !60, line: 228, baseType: !383, size: 64, offset: 34816)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !385, file: !60, line: 229, baseType: !683, size: 64, offset: 34880)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !60, line: 100, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !60, line: 101, size: 256, elements: !686)
!686 = !{!687, !691, !695, !696}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !685, file: !60, line: 102, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!190, !383, !383, !118}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !685, file: !60, line: 103, baseType: !692, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!190, !383, !458, !417, !458, !383, !118}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !685, file: !60, line: 104, baseType: !118, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !685, file: !60, line: 105, baseType: !683, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !385, file: !60, line: 230, baseType: !698, size: 64, offset: 34944)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !60, line: 108, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !60, line: 109, size: 256, elements: !701)
!701 = !{!702, !703, !707, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !700, file: !60, line: 110, baseType: !688, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !700, file: !60, line: 111, baseType: !704, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!190, !383, !458, !383, !118}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !700, file: !60, line: 112, baseType: !118, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !60, line: 113, baseType: !698, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !385, file: !60, line: 231, baseType: !710, size: 64, offset: 35008)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !60, line: 116, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !60, line: 117, size: 256, elements: !713)
!713 = !{!714, !715, !719, !720}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !712, file: !60, line: 118, baseType: !688, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !712, file: !60, line: 119, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!190, !383, !160, !160, !383, !118}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !712, file: !60, line: 120, baseType: !118, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !60, line: 121, baseType: !710, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !385, file: !60, line: 232, baseType: !722, size: 64, offset: 35072)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !60, line: 124, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !60, line: 125, size: 256, elements: !725)
!725 = !{!726, !730, !731, !732}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !724, file: !60, line: 126, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!190, !383, !417, !503, !417, !118}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !724, file: !60, line: 127, baseType: !727, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !724, file: !60, line: 128, baseType: !118, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !60, line: 129, baseType: !722, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !385, file: !60, line: 233, baseType: !734, size: 64, offset: 35136)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !60, line: 132, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !60, line: 133, size: 256, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !736, file: !60, line: 134, baseType: !727, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !736, file: !60, line: 135, baseType: !727, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !736, file: !60, line: 136, baseType: !118, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !60, line: 137, baseType: !734, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !385, file: !60, line: 235, baseType: !129, size: 32, offset: 35200)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !385, file: !60, line: 237, baseType: !744, size: 64, offset: 35264)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !60, line: 27, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !60, line: 27, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !60, line: 27, size: 320, elements: !748)
!748 = !{!749, !753, !754, !755, !756, !758, !765}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !747, file: !60, line: 27, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !751, line: 166, baseType: !752)
!751 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !751, line: 139, baseType: !5)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !747, file: !60, line: 27, baseType: !750, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !747, file: !60, line: 27, baseType: !750, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !747, file: !60, line: 27, baseType: !750, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !747, file: !60, line: 27, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !747, file: !60, line: 27, baseType: !759, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !60, line: 21, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !60, line: 17, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !761, file: !60, line: 19, baseType: !491, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !761, file: !60, line: 20, baseType: !129, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !747, file: !60, line: 27, baseType: !416, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !385, file: !60, line: 239, baseType: !162, size: 64, offset: 35328)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !385, file: !60, line: 240, baseType: !162, size: 64, offset: 35392)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !385, file: !60, line: 241, baseType: !162, size: 64, offset: 35456)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !385, file: !60, line: 242, baseType: !162, size: 64, offset: 35520)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !385, file: !60, line: 243, baseType: !172, size: 32, offset: 35584)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !385, file: !60, line: 245, baseType: !772, size: 64, offset: 35616)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !302)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !385, file: !60, line: 246, baseType: !774, size: 64, offset: 35712)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !775, line: 18, baseType: !776)
!775 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !778, line: 29, size: 5760, elements: !779)
!778 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!779 = !{!780, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !799, !800, !801, !802, !827, !828, !829}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !777, file: !778, line: 30, baseType: !388, size: 4480)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !777, file: !778, line: 30, baseType: !782, size: 32, offset: 4480)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !225)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !777, file: !778, line: 31, baseType: !129, size: 32, offset: 4512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !777, file: !778, line: 31, baseType: !129, size: 32, offset: 4544)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !777, file: !778, line: 32, baseType: !431, size: 64, offset: 4608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !777, file: !778, line: 33, baseType: !172, size: 32, offset: 4672)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !777, file: !778, line: 34, baseType: !172, size: 32, offset: 4704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !777, file: !778, line: 35, baseType: !136, size: 64, offset: 4736)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !777, file: !778, line: 36, baseType: !136, size: 64, offset: 4800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !777, file: !778, line: 37, baseType: !129, size: 32, offset: 4864)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !777, file: !778, line: 38, baseType: !774, size: 64, offset: 4928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !777, file: !778, line: 39, baseType: !136, size: 64, offset: 4992)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !777, file: !778, line: 40, baseType: !172, size: 32, offset: 5056)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !777, file: !778, line: 42, baseType: !129, size: 32, offset: 5088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !777, file: !778, line: 43, baseType: !428, size: 64, offset: 5120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !777, file: !778, line: 44, baseType: !136, size: 64, offset: 5184)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !777, file: !778, line: 45, baseType: !798, size: 64, offset: 5248)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !777, file: !778, line: 46, baseType: !172, size: 32, offset: 5312)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !777, file: !778, line: 47, baseType: !427, size: 64, offset: 5376)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !777, file: !778, line: 49, baseType: !174, size: 64, offset: 5440)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !777, file: !778, line: 50, baseType: !803, size: 64, offset: 5504)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !778, line: 27, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !778, line: 27, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !778, line: 27, size: 320, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !820}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !806, file: !778, line: 27, baseType: !750, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !778, line: 27, baseType: !750, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !806, file: !778, line: 27, baseType: !750, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !806, file: !778, line: 27, baseType: !750, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !778, line: 27, baseType: !757, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !806, file: !778, line: 27, baseType: !814, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !778, line: 10, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !778, line: 8, size: 64, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !816, file: !778, line: 9, baseType: !129, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !778, line: 9, baseType: !129, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !806, file: !778, line: 27, baseType: !821, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !778, line: 14, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !778, line: 12, size: 128, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !823, file: !778, line: 13, baseType: !136, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !823, file: !778, line: 13, baseType: !136, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !777, file: !778, line: 51, baseType: !774, size: 64, offset: 5568)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !777, file: !778, line: 52, baseType: !431, size: 64, offset: 5632)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !777, file: !778, line: 53, baseType: !830, size: 64, offset: 5696)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !775, line: 33, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !778, line: 72, size: 4864, elements: !833)
!833 = !{!834, !835, !853, !854, !863}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !832, file: !778, line: 73, baseType: !388, size: 4480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !832, file: !778, line: 73, baseType: !836, size: 192, offset: 4480)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 192, elements: !225)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !778, line: 56, size: 192, elements: !838)
!838 = !{!839, !845, !849}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !837, file: !778, line: 57, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!190, !830, !774, !129, !380, !843, !844}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !837, file: !778, line: 58, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!190, !830}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !837, file: !778, line: 59, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!190, !830, !196}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !832, file: !778, line: 74, baseType: !118, size: 64, offset: 4672)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !832, file: !778, line: 75, baseType: !855, size: 64, offset: 4736)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !778, line: 62, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !778, line: 64, size: 256, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !778, line: 66, baseType: !855, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !857, file: !778, line: 67, baseType: !843, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !857, file: !778, line: 68, baseType: !844, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !857, file: !778, line: 69, baseType: !129, size: 32, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !832, file: !778, line: 76, baseType: !855, size: 64, offset: 4800)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !385, file: !60, line: 247, baseType: !774, size: 64, offset: 35776)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !385, file: !60, line: 248, baseType: !866, size: 64, offset: 35840)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !432, line: 60, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !39, line: 240, size: 640, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !868, file: !39, line: 241, baseType: !114, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !868, file: !39, line: 242, baseType: !156, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !868, file: !39, line: 243, baseType: !129, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !868, file: !39, line: 243, baseType: !129, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !868, file: !39, line: 244, baseType: !129, size: 32, offset: 160)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !868, file: !39, line: 244, baseType: !129, size: 32, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !868, file: !39, line: 245, baseType: !136, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !868, file: !39, line: 246, baseType: !172, size: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !868, file: !39, line: 247, baseType: !129, size: 32, offset: 352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !868, file: !39, line: 251, baseType: !129, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !868, file: !39, line: 252, baseType: !670, size: 64, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !868, file: !39, line: 253, baseType: !172, size: 32, offset: 512)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !868, file: !39, line: 254, baseType: !129, size: 32, offset: 544)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !868, file: !39, line: 254, baseType: !129, size: 32, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !868, file: !39, line: 255, baseType: !129, size: 32, offset: 608)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !385, file: !60, line: 250, baseType: !774, size: 64, offset: 35904)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !385, file: !60, line: 251, baseType: !458, size: 64, offset: 35968)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !385, file: !60, line: 253, baseType: !383, size: 64, offset: 36032)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !385, file: !60, line: 254, baseType: !417, size: 64, offset: 36096)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !385, file: !60, line: 255, baseType: !118, size: 64, offset: 36160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !385, file: !60, line: 256, baseType: !891, size: 64, offset: 36224)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!190, !383, !118}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !385, file: !60, line: 257, baseType: !891, size: 64, offset: 36288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !385, file: !60, line: 258, baseType: !896, size: 64, offset: 36352)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!190, !383, !571, !172, !844, !118}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !385, file: !60, line: 260, baseType: !129, size: 32, offset: 36416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !385, file: !60, line: 261, baseType: !383, size: 64, offset: 36480)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !385, file: !60, line: 262, baseType: !417, size: 64, offset: 36544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !385, file: !60, line: 263, baseType: !417, size: 64, offset: 36608)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !385, file: !60, line: 264, baseType: !172, size: 32, offset: 36672)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !385, file: !60, line: 265, baseType: !441, size: 64, offset: 36736)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !385, file: !60, line: 266, baseType: !279, size: 64, offset: 36800)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !385, file: !60, line: 266, baseType: !279, size: 64, offset: 36864)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !385, file: !60, line: 267, baseType: !908, size: 64, offset: 36928)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !385, file: !60, line: 269, baseType: !910, size: 640, offset: 36992)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 640, elements: !919)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !60, line: 15, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!190, !383, !129, !129, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !459, line: 1723, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !459, line: 1723, flags: DIFlagFwdDecl)
!919 = !{!920}
!920 = !DISubrange(count: 10)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !385, file: !60, line: 270, baseType: !910, size: 640, offset: 37632)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !385, file: !60, line: 272, baseType: !129, size: 32, offset: 38272)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !385, file: !60, line: 273, baseType: !924, size: 64, offset: 38336)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !60, line: 178, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !60, line: 173, size: 256, elements: !927)
!927 = !{!928, !929, !930, !931}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !926, file: !60, line: 174, baseType: !174, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !926, file: !60, line: 175, baseType: !491, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !926, file: !60, line: 176, baseType: !772, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !926, file: !60, line: 177, baseType: !172, size: 32, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !385, file: !60, line: 274, baseType: !933, size: 64, offset: 38400)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !60, line: 165, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !60, line: 167, size: 192, elements: !936)
!936 = !{!937, !1018, !1019}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !935, file: !60, line: 168, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !939, line: 11, baseType: !940)
!939 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !939, line: 13, size: 832, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !1009, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !941, file: !939, line: 14, baseType: !119, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !941, file: !939, line: 15, baseType: !491, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !941, file: !939, line: 16, baseType: !119, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !941, file: !939, line: 17, baseType: !129, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !941, file: !939, line: 18, baseType: !136, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !941, file: !939, line: 19, baseType: !949, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !950, line: 22, baseType: !951)
!950 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !939, line: 81, size: 4992, elements: !953)
!953 = !{!954, !955, !969, !970, !971, !980}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !952, file: !939, line: 82, baseType: !388, size: 4480)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !952, file: !939, line: 82, baseType: !956, size: 256, offset: 4480)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, elements: !225)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !939, line: 74, size: 256, elements: !958)
!958 = !{!959, !963, !964, !968}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !957, file: !939, line: 75, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!190, !949}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !957, file: !939, line: 76, baseType: !960, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !957, file: !939, line: 77, baseType: !965, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!190, !949, !196}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !957, file: !939, line: 78, baseType: !960, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !952, file: !939, line: 83, baseType: !118, size: 64, offset: 4736)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !952, file: !939, line: 85, baseType: !129, size: 32, offset: 4800)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !952, file: !939, line: 86, baseType: !972, size: 64, offset: 4864)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !939, line: 41, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 36, size: 256, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !974, file: !939, line: 37, baseType: !337, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !974, file: !939, line: 38, baseType: !337, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !974, file: !939, line: 39, baseType: !337, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !974, file: !939, line: 40, baseType: !254, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !952, file: !939, line: 87, baseType: !981, size: 64, offset: 4928)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !939, line: 54, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !939, line: 54, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !939, line: 54, size: 320, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !1001}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !985, file: !939, line: 54, baseType: !750, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !985, file: !939, line: 54, baseType: !750, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !985, file: !939, line: 54, baseType: !750, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !985, file: !939, line: 54, baseType: !750, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !939, line: 54, baseType: !757, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !985, file: !939, line: 54, baseType: !993, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !950, line: 41, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !950, line: 35, size: 192, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !995, file: !950, line: 37, baseType: !491, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !995, file: !950, line: 38, baseType: !129, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !995, file: !950, line: 39, baseType: !129, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !995, file: !950, line: 40, baseType: !129, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !985, file: !939, line: 54, baseType: !1002, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !939, line: 34, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 30, size: 96, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1004, file: !939, line: 31, baseType: !129, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1004, file: !939, line: 32, baseType: !129, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1004, file: !939, line: 33, baseType: !129, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !939, line: 20, baseType: !1010, size: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !4, line: 60, baseType: !64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !941, file: !939, line: 21, baseType: !129, size: 32, offset: 416)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !941, file: !939, line: 22, baseType: !129, size: 32, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !941, file: !939, line: 23, baseType: !136, size: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !941, file: !939, line: 24, baseType: !217, size: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !941, file: !939, line: 25, baseType: !217, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !941, file: !939, line: 26, baseType: !118, size: 64, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !941, file: !939, line: 27, baseType: !938, size: 64, offset: 768)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !935, file: !60, line: 169, baseType: !491, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !60, line: 170, baseType: !933, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !385, file: !60, line: 275, baseType: !129, size: 32, offset: 38464)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !385, file: !60, line: 276, baseType: !1022, size: 64, offset: 38528)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !60, line: 184, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !60, line: 180, size: 192, elements: !1025)
!1025 = !{!1026, !1107, !1108}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1024, file: !60, line: 181, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !950, line: 13, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !939, line: 98, size: 7232, elements: !1030)
!1030 = !{!1031, !1032, !1046, !1047, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1029, file: !939, line: 99, baseType: !388, size: 4480)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1029, file: !939, line: 99, baseType: !1033, size: 256, offset: 4480)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 256, elements: !225)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !939, line: 91, size: 256, elements: !1035)
!1035 = !{!1036, !1040, !1041, !1045}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1034, file: !939, line: 92, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!190, !1027}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1034, file: !939, line: 93, baseType: !1037, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1034, file: !939, line: 94, baseType: !1042, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!190, !1027, !196}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1034, file: !939, line: 95, baseType: !1037, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1029, file: !939, line: 100, baseType: !118, size: 64, offset: 4736)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1029, file: !939, line: 101, baseType: !1048, size: 64, offset: 4800)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1029, file: !939, line: 102, baseType: !172, size: 32, offset: 4864)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !1029, file: !939, line: 103, baseType: !172, size: 32, offset: 4896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !1029, file: !939, line: 104, baseType: !129, size: 32, offset: 4928)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1029, file: !939, line: 105, baseType: !129, size: 32, offset: 4960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1029, file: !939, line: 106, baseType: !204, size: 64, offset: 4992)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !1029, file: !939, line: 108, baseType: !938, size: 64, offset: 5056)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !1029, file: !939, line: 109, baseType: !172, size: 32, offset: 5120)
