; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/ksp/pcksp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/ksp/pcksp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 451, baseType: !26, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!116 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!117 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!118 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!119 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 285, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126}
!123 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135}
!129 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!130 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!131 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!132 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!133 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!134 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!135 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 663, baseType: !5, size: 32, elements: !138)
!137 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!138 = !{!139, !140, !141}
!139 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!144 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !163, line: 624, baseType: !5, size: 32, elements: !164)
!163 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!164 = !{!165, !166, !167, !168}
!165 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!166 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!168 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!169 = !{!170, !173, !174, !259, !26, !377, !209, !343, !378, !380}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !163, line: 330, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !163, line: 330, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !177, line: 73, size: 4480, elements: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!178 = !{!179, !181, !230, !231, !233, !236, !237, !238, !239, !247, !248, !250, !254, !258, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !271, !272, !273, !275, !276, !278, !280, !281, !282, !283, !284, !287, !289, !290, !291, !292, !293, !296, !298, !299, !300, !310, !312, !313, !317, !318, !367, !372, !374, !375, !376}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !176, file: !177, line: 74, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !176, file: !177, line: 75, baseType: !182, size: 448, offset: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 448, elements: !228)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !177, line: 53, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 45, size: 448, elements: !185)
!185 = !{!186, !192, !200, !205, !212, !216, !223}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !184, file: !177, line: 46, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !174, !191}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !184, file: !177, line: 47, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!190, !174, !196}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !197, line: 16, baseType: !198)
!197 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !197, line: 16, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !184, file: !177, line: 48, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!190, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !184, file: !177, line: 49, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!190, !174, !209, !174}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !184, file: !177, line: 50, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!190, !174, !209, !204}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !184, file: !177, line: 51, baseType: !217, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!190, !174, !209, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !184, file: !177, line: 52, baseType: !224, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!190, !174, !209, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!228 = !{!229}
!229 = !DISubrange(count: 1)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !176, file: !177, line: 76, baseType: !170, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !177, line: 77, baseType: !232, size: 32, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !176, file: !177, line: 78, baseType: !234, size: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !235)
!235 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !176, file: !177, line: 78, baseType: !234, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !176, file: !177, line: 78, baseType: !234, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !176, file: !177, line: 78, baseType: !234, size: 64, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !176, file: !177, line: 79, baseType: !240, size: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !243, line: 27, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !245, line: 43, baseType: !246)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!246 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !176, file: !177, line: 80, baseType: !232, size: 32, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !176, file: !177, line: 81, baseType: !249, size: 32, offset: 992)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !176, file: !177, line: 82, baseType: !251, size: 64, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !176, file: !177, line: 83, baseType: !255, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !176, file: !177, line: 84, baseType: !259, size: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !176, file: !177, line: 85, baseType: !259, size: 64, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !176, file: !177, line: 86, baseType: !259, size: 64, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !176, file: !177, line: 87, baseType: !259, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !176, file: !177, line: 88, baseType: !174, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !176, file: !177, line: 89, baseType: !240, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !177, line: 90, baseType: !259, size: 64, offset: 1536)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !176, file: !177, line: 91, baseType: !259, size: 64, offset: 1600)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !176, file: !177, line: 92, baseType: !232, size: 32, offset: 1664)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !176, file: !177, line: 93, baseType: !173, size: 64, offset: 1728)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !177, line: 94, baseType: !270, size: 64, offset: 1792)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !176, file: !177, line: 95, baseType: !232, size: 32, offset: 1856)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !176, file: !177, line: 95, baseType: !232, size: 32, offset: 1888)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !176, file: !177, line: 96, baseType: !274, size: 64, offset: 1920)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !176, file: !177, line: 96, baseType: !274, size: 64, offset: 1984)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !176, file: !177, line: 97, baseType: !277, size: 64, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !176, file: !177, line: 97, baseType: !279, size: 64, offset: 2112)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !176, file: !177, line: 98, baseType: !232, size: 32, offset: 2176)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !176, file: !177, line: 98, baseType: !232, size: 32, offset: 2208)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !176, file: !177, line: 99, baseType: !274, size: 64, offset: 2240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !176, file: !177, line: 99, baseType: !274, size: 64, offset: 2304)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !176, file: !177, line: 100, baseType: !285, size: 64, offset: 2368)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !235)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !176, file: !177, line: 100, baseType: !288, size: 64, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !176, file: !177, line: 101, baseType: !232, size: 32, offset: 2496)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !176, file: !177, line: 101, baseType: !232, size: 32, offset: 2528)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !176, file: !177, line: 102, baseType: !274, size: 64, offset: 2560)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !176, file: !177, line: 102, baseType: !274, size: 64, offset: 2624)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !176, file: !177, line: 103, baseType: !294, size: 64, offset: 2688)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !286)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !176, file: !177, line: 103, baseType: !297, size: 64, offset: 2752)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !176, file: !177, line: 104, baseType: !227, size: 64, offset: 2816)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !176, file: !177, line: 105, baseType: !232, size: 32, offset: 2880)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !176, file: !177, line: 106, baseType: !301, size: 128, offset: 2944)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !308)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !177, line: 64, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 61, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !304, file: !177, line: 62, baseType: !220, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !304, file: !177, line: 63, baseType: !173, size: 64, offset: 64)
!308 = !{!309}
!309 = !DISubrange(count: 2)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !176, file: !177, line: 107, baseType: !311, size: 64, offset: 3072)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 64, elements: !308)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !176, file: !177, line: 108, baseType: !173, size: 64, offset: 3136)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !176, file: !177, line: 109, baseType: !314, size: 64, offset: 3200)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!190, !173}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !176, file: !177, line: 111, baseType: !232, size: 32, offset: 3264)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !176, file: !177, line: 112, baseType: !319, size: 320, offset: 3328)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 320, elements: !365)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!190, !323, !174, !173}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !326)
!326 = !{!327, !328, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !325, file: !10, line: 100, baseType: !232, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !10, line: 101, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !340, !341, !342, !346, !348, !350, !351, !352}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !331, file: !10, line: 84, baseType: !259, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !331, file: !10, line: 85, baseType: !259, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !10, line: 86, baseType: !173, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !331, file: !10, line: 87, baseType: !251, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !331, file: !10, line: 88, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !331, file: !10, line: 89, baseType: !211, size: 8, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !331, file: !10, line: 90, baseType: !259, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !331, file: !10, line: 91, baseType: !343, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !344, line: 46, baseType: !345)
!344 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!345 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !331, file: !10, line: 92, baseType: !347, size: 32, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !10, line: 93, baseType: !349, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !10, line: 94, baseType: !329, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !331, file: !10, line: 95, baseType: !259, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !331, file: !10, line: 96, baseType: !173, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !325, file: !10, line: 102, baseType: !259, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !325, file: !10, line: 102, baseType: !259, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !325, file: !10, line: 103, baseType: !259, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !325, file: !10, line: 104, baseType: !170, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !325, file: !10, line: 105, baseType: !347, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !325, file: !10, line: 105, baseType: !347, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !325, file: !10, line: 105, baseType: !347, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !325, file: !10, line: 106, baseType: !174, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !325, file: !10, line: 107, baseType: !362, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!365 = !{!366}
!366 = !DISubrange(count: 5)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !176, file: !177, line: 113, baseType: !368, size: 320, offset: 3648)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 320, elements: !365)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!190, !174, !173}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !176, file: !177, line: 114, baseType: !373, size: 320, offset: 3968)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !365)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !176, file: !177, line: 115, baseType: !347, size: 32, offset: 4288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !176, file: !177, line: 120, baseType: !362, size: 64, offset: 4352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !176, file: !177, line: 121, baseType: !347, size: 32, offset: 4416)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !379, line: 1451, baseType: !220)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_KSP", file: !382, line: 8, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/ksp/pcksp.c", directory: "/home/users/ndemeye/xSDK")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 5, size: 128, elements: !384)
!384 = !{!385, !720}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !383, file: !382, line: 6, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !39, line: 22, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !108, line: 75, size: 12800, elements: !389)
!389 = !{!390, !392, !445, !450, !451, !452, !453, !483, !484, !485, !486, !487, !489, !494, !495, !496, !497, !498, !499, !500, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !523, !529, !530, !531, !532, !537, !538, !539, !540, !545, !546, !547, !548, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !690, !691, !692, !693, !694, !701, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !717, !718, !719}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !388, file: !108, line: 76, baseType: !391, size: 4480)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !177, line: 122, baseType: !176)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !388, file: !108, line: 76, baseType: !393, size: 896, offset: 4480)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 896, elements: !228)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !108, line: 18, size: 896, elements: !395)
!395 = !{!396, !405, !409, !413, !420, !421, !425, !426, !430, !434, !438, !439, !443, !444}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !394, file: !108, line: 19, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!190, !386, !400, !404}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !401, line: 21, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !401, line: 21, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !394, file: !108, line: 22, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!190, !386, !400, !400, !404}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !394, file: !108, line: 25, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!190, !386}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !394, file: !108, line: 26, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!190, !386, !417, !417}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !121, line: 16, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !121, line: 16, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !394, file: !108, line: 27, baseType: !410, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !394, file: !108, line: 28, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!190, !323, !386}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !394, file: !108, line: 29, baseType: !410, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !394, file: !108, line: 30, baseType: !427, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!190, !386, !285, !285}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !394, file: !108, line: 31, baseType: !431, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!190, !386, !232, !285, !285, !277}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !394, file: !108, line: 32, baseType: !435, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!190, !386, !347, !347, !277, !404, !285, !285}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !394, file: !108, line: 33, baseType: !410, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !394, file: !108, line: 34, baseType: !440, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!190, !386, !196}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !394, file: !108, line: 35, baseType: !410, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !394, file: !108, line: 36, baseType: !440, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !388, file: !108, line: 77, baseType: !446, size: 64, offset: 5376)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !447, line: 14, baseType: !448)
!447 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !447, line: 14, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !388, file: !108, line: 78, baseType: !347, size: 32, offset: 5440)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !388, file: !108, line: 79, baseType: !347, size: 32, offset: 5472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !388, file: !108, line: 81, baseType: !232, size: 32, offset: 5504)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !388, file: !108, line: 82, baseType: !454, size: 64, offset: 5568)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !39, line: 752, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !108, line: 54, size: 5184, elements: !457)
!457 = !{!458, !459, !479, !480, !481, !482}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !456, file: !108, line: 55, baseType: !391, size: 4480)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !456, file: !108, line: 55, baseType: !460, size: 448, offset: 4480)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 448, elements: !228)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !108, line: 41, size: 448, elements: !462)
!462 = !{!463, !467, !468, !472, !473, !474, !478}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !461, file: !108, line: 42, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!190, !454, !400, !400}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !461, file: !108, line: 43, baseType: !464, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !461, file: !108, line: 44, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!190, !454}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !461, file: !108, line: 45, baseType: !469, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !461, file: !108, line: 46, baseType: !469, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !461, file: !108, line: 47, baseType: !475, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!190, !454, !196}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !461, file: !108, line: 48, baseType: !469, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !456, file: !108, line: 56, baseType: !386, size: 64, offset: 4928)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !456, file: !108, line: 57, baseType: !417, size: 64, offset: 4992)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !456, file: !108, line: 58, baseType: !270, size: 64, offset: 5056)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !456, file: !108, line: 59, baseType: !173, size: 64, offset: 5120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !388, file: !108, line: 83, baseType: !347, size: 32, offset: 5632)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !388, file: !108, line: 84, baseType: !347, size: 32, offset: 5664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !388, file: !108, line: 85, baseType: !347, size: 32, offset: 5696)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !388, file: !108, line: 86, baseType: !347, size: 32, offset: 5728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !388, file: !108, line: 87, baseType: !488, size: 32, offset: 5760)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !388, file: !108, line: 88, baseType: !490, size: 384, offset: 5792)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 384, elements: !491)
!491 = !{!492, !493}
!492 = !DISubrange(count: 4)
!493 = !DISubrange(count: 3)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !388, file: !108, line: 89, baseType: !286, size: 64, offset: 6208)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !388, file: !108, line: 90, baseType: !286, size: 64, offset: 6272)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !388, file: !108, line: 91, baseType: !286, size: 64, offset: 6336)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !388, file: !108, line: 92, baseType: !286, size: 64, offset: 6400)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !388, file: !108, line: 93, baseType: !286, size: 64, offset: 6464)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !388, file: !108, line: 94, baseType: !286, size: 64, offset: 6528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !388, file: !108, line: 95, baseType: !501, size: 32, offset: 6592)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !39, line: 540, baseType: !38)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !388, file: !108, line: 96, baseType: !347, size: 32, offset: 6624)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !388, file: !108, line: 98, baseType: !400, size: 64, offset: 6656)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !388, file: !108, line: 98, baseType: !400, size: 64, offset: 6720)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !388, file: !108, line: 102, baseType: !285, size: 64, offset: 6784)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !388, file: !108, line: 103, baseType: !285, size: 64, offset: 6848)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !388, file: !108, line: 104, baseType: !232, size: 32, offset: 6912)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !388, file: !108, line: 105, baseType: !232, size: 32, offset: 6944)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !388, file: !108, line: 106, baseType: !347, size: 32, offset: 6976)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !388, file: !108, line: 107, baseType: !285, size: 64, offset: 7040)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !388, file: !108, line: 108, baseType: !285, size: 64, offset: 7104)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !388, file: !108, line: 109, baseType: !232, size: 32, offset: 7168)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !388, file: !108, line: 110, baseType: !232, size: 32, offset: 7200)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !388, file: !108, line: 111, baseType: !347, size: 32, offset: 7232)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !388, file: !108, line: 113, baseType: !232, size: 32, offset: 7264)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !388, file: !108, line: 114, baseType: !347, size: 32, offset: 7296)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !388, file: !108, line: 117, baseType: !232, size: 32, offset: 7328)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !388, file: !108, line: 120, baseType: !519, size: 320, offset: 7360)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !365)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!190, !386, !232, !286, !173}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !388, file: !108, line: 121, baseType: !524, size: 320, offset: 7680)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !365)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!190, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !388, file: !108, line: 122, baseType: !373, size: 320, offset: 8000)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !388, file: !108, line: 123, baseType: !232, size: 32, offset: 8320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !388, file: !108, line: 124, baseType: !347, size: 32, offset: 8352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !388, file: !108, line: 126, baseType: !533, size: 320, offset: 8384)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !365)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!190, !386, !173}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !388, file: !108, line: 127, baseType: !524, size: 320, offset: 8704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !388, file: !108, line: 128, baseType: !373, size: 320, offset: 9024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !388, file: !108, line: 129, baseType: !232, size: 32, offset: 9344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !388, file: !108, line: 131, baseType: !541, size: 64, offset: 9408)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!190, !386, !232, !286, !544, !173}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !388, file: !108, line: 132, baseType: !314, size: 64, offset: 9472)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !388, file: !108, line: 133, baseType: !173, size: 64, offset: 9536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !388, file: !108, line: 135, baseType: !173, size: 64, offset: 9600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !388, file: !108, line: 137, baseType: !549, size: 64, offset: 9664)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !552, line: 37, size: 6720, elements: !553)
!552 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!553 = !{!554, !555, !610, !611, !612, !613, !614, !615, !617, !618, !619, !620, !621, !622, !623, !624, !625, !635, !636, !637, !638, !639, !641}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !551, file: !552, line: 38, baseType: !391, size: 4480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !551, file: !552, line: 38, baseType: !556, size: 1152, offset: 4480)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 1152, elements: !228)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !552, line: 13, size: 1152, elements: !558)
!558 = !{!559, !563, !567, !571, !577, !581, !582, !586, !590, !594, !595, !600, !601, !602, !603, !604, !608, !609}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !557, file: !552, line: 14, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!190, !549}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !557, file: !552, line: 15, baseType: !564, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!190, !549, !400, !400}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !557, file: !552, line: 16, baseType: !568, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!190, !549, !417, !417}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !557, file: !552, line: 17, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!190, !549, !400, !400, !400, !286, !286, !286, !232, !347, !277, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !557, file: !552, line: 18, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!190, !549, !488, !400, !400, !400}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !557, file: !552, line: 19, baseType: !564, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !557, file: !552, line: 20, baseType: !583, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!190, !549, !232, !400, !400, !400}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !557, file: !552, line: 21, baseType: !587, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!190, !323, !549}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !557, file: !552, line: 22, baseType: !591, size: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!190, !549, !386, !400, !400}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !557, file: !552, line: 23, baseType: !591, size: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !557, file: !552, line: 24, baseType: !596, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!190, !549, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !557, file: !552, line: 25, baseType: !564, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !557, file: !552, line: 26, baseType: !564, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !557, file: !552, line: 27, baseType: !560, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !557, file: !552, line: 28, baseType: !560, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !557, file: !552, line: 29, baseType: !605, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!190, !549, !196}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !557, file: !552, line: 30, baseType: !560, size: 64, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !557, file: !552, line: 31, baseType: !605, size: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !551, file: !552, line: 39, baseType: !446, size: 64, offset: 5632)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !551, file: !552, line: 40, baseType: !232, size: 32, offset: 5696)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !551, file: !552, line: 41, baseType: !270, size: 64, offset: 5760)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !551, file: !552, line: 41, baseType: !270, size: 64, offset: 5824)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !551, file: !552, line: 42, baseType: !347, size: 32, offset: 5888)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !552, line: 43, baseType: !616, size: 32, offset: 5920)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !121, line: 285, baseType: !120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !551, file: !552, line: 45, baseType: !232, size: 32, offset: 5952)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !551, file: !552, line: 46, baseType: !347, size: 32, offset: 5984)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !551, file: !552, line: 47, baseType: !417, size: 64, offset: 6016)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !551, file: !552, line: 47, baseType: !417, size: 64, offset: 6080)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !551, file: !552, line: 48, baseType: !400, size: 64, offset: 6144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !551, file: !552, line: 48, baseType: !400, size: 64, offset: 6208)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !551, file: !552, line: 49, baseType: !347, size: 32, offset: 6272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !551, file: !552, line: 50, baseType: !347, size: 32, offset: 6304)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !551, file: !552, line: 51, baseType: !626, size: 64, offset: 6336)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!190, !549, !232, !629, !629, !599, !173}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !632, line: 11, baseType: !633)
!632 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !632, line: 11, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !551, file: !552, line: 52, baseType: !173, size: 64, offset: 6400)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !551, file: !552, line: 53, baseType: !173, size: 64, offset: 6464)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !551, file: !552, line: 54, baseType: !232, size: 32, offset: 6528)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !551, file: !552, line: 55, baseType: !173, size: 64, offset: 6592)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !551, file: !552, line: 56, baseType: !640, size: 32, offset: 6656)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !127)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !551, file: !552, line: 57, baseType: !640, size: 32, offset: 6688)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !108, line: 139, baseType: !173, size: 64, offset: 9728)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9792)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9824)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9856)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9888)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9920)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9952)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 9984)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10016)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10048)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10080)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10112)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10144)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10176)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !388, file: !108, line: 142, baseType: !347, size: 32, offset: 10208)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10240)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10304)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10368)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10432)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10496)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10560)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10624)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10688)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10752)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10816)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10880)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 10944)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 11008)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !388, file: !108, line: 143, baseType: !196, size: 64, offset: 11072)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11136)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !63, line: 162, baseType: !62)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11168)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11200)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11232)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11264)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11296)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11328)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11360)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11392)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11424)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11456)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11488)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11520)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !388, file: !108, line: 144, baseType: !672, size: 32, offset: 11552)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !388, file: !108, line: 147, baseType: !232, size: 32, offset: 11584)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !388, file: !108, line: 148, baseType: !404, size: 64, offset: 11648)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !388, file: !108, line: 150, baseType: !689, size: 32, offset: 11712)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !108, line: 70, baseType: !107)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !388, file: !108, line: 151, baseType: !347, size: 32, offset: 11744)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !388, file: !108, line: 153, baseType: !232, size: 32, offset: 11776)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !388, file: !108, line: 154, baseType: !232, size: 32, offset: 11808)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !388, file: !108, line: 156, baseType: !347, size: 32, offset: 11840)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !388, file: !108, line: 161, baseType: !695, size: 192, offset: 11904)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !108, line: 157, size: 192, elements: !696)
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !695, file: !108, line: 158, baseType: !417, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !695, file: !108, line: 158, baseType: !417, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !695, file: !108, line: 159, baseType: !347, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !695, file: !108, line: 160, baseType: !347, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !388, file: !108, line: 163, baseType: !702, size: 32, offset: 12096)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !39, line: 451, baseType: !113)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !388, file: !108, line: 165, baseType: !488, size: 32, offset: 12128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !388, file: !108, line: 166, baseType: !702, size: 32, offset: 12160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !388, file: !108, line: 171, baseType: !347, size: 32, offset: 12192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !388, file: !108, line: 172, baseType: !347, size: 32, offset: 12224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !388, file: !108, line: 173, baseType: !347, size: 32, offset: 12256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !388, file: !108, line: 174, baseType: !400, size: 64, offset: 12288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !388, file: !108, line: 175, baseType: !400, size: 64, offset: 12352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !388, file: !108, line: 177, baseType: !232, size: 32, offset: 12416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !388, file: !108, line: 178, baseType: !347, size: 32, offset: 12448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !388, file: !108, line: 180, baseType: !196, size: 64, offset: 12480)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !388, file: !108, line: 182, baseType: !714, size: 64, offset: 12544)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!190, !386, !400, !400, !173}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !388, file: !108, line: 183, baseType: !714, size: 64, offset: 12608)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !388, file: !108, line: 184, baseType: !173, size: 64, offset: 12672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !388, file: !108, line: 184, baseType: !173, size: 64, offset: 12736)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !383, file: !382, line: 7, baseType: !232, size: 32, offset: 64)
!721 = !{i32 7, !"Dwarf Version", i32 4}
!722 = !{i32 2, !"Debug Info Version", i32 3}
!723 = !{i32 1, !"wchar_size", i32 4}
!724 = !{i32 7, !"PIC Level", i32 2}
!725 = !{i32 7, !"uwtable", i32 1}
!726 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!727 = distinct !DISubprogram(name: "PCKSPSetKSP", scope: !382, file: !382, line: 183, type: !728, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{!190, !549, !386}
!730 = !{!731, !732, !733, !734, !736, !737, !739, !745, !746, !749, !750, !752, !756}
!731 = !DILocalVariable(name: "pc", arg: 1, scope: !727, file: !382, line: 183, type: !549)
!732 = !DILocalVariable(name: "ksp", arg: 2, scope: !727, file: !382, line: 183, type: !386)
!733 = !DILocalVariable(name: "ierr", scope: !727, file: !382, line: 185, type: !190)
!734 = !DILocalVariable(name: "_7_ierr", scope: !735, file: !382, line: 190, type: !190)
!735 = distinct !DILexicalBlock(scope: !727, file: !382, line: 190, column: 3)
!736 = !DILocalVariable(name: "_7_flag", scope: !735, file: !382, line: 190, type: !249)
!737 = !DILocalVariable(name: "_7_errorcode", scope: !738, file: !382, line: 190, type: !190)
!738 = distinct !DILexicalBlock(scope: !735, file: !382, line: 190, column: 3)
!739 = !DILocalVariable(name: "_7_errorstring", scope: !740, file: !382, line: 190, type: !742)
!740 = distinct !DILexicalBlock(scope: !741, file: !382, line: 190, column: 3)
!741 = distinct !DILexicalBlock(scope: !738, file: !382, line: 190, column: 3)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 2048, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 256)
!745 = !DILocalVariable(name: "_7_resultlen", scope: !740, file: !382, line: 190, type: !249)
!746 = !DILocalVariable(name: "_7_f", scope: !747, file: !382, line: 191, type: !748)
!747 = distinct !DILexicalBlock(scope: !727, file: !382, line: 191, column: 10)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!749 = !DILocalVariable(name: "_7_ierr", scope: !747, file: !382, line: 191, type: !190)
!750 = !DILocalVariable(name: "ierr__", scope: !751, file: !382, line: 191, type: !190)
!751 = distinct !DILexicalBlock(scope: !747, file: !382, line: 191, column: 10)
!752 = !DILocalVariable(name: "ierr__", scope: !753, file: !382, line: 191, type: !190)
!753 = distinct !DILexicalBlock(scope: !754, file: !382, line: 191, column: 10)
!754 = distinct !DILexicalBlock(scope: !755, file: !382, line: 191, column: 10)
!755 = distinct !DILexicalBlock(scope: !747, file: !382, line: 191, column: 10)
!756 = !DILocalVariable(name: "ierr__", scope: !757, file: !382, line: 191, type: !190)
!757 = distinct !DILexicalBlock(scope: !727, file: !382, line: 191, column: 63)
!758 = !DILocation(line: 0, scope: !727)
!759 = !DILocation(line: 187, column: 3, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !382, line: 187, column: 3)
!761 = distinct !DILexicalBlock(scope: !762, file: !382, line: 187, column: 3)
!762 = distinct !DILexicalBlock(scope: !727, file: !382, line: 187, column: 3)
!763 = !{!764, !764, i64 0}
!764 = !{!"any pointer", !765, i64 0}
!765 = !{!"omnipotent char", !766, i64 0}
!766 = !{!"Simple C/C++ TBAA"}
!767 = !DILocation(line: 187, column: 3, scope: !761)
!768 = !DILocation(line: 187, column: 3, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !382, line: 187, column: 3)
!770 = distinct !DILexicalBlock(scope: !760, file: !382, line: 187, column: 3)
!771 = !{!772, !773, i64 1536}
!772 = !{!"", !765, i64 0, !765, i64 512, !765, i64 1024, !765, i64 1280, !773, i64 1536, !773, i64 1540, !765, i64 1544}
!773 = !{!"int", !765, i64 0}
!774 = !DILocation(line: 187, column: 3, scope: !770)
