; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/mpiuopen.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/mpiuopen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PetscPOpenMachine", scope: !2, file: !243, line: 99, type: !244, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !242, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/mpiuopen.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !{!33, !35, !39, !40, !41, !76}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !36, line: 330, baseType: !37)
!36 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !36, line: 330, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !44, line: 73, size: 4480, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !48, !96, !97, !99, !102, !103, !104, !105, !113, !114, !116, !120, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !136, !137, !138, !140, !141, !143, !145, !146, !147, !148, !149, !152, !154, !155, !156, !157, !158, !161, !163, !164, !165, !175, !177, !178, !182, !183, !232, !237, !239, !240, !241}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !43, file: !44, line: 74, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !40)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !43, file: !44, line: 75, baseType: !49, size: 448, offset: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 448, elements: !94)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !44, line: 53, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 45, size: 448, elements: !52)
!52 = !{!53, !59, !67, !72, !78, !82, !89}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !51, file: !44, line: 46, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !41, !58}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !40)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !51, file: !44, line: 47, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!57, !41, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !64, line: 16, baseType: !65)
!64 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !64, line: 16, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !51, file: !44, line: 48, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!57, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !51, file: !44, line: 49, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!57, !41, !76, !41}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !51, file: !44, line: 50, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!57, !41, !76, !71}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !51, file: !44, line: 51, baseType: !83, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!57, !41, !76, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !51, file: !44, line: 52, baseType: !90, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!57, !41, !76, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !43, file: !44, line: 76, baseType: !35, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !44, line: 77, baseType: !98, size: 32, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !40)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !43, file: !44, line: 78, baseType: !100, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !101)
!101 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !43, file: !44, line: 78, baseType: !100, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !43, file: !44, line: 78, baseType: !100, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !43, file: !44, line: 78, baseType: !100, size: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !43, file: !44, line: 79, baseType: !106, size: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 27, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 43, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !43, file: !44, line: 80, baseType: !98, size: 32, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !43, file: !44, line: 81, baseType: !115, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !40)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !43, file: !44, line: 82, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !43, file: !44, line: 83, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !43, file: !44, line: 84, baseType: !33, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !43, file: !44, line: 85, baseType: !33, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !43, file: !44, line: 86, baseType: !33, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !43, file: !44, line: 87, baseType: !33, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !43, file: !44, line: 88, baseType: !41, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !43, file: !44, line: 89, baseType: !106, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !44, line: 90, baseType: !33, size: 64, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !43, file: !44, line: 91, baseType: !33, size: 64, offset: 1600)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !43, file: !44, line: 92, baseType: !98, size: 32, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !43, file: !44, line: 93, baseType: !39, size: 64, offset: 1728)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !43, file: !44, line: 94, baseType: !135, size: 64, offset: 1792)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !107)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !43, file: !44, line: 95, baseType: !98, size: 32, offset: 1856)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !43, file: !44, line: 95, baseType: !98, size: 32, offset: 1888)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !43, file: !44, line: 96, baseType: !139, size: 64, offset: 1920)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !43, file: !44, line: 96, baseType: !139, size: 64, offset: 1984)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !43, file: !44, line: 97, baseType: !142, size: 64, offset: 2048)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !43, file: !44, line: 97, baseType: !144, size: 64, offset: 2112)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !43, file: !44, line: 98, baseType: !98, size: 32, offset: 2176)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !43, file: !44, line: 98, baseType: !98, size: 32, offset: 2208)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !43, file: !44, line: 99, baseType: !139, size: 64, offset: 2240)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !43, file: !44, line: 99, baseType: !139, size: 64, offset: 2304)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !43, file: !44, line: 100, baseType: !150, size: 64, offset: 2368)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !101)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !43, file: !44, line: 100, baseType: !153, size: 64, offset: 2432)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !43, file: !44, line: 101, baseType: !98, size: 32, offset: 2496)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !43, file: !44, line: 101, baseType: !98, size: 32, offset: 2528)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !43, file: !44, line: 102, baseType: !139, size: 64, offset: 2560)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !43, file: !44, line: 102, baseType: !139, size: 64, offset: 2624)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !43, file: !44, line: 103, baseType: !159, size: 64, offset: 2688)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !151)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !43, file: !44, line: 103, baseType: !162, size: 64, offset: 2752)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !43, file: !44, line: 104, baseType: !93, size: 64, offset: 2816)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !43, file: !44, line: 105, baseType: !98, size: 32, offset: 2880)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !43, file: !44, line: 106, baseType: !166, size: 128, offset: 2944)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !173)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !44, line: 64, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 61, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !169, file: !44, line: 62, baseType: !86, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !169, file: !44, line: 63, baseType: !39, size: 64, offset: 64)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !43, file: !44, line: 107, baseType: !176, size: 64, offset: 3072)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !173)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !43, file: !44, line: 108, baseType: !39, size: 64, offset: 3136)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !43, file: !44, line: 109, baseType: !179, size: 64, offset: 3200)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!57, !39}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !43, file: !44, line: 111, baseType: !98, size: 32, offset: 3264)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !43, file: !44, line: 112, baseType: !184, size: 320, offset: 3328)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 320, elements: !230)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!57, !188, !41, !39}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !191)
!191 = !{!192, !193, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !190, file: !18, line: 100, baseType: !98, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !18, line: 101, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !205, !206, !207, !211, !213, !215, !216, !217}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !196, file: !18, line: 84, baseType: !33, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !196, file: !18, line: 85, baseType: !33, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !18, line: 86, baseType: !39, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !196, file: !18, line: 87, baseType: !117, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !196, file: !18, line: 88, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !196, file: !18, line: 89, baseType: !34, size: 8, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !196, file: !18, line: 90, baseType: !33, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !196, file: !18, line: 91, baseType: !208, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 46, baseType: !210)
!209 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!210 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !196, file: !18, line: 92, baseType: !212, size: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !18, line: 93, baseType: !214, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !18, line: 94, baseType: !194, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !196, file: !18, line: 95, baseType: !33, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !196, file: !18, line: 96, baseType: !39, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !190, file: !18, line: 102, baseType: !33, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !190, file: !18, line: 102, baseType: !33, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !190, file: !18, line: 103, baseType: !33, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !190, file: !18, line: 104, baseType: !35, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !190, file: !18, line: 105, baseType: !212, size: 32, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !190, file: !18, line: 105, baseType: !212, size: 32, offset: 416)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !190, file: !18, line: 105, baseType: !212, size: 32, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !190, file: !18, line: 106, baseType: !41, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !190, file: !18, line: 107, baseType: !227, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!230 = !{!231}
!231 = !DISubrange(count: 5)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !43, file: !44, line: 113, baseType: !233, size: 320, offset: 3648)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !230)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!57, !41, !39}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !43, file: !44, line: 114, baseType: !238, size: 320, offset: 3968)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 320, elements: !230)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !43, file: !44, line: 115, baseType: !212, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !43, file: !44, line: 120, baseType: !227, size: 64, offset: 4352)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !43, file: !44, line: 121, baseType: !212, size: 32, offset: 4416)
!242 = !{!0}
!243 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/mpiuopen.c", directory: "/home/users/ndemeye/xSDK")
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 128)
!247 = !{i32 7, !"Dwarf Version", i32 4}
!248 = !{i32 2, !"Debug Info Version", i32 3}
!249 = !{i32 1, !"wchar_size", i32 4}
!250 = !{i32 7, !"PIC Level", i32 2}
!251 = !{i32 7, !"uwtable", i32 1}
!252 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!253 = distinct !DISubprogram(name: "PetscFOpen", scope: !243, file: !243, line: 34, type: !254, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!254 = !DISubroutineType(types: !255)
!255 = !{!57, !35, !76, !76, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !259, line: 7, baseType: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !261, line: 245, size: 1728, elements: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !283, !284, !285, !286, !288, !290, !292, !294, !297, !299, !300, !301, !302, !303, !304, !305}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !260, file: !261, line: 246, baseType: !40, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !260, file: !261, line: 251, baseType: !33, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !260, file: !261, line: 252, baseType: !33, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !260, file: !261, line: 253, baseType: !33, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !260, file: !261, line: 254, baseType: !33, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !260, file: !261, line: 255, baseType: !33, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !260, file: !261, line: 256, baseType: !33, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !260, file: !261, line: 257, baseType: !33, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !260, file: !261, line: 258, baseType: !33, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !260, file: !261, line: 260, baseType: !33, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !260, file: !261, line: 261, baseType: !33, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !260, file: !261, line: 262, baseType: !33, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !260, file: !261, line: 264, baseType: !276, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !261, line: 160, size: 192, elements: !278)
!278 = !{!279, !280, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !277, file: !261, line: 161, baseType: !276, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !277, file: !261, line: 162, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !277, file: !261, line: 166, baseType: !40, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !260, file: !261, line: 266, baseType: !281, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !260, file: !261, line: 268, baseType: !40, size: 32, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !260, file: !261, line: 272, baseType: !40, size: 32, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !260, file: !261, line: 274, baseType: !287, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 140, baseType: !112)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !260, file: !261, line: 278, baseType: !289, size: 16, offset: 1024)
!289 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !260, file: !261, line: 279, baseType: !291, size: 8, offset: 1040)
!291 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !260, file: !261, line: 280, baseType: !293, size: 8, offset: 1048)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !94)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !260, file: !261, line: 284, baseType: !295, size: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !261, line: 154, baseType: null)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !260, file: !261, line: 293, baseType: !298, size: 64, offset: 1152)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 141, baseType: !112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !260, file: !261, line: 301, baseType: !39, size: 64, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !260, file: !261, line: 302, baseType: !39, size: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !260, file: !261, line: 303, baseType: !39, size: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !260, file: !261, line: 304, baseType: !39, size: 64, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !260, file: !261, line: 306, baseType: !208, size: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !260, file: !261, line: 307, baseType: !40, size: 32, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !260, file: !261, line: 309, baseType: !306, size: 160, offset: 1568)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 20)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !324, !330, !331, !334, !335, !337, !339, !343, !345, !347, !349, !353}
!310 = !DILocalVariable(name: "comm", arg: 1, scope: !253, file: !243, line: 34, type: !35)
!311 = !DILocalVariable(name: "name", arg: 2, scope: !253, file: !243, line: 34, type: !76)
!312 = !DILocalVariable(name: "mode", arg: 3, scope: !253, file: !243, line: 34, type: !76)
!313 = !DILocalVariable(name: "fp", arg: 4, scope: !253, file: !243, line: 34, type: !256)
!314 = !DILocalVariable(name: "ierr", scope: !253, file: !243, line: 36, type: !57)
!315 = !DILocalVariable(name: "rank", scope: !253, file: !243, line: 37, type: !115)
!316 = !DILocalVariable(name: "fd", scope: !253, file: !243, line: 38, type: !257)
!317 = !DILocalVariable(name: "fname", scope: !253, file: !243, line: 39, type: !318)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32768, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 4096)
!321 = !DILocalVariable(name: "tname", scope: !253, file: !243, line: 39, type: !318)
!322 = !DILocalVariable(name: "_7_errorcode", scope: !323, file: !243, line: 42, type: !57)
!323 = distinct !DILexicalBlock(scope: !253, file: !243, line: 42, column: 36)
!324 = !DILocalVariable(name: "_7_errorstring", scope: !325, file: !243, line: 42, type: !327)
!325 = distinct !DILexicalBlock(scope: !326, file: !243, line: 42, column: 36)
!326 = distinct !DILexicalBlock(scope: !323, file: !243, line: 42, column: 36)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 256)
!330 = !DILocalVariable(name: "_7_resultlen", scope: !325, file: !243, line: 42, type: !115)
!331 = !DILocalVariable(name: "isstdout", scope: !332, file: !243, line: 44, type: !212)
!332 = distinct !DILexicalBlock(scope: !333, file: !243, line: 43, column: 14)
!333 = distinct !DILexicalBlock(scope: !253, file: !243, line: 43, column: 7)
!334 = !DILocalVariable(name: "isstderr", scope: !332, file: !243, line: 44, type: !212)
!335 = !DILocalVariable(name: "ierr__", scope: !336, file: !243, line: 45, type: !57)
!336 = distinct !DILexicalBlock(scope: !332, file: !243, line: 45, column: 49)
!337 = !DILocalVariable(name: "ierr__", scope: !338, file: !243, line: 46, type: !57)
!338 = distinct !DILexicalBlock(scope: !332, file: !243, line: 46, column: 49)
!339 = !DILocalVariable(name: "devnull", scope: !340, file: !243, line: 50, type: !212)
!340 = distinct !DILexicalBlock(scope: !341, file: !243, line: 49, column: 10)
!341 = distinct !DILexicalBlock(scope: !342, file: !243, line: 48, column: 14)
!342 = distinct !DILexicalBlock(scope: !332, file: !243, line: 47, column: 9)
!343 = !DILocalVariable(name: "ierr__", scope: !344, file: !243, line: 51, type: !57)
!344 = distinct !DILexicalBlock(scope: !340, file: !243, line: 51, column: 77)
!345 = !DILocalVariable(name: "ierr__", scope: !346, file: !243, line: 52, type: !57)
!346 = distinct !DILexicalBlock(scope: !340, file: !243, line: 52, column: 44)
!347 = !DILocalVariable(name: "ierr__", scope: !348, file: !243, line: 53, type: !57)
!348 = distinct !DILexicalBlock(scope: !340, file: !243, line: 53, column: 61)
!349 = !DILocalVariable(name: "ierr__", scope: !350, file: !243, line: 55, type: !57)
!350 = distinct !DILexicalBlock(scope: !351, file: !243, line: 55, column: 47)
!351 = distinct !DILexicalBlock(scope: !352, file: !243, line: 54, column: 20)
!352 = distinct !DILexicalBlock(scope: !340, file: !243, line: 54, column: 11)
!353 = !DILocalVariable(name: "ierr__", scope: !354, file: !243, line: 57, type: !57)
!354 = distinct !DILexicalBlock(scope: !340, file: !243, line: 57, column: 54)
!355 = !DILocation(line: 0, scope: !253)
