; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 297, baseType: !7, size: 32, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 663, baseType: !7, size: 32, elements: !123)
!122 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 395, baseType: !28, size: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135}
!129 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!130 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!131 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!132 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!133 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!134 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!135 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 155, baseType: !7, size: 32, elements: !138)
!137 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!143 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!144 = !{!145, !193, !196, !275, !217, !346, !699, !166, !701, !704, !265, !28, !707, !641}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_AGMRES", file: !147, line: 34, baseType: !148)
!147 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/agmres/agmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 10, size: 5056, elements: !149)
!149 = !{!150, !155, !156, !157, !158, !159, !160, !161, !163, !164, !165, !167, !168, !618, !620, !621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !148, file: !147, line: 11, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !154)
!154 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !148, file: !147, line: 11, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !148, file: !147, line: 11, baseType: !153, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !148, file: !147, line: 11, baseType: !169, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !173, !166}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !176)
!176 = !{!177, !380, !433, !438, !439, !440, !441, !471, !472, !473, !474, !475, !477, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !511, !517, !518, !519, !520, !525, !526, !527, !528, !533, !534, !535, !536, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !588, !589, !590, !591, !592, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !615, !616, !617}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !175, file: !104, line: 76, baseType: !178, size: 4480)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !179, line: 122, baseType: !180)
!179 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !179, line: 73, size: 4480, elements: !181)
!181 = !{!182, !184, !238, !239, !240, !242, !243, !244, !245, !253, !254, !256, !260, !264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !276, !278, !279, !280, !282, !283, !285, !287, !288, !289, !290, !291, !292, !294, !295, !296, !297, !298, !299, !301, !302, !303, !313, !315, !316, !320, !321, !370, !375, !377, !378, !379}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !180, file: !179, line: 74, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !180, file: !179, line: 75, baseType: !185, size: 448, offset: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 448, elements: !236)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !179, line: 53, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 45, size: 448, elements: !188)
!188 = !{!189, !200, !208, !213, !220, !224, !231}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !187, file: !179, line: 46, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!172, !193, !195}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !197, line: 330, baseType: !198)
!197 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !197, line: 330, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !187, file: !179, line: 47, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!172, !193, !204}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !205, line: 16, baseType: !206)
!205 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !205, line: 16, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !187, file: !179, line: 48, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!172, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !187, file: !179, line: 49, baseType: !214, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!172, !193, !217, !193}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !187, file: !179, line: 50, baseType: !221, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!172, !193, !217, !212}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !187, file: !179, line: 51, baseType: !225, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!172, !193, !217, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !187, file: !179, line: 52, baseType: !232, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!172, !193, !217, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!236 = !{!237}
!237 = !DISubrange(count: 1)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !180, file: !179, line: 76, baseType: !196, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !179, line: 77, baseType: !166, size: 32, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !180, file: !179, line: 78, baseType: !241, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !154)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !180, file: !179, line: 78, baseType: !241, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !180, file: !179, line: 78, baseType: !241, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !180, file: !179, line: 78, baseType: !241, size: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !179, line: 79, baseType: !246, size: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !249, line: 27, baseType: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !251, line: 43, baseType: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!252 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !180, file: !179, line: 80, baseType: !166, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !180, file: !179, line: 81, baseType: !255, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !180, file: !179, line: 82, baseType: !257, size: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !180, file: !179, line: 83, baseType: !261, size: 64, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !180, file: !179, line: 84, baseType: !265, size: 64, offset: 1152)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !180, file: !179, line: 85, baseType: !265, size: 64, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !180, file: !179, line: 86, baseType: !265, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !180, file: !179, line: 87, baseType: !265, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !180, file: !179, line: 88, baseType: !193, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !180, file: !179, line: 89, baseType: !246, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !179, line: 90, baseType: !265, size: 64, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !180, file: !179, line: 91, baseType: !265, size: 64, offset: 1600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !180, file: !179, line: 92, baseType: !166, size: 32, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !180, file: !179, line: 93, baseType: !275, size: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !180, file: !179, line: 94, baseType: !277, size: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !247)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !180, file: !179, line: 95, baseType: !166, size: 32, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !180, file: !179, line: 95, baseType: !166, size: 32, offset: 1888)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !180, file: !179, line: 96, baseType: !281, size: 64, offset: 1920)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !180, file: !179, line: 96, baseType: !281, size: 64, offset: 1984)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !180, file: !179, line: 97, baseType: !284, size: 64, offset: 2048)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !180, file: !179, line: 97, baseType: !286, size: 64, offset: 2112)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !180, file: !179, line: 98, baseType: !166, size: 32, offset: 2176)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !180, file: !179, line: 98, baseType: !166, size: 32, offset: 2208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !180, file: !179, line: 99, baseType: !281, size: 64, offset: 2240)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !180, file: !179, line: 99, baseType: !281, size: 64, offset: 2304)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !180, file: !179, line: 100, baseType: !162, size: 64, offset: 2368)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !180, file: !179, line: 100, baseType: !293, size: 64, offset: 2432)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !180, file: !179, line: 101, baseType: !166, size: 32, offset: 2496)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !180, file: !179, line: 101, baseType: !166, size: 32, offset: 2528)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !180, file: !179, line: 102, baseType: !281, size: 64, offset: 2560)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !180, file: !179, line: 102, baseType: !281, size: 64, offset: 2624)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !180, file: !179, line: 103, baseType: !151, size: 64, offset: 2688)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !180, file: !179, line: 103, baseType: !300, size: 64, offset: 2752)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !180, file: !179, line: 104, baseType: !235, size: 64, offset: 2816)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !180, file: !179, line: 105, baseType: !166, size: 32, offset: 2880)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !180, file: !179, line: 106, baseType: !304, size: 128, offset: 2944)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 128, elements: !311)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !179, line: 64, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 61, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !307, file: !179, line: 62, baseType: !228, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !307, file: !179, line: 63, baseType: !275, size: 64, offset: 64)
!311 = !{!312}
!312 = !DISubrange(count: 2)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !180, file: !179, line: 107, baseType: !314, size: 64, offset: 3072)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !311)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !180, file: !179, line: 108, baseType: !275, size: 64, offset: 3136)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !180, file: !179, line: 109, baseType: !317, size: 64, offset: 3200)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!172, !275}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !180, file: !179, line: 111, baseType: !166, size: 32, offset: 3264)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !180, file: !179, line: 112, baseType: !322, size: 320, offset: 3328)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 320, elements: !368)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!172, !326, !193, !275}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !329)
!329 = !{!330, !331, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !328, file: !12, line: 100, baseType: !166, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !12, line: 101, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !343, !344, !345, !349, !351, !353, !354, !355}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !334, file: !12, line: 84, baseType: !265, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !334, file: !12, line: 85, baseType: !265, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !12, line: 86, baseType: !275, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !334, file: !12, line: 87, baseType: !257, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !334, file: !12, line: 88, baseType: !341, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !334, file: !12, line: 89, baseType: !219, size: 8, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !334, file: !12, line: 90, baseType: !265, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !334, file: !12, line: 91, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 46, baseType: !348)
!347 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !334, file: !12, line: 92, baseType: !350, size: 32, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !12, line: 93, baseType: !352, size: 32, offset: 544)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !12, line: 94, baseType: !332, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !334, file: !12, line: 95, baseType: !265, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !334, file: !12, line: 96, baseType: !275, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !328, file: !12, line: 102, baseType: !265, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !328, file: !12, line: 102, baseType: !265, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !328, file: !12, line: 103, baseType: !265, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !328, file: !12, line: 104, baseType: !196, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !328, file: !12, line: 105, baseType: !350, size: 32, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !328, file: !12, line: 105, baseType: !350, size: 32, offset: 416)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !328, file: !12, line: 105, baseType: !350, size: 32, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !328, file: !12, line: 106, baseType: !193, size: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !328, file: !12, line: 107, baseType: !365, size: 64, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!368 = !{!369}
!369 = !DISubrange(count: 5)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !180, file: !179, line: 113, baseType: !371, size: 320, offset: 3648)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 320, elements: !368)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!172, !193, !275}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !180, file: !179, line: 114, baseType: !376, size: 320, offset: 3968)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 320, elements: !368)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !180, file: !179, line: 115, baseType: !350, size: 32, offset: 4288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !179, line: 120, baseType: !365, size: 64, offset: 4352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !180, file: !179, line: 121, baseType: !350, size: 32, offset: 4416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !175, file: !104, line: 76, baseType: !381, size: 896, offset: 4480)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 896, elements: !236)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !383)
!383 = !{!384, !392, !396, !400, !408, !409, !413, !414, !418, !422, !426, !427, !431, !432}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !382, file: !104, line: 19, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!172, !173, !388, !391}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !137, line: 21, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !137, line: 21, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !382, file: !104, line: 22, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!172, !173, !388, !388, !391}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !382, file: !104, line: 25, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!172, !173}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !382, file: !104, line: 26, baseType: !401, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!172, !173, !404, !404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !405, line: 16, baseType: !406)
!405 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !405, line: 16, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !382, file: !104, line: 27, baseType: !397, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !382, file: !104, line: 28, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!172, !326, !173}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !382, file: !104, line: 29, baseType: !397, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !382, file: !104, line: 30, baseType: !415, size: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!172, !173, !162, !162}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !382, file: !104, line: 31, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!172, !173, !166, !162, !162, !284}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !382, file: !104, line: 32, baseType: !423, size: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!172, !173, !350, !350, !284, !391, !162, !162}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !382, file: !104, line: 33, baseType: !397, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !382, file: !104, line: 34, baseType: !428, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!172, !173, !204}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !382, file: !104, line: 35, baseType: !397, size: 64, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !382, file: !104, line: 36, baseType: !428, size: 64, offset: 832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !175, file: !104, line: 77, baseType: !434, size: 64, offset: 5376)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !435, line: 14, baseType: !436)
!435 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !435, line: 14, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !175, file: !104, line: 78, baseType: !350, size: 32, offset: 5440)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !175, file: !104, line: 79, baseType: !350, size: 32, offset: 5472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !175, file: !104, line: 81, baseType: !166, size: 32, offset: 5504)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !175, file: !104, line: 82, baseType: !442, size: 64, offset: 5568)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !445)
!445 = !{!446, !447, !467, !468, !469, !470}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !444, file: !104, line: 55, baseType: !178, size: 4480)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !444, file: !104, line: 55, baseType: !448, size: 448, offset: 4480)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 448, elements: !236)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !450)
!450 = !{!451, !455, !456, !460, !461, !462, !466}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !449, file: !104, line: 42, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!172, !442, !388, !388}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !449, file: !104, line: 43, baseType: !452, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !449, file: !104, line: 44, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!172, !442}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !449, file: !104, line: 45, baseType: !457, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !449, file: !104, line: 46, baseType: !457, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !449, file: !104, line: 47, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!172, !442, !204}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !449, file: !104, line: 48, baseType: !457, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !444, file: !104, line: 56, baseType: !173, size: 64, offset: 4928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !444, file: !104, line: 57, baseType: !404, size: 64, offset: 4992)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !444, file: !104, line: 58, baseType: !277, size: 64, offset: 5056)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !444, file: !104, line: 59, baseType: !275, size: 64, offset: 5120)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !175, file: !104, line: 83, baseType: !350, size: 32, offset: 5632)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !175, file: !104, line: 84, baseType: !350, size: 32, offset: 5664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !175, file: !104, line: 85, baseType: !350, size: 32, offset: 5696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !175, file: !104, line: 86, baseType: !350, size: 32, offset: 5728)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !175, file: !104, line: 87, baseType: !476, size: 32, offset: 5760)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !175, file: !104, line: 88, baseType: !478, size: 384, offset: 5792)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 384, elements: !479)
!479 = !{!480, !481}
!480 = !DISubrange(count: 4)
!481 = !DISubrange(count: 3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !175, file: !104, line: 89, baseType: !153, size: 64, offset: 6208)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !175, file: !104, line: 90, baseType: !153, size: 64, offset: 6272)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !175, file: !104, line: 91, baseType: !153, size: 64, offset: 6336)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !175, file: !104, line: 92, baseType: !153, size: 64, offset: 6400)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !175, file: !104, line: 93, baseType: !153, size: 64, offset: 6464)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !175, file: !104, line: 94, baseType: !153, size: 64, offset: 6528)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !175, file: !104, line: 95, baseType: !489, size: 32, offset: 6592)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !175, file: !104, line: 96, baseType: !350, size: 32, offset: 6624)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !175, file: !104, line: 98, baseType: !388, size: 64, offset: 6656)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !175, file: !104, line: 98, baseType: !388, size: 64, offset: 6720)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !175, file: !104, line: 102, baseType: !162, size: 64, offset: 6784)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !175, file: !104, line: 103, baseType: !162, size: 64, offset: 6848)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !175, file: !104, line: 104, baseType: !166, size: 32, offset: 6912)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !175, file: !104, line: 105, baseType: !166, size: 32, offset: 6944)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !175, file: !104, line: 106, baseType: !350, size: 32, offset: 6976)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !175, file: !104, line: 107, baseType: !162, size: 64, offset: 7040)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !175, file: !104, line: 108, baseType: !162, size: 64, offset: 7104)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !175, file: !104, line: 109, baseType: !166, size: 32, offset: 7168)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !175, file: !104, line: 110, baseType: !166, size: 32, offset: 7200)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !175, file: !104, line: 111, baseType: !350, size: 32, offset: 7232)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !175, file: !104, line: 113, baseType: !166, size: 32, offset: 7264)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !175, file: !104, line: 114, baseType: !350, size: 32, offset: 7296)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !175, file: !104, line: 117, baseType: !166, size: 32, offset: 7328)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !175, file: !104, line: 120, baseType: !507, size: 320, offset: 7360)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 320, elements: !368)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!172, !173, !166, !153, !275}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !175, file: !104, line: 121, baseType: !512, size: 320, offset: 7680)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !368)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!172, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !175, file: !104, line: 122, baseType: !376, size: 320, offset: 8000)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !175, file: !104, line: 123, baseType: !166, size: 32, offset: 8320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !175, file: !104, line: 124, baseType: !350, size: 32, offset: 8352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !175, file: !104, line: 126, baseType: !521, size: 320, offset: 8384)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !368)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!172, !173, !275}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !175, file: !104, line: 127, baseType: !512, size: 320, offset: 8704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !175, file: !104, line: 128, baseType: !376, size: 320, offset: 9024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !175, file: !104, line: 129, baseType: !166, size: 32, offset: 9344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !175, file: !104, line: 131, baseType: !529, size: 64, offset: 9408)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!172, !173, !166, !153, !532, !275}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !175, file: !104, line: 132, baseType: !317, size: 64, offset: 9472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !175, file: !104, line: 133, baseType: !275, size: 64, offset: 9536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !175, file: !104, line: 135, baseType: !275, size: 64, offset: 9600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !175, file: !104, line: 137, baseType: !537, size: 64, offset: 9664)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !104, line: 139, baseType: !275, size: 64, offset: 9728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9824)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9856)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9888)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9952)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 9984)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10016)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10048)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10080)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !175, file: !104, line: 142, baseType: !350, size: 32, offset: 10208)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10304)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10368)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10432)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10560)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10624)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10688)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10752)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10816)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10880)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 10944)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 11008)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !175, file: !104, line: 143, baseType: !204, size: 64, offset: 11072)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11136)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11168)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11200)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11232)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11264)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11296)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11328)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11360)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11424)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11520)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !175, file: !104, line: 144, baseType: !570, size: 32, offset: 11552)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !175, file: !104, line: 147, baseType: !166, size: 32, offset: 11584)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !175, file: !104, line: 148, baseType: !391, size: 64, offset: 11648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !175, file: !104, line: 150, baseType: !587, size: 32, offset: 11712)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !175, file: !104, line: 151, baseType: !350, size: 32, offset: 11744)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !175, file: !104, line: 153, baseType: !166, size: 32, offset: 11776)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !175, file: !104, line: 154, baseType: !166, size: 32, offset: 11808)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !175, file: !104, line: 156, baseType: !350, size: 32, offset: 11840)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !175, file: !104, line: 161, baseType: !593, size: 192, offset: 11904)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !104, line: 157, size: 192, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !593, file: !104, line: 158, baseType: !404, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !593, file: !104, line: 158, baseType: !404, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !593, file: !104, line: 159, baseType: !350, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !593, file: !104, line: 160, baseType: !350, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !175, file: !104, line: 163, baseType: !600, size: 32, offset: 12096)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !175, file: !104, line: 165, baseType: !476, size: 32, offset: 12128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !175, file: !104, line: 166, baseType: !600, size: 32, offset: 12160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !175, file: !104, line: 171, baseType: !350, size: 32, offset: 12192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !175, file: !104, line: 172, baseType: !350, size: 32, offset: 12224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !175, file: !104, line: 173, baseType: !350, size: 32, offset: 12256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !175, file: !104, line: 174, baseType: !388, size: 64, offset: 12288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !175, file: !104, line: 175, baseType: !388, size: 64, offset: 12352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !175, file: !104, line: 177, baseType: !166, size: 32, offset: 12416)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !175, file: !104, line: 178, baseType: !350, size: 32, offset: 12448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !175, file: !104, line: 180, baseType: !204, size: 64, offset: 12480)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !175, file: !104, line: 182, baseType: !612, size: 64, offset: 12544)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!172, !173, !388, !388, !275}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !175, file: !104, line: 183, baseType: !612, size: 64, offset: 12608)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !175, file: !104, line: 184, baseType: !275, size: 64, offset: 12672)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !175, file: !104, line: 184, baseType: !275, size: 64, offset: 12736)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !148, file: !147, line: 11, baseType: !619, size: 32, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !35, line: 297, baseType: !116)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !148, file: !147, line: 11, baseType: !391, size: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !148, file: !147, line: 11, baseType: !391, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 992)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 1056)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !148, file: !147, line: 11, baseType: !627, size: 64, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !148, file: !147, line: 11, baseType: !284, size: 64, offset: 1152)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 1216)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 1248)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !148, file: !147, line: 11, baseType: !166, size: 32, offset: 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !148, file: !147, line: 11, baseType: !151, size: 64, offset: 1344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !148, file: !147, line: 11, baseType: !388, size: 64, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !148, file: !147, line: 11, baseType: !153, size: 64, offset: 1472)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !148, file: !147, line: 11, baseType: !153, size: 64, offset: 1536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !148, file: !147, line: 12, baseType: !391, size: 64, offset: 1600)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 1664)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "TF", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 1728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "InvP", scope: !148, file: !147, line: 12, baseType: !640, size: 64, offset: 1792)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !28)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "neig", scope: !148, file: !147, line: 12, baseType: !166, size: 32, offset: 1856)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !148, file: !147, line: 12, baseType: !166, size: 32, offset: 1888)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "max_neig", scope: !148, file: !147, line: 12, baseType: !166, size: 32, offset: 1920)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lambdaN", scope: !148, file: !147, line: 12, baseType: !153, size: 64, offset: 1984)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "smv", scope: !148, file: !147, line: 12, baseType: !153, size: 64, offset: 2048)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !148, file: !147, line: 12, baseType: !350, size: 32, offset: 2112)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "matvecs", scope: !148, file: !147, line: 12, baseType: !166, size: 32, offset: 2144)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "GreatestEig", scope: !148, file: !147, line: 12, baseType: !166, size: 32, offset: 2176)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "wr", scope: !148, file: !147, line: 12, baseType: !162, size: 64, offset: 2240)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "wi", scope: !148, file: !147, line: 12, baseType: !162, size: 64, offset: 2304)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "modul", scope: !148, file: !147, line: 12, baseType: !162, size: 64, offset: 2368)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 2432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !148, file: !147, line: 12, baseType: !284, size: 64, offset: 2560)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !148, file: !147, line: 12, baseType: !391, size: 64, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Sr", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 2688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !148, file: !147, line: 12, baseType: !391, size: 64, offset: 2752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !148, file: !147, line: 12, baseType: !391, size: 64, offset: 2816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "umx", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 2880)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "xmu", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 2944)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3008)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3072)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3136)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Sr2", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3200)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "auau", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3264)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "auu", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3328)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !148, file: !147, line: 12, baseType: !151, size: 64, offset: 3392)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "iwork", scope: !148, file: !147, line: 12, baseType: !640, size: 64, offset: 3456)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "orth", scope: !148, file: !147, line: 12, baseType: !162, size: 64, offset: 3520)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "HasSchur", scope: !148, file: !147, line: 12, baseType: !350, size: 32, offset: 3584)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !148, file: !147, line: 12, baseType: !350, size: 32, offset: 3616)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bgv", scope: !148, file: !147, line: 15, baseType: !153, size: 64, offset: 3648)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ritz", scope: !148, file: !147, line: 16, baseType: !350, size: 32, offset: 3712)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DeflPrecond", scope: !148, file: !147, line: 17, baseType: !350, size: 32, offset: 3744)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Qloc", scope: !148, file: !147, line: 18, baseType: !151, size: 64, offset: 3776)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Rloc", scope: !148, file: !147, line: 19, baseType: !151, size: 64, offset: 3840)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Rshift", scope: !148, file: !147, line: 20, baseType: !151, size: 64, offset: 3904)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Ishift", scope: !148, file: !147, line: 20, baseType: !151, size: 64, offset: 3968)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Scale", scope: !148, file: !147, line: 21, baseType: !151, size: 64, offset: 4032)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "HasShifts", scope: !148, file: !147, line: 22, baseType: !350, size: 32, offset: 4096)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !148, file: !147, line: 23, baseType: !255, size: 32, offset: 4128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !148, file: !147, line: 23, baseType: !255, size: 32, offset: 4160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "First", scope: !148, file: !147, line: 24, baseType: !255, size: 32, offset: 4192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Last", scope: !148, file: !147, line: 24, baseType: !255, size: 32, offset: 4224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Ileft", scope: !148, file: !147, line: 24, baseType: !255, size: 32, offset: 4256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Iright", scope: !148, file: !147, line: 24, baseType: !255, size: 32, offset: 4288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "MatEigL", scope: !148, file: !147, line: 25, baseType: !151, size: 64, offset: 4352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "MatEigR", scope: !148, file: !147, line: 25, baseType: !151, size: 64, offset: 4416)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sgn", scope: !148, file: !147, line: 26, baseType: !151, size: 64, offset: 4480)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tloc", scope: !148, file: !147, line: 27, baseType: !151, size: 64, offset: 4544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "TmpU", scope: !148, file: !147, line: 28, baseType: !391, size: 64, offset: 4608)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !148, file: !147, line: 29, baseType: !151, size: 64, offset: 4672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !148, file: !147, line: 30, baseType: !640, size: 64, offset: 4736)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !148, file: !147, line: 31, baseType: !151, size: 64, offset: 4800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "wbufptr", scope: !148, file: !147, line: 31, baseType: !151, size: 64, offset: 4864)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !148, file: !147, line: 32, baseType: !151, size: 64, offset: 4928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !147, line: 33, baseType: !255, size: 32, offset: 4992)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !700, line: 1451, baseType: !228)
!700 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !197, line: 331, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !197, line: 331, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !197, line: 338, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !197, line: 338, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !127)
!708 = !{!0, !709, !714, !716}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "KSP_AGMRESBuildBasis", scope: !2, file: !711, line: 12, type: !712, isLocal: false, isDefinition: true)
!711 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/agmres/agmres.c", directory: "/home/users/ndemeye/xSDK")
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !713, line: 80, baseType: !28)
!713 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "KSP_AGMRESComputeShifts", scope: !2, file: !711, line: 12, type: !712, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "KSP_AGMRESRoddec", scope: !2, file: !711, line: 12, type: !712, isLocal: false, isDefinition: true)
!718 = !{i32 7, !"Dwarf Version", i32 4}
!719 = !{i32 2, !"Debug Info Version", i32 3}
!720 = !{i32 1, !"wchar_size", i32 4}
!721 = !{i32 7, !"PIC Level", i32 2}
!722 = !{i32 7, !"uwtable", i32 1}
!723 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!724 = distinct !DISubprogram(name: "KSPComputeShifts_GMRES", scope: !711, file: !711, line: 103, type: !398, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !734, !735, !736, !737, !738, !739, !741, !745, !747, !749, !751, !753, !757, !759, !761, !763, !765, !767, !769, !771, !773, !775, !779}
!726 = !DILocalVariable(name: "ksp", arg: 1, scope: !724, file: !711, line: 103, type: !173)
!727 = !DILocalVariable(name: "ierr", scope: !724, file: !711, line: 105, type: !172)
!728 = !DILocalVariable(name: "agmres", scope: !724, file: !711, line: 106, type: !145)
!729 = !DILocalVariable(name: "kspgmres", scope: !724, file: !711, line: 107, type: !173)
!730 = !DILocalVariable(name: "Amat", scope: !724, file: !711, line: 108, type: !404)
!731 = !DILocalVariable(name: "Pmat", scope: !724, file: !711, line: 108, type: !404)
!732 = !DILocalVariable(name: "max_k", scope: !724, file: !711, line: 109, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!734 = !DILocalVariable(name: "pc", scope: !724, file: !711, line: 110, type: !537)
!735 = !DILocalVariable(name: "m", scope: !724, file: !711, line: 111, type: !166)
!736 = !DILocalVariable(name: "Rshift", scope: !724, file: !711, line: 112, type: !151)
!737 = !DILocalVariable(name: "Ishift", scope: !724, file: !711, line: 112, type: !151)
!738 = !DILocalVariable(name: "flg", scope: !724, file: !711, line: 113, type: !350)
!739 = !DILocalVariable(name: "ierr__", scope: !740, file: !711, line: 119, type: !172)
