; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/fieldsplit/fieldsplit.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/fieldsplit/fieldsplit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!202 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!203 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!207 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!208 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 238, baseType: !7, size: 32, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!212 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!213 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!214 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 442, baseType: !28, size: 32, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!217 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!218 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!219 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!220 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!221 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!222 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!223 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!224 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!225 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!226 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!227 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!228 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!229 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!230 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!231 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!232 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!233 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!234 = !DIEnumerator(name: "MAT_SPD", value: 15)
!235 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!236 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!237 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!238 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!239 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!240 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!241 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!242 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!243 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!244 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 424, baseType: !7, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!248 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 155, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!252 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!255 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !257)
!257 = !{!258}
!258 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 787, baseType: !7, size: 32, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_DIAG", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_LUMP", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "MAT_SCHUR_COMPLEMENT_AINV_BLOCK_DIAG", value: 2, isUnsigned: true)
!264 = !{!265, !269, !270, !473, !305, !476, !345, !884, !887, !355, !28, !382, !439, !474, !7, !300, !391, !890, !891, !328, !758}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !266, line: 330, baseType: !267)
!266 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !266, line: 330, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !273, line: 73, size: 4480, elements: !274)
!273 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!274 = !{!275, !277, !326, !327, !329, !332, !333, !334, !335, !343, !344, !346, !350, !354, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !369, !371, !372, !374, !376, !377, !378, !379, !380, !383, !385, !386, !387, !388, !389, !392, !394, !395, !396, !406, !408, !409, !413, !414, !463, !468, !470, !471, !472}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !272, file: !273, line: 74, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !272, file: !273, line: 75, baseType: !278, size: 448, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 448, elements: !324)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !273, line: 53, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 45, size: 448, elements: !281)
!281 = !{!282, !288, !296, !301, !308, !312, !319}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !280, file: !273, line: 46, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!286, !270, !287}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !280, file: !273, line: 47, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!286, !270, !292}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !293, line: 16, baseType: !294)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !293, line: 16, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !280, file: !273, line: 48, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!286, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !280, file: !273, line: 49, baseType: !302, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!286, !270, !305, !270}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !280, file: !273, line: 50, baseType: !309, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!286, !270, !305, !300}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !280, file: !273, line: 51, baseType: !313, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!286, !270, !305, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !280, file: !273, line: 52, baseType: !320, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!286, !270, !305, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!324 = !{!325}
!325 = !DISubrange(count: 1)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !272, file: !273, line: 76, baseType: !265, size: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !273, line: 77, baseType: !328, size: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !272, file: !273, line: 78, baseType: !330, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !331)
!331 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !272, file: !273, line: 78, baseType: !330, size: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !272, file: !273, line: 78, baseType: !330, size: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !272, file: !273, line: 78, baseType: !330, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !272, file: !273, line: 79, baseType: !336, size: 64, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !339, line: 27, baseType: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !341, line: 43, baseType: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!342 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !272, file: !273, line: 80, baseType: !328, size: 32, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !272, file: !273, line: 81, baseType: !345, size: 32, offset: 992)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !272, file: !273, line: 82, baseType: !347, size: 64, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !272, file: !273, line: 83, baseType: !351, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !272, file: !273, line: 84, baseType: !355, size: 64, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !272, file: !273, line: 85, baseType: !355, size: 64, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !272, file: !273, line: 86, baseType: !355, size: 64, offset: 1280)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !272, file: !273, line: 87, baseType: !355, size: 64, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !272, file: !273, line: 88, baseType: !270, size: 64, offset: 1408)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !272, file: !273, line: 89, baseType: !336, size: 64, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !273, line: 90, baseType: !355, size: 64, offset: 1536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !272, file: !273, line: 91, baseType: !355, size: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !272, file: !273, line: 92, baseType: !328, size: 32, offset: 1664)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !272, file: !273, line: 93, baseType: !269, size: 64, offset: 1728)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !272, file: !273, line: 94, baseType: !366, size: 64, offset: 1792)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !337)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !272, file: !273, line: 95, baseType: !328, size: 32, offset: 1856)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !272, file: !273, line: 95, baseType: !328, size: 32, offset: 1888)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !272, file: !273, line: 96, baseType: !370, size: 64, offset: 1920)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !272, file: !273, line: 96, baseType: !370, size: 64, offset: 1984)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !272, file: !273, line: 97, baseType: !373, size: 64, offset: 2048)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !272, file: !273, line: 97, baseType: !375, size: 64, offset: 2112)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !272, file: !273, line: 98, baseType: !328, size: 32, offset: 2176)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !272, file: !273, line: 98, baseType: !328, size: 32, offset: 2208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !272, file: !273, line: 99, baseType: !370, size: 64, offset: 2240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !272, file: !273, line: 99, baseType: !370, size: 64, offset: 2304)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !272, file: !273, line: 100, baseType: !381, size: 64, offset: 2368)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !331)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !272, file: !273, line: 100, baseType: !384, size: 64, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !272, file: !273, line: 101, baseType: !328, size: 32, offset: 2496)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !272, file: !273, line: 101, baseType: !328, size: 32, offset: 2528)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !272, file: !273, line: 102, baseType: !370, size: 64, offset: 2560)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !272, file: !273, line: 102, baseType: !370, size: 64, offset: 2624)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !272, file: !273, line: 103, baseType: !390, size: 64, offset: 2688)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !382)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !272, file: !273, line: 103, baseType: !393, size: 64, offset: 2752)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !272, file: !273, line: 104, baseType: !323, size: 64, offset: 2816)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !272, file: !273, line: 105, baseType: !328, size: 32, offset: 2880)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !272, file: !273, line: 106, baseType: !397, size: 128, offset: 2944)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 128, elements: !404)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !273, line: 64, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 61, size: 128, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !400, file: !273, line: 62, baseType: !316, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !400, file: !273, line: 63, baseType: !269, size: 64, offset: 64)
!404 = !{!405}
!405 = !DISubrange(count: 2)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !272, file: !273, line: 107, baseType: !407, size: 64, offset: 3072)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !404)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !272, file: !273, line: 108, baseType: !269, size: 64, offset: 3136)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !272, file: !273, line: 109, baseType: !410, size: 64, offset: 3200)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!286, !269}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !272, file: !273, line: 111, baseType: !328, size: 32, offset: 3264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !272, file: !273, line: 112, baseType: !415, size: 320, offset: 3328)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 320, elements: !461)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!286, !419, !270, !269}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !422)
!422 = !{!423, !424, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !421, file: !12, line: 100, baseType: !328, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !12, line: 101, baseType: !425, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !436, !437, !438, !442, !444, !446, !447, !448}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !427, file: !12, line: 84, baseType: !355, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !427, file: !12, line: 85, baseType: !355, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !12, line: 86, baseType: !269, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !427, file: !12, line: 87, baseType: !347, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !427, file: !12, line: 88, baseType: !434, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !427, file: !12, line: 89, baseType: !307, size: 8, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !427, file: !12, line: 90, baseType: !355, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !427, file: !12, line: 91, baseType: !439, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 46, baseType: !441)
!440 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!441 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !427, file: !12, line: 92, baseType: !443, size: 32, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !12, line: 93, baseType: !445, size: 32, offset: 544)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !427, file: !12, line: 94, baseType: !425, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !427, file: !12, line: 95, baseType: !355, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !427, file: !12, line: 96, baseType: !269, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !421, file: !12, line: 102, baseType: !355, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !421, file: !12, line: 102, baseType: !355, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !421, file: !12, line: 103, baseType: !355, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !421, file: !12, line: 104, baseType: !265, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !421, file: !12, line: 105, baseType: !443, size: 32, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !421, file: !12, line: 105, baseType: !443, size: 32, offset: 416)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !421, file: !12, line: 105, baseType: !443, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !421, file: !12, line: 106, baseType: !270, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !421, file: !12, line: 107, baseType: !458, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!461 = !{!462}
!462 = !DISubrange(count: 5)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !272, file: !273, line: 113, baseType: !464, size: 320, offset: 3648)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 320, elements: !461)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!286, !270, !269}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !272, file: !273, line: 114, baseType: !469, size: 320, offset: 3968)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 320, elements: !461)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !272, file: !273, line: 115, baseType: !443, size: 32, offset: 4288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !272, file: !273, line: 120, baseType: !458, size: 64, offset: 4352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !272, file: !273, line: 121, baseType: !443, size: 32, offset: 4416)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !475, line: 1451, baseType: !316)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_FieldSplit", file: !478, line: 65, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/fieldsplit/fieldsplit.c", directory: "/home/users/ndemeye/xSDK")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 23, size: 2240, elements: !480)
!480 = !{!481, !483, !484, !485, !486, !487, !492, !493, !494, !495, !500, !501, !502, !503, !504, !505, !506, !507, !508, !510, !512, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !878, !879, !880, !881, !882, !883}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !478, line: 24, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCCompositeType", file: !27, line: 180, baseType: !164)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "defaultsplit", scope: !479, file: !478, line: 25, baseType: !443, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "splitdefined", scope: !479, file: !478, line: 26, baseType: !443, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !479, file: !478, line: 27, baseType: !328, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nsplits", scope: !479, file: !478, line: 28, baseType: !328, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !479, file: !478, line: 29, baseType: !488, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !197, line: 21, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !197, line: 21, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !479, file: !478, line: 29, baseType: !488, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !479, file: !478, line: 29, baseType: !489, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !479, file: !478, line: 29, baseType: !489, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !479, file: !478, line: 30, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !123, line: 16, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !123, line: 16, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !479, file: !478, line: 31, baseType: !496, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Afield", scope: !479, file: !478, line: 32, baseType: !496, size: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "issetup", scope: !479, file: !478, line: 33, baseType: !443, size: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !479, file: !478, line: 36, baseType: !497, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !479, file: !478, line: 37, baseType: !497, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "schur", scope: !479, file: !478, line: 38, baseType: !497, size: 64, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "schurp", scope: !479, file: !478, line: 39, baseType: !497, size: 64, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "schur_user", scope: !479, file: !478, line: 40, baseType: !497, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "schurpre", scope: !479, file: !478, line: 41, baseType: !509, size: 32, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFieldSplitSchurPreType", file: !27, line: 189, baseType: !172)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "schurfactorization", scope: !479, file: !478, line: 42, baseType: !511, size: 32, offset: 1056)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFieldSplitSchurFactType", file: !27, line: 203, baseType: !179)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "kspschur", scope: !479, file: !478, line: 43, baseType: !513, size: 64, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !41, line: 22, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !110, line: 75, size: 12800, elements: !516)
!516 = !{!517, !519, !564, !569, !570, !571, !572, !602, !603, !604, !605, !606, !608, !613, !614, !615, !616, !617, !618, !619, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !642, !648, !649, !650, !651, !656, !657, !658, !659, !664, !665, !666, !667, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !808, !809, !810, !811, !812, !819, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !835, !836, !837}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !515, file: !110, line: 76, baseType: !518, size: 4480)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !273, line: 122, baseType: !272)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !515, file: !110, line: 76, baseType: !520, size: 896, offset: 4480)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 896, elements: !324)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !110, line: 18, size: 896, elements: !522)
!522 = !{!523, !527, !531, !535, !539, !540, !544, !545, !549, !553, !557, !558, !562, !563}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !521, file: !110, line: 19, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!286, !513, !489, !488}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !521, file: !110, line: 22, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!286, !513, !489, !489, !488}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !521, file: !110, line: 25, baseType: !532, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!286, !513}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !521, file: !110, line: 26, baseType: !536, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!286, !513, !497, !497}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !521, file: !110, line: 27, baseType: !532, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !521, file: !110, line: 28, baseType: !541, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!286, !419, !513}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !521, file: !110, line: 29, baseType: !532, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !521, file: !110, line: 30, baseType: !546, size: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!286, !513, !381, !381}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !521, file: !110, line: 31, baseType: !550, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!286, !513, !328, !381, !381, !373}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !521, file: !110, line: 32, baseType: !554, size: 64, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!286, !513, !443, !443, !373, !488, !381, !381}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !521, file: !110, line: 33, baseType: !532, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !521, file: !110, line: 34, baseType: !559, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!286, !513, !292}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !521, file: !110, line: 35, baseType: !532, size: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !521, file: !110, line: 36, baseType: !559, size: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !515, file: !110, line: 77, baseType: !565, size: 64, offset: 5376)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !566, line: 14, baseType: !567)
!566 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !566, line: 14, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !515, file: !110, line: 78, baseType: !443, size: 32, offset: 5440)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !515, file: !110, line: 79, baseType: !443, size: 32, offset: 5472)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !515, file: !110, line: 81, baseType: !328, size: 32, offset: 5504)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !515, file: !110, line: 82, baseType: !573, size: 64, offset: 5568)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !41, line: 752, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !110, line: 54, size: 5184, elements: !576)
!576 = !{!577, !578, !598, !599, !600, !601}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !575, file: !110, line: 55, baseType: !518, size: 4480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !575, file: !110, line: 55, baseType: !579, size: 448, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 448, elements: !324)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !110, line: 41, size: 448, elements: !581)
!581 = !{!582, !586, !587, !591, !592, !593, !597}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !580, file: !110, line: 42, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!286, !573, !489, !489}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !580, file: !110, line: 43, baseType: !583, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !580, file: !110, line: 44, baseType: !588, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!286, !573}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !580, file: !110, line: 45, baseType: !588, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !580, file: !110, line: 46, baseType: !588, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !580, file: !110, line: 47, baseType: !594, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!286, !573, !292}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !580, file: !110, line: 48, baseType: !588, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !575, file: !110, line: 56, baseType: !513, size: 64, offset: 4928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !575, file: !110, line: 57, baseType: !497, size: 64, offset: 4992)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !575, file: !110, line: 58, baseType: !366, size: 64, offset: 5056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !575, file: !110, line: 59, baseType: !269, size: 64, offset: 5120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !515, file: !110, line: 83, baseType: !443, size: 32, offset: 5632)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !515, file: !110, line: 84, baseType: !443, size: 32, offset: 5664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !515, file: !110, line: 85, baseType: !443, size: 32, offset: 5696)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !515, file: !110, line: 86, baseType: !443, size: 32, offset: 5728)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !515, file: !110, line: 87, baseType: !607, size: 32, offset: 5760)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !515, file: !110, line: 88, baseType: !609, size: 384, offset: 5792)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 384, elements: !610)
!610 = !{!611, !612}
!611 = !DISubrange(count: 4)
!612 = !DISubrange(count: 3)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !515, file: !110, line: 89, baseType: !382, size: 64, offset: 6208)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !515, file: !110, line: 90, baseType: !382, size: 64, offset: 6272)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !515, file: !110, line: 91, baseType: !382, size: 64, offset: 6336)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !515, file: !110, line: 92, baseType: !382, size: 64, offset: 6400)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !515, file: !110, line: 93, baseType: !382, size: 64, offset: 6464)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !515, file: !110, line: 94, baseType: !382, size: 64, offset: 6528)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !515, file: !110, line: 95, baseType: !620, size: 32, offset: 6592)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !41, line: 540, baseType: !40)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !515, file: !110, line: 96, baseType: !443, size: 32, offset: 6624)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !515, file: !110, line: 98, baseType: !489, size: 64, offset: 6656)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !515, file: !110, line: 98, baseType: !489, size: 64, offset: 6720)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !515, file: !110, line: 102, baseType: !381, size: 64, offset: 6784)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !515, file: !110, line: 103, baseType: !381, size: 64, offset: 6848)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !515, file: !110, line: 104, baseType: !328, size: 32, offset: 6912)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !515, file: !110, line: 105, baseType: !328, size: 32, offset: 6944)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !515, file: !110, line: 106, baseType: !443, size: 32, offset: 6976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !515, file: !110, line: 107, baseType: !381, size: 64, offset: 7040)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !515, file: !110, line: 108, baseType: !381, size: 64, offset: 7104)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !515, file: !110, line: 109, baseType: !328, size: 32, offset: 7168)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !515, file: !110, line: 110, baseType: !328, size: 32, offset: 7200)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !515, file: !110, line: 111, baseType: !443, size: 32, offset: 7232)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !515, file: !110, line: 113, baseType: !328, size: 32, offset: 7264)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !515, file: !110, line: 114, baseType: !443, size: 32, offset: 7296)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !515, file: !110, line: 117, baseType: !328, size: 32, offset: 7328)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !515, file: !110, line: 120, baseType: !638, size: 320, offset: 7360)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 320, elements: !461)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!286, !513, !328, !382, !269}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !515, file: !110, line: 121, baseType: !643, size: 320, offset: 7680)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 320, elements: !461)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!286, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !515, file: !110, line: 122, baseType: !469, size: 320, offset: 8000)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !515, file: !110, line: 123, baseType: !328, size: 32, offset: 8320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !515, file: !110, line: 124, baseType: !443, size: 32, offset: 8352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !515, file: !110, line: 126, baseType: !652, size: 320, offset: 8384)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 320, elements: !461)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!286, !513, !269}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !515, file: !110, line: 127, baseType: !643, size: 320, offset: 8704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !515, file: !110, line: 128, baseType: !469, size: 320, offset: 9024)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !515, file: !110, line: 129, baseType: !328, size: 32, offset: 9344)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !515, file: !110, line: 131, baseType: !660, size: 64, offset: 9408)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!286, !513, !328, !382, !663, !269}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !515, file: !110, line: 132, baseType: !410, size: 64, offset: 9472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !515, file: !110, line: 133, baseType: !269, size: 64, offset: 9536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !515, file: !110, line: 135, baseType: !269, size: 64, offset: 9600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !515, file: !110, line: 137, baseType: !668, size: 64, offset: 9664)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !671, line: 37, size: 6720, elements: !672)
!671 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!672 = !{!673, !674, !728, !729, !730, !731, !732, !733, !735, !736, !737, !738, !739, !740, !741, !742, !743, !753, !754, !755, !756, !757, !759}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !670, file: !671, line: 38, baseType: !518, size: 4480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !670, file: !671, line: 38, baseType: !675, size: 1152, offset: 4480)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 1152, elements: !324)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !671, line: 13, size: 1152, elements: !677)
!677 = !{!678, !682, !686, !690, !696, !700, !701, !705, !709, !713, !714, !718, !719, !720, !721, !722, !726, !727}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !676, file: !671, line: 14, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!286, !668}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !676, file: !671, line: 15, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!286, !668, !489, !489}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !676, file: !671, line: 16, baseType: !687, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!286, !668, !497, !497}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !676, file: !671, line: 17, baseType: !691, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!286, !668, !489, !489, !489, !382, !382, !382, !328, !443, !373, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !676, file: !671, line: 18, baseType: !697, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!286, !668, !607, !489, !489, !489}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !676, file: !671, line: 19, baseType: !683, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !676, file: !671, line: 20, baseType: !702, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!286, !668, !328, !489, !489, !489}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !676, file: !671, line: 21, baseType: !706, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!286, !419, !668}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !676, file: !671, line: 22, baseType: !710, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!286, !668, !513, !489, !489}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !676, file: !671, line: 23, baseType: !710, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !676, file: !671, line: 24, baseType: !715, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!286, !668, !496}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !676, file: !671, line: 25, baseType: !683, size: 64, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !676, file: !671, line: 26, baseType: !683, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !676, file: !671, line: 27, baseType: !679, size: 64, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !676, file: !671, line: 28, baseType: !679, size: 64, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !676, file: !671, line: 29, baseType: !723, size: 64, offset: 960)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!286, !668, !292}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !676, file: !671, line: 30, baseType: !679, size: 64, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !676, file: !671, line: 31, baseType: !723, size: 64, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !670, file: !671, line: 39, baseType: !565, size: 64, offset: 5632)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !670, file: !671, line: 40, baseType: !328, size: 32, offset: 5696)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !670, file: !671, line: 41, baseType: !366, size: 64, offset: 5760)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !670, file: !671, line: 41, baseType: !366, size: 64, offset: 5824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !670, file: !671, line: 42, baseType: !443, size: 32, offset: 5888)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !671, line: 43, baseType: !734, size: 32, offset: 5920)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !123, line: 285, baseType: !122)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !670, file: !671, line: 45, baseType: !328, size: 32, offset: 5952)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !670, file: !671, line: 46, baseType: !443, size: 32, offset: 5984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !670, file: !671, line: 47, baseType: !497, size: 64, offset: 6016)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !670, file: !671, line: 47, baseType: !497, size: 64, offset: 6080)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !670, file: !671, line: 48, baseType: !489, size: 64, offset: 6144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !670, file: !671, line: 48, baseType: !489, size: 64, offset: 6208)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !670, file: !671, line: 49, baseType: !443, size: 32, offset: 6272)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !670, file: !671, line: 50, baseType: !443, size: 32, offset: 6304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !670, file: !671, line: 51, baseType: !744, size: 64, offset: 6336)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!286, !668, !328, !747, !747, !496, !269}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !750, line: 11, baseType: !751)
!750 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !750, line: 11, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !670, file: !671, line: 52, baseType: !269, size: 64, offset: 6400)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !670, file: !671, line: 53, baseType: !269, size: 64, offset: 6464)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !670, file: !671, line: 54, baseType: !328, size: 32, offset: 6528)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !670, file: !671, line: 55, baseType: !269, size: 64, offset: 6592)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !670, file: !671, line: 56, baseType: !758, size: 32, offset: 6656)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !129)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !670, file: !671, line: 57, baseType: !758, size: 32, offset: 6688)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !110, line: 139, baseType: !269, size: 64, offset: 9728)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9792)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9824)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9856)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9888)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9920)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9952)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 9984)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10016)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10080)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10144)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10176)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !515, file: !110, line: 142, baseType: !443, size: 32, offset: 10208)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10304)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10432)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10496)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10560)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10624)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10752)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10816)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10880)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 10944)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 11008)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !515, file: !110, line: 143, baseType: !292, size: 64, offset: 11072)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11136)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !65, line: 162, baseType: !64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11168)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11200)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11232)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11264)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11296)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11360)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11392)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11424)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11456)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11488)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11520)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !515, file: !110, line: 144, baseType: !790, size: 32, offset: 11552)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !515, file: !110, line: 147, baseType: !328, size: 32, offset: 11584)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !515, file: !110, line: 148, baseType: !488, size: 64, offset: 11648)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !515, file: !110, line: 150, baseType: !807, size: 32, offset: 11712)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !110, line: 70, baseType: !109)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !515, file: !110, line: 151, baseType: !443, size: 32, offset: 11744)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !515, file: !110, line: 153, baseType: !328, size: 32, offset: 11776)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !515, file: !110, line: 154, baseType: !328, size: 32, offset: 11808)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !515, file: !110, line: 156, baseType: !443, size: 32, offset: 11840)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !515, file: !110, line: 161, baseType: !813, size: 192, offset: 11904)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !110, line: 157, size: 192, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !813, file: !110, line: 158, baseType: !497, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !813, file: !110, line: 158, baseType: !497, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !813, file: !110, line: 159, baseType: !443, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !813, file: !110, line: 160, baseType: !443, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !515, file: !110, line: 163, baseType: !820, size: 32, offset: 12096)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !41, line: 451, baseType: !115)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !515, file: !110, line: 165, baseType: !607, size: 32, offset: 12128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !515, file: !110, line: 166, baseType: !820, size: 32, offset: 12160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !515, file: !110, line: 171, baseType: !443, size: 32, offset: 12192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !515, file: !110, line: 172, baseType: !443, size: 32, offset: 12224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !515, file: !110, line: 173, baseType: !443, size: 32, offset: 12256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !515, file: !110, line: 174, baseType: !489, size: 64, offset: 12288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !515, file: !110, line: 175, baseType: !489, size: 64, offset: 12352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !515, file: !110, line: 177, baseType: !328, size: 32, offset: 12416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !515, file: !110, line: 178, baseType: !443, size: 32, offset: 12448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !515, file: !110, line: 180, baseType: !292, size: 64, offset: 12480)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !515, file: !110, line: 182, baseType: !832, size: 64, offset: 12544)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!286, !513, !489, !489, !269}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !515, file: !110, line: 183, baseType: !832, size: 64, offset: 12608)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !515, file: !110, line: 184, baseType: !269, size: 64, offset: 12672)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !515, file: !110, line: 184, baseType: !269, size: 64, offset: 12736)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "kspupper", scope: !479, file: !478, line: 44, baseType: !513, size: 64, offset: 1152)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "schurscale", scope: !479, file: !478, line: 45, baseType: !391, size: 64, offset: 1216)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !479, file: !478, line: 48, baseType: !497, size: 64, offset: 1280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gkbtol", scope: !479, file: !478, line: 49, baseType: !382, size: 64, offset: 1344)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gkbdelay", scope: !479, file: !478, line: 50, baseType: !328, size: 32, offset: 1408)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gkbnu", scope: !479, file: !478, line: 51, baseType: !382, size: 64, offset: 1472)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gkbmaxit", scope: !479, file: !478, line: 52, baseType: !328, size: 32, offset: 1536)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gkbmonitor", scope: !479, file: !478, line: 53, baseType: !443, size: 32, offset: 1568)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gkbviewer", scope: !479, file: !478, line: 54, baseType: !292, size: 64, offset: 1600)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !479, file: !478, line: 55, baseType: !489, size: 64, offset: 1664)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !479, file: !478, line: 55, baseType: !489, size: 64, offset: 1728)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !479, file: !478, line: 55, baseType: !489, size: 64, offset: 1792)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Hu", scope: !479, file: !478, line: 55, baseType: !489, size: 64, offset: 1856)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vecz", scope: !479, file: !478, line: 56, baseType: !390, size: 64, offset: 1920)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !479, file: !478, line: 58, baseType: !853, size: 64, offset: 1984)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_FieldSplitLink", file: !478, line: 10, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PC_FieldSplitLink", file: !478, line: 11, size: 896, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !871, !872, !873, !874, !875}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !855, file: !478, line: 12, baseType: !513, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !855, file: !478, line: 13, baseType: !489, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !855, file: !478, line: 13, baseType: !489, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !855, file: !478, line: 13, baseType: !489, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !855, file: !478, line: 14, baseType: !355, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !855, file: !478, line: 15, baseType: !328, size: 32, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !855, file: !478, line: 16, baseType: !373, size: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fields_col", scope: !855, file: !478, line: 16, baseType: !373, size: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sctx", scope: !855, file: !478, line: 17, baseType: !866, size: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !867, line: 59, baseType: !868)
!867 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !867, line: 15, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !867, line: 15, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !855, file: !478, line: 18, baseType: !749, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "is_col", scope: !855, file: !478, line: 18, baseType: !749, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !478, line: 19, baseType: !853, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !855, file: !478, line: 19, baseType: !853, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !855, file: !478, line: 20, baseType: !876, size: 32, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !877, line: 80, baseType: !28)
!877 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!878 = !DIDerivedType(tag: DW_TAG_member, name: "isrestrict", scope: !479, file: !478, line: 59, baseType: !443, size: 32, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "suboptionsset", scope: !479, file: !478, line: 60, baseType: !443, size: 32, offset: 2080)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dm_splits", scope: !479, file: !478, line: 61, baseType: !443, size: 32, offset: 2112)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "diag_use_amat", scope: !479, file: !478, line: 62, baseType: !443, size: 32, offset: 2144)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "offdiag_use_amat", scope: !479, file: !478, line: 63, baseType: !443, size: 32, offset: 2176)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !479, file: !478, line: 64, baseType: !443, size: 32, offset: 2208)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !266, line: 331, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !266, line: 331, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !266, line: 338, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !266, line: 338, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !256)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!892 = !{!0, !893, !898, !900, !902, !904, !906, !908, !910, !912}
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "PCFieldSplitSchurFactTypes", scope: !2, file: !478, line: 6, type: !895, isLocal: false, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 448, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 7)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_0", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_1", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_S", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_U", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_L", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_2", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_3", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "KSP_Solve_FS_4", scope: !2, file: !478, line: 8, type: !876, isLocal: false, isDefinition: true)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 512, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 8)
!917 = !{i32 7, !"Dwarf Version", i32 4}
!918 = !{i32 2, !"Debug Info Version", i32 3}
!919 = !{i32 1, !"wchar_size", i32 4}
!920 = !{i32 7, !"PIC Level", i32 2}
!921 = !{i32 7, !"uwtable", i32 1}
!922 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!923 = distinct !DISubprogram(name: "PCFieldSplitRestrictIS", scope: !478, file: !478, line: 1776, type: !924, scopeLine: 1777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{!286, !668, !749}
!926 = !{!927, !928, !929, !930, !933, !934, !936, !940}
!927 = !DILocalVariable(name: "pc", arg: 1, scope: !923, file: !478, line: 1776, type: !668)
!928 = !DILocalVariable(name: "isy", arg: 2, scope: !923, file: !478, line: 1776, type: !749)
