; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/preallocator/matpreallocator.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/preallocator/matpreallocator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !360, !364, !365, !563, !400, !530, !438, !565, !568, !351, !72, !334, !571, !329, !341, !343, !572, !5}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Preallocator", file: !323, line: 9, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/preallocator/matpreallocator.c", directory: "/home/users/ndemeye/xSDK")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 4, size: 384, elements: !325)
!325 = !{!326, !353, !355, !356, !357, !358}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !324, file: !323, line: 5, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHSetIJ", file: !328, line: 13, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashsetij.h", directory: "/home/users/ndemeye/xSDK")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HSetIJ_t", file: !328, line: 13, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HSetIJ_s", file: !328, line: 13, size: 320, elements: !332)
!332 = !{!333, !337, !338, !339, !340, !342, !350}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !331, file: !328, line: 13, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !335, line: 166, baseType: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !335, line: 139, baseType: !5)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !328, line: 13, baseType: !334, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !331, file: !328, line: 13, baseType: !334, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !331, file: !328, line: 13, baseType: !334, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !328, line: 13, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !331, file: !328, line: 13, baseType: !343, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashIJKey", file: !328, line: 8, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashIJKey", file: !328, line: 8, size: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !345, file: !328, line: 8, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !345, file: !328, line: 8, baseType: !348, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !331, file: !328, line: 13, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dnz", scope: !324, file: !323, line: 6, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "onz", scope: !324, file: !323, line: 6, baseType: !354, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dnzu", scope: !324, file: !323, line: 7, baseType: !354, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "onzu", scope: !324, file: !323, line: 7, baseType: !354, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nooffproc", scope: !324, file: !323, line: 8, baseType: !359, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !361, line: 330, baseType: !362)
!361 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !361, line: 330, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !368, line: 73, size: 4480, elements: !369)
!368 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!369 = !{!370, !372, !420, !421, !422, !425, !426, !427, !428, !436, !437, !439, !443, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !459, !460, !461, !463, !464, !465, !467, !468, !469, !470, !471, !474, !476, !477, !478, !479, !480, !483, !485, !486, !487, !497, !499, !500, !504, !505, !553, !558, !560, !561, !562}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !367, file: !368, line: 74, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !367, file: !368, line: 75, baseType: !373, size: 448, offset: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 448, elements: !418)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !368, line: 53, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 45, size: 448, elements: !376)
!376 = !{!377, !383, !391, !396, !402, !406, !413}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !375, file: !368, line: 46, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !365, !382}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !375, file: !368, line: 47, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!381, !365, !387}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !388, line: 16, baseType: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !388, line: 16, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !375, file: !368, line: 48, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!381, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !375, file: !368, line: 49, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!381, !365, !400, !365}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !375, file: !368, line: 50, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!381, !365, !400, !395}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !375, file: !368, line: 51, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!381, !365, !400, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !375, file: !368, line: 52, baseType: !414, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!381, !365, !400, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!418 = !{!419}
!419 = !DISubrange(count: 1)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !367, file: !368, line: 76, baseType: !360, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 77, baseType: !348, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !367, file: !368, line: 78, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !424)
!424 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !367, file: !368, line: 78, baseType: !423, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !367, file: !368, line: 78, baseType: !423, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !367, file: !368, line: 78, baseType: !423, size: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !367, file: !368, line: 79, baseType: !429, size: 64, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !432, line: 27, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !434, line: 43, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!435 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !367, file: !368, line: 80, baseType: !348, size: 32, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !367, file: !368, line: 81, baseType: !438, size: 32, offset: 992)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !367, file: !368, line: 82, baseType: !440, size: 64, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !367, file: !368, line: 83, baseType: !444, size: 64, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !367, file: !368, line: 84, baseType: !351, size: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !367, file: !368, line: 85, baseType: !351, size: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !367, file: !368, line: 86, baseType: !351, size: 64, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !367, file: !368, line: 87, baseType: !351, size: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !367, file: !368, line: 88, baseType: !365, size: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !367, file: !368, line: 89, baseType: !429, size: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !368, line: 90, baseType: !351, size: 64, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !367, file: !368, line: 91, baseType: !351, size: 64, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !367, file: !368, line: 92, baseType: !348, size: 32, offset: 1664)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !367, file: !368, line: 93, baseType: !364, size: 64, offset: 1728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !368, line: 94, baseType: !458, size: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !430)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !367, file: !368, line: 95, baseType: !348, size: 32, offset: 1856)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !367, file: !368, line: 95, baseType: !348, size: 32, offset: 1888)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !367, file: !368, line: 96, baseType: !462, size: 64, offset: 1920)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !367, file: !368, line: 96, baseType: !462, size: 64, offset: 1984)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !367, file: !368, line: 97, baseType: !354, size: 64, offset: 2048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !367, file: !368, line: 97, baseType: !466, size: 64, offset: 2112)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !367, file: !368, line: 98, baseType: !348, size: 32, offset: 2176)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !367, file: !368, line: 98, baseType: !348, size: 32, offset: 2208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !367, file: !368, line: 99, baseType: !462, size: 64, offset: 2240)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !367, file: !368, line: 99, baseType: !462, size: 64, offset: 2304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !367, file: !368, line: 100, baseType: !472, size: 64, offset: 2368)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !424)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !367, file: !368, line: 100, baseType: !475, size: 64, offset: 2432)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !367, file: !368, line: 101, baseType: !348, size: 32, offset: 2496)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !367, file: !368, line: 101, baseType: !348, size: 32, offset: 2528)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !367, file: !368, line: 102, baseType: !462, size: 64, offset: 2560)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !367, file: !368, line: 102, baseType: !462, size: 64, offset: 2624)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !367, file: !368, line: 103, baseType: !481, size: 64, offset: 2688)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !473)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !367, file: !368, line: 103, baseType: !484, size: 64, offset: 2752)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !367, file: !368, line: 104, baseType: !417, size: 64, offset: 2816)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !367, file: !368, line: 105, baseType: !348, size: 32, offset: 2880)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !367, file: !368, line: 106, baseType: !488, size: 128, offset: 2944)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !495)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !368, line: 64, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 61, size: 128, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !491, file: !368, line: 62, baseType: !410, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !491, file: !368, line: 63, baseType: !364, size: 64, offset: 64)
!495 = !{!496}
!496 = !DISubrange(count: 2)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !367, file: !368, line: 107, baseType: !498, size: 64, offset: 3072)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 64, elements: !495)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !367, file: !368, line: 108, baseType: !364, size: 64, offset: 3136)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !367, file: !368, line: 109, baseType: !501, size: 64, offset: 3200)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!381, !364}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !367, file: !368, line: 111, baseType: !348, size: 32, offset: 3264)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !367, file: !368, line: 112, baseType: !506, size: 320, offset: 3328)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 320, elements: !551)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!381, !510, !365, !364}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !513)
!513 = !{!514, !515, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !10, line: 100, baseType: !348, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !10, line: 101, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !527, !528, !529, !533, !534, !536, !537, !538}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !518, file: !10, line: 84, baseType: !351, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !518, file: !10, line: 85, baseType: !351, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !10, line: 86, baseType: !364, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !518, file: !10, line: 87, baseType: !440, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !518, file: !10, line: 88, baseType: !525, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !518, file: !10, line: 89, baseType: !352, size: 8, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !518, file: !10, line: 90, baseType: !351, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !518, file: !10, line: 91, baseType: !530, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 46, baseType: !532)
!531 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!532 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !518, file: !10, line: 92, baseType: !359, size: 32, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !10, line: 93, baseType: !535, size: 32, offset: 544)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !10, line: 94, baseType: !516, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !518, file: !10, line: 95, baseType: !351, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !518, file: !10, line: 96, baseType: !364, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !512, file: !10, line: 102, baseType: !351, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !512, file: !10, line: 102, baseType: !351, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !512, file: !10, line: 103, baseType: !351, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !512, file: !10, line: 104, baseType: !360, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !512, file: !10, line: 105, baseType: !359, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !512, file: !10, line: 105, baseType: !359, size: 32, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !512, file: !10, line: 105, baseType: !359, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !512, file: !10, line: 106, baseType: !365, size: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !512, file: !10, line: 107, baseType: !548, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!551 = !{!552}
!552 = !DISubrange(count: 5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !367, file: !368, line: 113, baseType: !554, size: 320, offset: 3648)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 320, elements: !551)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!381, !365, !364}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !367, file: !368, line: 114, baseType: !559, size: 320, offset: 3968)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 320, elements: !551)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !367, file: !368, line: 115, baseType: !359, size: 32, offset: 4288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !367, file: !368, line: 120, baseType: !548, size: 64, offset: 4352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !367, file: !368, line: 121, baseType: !359, size: 32, offset: 4416)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !564, line: 1451, baseType: !410)
!564 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !361, line: 331, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !361, line: 331, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !361, line: 338, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !361, line: 338, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHash32_t", file: !573, line: 123, baseType: !336)
!573 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashtable.h", directory: "/home/users/ndemeye/xSDK")
!574 = !{!575}
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression(DW_OP_constu, 4605110762971426980, DW_OP_stack_value))
!576 = distinct !DIGlobalVariable(name: "__ac_HASH_UPPER", scope: !0, file: !335, line: 196, type: !577, isLocal: true, isDefinition: true)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!578 = !{i32 7, !"Dwarf Version", i32 4}
!579 = !{i32 2, !"Debug Info Version", i32 3}
!580 = !{i32 1, !"wchar_size", i32 4}
!581 = !{i32 7, !"PIC Level", i32 2}
!582 = !{i32 7, !"uwtable", i32 1}
!583 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!584 = distinct !DISubprogram(name: "MatDestroy_Preallocator", scope: !323, file: !323, line: 11, type: !585, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1353)
!585 = !DISubroutineType(types: !586)
!586 = !{!381, !587}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !590, line: 436, size: 23424, elements: !591)
!590 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!591 = !{!592, !594, !1099, !1119, !1120, !1121, !1123, !1124, !1125, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1249, !1250, !1266, !1267, !1268, !1269, !1270, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1305, !1325, !1326, !1328, !1329, !1330, !1331, !1332, !1333, !1351, !1352}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !589, file: !590, line: 437, baseType: !593, size: 4480)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !368, line: 122, baseType: !367)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !589, file: !590, line: 437, baseType: !595, size: 9472, offset: 4480)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 9472, elements: !418)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !590, line: 32, size: 9472, elements: !597)
!597 = !{!598, !607, !611, !612, !619, !623, !624, !625, !626, !627, !628, !629, !653, !657, !662, !668, !687, !692, !696, !697, !702, !707, !708, !713, !715, !719, !723, !727, !731, !732, !733, !734, !735, !739, !740, !745, !746, !747, !748, !749, !754, !761, !766, !770, !774, !778, !782, !783, !787, !788, !795, !800, !801, !802, !803, !865, !873, !874, !878, !879, !883, !884, !888, !893, !894, !898, !902, !909, !910, !911, !912, !913, !914, !919, !920, !924, !928, !932, !933, !934, !938, !948, !949, !953, !954, !958, !959, !963, !964, !969, !970, !974, !978, !979, !980, !981, !982, !983, !984, !988, !989, !990, !991, !992, !993, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1008, !1012, !1013, !1014, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1028, !1029, !1030, !1035, !1039, !1040, !1044, !1045, !1046, !1047, !1073, !1077, !1078, !1079, !1080, !1081, !1085, !1086, !1087, !1088, !1089, !1093, !1097, !1098}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !596, file: !590, line: 34, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!381, !587, !348, !602, !348, !602, !604, !606}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !596, file: !590, line: 35, baseType: !608, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!381, !587, !348, !354, !466, !484}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !596, file: !590, line: 36, baseType: !608, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !596, file: !590, line: 37, baseType: !613, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!381, !587, !616, !616}
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !596, file: !590, line: 38, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!381, !587, !616, !616, !616}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !596, file: !590, line: 40, baseType: !613, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !596, file: !590, line: 41, baseType: !620, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !596, file: !590, line: 42, baseType: !613, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !596, file: !590, line: 43, baseType: !620, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !596, file: !590, line: 44, baseType: !613, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !596, file: !590, line: 46, baseType: !620, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !596, file: !590, line: 47, baseType: !630, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!381, !587, !633, !633, !637}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !634, line: 11, baseType: !635)
!634 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !634, line: 11, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !640, file: !36, line: 1227, baseType: !473, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !640, file: !36, line: 1228, baseType: !473, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !640, file: !36, line: 1229, baseType: !473, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !640, file: !36, line: 1230, baseType: !473, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !640, file: !36, line: 1231, baseType: !473, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !640, file: !36, line: 1232, baseType: !473, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !640, file: !36, line: 1233, baseType: !473, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !640, file: !36, line: 1234, baseType: !473, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !640, file: !36, line: 1236, baseType: !473, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !640, file: !36, line: 1237, baseType: !473, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !640, file: !36, line: 1238, baseType: !473, size: 64, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !596, file: !590, line: 48, baseType: !654, size: 64, offset: 768)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!381, !587, !633, !637}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !596, file: !590, line: 49, baseType: !658, size: 64, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!381, !587, !616, !473, !661, !473, !348, !348, !616}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !596, file: !590, line: 50, baseType: !663, size: 64, offset: 896)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!381, !587, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !596, file: !590, line: 52, baseType: !669, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!381, !587, !672, !673}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !675, file: !36, line: 593, baseType: !423, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !675, file: !36, line: 594, baseType: !423, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !675, file: !36, line: 594, baseType: !423, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !675, file: !36, line: 594, baseType: !423, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !675, file: !36, line: 595, baseType: !423, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !675, file: !36, line: 596, baseType: !423, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !675, file: !36, line: 597, baseType: !423, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !675, file: !36, line: 598, baseType: !423, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !675, file: !36, line: 598, baseType: !423, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !675, file: !36, line: 599, baseType: !423, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !596, file: !590, line: 53, baseType: !688, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!381, !587, !587, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !596, file: !590, line: 54, baseType: !693, size: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!381, !587, !616}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !596, file: !590, line: 55, baseType: !613, size: 64, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !596, file: !590, line: 56, baseType: !698, size: 64, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!381, !587, !701, !472}
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !596, file: !590, line: 58, baseType: !703, size: 64, offset: 1280)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!381, !587, !706}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !596, file: !590, line: 59, baseType: !703, size: 64, offset: 1344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !596, file: !590, line: 60, baseType: !709, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!381, !587, !712, !359}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !596, file: !590, line: 61, baseType: !714, size: 64, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !596, file: !590, line: 63, baseType: !716, size: 64, offset: 1536)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!381, !587, !348, !602, !482, !616, !616}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !596, file: !590, line: 64, baseType: !720, size: 64, offset: 1600)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!381, !587, !587, !633, !633, !637}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !596, file: !590, line: 65, baseType: !724, size: 64, offset: 1664)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!381, !587, !587, !637}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !596, file: !590, line: 66, baseType: !728, size: 64, offset: 1728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!381, !587, !587, !633, !637}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !596, file: !590, line: 67, baseType: !724, size: 64, offset: 1792)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !596, file: !590, line: 69, baseType: !714, size: 64, offset: 1856)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !596, file: !590, line: 70, baseType: !720, size: 64, offset: 1920)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !596, file: !590, line: 71, baseType: !728, size: 64, offset: 1984)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !596, file: !590, line: 72, baseType: !736, size: 64, offset: 2048)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!381, !587, !667}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !596, file: !590, line: 73, baseType: !714, size: 64, offset: 2112)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !596, file: !590, line: 75, baseType: !741, size: 64, offset: 2176)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!381, !587, !744, !667}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !596, file: !590, line: 76, baseType: !613, size: 64, offset: 2240)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !596, file: !590, line: 77, baseType: !613, size: 64, offset: 2304)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !596, file: !590, line: 78, baseType: !630, size: 64, offset: 2368)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !596, file: !590, line: 79, baseType: !654, size: 64, offset: 2432)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !596, file: !590, line: 81, baseType: !750, size: 64, offset: 2496)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!381, !587, !482, !587, !753}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !596, file: !590, line: 82, baseType: !755, size: 64, offset: 2560)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!381, !587, !348, !758, !758, !666, !760}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !596, file: !590, line: 83, baseType: !762, size: 64, offset: 2624)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!381, !587, !348, !765, !348}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !596, file: !590, line: 84, baseType: !767, size: 64, offset: 2688)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!381, !587, !348, !602, !348, !602, !481}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !596, file: !590, line: 85, baseType: !771, size: 64, offset: 2752)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!381, !587, !587, !753}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !596, file: !590, line: 87, baseType: !775, size: 64, offset: 2816)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!381, !587, !616, !354}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !596, file: !590, line: 88, baseType: !779, size: 64, offset: 2880)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!381, !587, !482}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !596, file: !590, line: 89, baseType: !779, size: 64, offset: 2944)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !596, file: !590, line: 90, baseType: !784, size: 64, offset: 3008)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!381, !587, !616, !606}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !596, file: !590, line: 91, baseType: !716, size: 64, offset: 3072)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !596, file: !590, line: 93, baseType: !789, size: 64, offset: 3136)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!381, !587, !792}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !596, file: !590, line: 94, baseType: !796, size: 64, offset: 3200)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!381, !587, !348, !359, !359, !354, !799, !799, !691}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !596, file: !590, line: 95, baseType: !796, size: 64, offset: 3264)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !596, file: !590, line: 96, baseType: !796, size: 64, offset: 3328)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !596, file: !590, line: 97, baseType: !796, size: 64, offset: 3392)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !596, file: !590, line: 99, baseType: !804, size: 64, offset: 3456)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!381, !587, !807, !810}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !634, line: 51, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !634, line: 51, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !590, line: 609, size: 6208, elements: !813)
!813 = !{!814, !815, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !834, !841, !842, !843, !844, !845, !846, !847, !848, !852, !853, !854, !855, !856, !858, !859, !860, !861, !862, !863, !864}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !812, file: !590, line: 610, baseType: !593, size: 4480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !812, file: !590, line: 610, baseType: !816, size: 32, offset: 4480)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !418)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !812, file: !590, line: 611, baseType: !348, size: 32, offset: 4512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !812, file: !590, line: 611, baseType: !348, size: 32, offset: 4544)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !812, file: !590, line: 611, baseType: !348, size: 32, offset: 4576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !812, file: !590, line: 612, baseType: !348, size: 32, offset: 4608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !812, file: !590, line: 613, baseType: !348, size: 32, offset: 4640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !812, file: !590, line: 614, baseType: !354, size: 64, offset: 4672)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !812, file: !590, line: 615, baseType: !466, size: 64, offset: 4736)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !812, file: !590, line: 616, baseType: !765, size: 64, offset: 4800)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !812, file: !590, line: 617, baseType: !354, size: 64, offset: 4864)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !812, file: !590, line: 618, baseType: !827, size: 64, offset: 4928)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !590, line: 602, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 598, size: 128, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !829, file: !590, line: 599, baseType: !348, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !829, file: !590, line: 600, baseType: !348, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !829, file: !590, line: 601, baseType: !481, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !812, file: !590, line: 619, baseType: !835, size: 64, offset: 4992)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !590, line: 607, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 604, size: 128, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !837, file: !590, line: 605, baseType: !348, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !837, file: !590, line: 606, baseType: !481, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !812, file: !590, line: 620, baseType: !481, size: 64, offset: 5056)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !812, file: !590, line: 621, baseType: !473, size: 64, offset: 5120)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !812, file: !590, line: 622, baseType: !473, size: 64, offset: 5184)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !812, file: !590, line: 623, baseType: !616, size: 64, offset: 5248)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !812, file: !590, line: 623, baseType: !616, size: 64, offset: 5312)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !812, file: !590, line: 623, baseType: !616, size: 64, offset: 5376)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !812, file: !590, line: 624, baseType: !359, size: 32, offset: 5440)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !812, file: !590, line: 625, baseType: !849, size: 64, offset: 5504)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!381}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !812, file: !590, line: 626, baseType: !364, size: 64, offset: 5568)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !812, file: !590, line: 627, baseType: !616, size: 64, offset: 5632)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !812, file: !590, line: 628, baseType: !348, size: 32, offset: 5696)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !812, file: !590, line: 629, baseType: !400, size: 64, offset: 5760)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !812, file: !590, line: 630, baseType: !857, size: 32, offset: 5824)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !812, file: !590, line: 631, baseType: !348, size: 32, offset: 5856)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !812, file: !590, line: 631, baseType: !348, size: 32, offset: 5888)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !812, file: !590, line: 632, baseType: !359, size: 32, offset: 5920)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !812, file: !590, line: 633, baseType: !359, size: 32, offset: 5952)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !812, file: !590, line: 634, baseType: !410, size: 64, offset: 6016)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !812, file: !590, line: 634, baseType: !364, size: 64, offset: 6080)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !812, file: !590, line: 635, baseType: !429, size: 64, offset: 6144)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !596, file: !590, line: 100, baseType: !866, size: 64, offset: 3520)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!381, !587, !348, !348, !869, !872}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !871)
!871 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !596, file: !590, line: 101, baseType: !714, size: 64, offset: 3584)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !596, file: !590, line: 102, baseType: !875, size: 64, offset: 3648)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!381, !587, !633, !633, !667}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !596, file: !590, line: 103, baseType: !599, size: 64, offset: 3712)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !596, file: !590, line: 105, baseType: !880, size: 64, offset: 3776)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!381, !587, !633, !633, !666, !667}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !596, file: !590, line: 106, baseType: !714, size: 64, offset: 3840)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !596, file: !590, line: 107, baseType: !885, size: 64, offset: 3904)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!381, !587, !387}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !596, file: !590, line: 108, baseType: !889, size: 64, offset: 3968)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!381, !587, !892, !666, !667}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !400)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !596, file: !590, line: 109, baseType: !849, size: 64, offset: 4032)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !596, file: !590, line: 111, baseType: !895, size: 64, offset: 4096)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!381, !587, !587, !587, !473, !587}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !596, file: !590, line: 112, baseType: !899, size: 64, offset: 4160)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!381, !587, !587, !587, !587}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !596, file: !590, line: 113, baseType: !903, size: 64, offset: 4224)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!381, !587, !906, !906}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !634, line: 30, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !634, line: 30, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !596, file: !590, line: 114, baseType: !599, size: 64, offset: 4288)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !596, file: !590, line: 115, baseType: !716, size: 64, offset: 4352)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !596, file: !590, line: 117, baseType: !775, size: 64, offset: 4416)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !596, file: !590, line: 118, baseType: !775, size: 64, offset: 4480)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !596, file: !590, line: 119, baseType: !889, size: 64, offset: 4544)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !596, file: !590, line: 120, baseType: !915, size: 64, offset: 4608)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!381, !587, !918, !691}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !596, file: !590, line: 121, baseType: !849, size: 64, offset: 4672)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !596, file: !590, line: 123, baseType: !921, size: 64, offset: 4736)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!381, !587, !348, !364}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !596, file: !590, line: 124, baseType: !925, size: 64, offset: 4800)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!381, !587, !810, !616, !364}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !596, file: !590, line: 125, baseType: !929, size: 64, offset: 4864)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!381, !510, !587}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !596, file: !590, line: 126, baseType: !613, size: 64, offset: 4928)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !596, file: !590, line: 127, baseType: !613, size: 64, offset: 4992)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !596, file: !590, line: 129, baseType: !935, size: 64, offset: 5056)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!381, !587, !765}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !596, file: !590, line: 130, baseType: !939, size: 64, offset: 5120)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!381, !587, !942, !942}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !944, file: !60, line: 653, baseType: !348, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !944, file: !60, line: 653, baseType: !616, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !596, file: !590, line: 131, baseType: !939, size: 64, offset: 5184)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !596, file: !590, line: 132, baseType: !950, size: 64, offset: 5248)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!381, !587, !354, !354, !354}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !596, file: !590, line: 133, baseType: !885, size: 64, offset: 5312)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !596, file: !590, line: 135, baseType: !955, size: 64, offset: 5376)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!381, !587, !473, !691}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !596, file: !590, line: 136, baseType: !955, size: 64, offset: 5440)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !596, file: !590, line: 137, baseType: !960, size: 64, offset: 5504)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!381, !587, !691}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !596, file: !590, line: 138, baseType: !599, size: 64, offset: 5568)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !596, file: !590, line: 139, baseType: !965, size: 64, offset: 5632)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!381, !587, !968, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !596, file: !590, line: 141, baseType: !849, size: 64, offset: 5696)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !596, file: !590, line: 142, baseType: !971, size: 64, offset: 5760)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!381, !587, !587, !473, !587}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !596, file: !590, line: 143, baseType: !975, size: 64, offset: 5824)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!381, !587, !587, !587}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !596, file: !590, line: 144, baseType: !849, size: 64, offset: 5888)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !596, file: !590, line: 145, baseType: !971, size: 64, offset: 5952)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !596, file: !590, line: 147, baseType: !975, size: 64, offset: 6016)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !596, file: !590, line: 148, baseType: !849, size: 64, offset: 6080)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !596, file: !590, line: 149, baseType: !971, size: 64, offset: 6144)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !596, file: !590, line: 150, baseType: !975, size: 64, offset: 6208)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !596, file: !590, line: 151, baseType: !985, size: 64, offset: 6272)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!381, !587, !359}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !596, file: !590, line: 153, baseType: !714, size: 64, offset: 6336)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !596, file: !590, line: 154, baseType: !714, size: 64, offset: 6400)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !596, file: !590, line: 155, baseType: !714, size: 64, offset: 6464)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !596, file: !590, line: 156, baseType: !714, size: 64, offset: 6528)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !596, file: !590, line: 157, baseType: !885, size: 64, offset: 6592)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !596, file: !590, line: 159, baseType: !994, size: 64, offset: 6656)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!381, !587, !348, !604}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !596, file: !590, line: 160, baseType: !714, size: 64, offset: 6720)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !596, file: !590, line: 161, baseType: !714, size: 64, offset: 6784)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !596, file: !590, line: 162, baseType: !714, size: 64, offset: 6848)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !596, file: !590, line: 163, baseType: !714, size: 64, offset: 6912)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !596, file: !590, line: 165, baseType: !975, size: 64, offset: 6976)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !596, file: !590, line: 166, baseType: !975, size: 64, offset: 7040)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !596, file: !590, line: 167, baseType: !775, size: 64, offset: 7104)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !596, file: !590, line: 168, baseType: !1005, size: 64, offset: 7168)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!381, !587, !616, !348}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !596, file: !590, line: 169, baseType: !1009, size: 64, offset: 7232)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!381, !587, !691, !354}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !596, file: !590, line: 171, baseType: !736, size: 64, offset: 7296)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !596, file: !590, line: 172, baseType: !714, size: 64, offset: 7360)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !596, file: !590, line: 173, baseType: !1015, size: 64, offset: 7424)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!381, !587, !354, !799}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !596, file: !590, line: 174, baseType: !875, size: 64, offset: 7488)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !596, file: !590, line: 175, baseType: !875, size: 64, offset: 7552)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !596, file: !590, line: 177, baseType: !613, size: 64, offset: 7616)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !596, file: !590, line: 178, baseType: !663, size: 64, offset: 7680)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !596, file: !590, line: 179, baseType: !613, size: 64, offset: 7744)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !596, file: !590, line: 180, baseType: !620, size: 64, offset: 7808)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !596, file: !590, line: 181, baseType: !1025, size: 64, offset: 7872)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!381, !587, !360, !666, !667}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !596, file: !590, line: 183, baseType: !935, size: 64, offset: 7936)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !596, file: !590, line: 184, baseType: !698, size: 64, offset: 8000)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !596, file: !590, line: 185, baseType: !1031, size: 64, offset: 8064)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!381, !587, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !596, file: !590, line: 186, baseType: !1036, size: 64, offset: 8128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!381, !587, !348, !602, !481}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !596, file: !590, line: 187, baseType: !755, size: 64, offset: 8192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !596, file: !590, line: 189, baseType: !1041, size: 64, offset: 8256)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!381, !587, !348, !348, !354, !604}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !596, file: !590, line: 190, baseType: !849, size: 64, offset: 8320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !596, file: !590, line: 191, baseType: !971, size: 64, offset: 8384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !596, file: !590, line: 192, baseType: !975, size: 64, offset: 8448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !596, file: !590, line: 193, baseType: !1048, size: 64, offset: 8512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!381, !587, !807, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !590, line: 660, size: 5312, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1053, file: !590, line: 661, baseType: !593, size: 4480)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1053, file: !590, line: 661, baseType: !816, size: 32, offset: 4480)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1053, file: !590, line: 662, baseType: !348, size: 32, offset: 4512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1053, file: !590, line: 662, baseType: !348, size: 32, offset: 4544)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1053, file: !590, line: 662, baseType: !348, size: 32, offset: 4576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1053, file: !590, line: 663, baseType: !348, size: 32, offset: 4608)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1053, file: !590, line: 664, baseType: !348, size: 32, offset: 4640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1053, file: !590, line: 665, baseType: !354, size: 64, offset: 4672)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1053, file: !590, line: 666, baseType: !354, size: 64, offset: 4736)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1053, file: !590, line: 667, baseType: !348, size: 32, offset: 4800)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1053, file: !590, line: 668, baseType: !857, size: 32, offset: 4832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1053, file: !590, line: 670, baseType: !354, size: 64, offset: 4864)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1053, file: !590, line: 670, baseType: !354, size: 64, offset: 4928)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1053, file: !590, line: 671, baseType: !354, size: 64, offset: 4992)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1053, file: !590, line: 672, baseType: !354, size: 64, offset: 5056)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1053, file: !590, line: 673, baseType: !354, size: 64, offset: 5120)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1053, file: !590, line: 674, baseType: !348, size: 32, offset: 5184)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1053, file: !590, line: 675, baseType: !354, size: 64, offset: 5248)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !596, file: !590, line: 195, baseType: !1074, size: 64, offset: 8576)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!381, !1051, !587, !587}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !596, file: !590, line: 196, baseType: !1074, size: 64, offset: 8640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !596, file: !590, line: 197, baseType: !849, size: 64, offset: 8704)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !596, file: !590, line: 198, baseType: !971, size: 64, offset: 8768)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !596, file: !590, line: 199, baseType: !975, size: 64, offset: 8832)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !596, file: !590, line: 201, baseType: !1082, size: 64, offset: 8896)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!381, !587, !348, !348}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !596, file: !590, line: 202, baseType: !750, size: 64, offset: 8960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !596, file: !590, line: 203, baseType: !620, size: 64, offset: 9024)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !596, file: !590, line: 204, baseType: !804, size: 64, offset: 9088)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !596, file: !590, line: 205, baseType: !935, size: 64, offset: 9152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !596, file: !590, line: 206, baseType: !1090, size: 64, offset: 9216)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!381, !360, !587, !348, !666, !667}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !596, file: !590, line: 208, baseType: !1094, size: 64, offset: 9280)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!381, !348, !760}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !596, file: !590, line: 209, baseType: !975, size: 64, offset: 9344)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !596, file: !590, line: 210, baseType: !767, size: 64, offset: 9408)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !589, file: !590, line: 438, baseType: !1100, size: 64, offset: 13952)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !634, line: 60, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1102, file: !114, line: 241, baseType: !360, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1102, file: !114, line: 242, baseType: !438, size: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1102, file: !114, line: 243, baseType: !348, size: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1102, file: !114, line: 243, baseType: !348, size: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1102, file: !114, line: 244, baseType: !348, size: 32, offset: 160)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1102, file: !114, line: 244, baseType: !348, size: 32, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1102, file: !114, line: 245, baseType: !354, size: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1102, file: !114, line: 246, baseType: !359, size: 32, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1102, file: !114, line: 247, baseType: !348, size: 32, offset: 352)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1102, file: !114, line: 251, baseType: !348, size: 32, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1102, file: !114, line: 252, baseType: !906, size: 64, offset: 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1102, file: !114, line: 253, baseType: !359, size: 32, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1102, file: !114, line: 254, baseType: !348, size: 32, offset: 544)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1102, file: !114, line: 254, baseType: !348, size: 32, offset: 576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1102, file: !114, line: 255, baseType: !348, size: 32, offset: 608)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !589, file: !590, line: 438, baseType: !1100, size: 64, offset: 14016)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !589, file: !590, line: 439, baseType: !364, size: 64, offset: 14080)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !589, file: !590, line: 440, baseType: !1122, size: 32, offset: 14144)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !589, file: !590, line: 441, baseType: !359, size: 32, offset: 14176)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !589, file: !590, line: 442, baseType: !359, size: 32, offset: 14208)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !589, file: !590, line: 443, baseType: !1126, size: 448, offset: 14272)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 448, elements: !1128)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !400)
!1128 = !{!1129}
!1129 = !DISubrange(count: 7)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !589, file: !590, line: 444, baseType: !359, size: 32, offset: 14720)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !589, file: !590, line: 445, baseType: !359, size: 32, offset: 14752)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !589, file: !590, line: 446, baseType: !348, size: 32, offset: 14784)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !589, file: !590, line: 447, baseType: !458, size: 64, offset: 14848)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !589, file: !590, line: 448, baseType: !458, size: 64, offset: 14912)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !589, file: !590, line: 449, baseType: !674, size: 640, offset: 14976)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !589, file: !590, line: 450, baseType: !606, size: 32, offset: 15616)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !589, file: !590, line: 451, baseType: !1138, size: 2880, offset: 15680)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !590, line: 318, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !590, line: 319, size: 2880, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147, !1160, !1161, !1166, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1186, !1187, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1219, !1220, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243, !1244, !1245, !1246, !1247}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1139, file: !590, line: 320, baseType: !348, size: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1139, file: !590, line: 321, baseType: !348, size: 32, offset: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1139, file: !590, line: 322, baseType: !348, size: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1139, file: !590, line: 323, baseType: !348, size: 32, offset: 96)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1139, file: !590, line: 324, baseType: !348, size: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1139, file: !590, line: 325, baseType: !348, size: 32, offset: 160)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1139, file: !590, line: 326, baseType: !1148, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !590, line: 293, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !590, line: 295, size: 448, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1150, file: !590, line: 296, baseType: !1148, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1150, file: !590, line: 297, baseType: !481, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1150, file: !590, line: 297, baseType: !481, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1150, file: !590, line: 298, baseType: !354, size: 64, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1150, file: !590, line: 298, baseType: !354, size: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1150, file: !590, line: 299, baseType: !348, size: 32, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1150, file: !590, line: 300, baseType: !348, size: 32, offset: 352)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1150, file: !590, line: 301, baseType: !348, size: 32, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1139, file: !590, line: 326, baseType: !1148, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1139, file: !590, line: 328, baseType: !1162, size: 64, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!381, !587, !1165, !354}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1139, file: !590, line: 329, baseType: !1167, size: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!381, !1165, !1170, !466, !466, !484, !354}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1139, file: !590, line: 330, baseType: !1172, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!381, !1165}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1139, file: !590, line: 331, baseType: !1172, size: 64, offset: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1139, file: !590, line: 334, baseType: !360, size: 64, offset: 576)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !590, line: 335, baseType: !438, size: 32, offset: 640)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1139, file: !590, line: 335, baseType: !438, size: 32, offset: 672)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1139, file: !590, line: 336, baseType: !438, size: 32, offset: 704)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1139, file: !590, line: 336, baseType: !438, size: 32, offset: 736)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1139, file: !590, line: 337, baseType: !1182, size: 64, offset: 768)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !361, line: 339, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !361, line: 339, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1139, file: !590, line: 338, baseType: !1182, size: 64, offset: 832)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1139, file: !590, line: 339, baseType: !1188, size: 64, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !361, line: 341, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !361, line: 351, size: 192, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1190, file: !361, line: 354, baseType: !72, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1190, file: !361, line: 355, baseType: !72, size: 32, offset: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1190, file: !361, line: 356, baseType: !72, size: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1190, file: !361, line: 361, baseType: !72, size: 32, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1190, file: !361, line: 362, baseType: !530, size: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1139, file: !590, line: 340, baseType: !348, size: 32, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1139, file: !590, line: 340, baseType: !348, size: 32, offset: 992)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1139, file: !590, line: 341, baseType: !481, size: 64, offset: 1024)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1139, file: !590, line: 342, baseType: !354, size: 64, offset: 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1139, file: !590, line: 343, baseType: !484, size: 64, offset: 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1139, file: !590, line: 344, baseType: !466, size: 64, offset: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1139, file: !590, line: 345, baseType: !348, size: 32, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1139, file: !590, line: 346, baseType: !1170, size: 64, offset: 1344)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1139, file: !590, line: 347, baseType: !359, size: 32, offset: 1408)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1139, file: !590, line: 348, baseType: !348, size: 32, offset: 1440)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1139, file: !590, line: 351, baseType: !359, size: 32, offset: 1472)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1139, file: !590, line: 352, baseType: !359, size: 32, offset: 1504)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1139, file: !590, line: 353, baseType: !438, size: 32, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1139, file: !590, line: 354, baseType: !438, size: 32, offset: 1568)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1139, file: !590, line: 355, baseType: !1170, size: 64, offset: 1600)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1139, file: !590, line: 356, baseType: !1170, size: 64, offset: 1664)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1139, file: !590, line: 357, baseType: !1214, size: 64, offset: 1728)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !590, line: 310, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 308, size: 32, elements: !1217)
!1217 = !{!1218}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1216, file: !590, line: 309, baseType: !348, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1139, file: !590, line: 357, baseType: !1214, size: 64, offset: 1792)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1139, file: !590, line: 358, baseType: !1221, size: 64, offset: 1856)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !590, line: 316, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 312, size: 128, elements: !1224)
!1224 = !{!1225, !1226, !1227}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1223, file: !590, line: 313, baseType: !364, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1223, file: !590, line: 314, baseType: !348, size: 32, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1223, file: !590, line: 315, baseType: !352, size: 8, offset: 96)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1139, file: !590, line: 359, baseType: !1221, size: 64, offset: 1920)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1139, file: !590, line: 360, baseType: !1221, size: 64, offset: 1984)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1139, file: !590, line: 361, baseType: !348, size: 32, offset: 2048)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1139, file: !590, line: 362, baseType: !438, size: 32, offset: 2080)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1139, file: !590, line: 363, baseType: !348, size: 32, offset: 2112)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1139, file: !590, line: 364, baseType: !1170, size: 64, offset: 2176)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1139, file: !590, line: 365, baseType: !1188, size: 64, offset: 2240)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1139, file: !590, line: 366, baseType: !438, size: 32, offset: 2304)
