; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/matstash.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/matstash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_communicator_t = type opaque

!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !301)
!301 = !{!302}
!302 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!303 = !{!304, !308, !309, !72, !311, !314, !317, !319, !321, !322, !515, !518, !5, !520, !418, !529, !1262, !1236}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !305, line: 330, baseType: !306)
!305 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !305, line: 330, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !312, line: 46, baseType: !313)
!312 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!313 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !305, line: 331, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !305, line: 331, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !320)
!320 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !325, line: 73, size: 4480, elements: !326)
!325 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!326 = !{!327, !329, !375, !376, !378, !379, !380, !381, !382, !390, !391, !392, !396, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !412, !413, !414, !416, !417, !419, !421, !422, !423, !424, !425, !428, !430, !431, !432, !433, !434, !437, !439, !440, !441, !451, !453, !454, !458, !459, !505, !510, !512, !513, !514}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !324, file: !325, line: 74, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !324, file: !325, line: 75, baseType: !330, size: 448, offset: 64)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 448, elements: !373)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !325, line: 53, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 45, size: 448, elements: !333)
!333 = !{!334, !340, !348, !353, !357, !361, !368}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !332, file: !325, line: 46, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !322, !339}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !332, file: !325, line: 47, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!338, !322, !344}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !345, line: 16, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !345, line: 16, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !332, file: !325, line: 48, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!338, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !332, file: !325, line: 49, baseType: !354, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!338, !322, !317, !322}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !332, file: !325, line: 50, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!338, !322, !317, !352}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !332, file: !325, line: 51, baseType: !362, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!338, !322, !317, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !332, file: !325, line: 52, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!338, !322, !317, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !324, file: !325, line: 76, baseType: !304, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !325, line: 77, baseType: !377, size: 32, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !324, file: !325, line: 78, baseType: !319, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !324, file: !325, line: 78, baseType: !319, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !324, file: !325, line: 78, baseType: !319, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !324, file: !325, line: 78, baseType: !319, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !324, file: !325, line: 79, baseType: !383, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !386, line: 27, baseType: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !388, line: 43, baseType: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!389 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !324, file: !325, line: 80, baseType: !377, size: 32, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !324, file: !325, line: 81, baseType: !321, size: 32, offset: 992)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !324, file: !325, line: 82, baseType: !393, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !324, file: !325, line: 83, baseType: !397, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !324, file: !325, line: 84, baseType: !309, size: 64, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !324, file: !325, line: 85, baseType: !309, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !324, file: !325, line: 86, baseType: !309, size: 64, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !324, file: !325, line: 87, baseType: !309, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !324, file: !325, line: 88, baseType: !322, size: 64, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !324, file: !325, line: 89, baseType: !383, size: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !325, line: 90, baseType: !309, size: 64, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !324, file: !325, line: 91, baseType: !309, size: 64, offset: 1600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !324, file: !325, line: 92, baseType: !377, size: 32, offset: 1664)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !324, file: !325, line: 93, baseType: !308, size: 64, offset: 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !325, line: 94, baseType: !411, size: 64, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !324, file: !325, line: 95, baseType: !377, size: 32, offset: 1856)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !324, file: !325, line: 95, baseType: !377, size: 32, offset: 1888)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !324, file: !325, line: 96, baseType: !415, size: 64, offset: 1920)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !324, file: !325, line: 96, baseType: !415, size: 64, offset: 1984)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !324, file: !325, line: 97, baseType: !418, size: 64, offset: 2048)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !324, file: !325, line: 97, baseType: !420, size: 64, offset: 2112)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !324, file: !325, line: 98, baseType: !377, size: 32, offset: 2176)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !324, file: !325, line: 98, baseType: !377, size: 32, offset: 2208)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !324, file: !325, line: 99, baseType: !415, size: 64, offset: 2240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !324, file: !325, line: 99, baseType: !415, size: 64, offset: 2304)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !324, file: !325, line: 100, baseType: !426, size: 64, offset: 2368)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !324, file: !325, line: 100, baseType: !429, size: 64, offset: 2432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !324, file: !325, line: 101, baseType: !377, size: 32, offset: 2496)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !324, file: !325, line: 101, baseType: !377, size: 32, offset: 2528)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !324, file: !325, line: 102, baseType: !415, size: 64, offset: 2560)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !324, file: !325, line: 102, baseType: !415, size: 64, offset: 2624)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !324, file: !325, line: 103, baseType: !435, size: 64, offset: 2688)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !427)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !324, file: !325, line: 103, baseType: !438, size: 64, offset: 2752)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !324, file: !325, line: 104, baseType: !372, size: 64, offset: 2816)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !324, file: !325, line: 105, baseType: !377, size: 32, offset: 2880)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !324, file: !325, line: 106, baseType: !442, size: 128, offset: 2944)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 128, elements: !449)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !325, line: 64, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 61, size: 128, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !445, file: !325, line: 62, baseType: !365, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !445, file: !325, line: 63, baseType: !308, size: 64, offset: 64)
!449 = !{!450}
!450 = !DISubrange(count: 2)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !324, file: !325, line: 107, baseType: !452, size: 64, offset: 3072)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 64, elements: !449)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !324, file: !325, line: 108, baseType: !308, size: 64, offset: 3136)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !324, file: !325, line: 109, baseType: !455, size: 64, offset: 3200)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!338, !308}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !324, file: !325, line: 111, baseType: !377, size: 32, offset: 3264)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !324, file: !325, line: 112, baseType: !460, size: 320, offset: 3328)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 320, elements: !503)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!338, !464, !322, !308}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !467)
!467 = !{!468, !469, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !466, file: !10, line: 100, baseType: !377, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !10, line: 101, baseType: !470, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !481, !482, !483, !484, !486, !488, !489, !490}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !472, file: !10, line: 84, baseType: !309, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !472, file: !10, line: 85, baseType: !309, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !472, file: !10, line: 86, baseType: !308, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !472, file: !10, line: 87, baseType: !393, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !472, file: !10, line: 88, baseType: !479, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !472, file: !10, line: 89, baseType: !310, size: 8, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !472, file: !10, line: 90, baseType: !309, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !472, file: !10, line: 91, baseType: !311, size: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !472, file: !10, line: 92, baseType: !485, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !10, line: 93, baseType: !487, size: 32, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !10, line: 94, baseType: !470, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !472, file: !10, line: 95, baseType: !309, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !472, file: !10, line: 96, baseType: !308, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !466, file: !10, line: 102, baseType: !309, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !466, file: !10, line: 102, baseType: !309, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !466, file: !10, line: 103, baseType: !309, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !466, file: !10, line: 104, baseType: !304, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !466, file: !10, line: 105, baseType: !485, size: 32, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !466, file: !10, line: 105, baseType: !485, size: 32, offset: 416)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !466, file: !10, line: 105, baseType: !485, size: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !466, file: !10, line: 106, baseType: !322, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !466, file: !10, line: 107, baseType: !500, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!503 = !{!504}
!504 = !DISubrange(count: 5)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !324, file: !325, line: 113, baseType: !506, size: 320, offset: 3648)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 320, elements: !503)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!338, !322, !308}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !324, file: !325, line: 114, baseType: !511, size: 320, offset: 3968)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !503)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !324, file: !325, line: 115, baseType: !485, size: 32, offset: 4288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !324, file: !325, line: 120, baseType: !500, size: 64, offset: 4352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !324, file: !325, line: 121, baseType: !485, size: 32, offset: 4416)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !305, line: 338, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !305, line: 338, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !300)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashBlock", file: !522, line: 706, baseType: !523)
!522 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/matstash.c", directory: "/home/users/ndemeye/xSDK")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 702, size: 128, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !523, file: !522, line: 703, baseType: !377, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !523, file: !522, line: 704, baseType: !377, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !523, file: !522, line: 705, baseType: !528, size: 64, offset: 64)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 64, elements: !373)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !531, line: 318, baseType: !532)
!531 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !531, line: 319, size: 2880, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !553, !554, !1215, !1219, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1234, !1235, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1267, !1268, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1291, !1292, !1293, !1294, !1295}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !532, file: !531, line: 320, baseType: !377, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !532, file: !531, line: 321, baseType: !377, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !532, file: !531, line: 322, baseType: !377, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !532, file: !531, line: 323, baseType: !377, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !532, file: !531, line: 324, baseType: !377, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !532, file: !531, line: 325, baseType: !377, size: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !532, file: !531, line: 326, baseType: !541, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !531, line: 293, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !531, line: 295, size: 448, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !531, line: 296, baseType: !541, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !543, file: !531, line: 297, baseType: !435, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !531, line: 297, baseType: !435, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !543, file: !531, line: 298, baseType: !418, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !543, file: !531, line: 298, baseType: !418, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !543, file: !531, line: 299, baseType: !377, size: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !543, file: !531, line: 300, baseType: !377, size: 32, offset: 352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !543, file: !531, line: 301, baseType: !377, size: 32, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !532, file: !531, line: 326, baseType: !541, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !532, file: !531, line: 328, baseType: !555, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!338, !558, !529, !418}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !531, line: 436, size: 23424, elements: !561)
!561 = !{!562, !564, !1071, !1091, !1092, !1093, !1095, !1096, !1097, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1127, !1128, !1129, !1130, !1131, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1166, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1213, !1214}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !560, file: !531, line: 437, baseType: !563, size: 4480)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !325, line: 122, baseType: !324)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !560, file: !531, line: 437, baseType: !565, size: 9472, offset: 4480)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 9472, elements: !373)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !531, line: 32, size: 9472, elements: !567)
!567 = !{!568, !577, !581, !582, !589, !593, !594, !595, !596, !597, !598, !599, !623, !627, !632, !638, !657, !662, !666, !667, !672, !677, !678, !683, !687, !691, !695, !699, !703, !704, !705, !706, !707, !711, !712, !717, !718, !719, !720, !721, !726, !733, !738, !742, !746, !750, !754, !755, !759, !760, !767, !772, !773, !774, !775, !837, !845, !846, !850, !851, !855, !856, !860, !865, !866, !870, !874, !881, !882, !883, !884, !885, !886, !891, !892, !896, !900, !904, !905, !906, !910, !920, !921, !925, !926, !930, !931, !935, !936, !941, !942, !946, !950, !951, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !965, !969, !970, !971, !972, !973, !974, !975, !976, !980, !984, !985, !986, !990, !991, !992, !993, !994, !995, !996, !1000, !1001, !1002, !1007, !1011, !1012, !1016, !1017, !1018, !1019, !1045, !1049, !1050, !1051, !1052, !1053, !1057, !1058, !1059, !1060, !1061, !1065, !1069, !1070}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !566, file: !531, line: 34, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!338, !558, !377, !572, !377, !572, !574, !576}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !566, file: !531, line: 35, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!338, !558, !377, !418, !420, !438}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !566, file: !531, line: 36, baseType: !578, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !566, file: !531, line: 37, baseType: !583, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!338, !558, !586, !586}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !566, file: !531, line: 38, baseType: !590, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!338, !558, !586, !586, !586}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !566, file: !531, line: 40, baseType: !583, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !566, file: !531, line: 41, baseType: !590, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !566, file: !531, line: 42, baseType: !583, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !566, file: !531, line: 43, baseType: !590, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !566, file: !531, line: 44, baseType: !583, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !566, file: !531, line: 46, baseType: !590, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !566, file: !531, line: 47, baseType: !600, size: 64, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!338, !558, !603, !603, !607}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !604, line: 11, baseType: !605)
!604 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !604, line: 11, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !610, file: !36, line: 1227, baseType: !427, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !610, file: !36, line: 1228, baseType: !427, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !610, file: !36, line: 1229, baseType: !427, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !610, file: !36, line: 1230, baseType: !427, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !610, file: !36, line: 1231, baseType: !427, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !610, file: !36, line: 1232, baseType: !427, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !610, file: !36, line: 1233, baseType: !427, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !610, file: !36, line: 1234, baseType: !427, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !610, file: !36, line: 1236, baseType: !427, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !610, file: !36, line: 1237, baseType: !427, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !610, file: !36, line: 1238, baseType: !427, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !566, file: !531, line: 48, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!338, !558, !603, !607}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !566, file: !531, line: 49, baseType: !628, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!338, !558, !586, !427, !631, !427, !377, !377, !586}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !566, file: !531, line: 50, baseType: !633, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!338, !558, !636, !637}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !566, file: !531, line: 52, baseType: !639, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!338, !558, !642, !643}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !645, file: !36, line: 593, baseType: !319, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !645, file: !36, line: 594, baseType: !319, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !645, file: !36, line: 594, baseType: !319, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !645, file: !36, line: 594, baseType: !319, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !645, file: !36, line: 595, baseType: !319, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !645, file: !36, line: 596, baseType: !319, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !645, file: !36, line: 597, baseType: !319, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !645, file: !36, line: 598, baseType: !319, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !645, file: !36, line: 598, baseType: !319, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !645, file: !36, line: 599, baseType: !319, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !566, file: !531, line: 53, baseType: !658, size: 64, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!338, !558, !558, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !566, file: !531, line: 54, baseType: !663, size: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!338, !558, !586}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !566, file: !531, line: 55, baseType: !583, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !566, file: !531, line: 56, baseType: !668, size: 64, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!338, !558, !671, !426}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !566, file: !531, line: 58, baseType: !673, size: 64, offset: 1280)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!338, !558, !676}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !566, file: !531, line: 59, baseType: !673, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !566, file: !531, line: 60, baseType: !679, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!338, !558, !682, !485}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !566, file: !531, line: 61, baseType: !684, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!338, !558}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !566, file: !531, line: 63, baseType: !688, size: 64, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!338, !558, !377, !572, !436, !586, !586}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !566, file: !531, line: 64, baseType: !692, size: 64, offset: 1600)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!338, !558, !558, !603, !603, !607}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !566, file: !531, line: 65, baseType: !696, size: 64, offset: 1664)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!338, !558, !558, !607}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !566, file: !531, line: 66, baseType: !700, size: 64, offset: 1728)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!338, !558, !558, !603, !607}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !566, file: !531, line: 67, baseType: !696, size: 64, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !566, file: !531, line: 69, baseType: !684, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !566, file: !531, line: 70, baseType: !692, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !566, file: !531, line: 71, baseType: !700, size: 64, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !566, file: !531, line: 72, baseType: !708, size: 64, offset: 2048)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!338, !558, !637}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !566, file: !531, line: 73, baseType: !684, size: 64, offset: 2112)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !566, file: !531, line: 75, baseType: !713, size: 64, offset: 2176)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!338, !558, !716, !637}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !566, file: !531, line: 76, baseType: !583, size: 64, offset: 2240)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !566, file: !531, line: 77, baseType: !583, size: 64, offset: 2304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !566, file: !531, line: 78, baseType: !600, size: 64, offset: 2368)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !566, file: !531, line: 79, baseType: !624, size: 64, offset: 2432)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !566, file: !531, line: 81, baseType: !722, size: 64, offset: 2496)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!338, !558, !436, !558, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !566, file: !531, line: 82, baseType: !727, size: 64, offset: 2560)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!338, !558, !377, !730, !730, !636, !732}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !566, file: !531, line: 83, baseType: !734, size: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!338, !558, !377, !737, !377}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !566, file: !531, line: 84, baseType: !739, size: 64, offset: 2688)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!338, !558, !377, !572, !377, !572, !435}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !566, file: !531, line: 85, baseType: !743, size: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!338, !558, !558, !725}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !566, file: !531, line: 87, baseType: !747, size: 64, offset: 2816)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!338, !558, !586, !418}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !566, file: !531, line: 88, baseType: !751, size: 64, offset: 2880)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!338, !558, !436}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !566, file: !531, line: 89, baseType: !751, size: 64, offset: 2944)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !566, file: !531, line: 90, baseType: !756, size: 64, offset: 3008)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!338, !558, !586, !576}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !566, file: !531, line: 91, baseType: !688, size: 64, offset: 3072)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !566, file: !531, line: 93, baseType: !761, size: 64, offset: 3136)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!338, !558, !764}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !566, file: !531, line: 94, baseType: !768, size: 64, offset: 3200)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!338, !558, !377, !485, !485, !418, !771, !771, !661}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !566, file: !531, line: 95, baseType: !768, size: 64, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !566, file: !531, line: 96, baseType: !768, size: 64, offset: 3328)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !566, file: !531, line: 97, baseType: !768, size: 64, offset: 3392)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !566, file: !531, line: 99, baseType: !776, size: 64, offset: 3456)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!338, !558, !779, !782}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !604, line: 51, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !604, line: 51, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !531, line: 609, size: 6208, elements: !785)
!785 = !{!786, !787, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !806, !813, !814, !815, !816, !817, !818, !819, !820, !824, !825, !826, !827, !828, !830, !831, !832, !833, !834, !835, !836}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !784, file: !531, line: 610, baseType: !563, size: 4480)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !784, file: !531, line: 610, baseType: !788, size: 32, offset: 4480)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !373)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !784, file: !531, line: 611, baseType: !377, size: 32, offset: 4512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !784, file: !531, line: 611, baseType: !377, size: 32, offset: 4544)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !784, file: !531, line: 611, baseType: !377, size: 32, offset: 4576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !784, file: !531, line: 612, baseType: !377, size: 32, offset: 4608)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !784, file: !531, line: 613, baseType: !377, size: 32, offset: 4640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !784, file: !531, line: 614, baseType: !418, size: 64, offset: 4672)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !784, file: !531, line: 615, baseType: !420, size: 64, offset: 4736)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !784, file: !531, line: 616, baseType: !737, size: 64, offset: 4800)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !784, file: !531, line: 617, baseType: !418, size: 64, offset: 4864)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !784, file: !531, line: 618, baseType: !799, size: 64, offset: 4928)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !531, line: 602, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 598, size: 128, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !801, file: !531, line: 599, baseType: !377, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !801, file: !531, line: 600, baseType: !377, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !801, file: !531, line: 601, baseType: !435, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !784, file: !531, line: 619, baseType: !807, size: 64, offset: 4992)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !531, line: 607, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 604, size: 128, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !809, file: !531, line: 605, baseType: !377, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !809, file: !531, line: 606, baseType: !435, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !784, file: !531, line: 620, baseType: !435, size: 64, offset: 5056)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !784, file: !531, line: 621, baseType: !427, size: 64, offset: 5120)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !784, file: !531, line: 622, baseType: !427, size: 64, offset: 5184)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !784, file: !531, line: 623, baseType: !586, size: 64, offset: 5248)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !784, file: !531, line: 623, baseType: !586, size: 64, offset: 5312)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !784, file: !531, line: 623, baseType: !586, size: 64, offset: 5376)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !784, file: !531, line: 624, baseType: !485, size: 32, offset: 5440)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !784, file: !531, line: 625, baseType: !821, size: 64, offset: 5504)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!338}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !784, file: !531, line: 626, baseType: !308, size: 64, offset: 5568)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !784, file: !531, line: 627, baseType: !586, size: 64, offset: 5632)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !784, file: !531, line: 628, baseType: !377, size: 32, offset: 5696)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !784, file: !531, line: 629, baseType: !317, size: 64, offset: 5760)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !784, file: !531, line: 630, baseType: !829, size: 32, offset: 5824)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !784, file: !531, line: 631, baseType: !377, size: 32, offset: 5856)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !784, file: !531, line: 631, baseType: !377, size: 32, offset: 5888)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !784, file: !531, line: 632, baseType: !485, size: 32, offset: 5920)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !784, file: !531, line: 633, baseType: !485, size: 32, offset: 5952)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !784, file: !531, line: 634, baseType: !365, size: 64, offset: 6016)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !784, file: !531, line: 634, baseType: !308, size: 64, offset: 6080)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !784, file: !531, line: 635, baseType: !383, size: 64, offset: 6144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !566, file: !531, line: 100, baseType: !838, size: 64, offset: 3520)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!338, !558, !377, !377, !841, !844}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !843)
!843 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !566, file: !531, line: 101, baseType: !684, size: 64, offset: 3584)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !566, file: !531, line: 102, baseType: !847, size: 64, offset: 3648)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!338, !558, !603, !603, !637}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !566, file: !531, line: 103, baseType: !569, size: 64, offset: 3712)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !566, file: !531, line: 105, baseType: !852, size: 64, offset: 3776)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!338, !558, !603, !603, !636, !637}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !566, file: !531, line: 106, baseType: !684, size: 64, offset: 3840)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !566, file: !531, line: 107, baseType: !857, size: 64, offset: 3904)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!338, !558, !344}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !566, file: !531, line: 108, baseType: !861, size: 64, offset: 3968)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!338, !558, !864, !636, !637}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !317)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !566, file: !531, line: 109, baseType: !821, size: 64, offset: 4032)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !566, file: !531, line: 111, baseType: !867, size: 64, offset: 4096)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!338, !558, !558, !558, !427, !558}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !566, file: !531, line: 112, baseType: !871, size: 64, offset: 4160)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!338, !558, !558, !558, !558}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !566, file: !531, line: 113, baseType: !875, size: 64, offset: 4224)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!338, !558, !878, !878}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !604, line: 30, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !604, line: 30, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !566, file: !531, line: 114, baseType: !569, size: 64, offset: 4288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !566, file: !531, line: 115, baseType: !688, size: 64, offset: 4352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !566, file: !531, line: 117, baseType: !747, size: 64, offset: 4416)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !566, file: !531, line: 118, baseType: !747, size: 64, offset: 4480)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !566, file: !531, line: 119, baseType: !861, size: 64, offset: 4544)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !566, file: !531, line: 120, baseType: !887, size: 64, offset: 4608)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!338, !558, !890, !661}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !566, file: !531, line: 121, baseType: !821, size: 64, offset: 4672)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !566, file: !531, line: 123, baseType: !893, size: 64, offset: 4736)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!338, !558, !377, !308}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !566, file: !531, line: 124, baseType: !897, size: 64, offset: 4800)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!338, !558, !782, !586, !308}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !566, file: !531, line: 125, baseType: !901, size: 64, offset: 4864)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!338, !464, !558}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !566, file: !531, line: 126, baseType: !583, size: 64, offset: 4928)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !566, file: !531, line: 127, baseType: !583, size: 64, offset: 4992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !566, file: !531, line: 129, baseType: !907, size: 64, offset: 5056)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!338, !558, !737}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !566, file: !531, line: 130, baseType: !911, size: 64, offset: 5120)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!338, !558, !914, !914}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !916, file: !60, line: 653, baseType: !377, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !916, file: !60, line: 653, baseType: !586, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !566, file: !531, line: 131, baseType: !911, size: 64, offset: 5184)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !566, file: !531, line: 132, baseType: !922, size: 64, offset: 5248)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!338, !558, !418, !418, !418}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !566, file: !531, line: 133, baseType: !857, size: 64, offset: 5312)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !566, file: !531, line: 135, baseType: !927, size: 64, offset: 5376)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!338, !558, !427, !661}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !566, file: !531, line: 136, baseType: !927, size: 64, offset: 5440)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !566, file: !531, line: 137, baseType: !932, size: 64, offset: 5504)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!338, !558, !661}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !566, file: !531, line: 138, baseType: !569, size: 64, offset: 5568)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !566, file: !531, line: 139, baseType: !937, size: 64, offset: 5632)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!338, !558, !940, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !566, file: !531, line: 141, baseType: !821, size: 64, offset: 5696)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !566, file: !531, line: 142, baseType: !943, size: 64, offset: 5760)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!338, !558, !558, !427, !558}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !566, file: !531, line: 143, baseType: !947, size: 64, offset: 5824)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!338, !558, !558, !558}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !566, file: !531, line: 144, baseType: !821, size: 64, offset: 5888)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !566, file: !531, line: 145, baseType: !943, size: 64, offset: 5952)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !566, file: !531, line: 147, baseType: !947, size: 64, offset: 6016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !566, file: !531, line: 148, baseType: !821, size: 64, offset: 6080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !566, file: !531, line: 149, baseType: !943, size: 64, offset: 6144)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !566, file: !531, line: 150, baseType: !947, size: 64, offset: 6208)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !566, file: !531, line: 151, baseType: !957, size: 64, offset: 6272)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!338, !558, !485}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !566, file: !531, line: 153, baseType: !684, size: 64, offset: 6336)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !566, file: !531, line: 154, baseType: !684, size: 64, offset: 6400)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !566, file: !531, line: 155, baseType: !684, size: 64, offset: 6464)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !566, file: !531, line: 156, baseType: !684, size: 64, offset: 6528)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !566, file: !531, line: 157, baseType: !857, size: 64, offset: 6592)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !566, file: !531, line: 159, baseType: !966, size: 64, offset: 6656)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!338, !558, !377, !574}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !566, file: !531, line: 160, baseType: !684, size: 64, offset: 6720)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !566, file: !531, line: 161, baseType: !684, size: 64, offset: 6784)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !566, file: !531, line: 162, baseType: !684, size: 64, offset: 6848)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !566, file: !531, line: 163, baseType: !684, size: 64, offset: 6912)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !566, file: !531, line: 165, baseType: !947, size: 64, offset: 6976)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !566, file: !531, line: 166, baseType: !947, size: 64, offset: 7040)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !566, file: !531, line: 167, baseType: !747, size: 64, offset: 7104)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !566, file: !531, line: 168, baseType: !977, size: 64, offset: 7168)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!338, !558, !586, !377}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !566, file: !531, line: 169, baseType: !981, size: 64, offset: 7232)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!338, !558, !661, !418}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !566, file: !531, line: 171, baseType: !708, size: 64, offset: 7296)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !566, file: !531, line: 172, baseType: !684, size: 64, offset: 7360)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !566, file: !531, line: 173, baseType: !987, size: 64, offset: 7424)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!338, !558, !418, !771}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !566, file: !531, line: 174, baseType: !847, size: 64, offset: 7488)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !566, file: !531, line: 175, baseType: !847, size: 64, offset: 7552)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !566, file: !531, line: 177, baseType: !583, size: 64, offset: 7616)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !566, file: !531, line: 178, baseType: !633, size: 64, offset: 7680)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !566, file: !531, line: 179, baseType: !583, size: 64, offset: 7744)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !566, file: !531, line: 180, baseType: !590, size: 64, offset: 7808)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !566, file: !531, line: 181, baseType: !997, size: 64, offset: 7872)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!338, !558, !304, !636, !637}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !566, file: !531, line: 183, baseType: !907, size: 64, offset: 7936)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !566, file: !531, line: 184, baseType: !668, size: 64, offset: 8000)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !566, file: !531, line: 185, baseType: !1003, size: 64, offset: 8064)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!338, !558, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !566, file: !531, line: 186, baseType: !1008, size: 64, offset: 8128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!338, !558, !377, !572, !435}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !566, file: !531, line: 187, baseType: !727, size: 64, offset: 8192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !566, file: !531, line: 189, baseType: !1013, size: 64, offset: 8256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!338, !558, !377, !377, !418, !574}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !566, file: !531, line: 190, baseType: !821, size: 64, offset: 8320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !566, file: !531, line: 191, baseType: !943, size: 64, offset: 8384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !566, file: !531, line: 192, baseType: !947, size: 64, offset: 8448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !566, file: !531, line: 193, baseType: !1020, size: 64, offset: 8512)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!338, !558, !779, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !531, line: 660, size: 5312, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1025, file: !531, line: 661, baseType: !563, size: 4480)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1025, file: !531, line: 661, baseType: !788, size: 32, offset: 4480)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1025, file: !531, line: 662, baseType: !377, size: 32, offset: 4512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1025, file: !531, line: 662, baseType: !377, size: 32, offset: 4544)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1025, file: !531, line: 662, baseType: !377, size: 32, offset: 4576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1025, file: !531, line: 663, baseType: !377, size: 32, offset: 4608)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1025, file: !531, line: 664, baseType: !377, size: 32, offset: 4640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1025, file: !531, line: 665, baseType: !418, size: 64, offset: 4672)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1025, file: !531, line: 666, baseType: !418, size: 64, offset: 4736)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1025, file: !531, line: 667, baseType: !377, size: 32, offset: 4800)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1025, file: !531, line: 668, baseType: !829, size: 32, offset: 4832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1025, file: !531, line: 670, baseType: !418, size: 64, offset: 4864)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1025, file: !531, line: 670, baseType: !418, size: 64, offset: 4928)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1025, file: !531, line: 671, baseType: !418, size: 64, offset: 4992)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1025, file: !531, line: 672, baseType: !418, size: 64, offset: 5056)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1025, file: !531, line: 673, baseType: !418, size: 64, offset: 5120)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1025, file: !531, line: 674, baseType: !377, size: 32, offset: 5184)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1025, file: !531, line: 675, baseType: !418, size: 64, offset: 5248)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !566, file: !531, line: 195, baseType: !1046, size: 64, offset: 8576)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!338, !1023, !558, !558}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !566, file: !531, line: 196, baseType: !1046, size: 64, offset: 8640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !566, file: !531, line: 197, baseType: !821, size: 64, offset: 8704)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !566, file: !531, line: 198, baseType: !943, size: 64, offset: 8768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !566, file: !531, line: 199, baseType: !947, size: 64, offset: 8832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !566, file: !531, line: 201, baseType: !1054, size: 64, offset: 8896)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!338, !558, !377, !377}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !566, file: !531, line: 202, baseType: !722, size: 64, offset: 8960)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !566, file: !531, line: 203, baseType: !590, size: 64, offset: 9024)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !566, file: !531, line: 204, baseType: !776, size: 64, offset: 9088)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !566, file: !531, line: 205, baseType: !907, size: 64, offset: 9152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !566, file: !531, line: 206, baseType: !1062, size: 64, offset: 9216)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!338, !304, !558, !377, !636, !637}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !566, file: !531, line: 208, baseType: !1066, size: 64, offset: 9280)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!338, !377, !732}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !566, file: !531, line: 209, baseType: !947, size: 64, offset: 9344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !566, file: !531, line: 210, baseType: !739, size: 64, offset: 9408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !560, file: !531, line: 438, baseType: !1072, size: 64, offset: 13952)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !604, line: 60, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1074, file: !114, line: 241, baseType: !304, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !114, line: 242, baseType: !321, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1074, file: !114, line: 243, baseType: !377, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1074, file: !114, line: 243, baseType: !377, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1074, file: !114, line: 244, baseType: !377, size: 32, offset: 160)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1074, file: !114, line: 244, baseType: !377, size: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !114, line: 245, baseType: !418, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1074, file: !114, line: 246, baseType: !485, size: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1074, file: !114, line: 247, baseType: !377, size: 32, offset: 352)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1074, file: !114, line: 251, baseType: !377, size: 32, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1074, file: !114, line: 252, baseType: !878, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1074, file: !114, line: 253, baseType: !485, size: 32, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1074, file: !114, line: 254, baseType: !377, size: 32, offset: 544)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1074, file: !114, line: 254, baseType: !377, size: 32, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1074, file: !114, line: 255, baseType: !377, size: 32, offset: 608)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !560, file: !531, line: 438, baseType: !1072, size: 64, offset: 14016)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !531, line: 439, baseType: !308, size: 64, offset: 14080)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !560, file: !531, line: 440, baseType: !1094, size: 32, offset: 14144)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !560, file: !531, line: 441, baseType: !485, size: 32, offset: 14176)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !560, file: !531, line: 442, baseType: !485, size: 32, offset: 14208)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !560, file: !531, line: 443, baseType: !1098, size: 448, offset: 14272)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 448, elements: !1100)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !317)
!1100 = !{!1101}
!1101 = !DISubrange(count: 7)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !560, file: !531, line: 444, baseType: !485, size: 32, offset: 14720)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !560, file: !531, line: 445, baseType: !485, size: 32, offset: 14752)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !560, file: !531, line: 446, baseType: !377, size: 32, offset: 14784)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !560, file: !531, line: 447, baseType: !411, size: 64, offset: 14848)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !560, file: !531, line: 448, baseType: !411, size: 64, offset: 14912)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !560, file: !531, line: 449, baseType: !644, size: 640, offset: 14976)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !560, file: !531, line: 450, baseType: !576, size: 32, offset: 15616)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !560, file: !531, line: 451, baseType: !530, size: 2880, offset: 15680)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !560, file: !531, line: 451, baseType: !530, size: 2880, offset: 18560)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !560, file: !531, line: 452, baseType: !1112, size: 64, offset: 21440)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !531, line: 681, size: 4864, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1126}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1114, file: !531, line: 682, baseType: !563, size: 4480)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1114, file: !531, line: 682, baseType: !788, size: 32, offset: 4480)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1114, file: !531, line: 683, baseType: !485, size: 32, offset: 4512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1114, file: !531, line: 684, baseType: !377, size: 32, offset: 4544)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1114, file: !531, line: 685, baseType: !940, size: 64, offset: 4608)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1114, file: !531, line: 686, baseType: !435, size: 64, offset: 4672)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1114, file: !531, line: 687, baseType: !1123, size: 64, offset: 4736)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!338, !1112, !586, !308}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1114, file: !531, line: 688, baseType: !308, size: 64, offset: 4800)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !560, file: !531, line: 453, baseType: !1112, size: 64, offset: 21504)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !560, file: !531, line: 454, baseType: !1112, size: 64, offset: 21568)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !560, file: !531, line: 455, baseType: !377, size: 32, offset: 21632)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !560, file: !531, line: 456, baseType: !485, size: 32, offset: 21664)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !560, file: !531, line: 457, baseType: !1132, size: 320, offset: 21696)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !531, line: 399, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 394, size: 320, elements: !1134)
!1134 = !{!1135, !1136, !1140, !1141}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1133, file: !531, line: 395, baseType: !377, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1133, file: !531, line: 396, baseType: !1137, size: 128, offset: 32)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 128, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 4)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1133, file: !531, line: 397, baseType: !1137, size: 128, offset: 160)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1133, file: !531, line: 398, baseType: !485, size: 32, offset: 288)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !560, file: !531, line: 458, baseType: !485, size: 32, offset: 22016)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !560, file: !531, line: 458, baseType: !485, size: 32, offset: 22048)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !560, file: !531, line: 458, baseType: !485, size: 32, offset: 22080)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !560, file: !531, line: 458, baseType: !485, size: 32, offset: 22112)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !560, file: !531, line: 459, baseType: !485, size: 32, offset: 22144)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !560, file: !531, line: 459, baseType: !485, size: 32, offset: 22176)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !560, file: !531, line: 459, baseType: !485, size: 32, offset: 22208)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "spd_set", scope: !560, file: !531, line: 459, baseType: !485, size: 32, offset: 22240)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_eternal", scope: !560, file: !531, line: 460, baseType: !485, size: 32, offset: 22272)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nooffprocentries", scope: !560, file: !531, line: 461, baseType: !485, size: 32, offset: 22304)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nooffproczerorows", scope: !560, file: !531, line: 461, baseType: !485, size: 32, offset: 22336)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !560, file: !531, line: 462, baseType: !485, size: 32, offset: 22368)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "submat_singleis", scope: !560, file: !531, line: 463, baseType: !485, size: 32, offset: 22400)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !560, file: !531, line: 464, baseType: !485, size: 32, offset: 22432)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sortedfull", scope: !560, file: !531, line: 465, baseType: !485, size: 32, offset: 22464)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "force_diagonals", scope: !560, file: !531, line: 466, baseType: !485, size: 32, offset: 22496)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "spptr", scope: !560, file: !531, line: 471, baseType: !308, size: 64, offset: 22528)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !560, file: !531, line: 472, baseType: !309, size: 64, offset: 22592)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetryonassembly", scope: !560, file: !531, line: 473, baseType: !485, size: 32, offset: 22656)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "checknullspaceonassembly", scope: !560, file: !531, line: 473, baseType: !485, size: 32, offset: 22688)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetrytol", scope: !560, file: !531, line: 474, baseType: !427, size: 64, offset: 22720)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "schur", scope: !560, file: !531, line: 475, baseType: !558, size: 64, offset: 22784)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "schur_status", scope: !560, file: !531, line: 476, baseType: !1165, size: 32, offset: 22848)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorSchurStatus", file: !36, line: 1265, baseType: !273)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "redundant", scope: !560, file: !531, line: 477, baseType: !1167, size: 64, offset: 22912)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Redundant", file: !531, line: 418, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 410, size: 896, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nzlocal", scope: !1169, file: !531, line: 411, baseType: !377, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1169, file: !531, line: 411, baseType: !377, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1169, file: !531, line: 411, baseType: !377, size: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "send_rank", scope: !1169, file: !531, line: 412, baseType: !1175, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "recv_rank", scope: !1169, file: !531, line: 412, baseType: !1175, size: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_nz", scope: !1169, file: !531, line: 413, baseType: !418, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_nz", scope: !1169, file: !531, line: 413, baseType: !418, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_j", scope: !1169, file: !531, line: 413, baseType: !418, size: 64, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_j", scope: !1169, file: !531, line: 413, baseType: !420, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_a", scope: !1169, file: !531, line: 414, baseType: !435, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_a", scope: !1169, file: !531, line: 414, baseType: !438, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "subcomm", scope: !1169, file: !531, line: 415, baseType: !304, size: 64, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "isrow", scope: !1169, file: !531, line: 416, baseType: !603, size: 64, offset: 704)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "iscol", scope: !1169, file: !531, line: 416, baseType: !603, size: 64, offset: 768)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "matseq", scope: !1169, file: !531, line: 417, baseType: !637, size: 64, offset: 832)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !560, file: !531, line: 478, baseType: !485, size: 32, offset: 22976)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "factorerrortype", scope: !560, file: !531, line: 479, baseType: !1189, size: 32, offset: 23008)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !36, line: 1203, baseType: !278)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "factorerror_zeropivot_value", scope: !560, file: !531, line: 480, baseType: !427, size: 64, offset: 23040)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "factorerror_zeropivot_row", scope: !560, file: !531, line: 481, baseType: !377, size: 32, offset: 23104)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !560, file: !531, line: 482, baseType: !377, size: 32, offset: 23136)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "bsizes", scope: !560, file: !531, line: 482, baseType: !418, size: 64, offset: 23168)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "defaultvectype", scope: !560, file: !531, line: 483, baseType: !309, size: 64, offset: 23232)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !560, file: !531, line: 484, baseType: !1196, size: 64, offset: 23296)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Product", file: !531, line: 434, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 420, size: 768, elements: !1199)
!1199 = !{!1200, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1198, file: !531, line: 421, baseType: !1201, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatProductType", file: !36, line: 187, baseType: !285)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alg", scope: !1198, file: !531, line: 422, baseType: !309, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !1198, file: !531, line: 423, baseType: !558, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !1198, file: !531, line: 423, baseType: !558, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !1198, file: !531, line: 423, baseType: !558, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "Dwork", scope: !1198, file: !531, line: 423, baseType: !558, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1198, file: !531, line: 424, baseType: !427, size: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "api_user", scope: !1198, file: !531, line: 425, baseType: !485, size: 32, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1198, file: !531, line: 428, baseType: !857, size: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !1198, file: !531, line: 431, baseType: !485, size: 32, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1198, file: !531, line: 432, baseType: !308, size: 64, offset: 640)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1198, file: !531, line: 433, baseType: !455, size: 64, offset: 704)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "form_explicit_transpose", scope: !560, file: !531, line: 485, baseType: !485, size: 32, offset: 23360)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "transupdated", scope: !560, file: !531, line: 486, baseType: !485, size: 32, offset: 23392)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !532, file: !531, line: 329, baseType: !1216, size: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!338, !529, !1175, !420, !420, !438, !418}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !532, file: !531, line: 330, baseType: !1220, size: 64, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!338, !529}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !532, file: !531, line: 331, baseType: !1220, size: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !532, file: !531, line: 334, baseType: !304, size: 64, offset: 576)
