; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/jacobi/jacobi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/jacobi/jacobi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!110 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!111 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!112 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!113 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!114 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!115 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!116 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !118)
!118 = !{!119}
!119 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 119, baseType: !7, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!123 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!162 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!163 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!164 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!165 = !{!166, !169, !187, !268, !374, !208, !376, !377, !392, !393}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !167, line: 46, baseType: !168)
!167 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!168 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !172, line: 73, size: 4480, elements: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!173 = !{!174, !176, !229, !230, !232, !235, !236, !237, !238, !246, !247, !249, !253, !257, !259, !260, !261, !262, !263, !264, !265, !266, !267, !269, !271, !272, !273, !275, !276, !278, !280, !281, !282, !283, !284, !287, !289, !290, !291, !292, !293, !296, !298, !299, !300, !310, !312, !313, !317, !318, !364, !369, !371, !372, !373}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !171, file: !172, line: 74, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !171, file: !172, line: 75, baseType: !177, size: 448, offset: 64)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 448, elements: !227)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !172, line: 53, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 45, size: 448, elements: !180)
!180 = !{!181, !191, !199, !204, !211, !215, !222}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !179, file: !172, line: 46, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !169, !186}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !188, line: 330, baseType: !189)
!188 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !188, line: 330, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !179, file: !172, line: 47, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!185, !169, !195}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !196, line: 16, baseType: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !196, line: 16, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !179, file: !172, line: 48, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!185, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !179, file: !172, line: 49, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!185, !169, !208, !169}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !179, file: !172, line: 50, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!185, !169, !208, !203}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !179, file: !172, line: 51, baseType: !216, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!185, !169, !208, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !179, file: !172, line: 52, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!185, !169, !208, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!227 = !{!228}
!228 = !DISubrange(count: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !171, file: !172, line: 76, baseType: !187, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !172, line: 77, baseType: !231, size: 32, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !171, file: !172, line: 78, baseType: !233, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !234)
!234 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !171, file: !172, line: 78, baseType: !233, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !171, file: !172, line: 78, baseType: !233, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !171, file: !172, line: 78, baseType: !233, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !172, line: 79, baseType: !239, size: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !242, line: 27, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !244, line: 43, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!245 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !171, file: !172, line: 80, baseType: !231, size: 32, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !171, file: !172, line: 81, baseType: !248, size: 32, offset: 992)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !171, file: !172, line: 82, baseType: !250, size: 64, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !171, file: !172, line: 83, baseType: !254, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !171, file: !172, line: 84, baseType: !258, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !171, file: !172, line: 85, baseType: !258, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !171, file: !172, line: 86, baseType: !258, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !171, file: !172, line: 87, baseType: !258, size: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !172, line: 88, baseType: !169, size: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !171, file: !172, line: 89, baseType: !239, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !172, line: 90, baseType: !258, size: 64, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !171, file: !172, line: 91, baseType: !258, size: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !171, file: !172, line: 92, baseType: !231, size: 32, offset: 1664)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !171, file: !172, line: 93, baseType: !268, size: 64, offset: 1728)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !172, line: 94, baseType: !270, size: 64, offset: 1792)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !171, file: !172, line: 95, baseType: !231, size: 32, offset: 1856)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !171, file: !172, line: 95, baseType: !231, size: 32, offset: 1888)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !171, file: !172, line: 96, baseType: !274, size: 64, offset: 1920)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !171, file: !172, line: 96, baseType: !274, size: 64, offset: 1984)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !171, file: !172, line: 97, baseType: !277, size: 64, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !171, file: !172, line: 97, baseType: !279, size: 64, offset: 2112)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !171, file: !172, line: 98, baseType: !231, size: 32, offset: 2176)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !171, file: !172, line: 98, baseType: !231, size: 32, offset: 2208)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !171, file: !172, line: 99, baseType: !274, size: 64, offset: 2240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !171, file: !172, line: 99, baseType: !274, size: 64, offset: 2304)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !171, file: !172, line: 100, baseType: !285, size: 64, offset: 2368)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !234)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !171, file: !172, line: 100, baseType: !288, size: 64, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !171, file: !172, line: 101, baseType: !231, size: 32, offset: 2496)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !171, file: !172, line: 101, baseType: !231, size: 32, offset: 2528)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !171, file: !172, line: 102, baseType: !274, size: 64, offset: 2560)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !171, file: !172, line: 102, baseType: !274, size: 64, offset: 2624)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !171, file: !172, line: 103, baseType: !294, size: 64, offset: 2688)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !286)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !171, file: !172, line: 103, baseType: !297, size: 64, offset: 2752)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !171, file: !172, line: 104, baseType: !226, size: 64, offset: 2816)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !171, file: !172, line: 105, baseType: !231, size: 32, offset: 2880)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !171, file: !172, line: 106, baseType: !301, size: 128, offset: 2944)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !308)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !172, line: 64, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 61, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !304, file: !172, line: 62, baseType: !219, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !304, file: !172, line: 63, baseType: !268, size: 64, offset: 64)
!308 = !{!309}
!309 = !DISubrange(count: 2)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !171, file: !172, line: 107, baseType: !311, size: 64, offset: 3072)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 64, elements: !308)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !171, file: !172, line: 108, baseType: !268, size: 64, offset: 3136)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !171, file: !172, line: 109, baseType: !314, size: 64, offset: 3200)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!185, !268}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !171, file: !172, line: 111, baseType: !231, size: 32, offset: 3264)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !171, file: !172, line: 112, baseType: !319, size: 320, offset: 3328)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 320, elements: !362)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!185, !323, !169, !268}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !326)
!326 = !{!327, !328, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !325, file: !12, line: 100, baseType: !231, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !12, line: 101, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !340, !341, !342, !343, !345, !347, !348, !349}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !331, file: !12, line: 84, baseType: !258, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !331, file: !12, line: 85, baseType: !258, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !12, line: 86, baseType: !268, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !331, file: !12, line: 87, baseType: !250, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !331, file: !12, line: 88, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !331, file: !12, line: 89, baseType: !210, size: 8, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !331, file: !12, line: 90, baseType: !258, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !331, file: !12, line: 91, baseType: !166, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !331, file: !12, line: 92, baseType: !344, size: 32, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !12, line: 93, baseType: !346, size: 32, offset: 544)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !12, line: 94, baseType: !329, size: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !331, file: !12, line: 95, baseType: !258, size: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !331, file: !12, line: 96, baseType: !268, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !325, file: !12, line: 102, baseType: !258, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !325, file: !12, line: 102, baseType: !258, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !325, file: !12, line: 103, baseType: !258, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !325, file: !12, line: 104, baseType: !187, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !325, file: !12, line: 105, baseType: !344, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !325, file: !12, line: 105, baseType: !344, size: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !325, file: !12, line: 105, baseType: !344, size: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !325, file: !12, line: 106, baseType: !169, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !325, file: !12, line: 107, baseType: !359, size: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!362 = !{!363}
!363 = !DISubrange(count: 5)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !171, file: !172, line: 113, baseType: !365, size: 320, offset: 3648)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 320, elements: !362)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!185, !169, !268}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !171, file: !172, line: 114, baseType: !370, size: 320, offset: 3968)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !362)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !171, file: !172, line: 115, baseType: !344, size: 32, offset: 4288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !171, file: !172, line: 120, baseType: !359, size: 64, offset: 4352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !171, file: !172, line: 121, baseType: !344, size: 32, offset: 4416)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !375, line: 1451, baseType: !219)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Jacobi", file: !379, line: 67, baseType: !380)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/jacobi/jacobi.c", directory: "/home/users/ndemeye/xSDK")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 58, size: 256, elements: !381)
!381 = !{!382, !387, !388, !389, !390, !391}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !380, file: !379, line: 59, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !384, line: 21, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !384, line: 21, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "diagsqrt", scope: !380, file: !379, line: 60, baseType: !383, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "userowmax", scope: !380, file: !379, line: 63, baseType: !344, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "userowsum", scope: !380, file: !379, line: 64, baseType: !344, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "useabs", scope: !380, file: !379, line: 65, baseType: !344, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fixdiag", scope: !380, file: !379, line: 66, baseType: !344, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !117)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!394 = !{!0}
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 384, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 6)
!398 = !{i32 7, !"Dwarf Version", i32 4}
!399 = !{i32 2, !"Debug Info Version", i32 3}
!400 = !{i32 1, !"wchar_size", i32 4}
!401 = !{i32 7, !"PIC Level", i32 2}
!402 = !{i32 7, !"uwtable", i32 1}
!403 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!404 = distinct !DISubprogram(name: "PCCreate_Jacobi", scope: !379, file: !379, line: 447, type: !405, scopeLine: 448, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !511)
!405 = !DISubroutineType(types: !406)
!406 = !{!185, !407}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !410, line: 37, size: 6720, elements: !411)
!410 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!411 = !{!412, !414, !475, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !504, !505, !506, !507, !508, !510}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !409, file: !410, line: 38, baseType: !413, size: 4480)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !172, line: 122, baseType: !171)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !409, file: !410, line: 38, baseType: !415, size: 1152, offset: 4480)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 1152, elements: !227)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !410, line: 13, size: 1152, elements: !417)
!417 = !{!418, !420, !424, !431, !437, !442, !443, !447, !451, !459, !460, !465, !466, !467, !468, !469, !473, !474}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !416, file: !410, line: 14, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !416, file: !410, line: 15, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!185, !407, !383, !383}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !416, file: !410, line: 16, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!185, !407, !428, !428}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !416, file: !410, line: 17, baseType: !432, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!185, !407, !383, !383, !383, !286, !286, !286, !231, !344, !277, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !416, file: !410, line: 18, baseType: !438, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!185, !407, !441, !383, !383, !383}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !416, file: !410, line: 19, baseType: !421, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !416, file: !410, line: 20, baseType: !444, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!185, !407, !231, !383, !383, !383}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !416, file: !410, line: 21, baseType: !448, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!185, !323, !407}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !416, file: !410, line: 22, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!185, !407, !455, !383, !383}
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !456, line: 22, baseType: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !456, line: 22, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !416, file: !410, line: 23, baseType: !452, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !416, file: !410, line: 24, baseType: !461, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!185, !407, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !416, file: !410, line: 25, baseType: !421, size: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !416, file: !410, line: 26, baseType: !421, size: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !416, file: !410, line: 27, baseType: !419, size: 64, offset: 832)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !416, file: !410, line: 28, baseType: !419, size: 64, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !416, file: !410, line: 29, baseType: !470, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!185, !407, !195}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !416, file: !410, line: 30, baseType: !419, size: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !416, file: !410, line: 31, baseType: !470, size: 64, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !409, file: !410, line: 39, baseType: !476, size: 64, offset: 5632)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !477, line: 14, baseType: !478)
!477 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !477, line: 14, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !409, file: !410, line: 40, baseType: !231, size: 32, offset: 5696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !409, file: !410, line: 41, baseType: !270, size: 64, offset: 5760)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !409, file: !410, line: 41, baseType: !270, size: 64, offset: 5824)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !409, file: !410, line: 42, baseType: !344, size: 32, offset: 5888)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !409, file: !410, line: 43, baseType: !485, size: 32, offset: 5920)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !409, file: !410, line: 45, baseType: !231, size: 32, offset: 5952)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !409, file: !410, line: 46, baseType: !344, size: 32, offset: 5984)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !409, file: !410, line: 47, baseType: !428, size: 64, offset: 6016)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !409, file: !410, line: 47, baseType: !428, size: 64, offset: 6080)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !409, file: !410, line: 48, baseType: !383, size: 64, offset: 6144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !409, file: !410, line: 48, baseType: !383, size: 64, offset: 6208)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !409, file: !410, line: 49, baseType: !344, size: 32, offset: 6272)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !409, file: !410, line: 50, baseType: !344, size: 32, offset: 6304)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !409, file: !410, line: 51, baseType: !495, size: 64, offset: 6336)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!185, !407, !231, !498, !498, !464, !268}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !501, line: 11, baseType: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !501, line: 11, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !409, file: !410, line: 52, baseType: !268, size: 64, offset: 6400)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !410, line: 53, baseType: !268, size: 64, offset: 6464)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !409, file: !410, line: 54, baseType: !231, size: 32, offset: 6528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !409, file: !410, line: 55, baseType: !268, size: 64, offset: 6592)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !409, file: !410, line: 56, baseType: !509, size: 32, offset: 6656)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !409, file: !410, line: 57, baseType: !509, size: 32, offset: 6688)
!511 = !{!512, !513, !514, !515, !517, !519, !521, !523, !525, !527}
!512 = !DILocalVariable(name: "pc", arg: 1, scope: !404, file: !379, line: 447, type: !407)
!513 = !DILocalVariable(name: "jac", scope: !404, file: !379, line: 449, type: !377)
!514 = !DILocalVariable(name: "ierr", scope: !404, file: !379, line: 450, type: !185)
!515 = !DILocalVariable(name: "ierr__", scope: !516, file: !379, line: 457, type: !185)
!516 = distinct !DILexicalBlock(scope: !404, file: !379, line: 457, column: 35)
!517 = !DILocalVariable(name: "ierr__", scope: !518, file: !379, line: 489, type: !185)
!518 = distinct !DILexicalBlock(scope: !404, file: !379, line: 489, column: 97)
!519 = !DILocalVariable(name: "ierr__", scope: !520, file: !379, line: 490, type: !185)
!520 = distinct !DILexicalBlock(scope: !404, file: !379, line: 490, column: 97)
!521 = !DILocalVariable(name: "ierr__", scope: !522, file: !379, line: 491, type: !185)
!522 = distinct !DILexicalBlock(scope: !404, file: !379, line: 491, column: 101)
!523 = !DILocalVariable(name: "ierr__", scope: !524, file: !379, line: 492, type: !185)
!524 = distinct !DILexicalBlock(scope: !404, file: !379, line: 492, column: 101)
!525 = !DILocalVariable(name: "ierr__", scope: !526, file: !379, line: 493, type: !185)
!526 = distinct !DILexicalBlock(scope: !404, file: !379, line: 493, column: 111)
!527 = !DILocalVariable(name: "ierr__", scope: !528, file: !379, line: 494, type: !185)
!528 = distinct !DILexicalBlock(scope: !404, file: !379, line: 494, column: 111)
!529 = !DILocation(line: 0, scope: !404)
!530 = !DILocation(line: 449, column: 3, scope: !404)
!531 = !DILocation(line: 452, column: 3, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !379, line: 452, column: 3)
!533 = distinct !DILexicalBlock(scope: !534, file: !379, line: 452, column: 3)
!534 = distinct !DILexicalBlock(scope: !404, file: !379, line: 452, column: 3)
!535 = !{!536, !536, i64 0}
!536 = !{!"any pointer", !537, i64 0}
!537 = !{!"omnipotent char", !538, i64 0}
!538 = !{!"Simple C/C++ TBAA"}
!539 = !DILocation(line: 452, column: 3, scope: !533)
!540 = !DILocation(line: 452, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !379, line: 452, column: 3)
!542 = distinct !DILexicalBlock(scope: !532, file: !379, line: 452, column: 3)
!543 = !{!544, !545, i64 1536}
!544 = !{!"", !537, i64 0, !537, i64 512, !537, i64 1024, !537, i64 1280, !545, i64 1536, !545, i64 1540, !537, i64 1544}
!545 = !{!"int", !537, i64 0}
!546 = !DILocation(line: 452, column: 3, scope: !542)
!547 = !DILocation(line: 452, column: 3, scope: !548)
!548 = distinct !DILexicalBlock(scope: !541, file: !379, line: 452, column: 3)
!549 = !{!545, !545, i64 0}
!550 = !{!544, !545, i64 1540}
!551 = !DILocation(line: 457, column: 14, scope: !404)
!552 = !{!"branch_weights", i32 2146410443, i32 1073205}
!553 = !DILocation(line: 0, scope: !516)
!554 = !DILocation(line: 457, column: 35, scope: !516)
!555 = !{!"branch_weights", i32 2000, i32 1}
!556 = !DILocation(line: 457, column: 35, scope: !557)
!557 = distinct !DILexicalBlock(scope: !516, file: !379, line: 457, column: 35)
!558 = !DILocation(line: 458, column: 21, scope: !404)
!559 = !DILocation(line: 458, column: 7, scope: !404)
!560 = !DILocation(line: 458, column: 12, scope: !404)
!561 = !{!562, !536, i64 808}
!562 = !{!"_p_PC", !563, i64 0, !537, i64 560, !536, i64 704, !545, i64 712, !565, i64 720, !565, i64 728, !537, i64 736, !537, i64 740, !545, i64 744, !537, i64 748, !536, i64 752, !536, i64 760, !536, i64 768, !536, i64 776, !537, i64 784, !537, i64 788, !536, i64 792, !536, i64 800, !536, i64 808, !545, i64 816, !536, i64 824, !537, i64 832, !537, i64 836}
