; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fdir.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fdir.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscPathJoin = private unnamed_addr constant [14 x i8] c"PetscPathJoin\00", align 1
@.str = private unnamed_addr constant [75 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fdir.c\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@.str.1 = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str.2 = private unnamed_addr constant [40 x i8] c"Path length is greater than buffer size\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"/\00", align 1

!234 = !DILocation(line: 46, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !225, file: !31, line: 46, column: 3)
!236 = !DILocation(line: 46, column: 3, scope: !237)
!237 = distinct !DILexicalBlock(scope: !235, file: !31, line: 46, column: 3)
!238 = !DILocation(line: 46, column: 3, scope: !239)
!239 = distinct !DILexicalBlock(scope: !240, file: !31, line: 46, column: 3)
!240 = distinct !DILexicalBlock(scope: !237, file: !31, line: 46, column: 3)
!241 = !DILocation(line: 46, column: 3, scope: !240)
!242 = !DILocation(line: 46, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !31, line: 46, column: 3)
!244 = !DILocation(line: 47, column: 1, scope: !156)
!245 = !DISubprogram(name: "PetscTestDirectory", scope: !144, file: !144, line: 2592, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !148)
!246 = !DISubroutineType(types: !247)
!247 = !{!35, !21, !23, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!249 = !DISubprogram(name: "mkdir", scope: !250, file: !250, line: 317, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !148)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!251 = !DISubroutineType(types: !252)
!252 = !{!35, !21, !5}
!253 = distinct !DISubprogram(name: "PetscMkdtemp", scope: !31, file: !31, line: 65, type: !254, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!34, !39}
!256 = !{!257}
!257 = !DILocalVariable(name: "dir", arg: 1, scope: !253, file: !31, line: 65, type: !39)
!258 = !DILocation(line: 0, scope: !253)
!259 = !DILocation(line: 67, column: 3, scope: !260)
!260 = distinct !DILexicalBlock(scope: !261, file: !31, line: 67, column: 3)
!261 = distinct !DILexicalBlock(scope: !262, file: !31, line: 67, column: 3)
!262 = distinct !DILexicalBlock(scope: !253, file: !31, line: 67, column: 3)
!263 = !DILocation(line: 67, column: 3, scope: !261)
!264 = !DILocation(line: 67, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !31, line: 67, column: 3)
!266 = distinct !DILexicalBlock(scope: !260, file: !31, line: 67, column: 3)
!267 = !DILocation(line: 67, column: 3, scope: !266)
!268 = !DILocation(line: 67, column: 3, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !31, line: 67, column: 3)
!270 = !DILocation(line: 88, column: 9, scope: !253)
!271 = !DILocation(line: 89, column: 8, scope: !272)
!272 = distinct !DILexicalBlock(scope: !253, file: !31, line: 89, column: 7)
!273 = !DILocation(line: 89, column: 7, scope: !253)
!274 = !DILocation(line: 89, column: 13, scope: !272)
!275 = !DILocation(line: 91, column: 3, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !31, line: 91, column: 3)
!277 = distinct !DILexicalBlock(scope: !278, file: !31, line: 91, column: 3)
!278 = distinct !DILexicalBlock(scope: !253, file: !31, line: 91, column: 3)
!279 = !DILocation(line: 91, column: 3, scope: !277)
!280 = !DILocation(line: 91, column: 3, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !31, line: 91, column: 3)
!282 = distinct !DILexicalBlock(scope: !276, file: !31, line: 91, column: 3)
!283 = !DILocation(line: 91, column: 3, scope: !282)
!284 = !DILocation(line: 91, column: 3, scope: !285)
!285 = distinct !DILexicalBlock(scope: !286, file: !31, line: 91, column: 3)
!286 = distinct !DILexicalBlock(scope: !281, file: !31, line: 91, column: 3)
!287 = !DILocation(line: 91, column: 3, scope: !286)
!288 = !DILocation(line: 91, column: 3, scope: !289)
!289 = distinct !DILexicalBlock(scope: !285, file: !31, line: 91, column: 3)
!290 = !DILocation(line: 91, column: 3, scope: !291)
!291 = distinct !DILexicalBlock(scope: !281, file: !31, line: 91, column: 3)
!292 = !DILocation(line: 91, column: 3, scope: !293)
!293 = distinct !DILexicalBlock(scope: !291, file: !31, line: 91, column: 3)
!294 = !DILocation(line: 91, column: 3, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !31, line: 91, column: 3)
!296 = distinct !DILexicalBlock(scope: !293, file: !31, line: 91, column: 3)
!297 = !DILocation(line: 91, column: 3, scope: !296)
!298 = !DILocation(line: 91, column: 3, scope: !299)
!299 = distinct !DILexicalBlock(scope: !295, file: !31, line: 91, column: 3)
!300 = !DILocation(line: 92, column: 1, scope: !253)
!301 = !DISubprogram(name: "mkdtemp", scope: !302, file: !302, line: 728, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !148)
!302 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!303 = !DISubroutineType(types: !304)
!304 = !{!39, !39}
!305 = distinct !DISubprogram(name: "PetscRMTree", scope: !31, file: !31, line: 136, type: !157, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !306)
!306 = !{!307, !308, !309, !328, !332, !333, !334, !339, !375, !378, !380, !382, !385, !387, !389}
!307 = !DILocalVariable(name: "dir", arg: 1, scope: !305, file: !31, line: 136, type: !21)
!308 = !DILocalVariable(name: "ierr", scope: !305, file: !31, line: 138, type: !34)
!309 = !DILocalVariable(name: "data", scope: !305, file: !31, line: 139, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !312, line: 22, size: 2240, elements: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!313 = !{!314, !317, !320, !322, !324}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !311, file: !312, line: 25, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !316, line: 136, baseType: !38)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !311, file: !312, line: 26, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !316, line: 140, baseType: !319)
!319 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !311, file: !312, line: 31, baseType: !321, size: 16, offset: 128)
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !311, file: !312, line: 32, baseType: !323, size: 8, offset: 144)
!323 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !311, file: !312, line: 33, baseType: !325, size: 2048, offset: 152)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 256)
!328 = !DILocalVariable(name: "loc", scope: !305, file: !31, line: 140, type: !329)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32768, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 4096)
!332 = !DILocalVariable(name: "flg1", scope: !305, file: !31, line: 141, type: !164)
!333 = !DILocalVariable(name: "flg2", scope: !305, file: !31, line: 141, type: !164)
!334 = !DILocalVariable(name: "dirp", scope: !305, file: !31, line: 142, type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !337, line: 127, baseType: !338)
!337 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !337, line: 127, flags: DIFlagFwdDecl)
!339 = !DILocalVariable(name: "statbuf", scope: !305, file: !31, line: 143, type: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !341, line: 46, size: 1152, elements: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!342 = !{!343, !345, !346, !348, !350, !352, !354, !355, !356, !357, !359, !361, !369, !370, !371}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !340, file: !341, line: 48, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !316, line: 133, baseType: !38)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !340, file: !341, line: 53, baseType: !315, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !340, file: !341, line: 61, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !316, line: 139, baseType: !38)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !340, file: !341, line: 62, baseType: !349, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !316, line: 138, baseType: !5)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !340, file: !341, line: 64, baseType: !351, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !316, line: 134, baseType: !5)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !340, file: !341, line: 65, baseType: !353, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !316, line: 135, baseType: !5)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !340, file: !341, line: 67, baseType: !35, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !340, file: !341, line: 69, baseType: !344, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !340, file: !341, line: 74, baseType: !318, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !340, file: !341, line: 78, baseType: !358, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !316, line: 162, baseType: !319)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !340, file: !341, line: 80, baseType: !360, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !316, line: 167, baseType: !319)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !340, file: !341, line: 91, baseType: !362, size: 128, offset: 576)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !363, line: 9, size: 128, elements: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !362, file: !363, line: 11, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !316, line: 148, baseType: !319)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !362, file: !363, line: 12, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !316, line: 184, baseType: !319)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !340, file: !341, line: 92, baseType: !362, size: 128, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !340, file: !341, line: 93, baseType: !362, size: 128, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !340, file: !341, line: 106, baseType: !372, size: 192, offset: 960)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 192, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 3)
!375 = !DILocalVariable(name: "flg", scope: !376, file: !31, line: 148, type: !164)
!376 = distinct !DILexicalBlock(scope: !377, file: !31, line: 147, column: 14)
!377 = distinct !DILexicalBlock(scope: !305, file: !31, line: 147, column: 7)
!378 = !DILocalVariable(name: "ierr__", scope: !379, file: !31, line: 149, type: !34)
!379 = distinct !DILexicalBlock(scope: !376, file: !31, line: 149, column: 45)
!380 = !DILocalVariable(name: "ierr__", scope: !381, file: !31, line: 151, type: !34)
!381 = distinct !DILexicalBlock(scope: !376, file: !31, line: 151, column: 40)
!382 = !DILocalVariable(name: "ierr__", scope: !383, file: !31, line: 156, type: !34)
!383 = distinct !DILexicalBlock(scope: !384, file: !31, line: 156, column: 49)
!384 = distinct !DILexicalBlock(scope: !305, file: !31, line: 155, column: 34)
!385 = !DILocalVariable(name: "ierr__", scope: !386, file: !31, line: 157, type: !34)
!386 = distinct !DILexicalBlock(scope: !384, file: !31, line: 157, column: 50)
!387 = !DILocalVariable(name: "ierr__", scope: !388, file: !31, line: 159, type: !34)
!388 = distinct !DILexicalBlock(scope: !384, file: !31, line: 159, column: 67)
!389 = !DILocalVariable(name: "ierr__", scope: !390, file: !31, line: 162, type: !34)
!390 = distinct !DILexicalBlock(scope: !391, file: !31, line: 162, column: 31)
!391 = distinct !DILexicalBlock(scope: !392, file: !31, line: 161, column: 35)
!392 = distinct !DILexicalBlock(scope: !384, file: !31, line: 161, column: 9)
!393 = !DILocation(line: 0, scope: !305)
!394 = !DILocation(line: 140, column: 3, scope: !305)
!395 = !DILocation(line: 140, column: 8, scope: !305)
!396 = !DILocation(line: 141, column: 3, scope: !305)
!397 = !DILocation(line: 143, column: 3, scope: !305)
!398 = !DILocation(line: 143, column: 15, scope: !305)
!399 = !DILocation(line: 145, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !31, line: 145, column: 3)
!401 = distinct !DILexicalBlock(scope: !402, file: !31, line: 145, column: 3)
!402 = distinct !DILexicalBlock(scope: !305, file: !31, line: 145, column: 3)
!403 = !DILocation(line: 145, column: 3, scope: !401)
!404 = !DILocation(line: 145, column: 3, scope: !405)
!405 = distinct !DILexicalBlock(scope: !406, file: !31, line: 145, column: 3)
!406 = distinct !DILexicalBlock(scope: !400, file: !31, line: 145, column: 3)
!407 = !DILocation(line: 145, column: 3, scope: !406)
!408 = !DILocation(line: 145, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !31, line: 145, column: 3)
!410 = !DILocation(line: 146, column: 10, scope: !305)
!411 = !DILocation(line: 147, column: 8, scope: !377)
!412 = !DILocation(line: 147, column: 7, scope: !305)
!413 = !DILocation(line: 155, column: 18, scope: !305)
!414 = !DILocation(line: 155, column: 3, scope: !305)
!415 = !DILocation(line: 148, column: 5, scope: !376)
!416 = !DILocation(line: 0, scope: !376)
!417 = !DILocation(line: 149, column: 12, scope: !376)
!418 = !DILocation(line: 0, scope: !379)
!419 = !DILocation(line: 149, column: 45, scope: !420)
!420 = distinct !DILexicalBlock(scope: !379, file: !31, line: 149, column: 45)
!421 = !DILocation(line: 149, column: 45, scope: !379)
!422 = !DILocation(line: 150, column: 9, scope: !423)
!423 = distinct !DILexicalBlock(scope: !376, file: !31, line: 150, column: 9)
!424 = !DILocation(line: 150, column: 9, scope: !376)
!425 = !DILocation(line: 150, column: 14, scope: !423)
!426 = !DILocation(line: 151, column: 12, scope: !376)
!427 = !DILocation(line: 0, scope: !381)
!428 = !DILocation(line: 151, column: 40, scope: !429)
!429 = distinct !DILexicalBlock(scope: !381, file: !31, line: 151, column: 40)
!430 = !DILocation(line: 151, column: 40, scope: !381)
