; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shellcnv.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shellcnv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 475, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!305 = !{!306, !324, !405, !480, !345, !356, !514, !516, !517}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !309, line: 73, size: 4480, elements: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!310 = !{!311, !313, !366, !367, !369, !372, !373, !374, !375, !383, !384, !386, !390, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !408, !409, !410, !412, !413, !415, !417, !418, !419, !420, !421, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !447, !449, !450, !454, !455, !504, !509, !511, !512, !513}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !308, file: !309, line: 74, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !308, file: !309, line: 75, baseType: !314, size: 448, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 448, elements: !364)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !309, line: 53, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 45, size: 448, elements: !317)
!317 = !{!318, !328, !336, !341, !348, !352, !359}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !316, file: !309, line: 46, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !306, !323}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !325, line: 330, baseType: !326)
!325 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !325, line: 330, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !316, file: !309, line: 47, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!322, !306, !332}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !333, line: 16, baseType: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !333, line: 16, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !316, file: !309, line: 48, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!322, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !316, file: !309, line: 49, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!322, !306, !345, !306}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !316, file: !309, line: 50, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!322, !306, !345, !340}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !316, file: !309, line: 51, baseType: !353, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!322, !306, !345, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !316, file: !309, line: 52, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!322, !306, !345, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!364 = !{!365}
!365 = !DISubrange(count: 1)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !308, file: !309, line: 76, baseType: !324, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 77, baseType: !368, size: 32, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !371)
!371 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !308, file: !309, line: 78, baseType: !370, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 79, baseType: !376, size: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !379, line: 27, baseType: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !381, line: 43, baseType: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!382 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !308, file: !309, line: 80, baseType: !368, size: 32, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !308, file: !309, line: 81, baseType: !385, size: 32, offset: 992)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !308, file: !309, line: 82, baseType: !387, size: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !308, file: !309, line: 83, baseType: !391, size: 64, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !308, file: !309, line: 84, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !308, file: !309, line: 85, baseType: !395, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !308, file: !309, line: 86, baseType: !395, size: 64, offset: 1280)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !308, file: !309, line: 87, baseType: !395, size: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 88, baseType: !306, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !308, file: !309, line: 89, baseType: !376, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 90, baseType: !395, size: 64, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !309, line: 91, baseType: !395, size: 64, offset: 1600)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !308, file: !309, line: 92, baseType: !368, size: 32, offset: 1664)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !308, file: !309, line: 93, baseType: !405, size: 64, offset: 1728)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !309, line: 94, baseType: !407, size: 64, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !377)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !308, file: !309, line: 95, baseType: !368, size: 32, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !308, file: !309, line: 95, baseType: !368, size: 32, offset: 1888)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !308, file: !309, line: 96, baseType: !411, size: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !308, file: !309, line: 96, baseType: !411, size: 64, offset: 1984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !308, file: !309, line: 97, baseType: !414, size: 64, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !308, file: !309, line: 97, baseType: !416, size: 64, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !308, file: !309, line: 98, baseType: !368, size: 32, offset: 2176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !308, file: !309, line: 98, baseType: !368, size: 32, offset: 2208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !308, file: !309, line: 99, baseType: !411, size: 64, offset: 2240)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !308, file: !309, line: 99, baseType: !411, size: 64, offset: 2304)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !308, file: !309, line: 100, baseType: !422, size: 64, offset: 2368)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !371)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !308, file: !309, line: 100, baseType: !425, size: 64, offset: 2432)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !308, file: !309, line: 101, baseType: !368, size: 32, offset: 2496)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !308, file: !309, line: 101, baseType: !368, size: 32, offset: 2528)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !308, file: !309, line: 102, baseType: !411, size: 64, offset: 2560)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !308, file: !309, line: 102, baseType: !411, size: 64, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !308, file: !309, line: 103, baseType: !431, size: 64, offset: 2688)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !423)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !308, file: !309, line: 103, baseType: !434, size: 64, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !308, file: !309, line: 104, baseType: !363, size: 64, offset: 2816)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !308, file: !309, line: 105, baseType: !368, size: 32, offset: 2880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !308, file: !309, line: 106, baseType: !438, size: 128, offset: 2944)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 128, elements: !445)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !309, line: 64, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 61, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !441, file: !309, line: 62, baseType: !356, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !441, file: !309, line: 63, baseType: !405, size: 64, offset: 64)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !308, file: !309, line: 107, baseType: !448, size: 64, offset: 3072)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !445)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !308, file: !309, line: 108, baseType: !405, size: 64, offset: 3136)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !308, file: !309, line: 109, baseType: !451, size: 64, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!322, !405}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !308, file: !309, line: 111, baseType: !368, size: 32, offset: 3264)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !308, file: !309, line: 112, baseType: !456, size: 320, offset: 3328)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !502)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!322, !460, !306, !405}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !463)
!463 = !{!464, !465, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !462, file: !10, line: 100, baseType: !368, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !10, line: 101, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !477, !478, !479, !483, !485, !487, !488, !489}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !468, file: !10, line: 84, baseType: !395, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !10, line: 85, baseType: !395, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !468, file: !10, line: 86, baseType: !405, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !468, file: !10, line: 87, baseType: !387, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !468, file: !10, line: 88, baseType: !475, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !468, file: !10, line: 89, baseType: !347, size: 8, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !468, file: !10, line: 90, baseType: !395, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !468, file: !10, line: 91, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !481, line: 46, baseType: !482)
!481 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!482 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !468, file: !10, line: 92, baseType: !484, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !10, line: 93, baseType: !486, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !10, line: 94, baseType: !466, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !468, file: !10, line: 95, baseType: !395, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !468, file: !10, line: 96, baseType: !405, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !462, file: !10, line: 102, baseType: !395, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !462, file: !10, line: 102, baseType: !395, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !462, file: !10, line: 103, baseType: !395, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !462, file: !10, line: 104, baseType: !324, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !462, file: !10, line: 106, baseType: !306, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !462, file: !10, line: 107, baseType: !499, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!502 = !{!503}
!503 = !DISubrange(count: 5)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !308, file: !309, line: 113, baseType: !505, size: 320, offset: 3648)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !502)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!322, !306, !405}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !308, file: !309, line: 114, baseType: !510, size: 320, offset: 3968)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !502)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !308, file: !309, line: 115, baseType: !484, size: 32, offset: 4288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !309, line: 120, baseType: !499, size: 64, offset: 4352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !308, file: !309, line: 121, baseType: !484, size: 32, offset: 4416)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !515, line: 1451, baseType: !356)
!515 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatMatCF", file: !519, line: 130, baseType: !520)
!519 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shellcnv.c", directory: "/home/users/ndemeye/xSDK")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 124, size: 320, elements: !521)
!521 = !{!522, !523, !524, !1296, !1297}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !520, file: !519, line: 125, baseType: !405, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !520, file: !519, line: 126, baseType: !451, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !520, file: !519, line: 127, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!322, !528}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !531, line: 436, size: 23424, elements: !532)
!531 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!532 = !{!533, !535, !1039, !1059, !1060, !1061, !1063, !1064, !1065, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1192, !1193, !1209, !1210, !1211, !1212, !1213, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1268, !1269, !1271, !1272, !1273, !1274, !1275, !1276, !1294, !1295}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !530, file: !531, line: 437, baseType: !534, size: 4480)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !309, line: 122, baseType: !308)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !530, file: !531, line: 437, baseType: !536, size: 9472, offset: 4480)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 9472, elements: !364)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !531, line: 32, size: 9472, elements: !538)
!538 = !{!539, !548, !552, !553, !560, !564, !565, !566, !567, !568, !569, !570, !594, !598, !603, !609, !628, !633, !637, !638, !643, !648, !649, !654, !655, !659, !663, !667, !671, !672, !673, !674, !675, !679, !680, !685, !686, !687, !688, !689, !694, !701, !706, !710, !714, !718, !722, !723, !727, !728, !735, !740, !741, !742, !743, !805, !813, !814, !818, !819, !823, !824, !828, !833, !834, !838, !842, !849, !850, !851, !852, !853, !854, !859, !860, !864, !868, !872, !873, !874, !878, !888, !889, !893, !894, !898, !899, !903, !904, !909, !910, !914, !918, !919, !920, !921, !922, !923, !924, !928, !929, !930, !931, !932, !933, !937, !938, !939, !940, !941, !942, !943, !944, !948, !952, !953, !954, !958, !959, !960, !961, !962, !963, !964, !968, !969, !970, !975, !979, !980, !984, !985, !986, !987, !1013, !1017, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1033, !1037, !1038}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !537, file: !531, line: 34, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!322, !528, !368, !543, !368, !543, !545, !547}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !537, file: !531, line: 35, baseType: !549, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!322, !528, !368, !414, !416, !434}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !537, file: !531, line: 36, baseType: !549, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !537, file: !531, line: 37, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!322, !528, !557, !557}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !537, file: !531, line: 38, baseType: !561, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!322, !528, !557, !557, !557}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !537, file: !531, line: 40, baseType: !554, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !537, file: !531, line: 41, baseType: !561, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !537, file: !531, line: 42, baseType: !554, size: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !537, file: !531, line: 43, baseType: !561, size: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !537, file: !531, line: 44, baseType: !554, size: 64, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !537, file: !531, line: 46, baseType: !561, size: 64, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !537, file: !531, line: 47, baseType: !571, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!322, !528, !574, !574, !578}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !575, line: 11, baseType: !576)
!575 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !575, line: 11, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !581, file: !36, line: 1227, baseType: !423, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !581, file: !36, line: 1228, baseType: !423, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !581, file: !36, line: 1229, baseType: !423, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !581, file: !36, line: 1230, baseType: !423, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !581, file: !36, line: 1231, baseType: !423, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !581, file: !36, line: 1232, baseType: !423, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !581, file: !36, line: 1233, baseType: !423, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !581, file: !36, line: 1234, baseType: !423, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !581, file: !36, line: 1236, baseType: !423, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !581, file: !36, line: 1237, baseType: !423, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !581, file: !36, line: 1238, baseType: !423, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !537, file: !531, line: 48, baseType: !595, size: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!322, !528, !574, !578}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !537, file: !531, line: 49, baseType: !599, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!322, !528, !557, !423, !602, !423, !368, !368, !557}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !537, file: !531, line: 50, baseType: !604, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!322, !528, !607, !608}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !537, file: !531, line: 52, baseType: !610, size: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!322, !528, !613, !614}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !616, file: !36, line: 593, baseType: !370, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !616, file: !36, line: 594, baseType: !370, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !616, file: !36, line: 594, baseType: !370, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !616, file: !36, line: 594, baseType: !370, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !616, file: !36, line: 595, baseType: !370, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !616, file: !36, line: 596, baseType: !370, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !616, file: !36, line: 597, baseType: !370, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !616, file: !36, line: 598, baseType: !370, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !616, file: !36, line: 598, baseType: !370, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !616, file: !36, line: 599, baseType: !370, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !537, file: !531, line: 53, baseType: !629, size: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!322, !528, !528, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !537, file: !531, line: 54, baseType: !634, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!322, !528, !557}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !537, file: !531, line: 55, baseType: !554, size: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !537, file: !531, line: 56, baseType: !639, size: 64, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!322, !528, !642, !422}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !537, file: !531, line: 58, baseType: !644, size: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!322, !528, !647}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !537, file: !531, line: 59, baseType: !644, size: 64, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !537, file: !531, line: 60, baseType: !650, size: 64, offset: 1408)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!322, !528, !653, !484}
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !537, file: !531, line: 61, baseType: !525, size: 64, offset: 1472)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !537, file: !531, line: 63, baseType: !656, size: 64, offset: 1536)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!322, !528, !368, !543, !432, !557, !557}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !537, file: !531, line: 64, baseType: !660, size: 64, offset: 1600)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!322, !528, !528, !574, !574, !578}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !537, file: !531, line: 65, baseType: !664, size: 64, offset: 1664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!322, !528, !528, !578}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !537, file: !531, line: 66, baseType: !668, size: 64, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!322, !528, !528, !574, !578}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !537, file: !531, line: 67, baseType: !664, size: 64, offset: 1792)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !537, file: !531, line: 69, baseType: !525, size: 64, offset: 1856)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !537, file: !531, line: 70, baseType: !660, size: 64, offset: 1920)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !537, file: !531, line: 71, baseType: !668, size: 64, offset: 1984)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !537, file: !531, line: 72, baseType: !676, size: 64, offset: 2048)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!322, !528, !608}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !537, file: !531, line: 73, baseType: !525, size: 64, offset: 2112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !537, file: !531, line: 75, baseType: !681, size: 64, offset: 2176)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!322, !528, !684, !608}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !537, file: !531, line: 76, baseType: !554, size: 64, offset: 2240)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !537, file: !531, line: 77, baseType: !554, size: 64, offset: 2304)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !537, file: !531, line: 78, baseType: !571, size: 64, offset: 2368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !537, file: !531, line: 79, baseType: !595, size: 64, offset: 2432)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !537, file: !531, line: 81, baseType: !690, size: 64, offset: 2496)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!322, !528, !432, !528, !693}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !537, file: !531, line: 82, baseType: !695, size: 64, offset: 2560)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!322, !528, !368, !698, !698, !607, !700}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !537, file: !531, line: 83, baseType: !702, size: 64, offset: 2624)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!322, !528, !368, !705, !368}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !537, file: !531, line: 84, baseType: !707, size: 64, offset: 2688)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!322, !528, !368, !543, !368, !543, !431}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !537, file: !531, line: 85, baseType: !711, size: 64, offset: 2752)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!322, !528, !528, !693}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !537, file: !531, line: 87, baseType: !715, size: 64, offset: 2816)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!322, !528, !557, !414}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !537, file: !531, line: 88, baseType: !719, size: 64, offset: 2880)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!322, !528, !432}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !537, file: !531, line: 89, baseType: !719, size: 64, offset: 2944)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !537, file: !531, line: 90, baseType: !724, size: 64, offset: 3008)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!322, !528, !557, !547}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !537, file: !531, line: 91, baseType: !656, size: 64, offset: 3072)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !537, file: !531, line: 93, baseType: !729, size: 64, offset: 3136)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!322, !528, !732}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !537, file: !531, line: 94, baseType: !736, size: 64, offset: 3200)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!322, !528, !368, !484, !484, !414, !739, !739, !632}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !537, file: !531, line: 95, baseType: !736, size: 64, offset: 3264)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !537, file: !531, line: 96, baseType: !736, size: 64, offset: 3328)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !537, file: !531, line: 97, baseType: !736, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !537, file: !531, line: 99, baseType: !744, size: 64, offset: 3456)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!322, !528, !747, !750}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !575, line: 51, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !575, line: 51, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !531, line: 609, size: 6208, elements: !753)
!753 = !{!754, !755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !774, !781, !782, !783, !784, !785, !786, !787, !788, !792, !793, !794, !795, !796, !798, !799, !800, !801, !802, !803, !804}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !752, file: !531, line: 610, baseType: !534, size: 4480)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !752, file: !531, line: 610, baseType: !756, size: 32, offset: 4480)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !364)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !752, file: !531, line: 611, baseType: !368, size: 32, offset: 4512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !752, file: !531, line: 611, baseType: !368, size: 32, offset: 4544)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !752, file: !531, line: 611, baseType: !368, size: 32, offset: 4576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !752, file: !531, line: 612, baseType: !368, size: 32, offset: 4608)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !752, file: !531, line: 613, baseType: !368, size: 32, offset: 4640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !752, file: !531, line: 614, baseType: !414, size: 64, offset: 4672)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !752, file: !531, line: 615, baseType: !416, size: 64, offset: 4736)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !752, file: !531, line: 616, baseType: !705, size: 64, offset: 4800)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !752, file: !531, line: 617, baseType: !414, size: 64, offset: 4864)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !752, file: !531, line: 618, baseType: !767, size: 64, offset: 4928)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !531, line: 602, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 598, size: 128, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !769, file: !531, line: 599, baseType: !368, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !769, file: !531, line: 600, baseType: !368, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !769, file: !531, line: 601, baseType: !431, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !752, file: !531, line: 619, baseType: !775, size: 64, offset: 4992)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !531, line: 607, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 604, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !777, file: !531, line: 605, baseType: !368, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !777, file: !531, line: 606, baseType: !431, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !752, file: !531, line: 620, baseType: !431, size: 64, offset: 5056)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !752, file: !531, line: 621, baseType: !423, size: 64, offset: 5120)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !752, file: !531, line: 622, baseType: !423, size: 64, offset: 5184)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !752, file: !531, line: 623, baseType: !557, size: 64, offset: 5248)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !752, file: !531, line: 623, baseType: !557, size: 64, offset: 5312)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !752, file: !531, line: 623, baseType: !557, size: 64, offset: 5376)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !752, file: !531, line: 624, baseType: !484, size: 32, offset: 5440)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !752, file: !531, line: 625, baseType: !789, size: 64, offset: 5504)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!322}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !752, file: !531, line: 626, baseType: !405, size: 64, offset: 5568)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !752, file: !531, line: 627, baseType: !557, size: 64, offset: 5632)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !752, file: !531, line: 628, baseType: !368, size: 32, offset: 5696)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !752, file: !531, line: 629, baseType: !345, size: 64, offset: 5760)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !752, file: !531, line: 630, baseType: !797, size: 32, offset: 5824)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !752, file: !531, line: 631, baseType: !368, size: 32, offset: 5856)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !752, file: !531, line: 631, baseType: !368, size: 32, offset: 5888)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !752, file: !531, line: 632, baseType: !484, size: 32, offset: 5920)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !752, file: !531, line: 633, baseType: !484, size: 32, offset: 5952)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !752, file: !531, line: 634, baseType: !356, size: 64, offset: 6016)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !752, file: !531, line: 634, baseType: !405, size: 64, offset: 6080)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !752, file: !531, line: 635, baseType: !376, size: 64, offset: 6144)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !537, file: !531, line: 100, baseType: !806, size: 64, offset: 3520)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!322, !528, !368, !368, !809, !812}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !811)
!811 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !537, file: !531, line: 101, baseType: !525, size: 64, offset: 3584)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !537, file: !531, line: 102, baseType: !815, size: 64, offset: 3648)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!322, !528, !574, !574, !608}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !537, file: !531, line: 103, baseType: !540, size: 64, offset: 3712)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !537, file: !531, line: 105, baseType: !820, size: 64, offset: 3776)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!322, !528, !574, !574, !607, !608}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !537, file: !531, line: 106, baseType: !525, size: 64, offset: 3840)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !537, file: !531, line: 107, baseType: !825, size: 64, offset: 3904)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!322, !528, !332}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !537, file: !531, line: 108, baseType: !829, size: 64, offset: 3968)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!322, !528, !832, !607, !608}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !345)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !537, file: !531, line: 109, baseType: !789, size: 64, offset: 4032)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !537, file: !531, line: 111, baseType: !835, size: 64, offset: 4096)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!322, !528, !528, !528, !423, !528}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !537, file: !531, line: 112, baseType: !839, size: 64, offset: 4160)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!322, !528, !528, !528, !528}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !537, file: !531, line: 113, baseType: !843, size: 64, offset: 4224)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!322, !528, !846, !846}
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !575, line: 30, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !575, line: 30, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !537, file: !531, line: 114, baseType: !540, size: 64, offset: 4288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !537, file: !531, line: 115, baseType: !656, size: 64, offset: 4352)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !537, file: !531, line: 117, baseType: !715, size: 64, offset: 4416)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !537, file: !531, line: 118, baseType: !715, size: 64, offset: 4480)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !537, file: !531, line: 119, baseType: !829, size: 64, offset: 4544)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !537, file: !531, line: 120, baseType: !855, size: 64, offset: 4608)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!322, !528, !858, !632}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !537, file: !531, line: 121, baseType: !789, size: 64, offset: 4672)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !537, file: !531, line: 123, baseType: !861, size: 64, offset: 4736)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!322, !528, !368, !405}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !537, file: !531, line: 124, baseType: !865, size: 64, offset: 4800)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!322, !528, !750, !557, !405}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !537, file: !531, line: 125, baseType: !869, size: 64, offset: 4864)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!322, !460, !528}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !537, file: !531, line: 126, baseType: !554, size: 64, offset: 4928)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !537, file: !531, line: 127, baseType: !554, size: 64, offset: 4992)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !537, file: !531, line: 129, baseType: !875, size: 64, offset: 5056)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!322, !528, !705}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !537, file: !531, line: 130, baseType: !879, size: 64, offset: 5120)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!322, !528, !882, !882}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !884, file: !60, line: 653, baseType: !368, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !884, file: !60, line: 653, baseType: !557, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !537, file: !531, line: 131, baseType: !879, size: 64, offset: 5184)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !537, file: !531, line: 132, baseType: !890, size: 64, offset: 5248)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!322, !528, !414, !414, !414}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !537, file: !531, line: 133, baseType: !825, size: 64, offset: 5312)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !537, file: !531, line: 135, baseType: !895, size: 64, offset: 5376)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!322, !528, !423, !632}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !537, file: !531, line: 136, baseType: !895, size: 64, offset: 5440)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !537, file: !531, line: 137, baseType: !900, size: 64, offset: 5504)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!322, !528, !632}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !537, file: !531, line: 138, baseType: !540, size: 64, offset: 5568)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !537, file: !531, line: 139, baseType: !905, size: 64, offset: 5632)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!322, !528, !908, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !537, file: !531, line: 141, baseType: !789, size: 64, offset: 5696)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !537, file: !531, line: 142, baseType: !911, size: 64, offset: 5760)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!322, !528, !528, !423, !528}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !537, file: !531, line: 143, baseType: !915, size: 64, offset: 5824)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!322, !528, !528, !528}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !537, file: !531, line: 144, baseType: !789, size: 64, offset: 5888)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !537, file: !531, line: 145, baseType: !911, size: 64, offset: 5952)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !537, file: !531, line: 147, baseType: !915, size: 64, offset: 6016)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !537, file: !531, line: 148, baseType: !789, size: 64, offset: 6080)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !537, file: !531, line: 149, baseType: !911, size: 64, offset: 6144)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !537, file: !531, line: 150, baseType: !915, size: 64, offset: 6208)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !537, file: !531, line: 151, baseType: !925, size: 64, offset: 6272)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!322, !528, !484}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !537, file: !531, line: 153, baseType: !525, size: 64, offset: 6336)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !537, file: !531, line: 154, baseType: !525, size: 64, offset: 6400)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !537, file: !531, line: 155, baseType: !525, size: 64, offset: 6464)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !537, file: !531, line: 156, baseType: !525, size: 64, offset: 6528)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !537, file: !531, line: 157, baseType: !825, size: 64, offset: 6592)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !537, file: !531, line: 159, baseType: !934, size: 64, offset: 6656)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!322, !528, !368, !545}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !537, file: !531, line: 160, baseType: !525, size: 64, offset: 6720)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !537, file: !531, line: 161, baseType: !525, size: 64, offset: 6784)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !537, file: !531, line: 162, baseType: !525, size: 64, offset: 6848)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !537, file: !531, line: 163, baseType: !525, size: 64, offset: 6912)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !537, file: !531, line: 165, baseType: !915, size: 64, offset: 6976)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !537, file: !531, line: 166, baseType: !915, size: 64, offset: 7040)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !537, file: !531, line: 167, baseType: !715, size: 64, offset: 7104)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !537, file: !531, line: 168, baseType: !945, size: 64, offset: 7168)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!322, !528, !557, !368}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !537, file: !531, line: 169, baseType: !949, size: 64, offset: 7232)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!322, !528, !632, !414}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !537, file: !531, line: 171, baseType: !676, size: 64, offset: 7296)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !537, file: !531, line: 172, baseType: !525, size: 64, offset: 7360)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !537, file: !531, line: 173, baseType: !955, size: 64, offset: 7424)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!322, !528, !414, !739}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !537, file: !531, line: 174, baseType: !815, size: 64, offset: 7488)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !537, file: !531, line: 175, baseType: !815, size: 64, offset: 7552)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !537, file: !531, line: 177, baseType: !554, size: 64, offset: 7616)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !537, file: !531, line: 178, baseType: !604, size: 64, offset: 7680)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !537, file: !531, line: 179, baseType: !554, size: 64, offset: 7744)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !537, file: !531, line: 180, baseType: !561, size: 64, offset: 7808)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !537, file: !531, line: 181, baseType: !965, size: 64, offset: 7872)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!322, !528, !324, !607, !608}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !537, file: !531, line: 183, baseType: !875, size: 64, offset: 7936)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !537, file: !531, line: 184, baseType: !639, size: 64, offset: 8000)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !537, file: !531, line: 185, baseType: !971, size: 64, offset: 8064)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!322, !528, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !537, file: !531, line: 186, baseType: !976, size: 64, offset: 8128)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!322, !528, !368, !543, !431}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !537, file: !531, line: 187, baseType: !695, size: 64, offset: 8192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !537, file: !531, line: 189, baseType: !981, size: 64, offset: 8256)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!322, !528, !368, !368, !414, !545}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !537, file: !531, line: 190, baseType: !789, size: 64, offset: 8320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !537, file: !531, line: 191, baseType: !911, size: 64, offset: 8384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !537, file: !531, line: 192, baseType: !915, size: 64, offset: 8448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !537, file: !531, line: 193, baseType: !988, size: 64, offset: 8512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!322, !528, !747, !991}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !531, line: 660, size: 5312, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !993, file: !531, line: 661, baseType: !534, size: 4480)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !993, file: !531, line: 661, baseType: !756, size: 32, offset: 4480)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !993, file: !531, line: 662, baseType: !368, size: 32, offset: 4512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !993, file: !531, line: 662, baseType: !368, size: 32, offset: 4544)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !993, file: !531, line: 662, baseType: !368, size: 32, offset: 4576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !993, file: !531, line: 663, baseType: !368, size: 32, offset: 4608)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !993, file: !531, line: 664, baseType: !368, size: 32, offset: 4640)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !993, file: !531, line: 665, baseType: !414, size: 64, offset: 4672)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !993, file: !531, line: 666, baseType: !414, size: 64, offset: 4736)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !993, file: !531, line: 667, baseType: !368, size: 32, offset: 4800)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !993, file: !531, line: 668, baseType: !797, size: 32, offset: 4832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !993, file: !531, line: 670, baseType: !414, size: 64, offset: 4864)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !993, file: !531, line: 670, baseType: !414, size: 64, offset: 4928)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !993, file: !531, line: 671, baseType: !414, size: 64, offset: 4992)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !993, file: !531, line: 672, baseType: !414, size: 64, offset: 5056)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !993, file: !531, line: 673, baseType: !414, size: 64, offset: 5120)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !993, file: !531, line: 674, baseType: !368, size: 32, offset: 5184)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !993, file: !531, line: 675, baseType: !414, size: 64, offset: 5248)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !537, file: !531, line: 195, baseType: !1014, size: 64, offset: 8576)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!322, !991, !528, !528}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !537, file: !531, line: 196, baseType: !1014, size: 64, offset: 8640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !537, file: !531, line: 197, baseType: !789, size: 64, offset: 8704)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !537, file: !531, line: 198, baseType: !911, size: 64, offset: 8768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !537, file: !531, line: 199, baseType: !915, size: 64, offset: 8832)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !537, file: !531, line: 201, baseType: !1022, size: 64, offset: 8896)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!322, !528, !368, !368}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !537, file: !531, line: 202, baseType: !690, size: 64, offset: 8960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !537, file: !531, line: 203, baseType: !561, size: 64, offset: 9024)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !537, file: !531, line: 204, baseType: !744, size: 64, offset: 9088)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !537, file: !531, line: 205, baseType: !875, size: 64, offset: 9152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !537, file: !531, line: 206, baseType: !1030, size: 64, offset: 9216)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!322, !324, !528, !368, !607, !608}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !537, file: !531, line: 208, baseType: !1034, size: 64, offset: 9280)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!322, !368, !700}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !537, file: !531, line: 209, baseType: !915, size: 64, offset: 9344)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !537, file: !531, line: 210, baseType: !707, size: 64, offset: 9408)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !530, file: !531, line: 438, baseType: !1040, size: 64, offset: 13952)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !575, line: 60, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1042, file: !114, line: 241, baseType: !324, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !114, line: 242, baseType: !385, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1042, file: !114, line: 243, baseType: !368, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1042, file: !114, line: 243, baseType: !368, size: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1042, file: !114, line: 244, baseType: !368, size: 32, offset: 160)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1042, file: !114, line: 244, baseType: !368, size: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1042, file: !114, line: 245, baseType: !414, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1042, file: !114, line: 246, baseType: !484, size: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1042, file: !114, line: 247, baseType: !368, size: 32, offset: 352)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1042, file: !114, line: 251, baseType: !368, size: 32, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1042, file: !114, line: 252, baseType: !846, size: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1042, file: !114, line: 253, baseType: !484, size: 32, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1042, file: !114, line: 254, baseType: !368, size: 32, offset: 544)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1042, file: !114, line: 254, baseType: !368, size: 32, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1042, file: !114, line: 255, baseType: !368, size: 32, offset: 608)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !530, file: !531, line: 438, baseType: !1040, size: 64, offset: 14016)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !531, line: 439, baseType: !405, size: 64, offset: 14080)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !530, file: !531, line: 440, baseType: !1062, size: 32, offset: 14144)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !530, file: !531, line: 441, baseType: !484, size: 32, offset: 14176)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !530, file: !531, line: 442, baseType: !484, size: 32, offset: 14208)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !530, file: !531, line: 443, baseType: !1066, size: 448, offset: 14272)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 448, elements: !1068)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !345)
!1068 = !{!1069}
!1069 = !DISubrange(count: 7)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !530, file: !531, line: 444, baseType: !484, size: 32, offset: 14720)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !530, file: !531, line: 445, baseType: !484, size: 32, offset: 14752)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !530, file: !531, line: 446, baseType: !368, size: 32, offset: 14784)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !530, file: !531, line: 447, baseType: !407, size: 64, offset: 14848)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !530, file: !531, line: 448, baseType: !407, size: 64, offset: 14912)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !530, file: !531, line: 449, baseType: !615, size: 640, offset: 14976)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !530, file: !531, line: 450, baseType: !547, size: 32, offset: 15616)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !530, file: !531, line: 451, baseType: !1078, size: 2880, offset: 15680)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !531, line: 318, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !531, line: 319, size: 2880, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1100, !1101, !1106, !1111, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1126, !1127, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1159, !1160, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1183, !1184, !1185, !1189, !1190}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1079, file: !531, line: 320, baseType: !368, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1079, file: !531, line: 321, baseType: !368, size: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1079, file: !531, line: 322, baseType: !368, size: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1079, file: !531, line: 323, baseType: !368, size: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1079, file: !531, line: 324, baseType: !368, size: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1079, file: !531, line: 325, baseType: !368, size: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1079, file: !531, line: 326, baseType: !1088, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !531, line: 293, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !531, line: 295, size: 448, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !531, line: 296, baseType: !1088, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1090, file: !531, line: 297, baseType: !431, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1090, file: !531, line: 297, baseType: !431, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1090, file: !531, line: 298, baseType: !414, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1090, file: !531, line: 298, baseType: !414, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1090, file: !531, line: 299, baseType: !368, size: 32, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1090, file: !531, line: 300, baseType: !368, size: 32, offset: 352)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1090, file: !531, line: 301, baseType: !368, size: 32, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1079, file: !531, line: 326, baseType: !1088, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1079, file: !531, line: 328, baseType: !1102, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!322, !528, !1105, !414}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1079, file: !531, line: 329, baseType: !1107, size: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!322, !1105, !1110, !416, !416, !434, !414}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1079, file: !531, line: 330, baseType: !1112, size: 64, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!322, !1105}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1079, file: !531, line: 331, baseType: !1112, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1079, file: !531, line: 334, baseType: !324, size: 64, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !531, line: 335, baseType: !385, size: 32, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1079, file: !531, line: 335, baseType: !385, size: 32, offset: 672)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1079, file: !531, line: 336, baseType: !385, size: 32, offset: 704)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1079, file: !531, line: 336, baseType: !385, size: 32, offset: 736)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1079, file: !531, line: 337, baseType: !1122, size: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !325, line: 339, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !325, line: 339, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1079, file: !531, line: 338, baseType: !1122, size: 64, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1079, file: !531, line: 339, baseType: !1128, size: 64, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !325, line: 341, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !325, line: 351, size: 192, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1130, file: !325, line: 354, baseType: !72, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1130, file: !325, line: 355, baseType: !72, size: 32, offset: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1130, file: !325, line: 356, baseType: !72, size: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1130, file: !325, line: 361, baseType: !72, size: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1130, file: !325, line: 362, baseType: !480, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1079, file: !531, line: 340, baseType: !368, size: 32, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1079, file: !531, line: 340, baseType: !368, size: 32, offset: 992)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1079, file: !531, line: 341, baseType: !431, size: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1079, file: !531, line: 342, baseType: !414, size: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1079, file: !531, line: 343, baseType: !434, size: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1079, file: !531, line: 344, baseType: !416, size: 64, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1079, file: !531, line: 345, baseType: !368, size: 32, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1079, file: !531, line: 346, baseType: !1110, size: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1079, file: !531, line: 347, baseType: !484, size: 32, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1079, file: !531, line: 348, baseType: !368, size: 32, offset: 1440)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1079, file: !531, line: 351, baseType: !484, size: 32, offset: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1079, file: !531, line: 352, baseType: !484, size: 32, offset: 1504)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1079, file: !531, line: 353, baseType: !385, size: 32, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1079, file: !531, line: 354, baseType: !385, size: 32, offset: 1568)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1079, file: !531, line: 355, baseType: !1110, size: 64, offset: 1600)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1079, file: !531, line: 356, baseType: !1110, size: 64, offset: 1664)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1079, file: !531, line: 357, baseType: !1154, size: 64, offset: 1728)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !531, line: 310, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 308, size: 32, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1156, file: !531, line: 309, baseType: !368, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1079, file: !531, line: 357, baseType: !1154, size: 64, offset: 1792)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1079, file: !531, line: 358, baseType: !1161, size: 64, offset: 1856)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !531, line: 316, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 312, size: 128, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1163, file: !531, line: 313, baseType: !405, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1163, file: !531, line: 314, baseType: !368, size: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1163, file: !531, line: 315, baseType: !347, size: 8, offset: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1079, file: !531, line: 359, baseType: !1161, size: 64, offset: 1920)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1079, file: !531, line: 360, baseType: !1161, size: 64, offset: 1984)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1079, file: !531, line: 361, baseType: !368, size: 32, offset: 2048)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1079, file: !531, line: 362, baseType: !385, size: 32, offset: 2080)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1079, file: !531, line: 363, baseType: !368, size: 32, offset: 2112)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1079, file: !531, line: 364, baseType: !1110, size: 64, offset: 2176)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1079, file: !531, line: 365, baseType: !1128, size: 64, offset: 2240)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1079, file: !531, line: 366, baseType: !385, size: 32, offset: 2304)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1079, file: !531, line: 367, baseType: !385, size: 32, offset: 2336)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1079, file: !531, line: 368, baseType: !1122, size: 64, offset: 2368)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1079, file: !531, line: 369, baseType: !1122, size: 64, offset: 2432)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1079, file: !531, line: 370, baseType: !1180, size: 64, offset: 2496)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1079, file: !531, line: 371, baseType: !1180, size: 64, offset: 2560)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1079, file: !531, line: 372, baseType: !1180, size: 64, offset: 2624)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1079, file: !531, line: 373, baseType: !1186, size: 64, offset: 2688)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !325, line: 331, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !325, line: 331, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1079, file: !531, line: 374, baseType: !480, size: 64, offset: 2752)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1079, file: !531, line: 375, baseType: !1191, size: 64, offset: 2816)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !530, file: !531, line: 451, baseType: !1078, size: 2880, offset: 18560)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !530, file: !531, line: 452, baseType: !1194, size: 64, offset: 21440)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !531, line: 681, size: 4864, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1204, !1208}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1196, file: !531, line: 682, baseType: !534, size: 4480)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1196, file: !531, line: 682, baseType: !756, size: 32, offset: 4480)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1196, file: !531, line: 683, baseType: !484, size: 32, offset: 4512)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1196, file: !531, line: 684, baseType: !368, size: 32, offset: 4544)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1196, file: !531, line: 685, baseType: !908, size: 64, offset: 4608)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1196, file: !531, line: 686, baseType: !431, size: 64, offset: 4672)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1196, file: !531, line: 687, baseType: !1205, size: 64, offset: 4736)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!322, !1194, !557, !405}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1196, file: !531, line: 688, baseType: !405, size: 64, offset: 4800)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !530, file: !531, line: 453, baseType: !1194, size: 64, offset: 21504)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !530, file: !531, line: 454, baseType: !1194, size: 64, offset: 21568)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !530, file: !531, line: 455, baseType: !368, size: 32, offset: 21632)
