; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/sor/sor.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/sor/sor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque

!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1288, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!56 = !DIEnumerator(name: "SOR_FORWARD_SWEEP", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SOR_BACKWARD_SWEEP", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SOR_SYMMETRIC_SWEEP", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "SOR_LOCAL_FORWARD_SWEEP", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "SOR_LOCAL_BACKWARD_SWEEP", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "SOR_LOCAL_SYMMETRIC_SWEEP", value: 12, isUnsigned: true)
!62 = !DIEnumerator(name: "SOR_ZERO_INITIAL_GUESS", value: 16, isUnsigned: true)
!63 = !DIEnumerator(name: "SOR_EISENSTAT", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "SOR_APPLY_UPPER", value: 64, isUnsigned: true)
!65 = !DIEnumerator(name: "SOR_APPLY_LOWER", value: 128, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!99 = !{!100, !114, !118, !119, !122, !112, !319, !192, !322, !325, !202, !26, !285, !320, !5, !109, !328}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_SOR", file: !102, line: 12, baseType: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/sor/sor.c", directory: "/home/users/ndemeye/xSDK")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 6, size: 256, elements: !104)
!104 = !{!105, !107, !108, !110, !113}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !103, file: !102, line: 7, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "lits", scope: !103, file: !102, line: 8, baseType: !106, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !103, file: !102, line: 9, baseType: !109, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !39, line: 1291, baseType: !54)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !103, file: !102, line: 10, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !112)
!112 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !103, file: !102, line: 11, baseType: !111, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !115, line: 330, baseType: !116)
!115 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !115, line: 330, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !125, line: 73, size: 4480, elements: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!126 = !{!127, !129, !175, !176, !177, !179, !180, !181, !182, !190, !191, !193, !197, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !218, !219, !221, !223, !224, !225, !226, !227, !229, !231, !232, !233, !234, !235, !238, !240, !241, !242, !252, !254, !255, !259, !260, !309, !314, !316, !317, !318}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !124, file: !125, line: 74, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !124, file: !125, line: 75, baseType: !130, size: 448, offset: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 448, elements: !173)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !125, line: 53, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 45, size: 448, elements: !133)
!133 = !{!134, !140, !148, !153, !157, !161, !168}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !132, file: !125, line: 46, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !122, !139}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !132, file: !125, line: 47, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!138, !122, !144}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !145, line: 16, baseType: !146)
!145 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !145, line: 16, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !132, file: !125, line: 48, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!138, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !132, file: !125, line: 49, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!138, !122, !119, !122}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !132, file: !125, line: 50, baseType: !158, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!138, !122, !119, !152}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !132, file: !125, line: 51, baseType: !162, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!138, !122, !119, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !132, file: !125, line: 52, baseType: !169, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!138, !122, !119, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!173 = !{!174}
!174 = !DISubrange(count: 1)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !124, file: !125, line: 76, baseType: !114, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !125, line: 77, baseType: !106, size: 32, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !124, file: !125, line: 78, baseType: !178, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !124, file: !125, line: 78, baseType: !178, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !124, file: !125, line: 78, baseType: !178, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !124, file: !125, line: 78, baseType: !178, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !124, file: !125, line: 79, baseType: !183, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !186, line: 27, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !188, line: 43, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!189 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !124, file: !125, line: 80, baseType: !106, size: 32, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !124, file: !125, line: 81, baseType: !192, size: 32, offset: 992)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !124, file: !125, line: 82, baseType: !194, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !124, file: !125, line: 83, baseType: !198, size: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !124, file: !125, line: 84, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !124, file: !125, line: 85, baseType: !202, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !124, file: !125, line: 86, baseType: !202, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !124, file: !125, line: 87, baseType: !202, size: 64, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !124, file: !125, line: 88, baseType: !122, size: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !124, file: !125, line: 89, baseType: !183, size: 64, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !125, line: 90, baseType: !202, size: 64, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !124, file: !125, line: 91, baseType: !202, size: 64, offset: 1600)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !124, file: !125, line: 92, baseType: !106, size: 32, offset: 1664)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !124, file: !125, line: 93, baseType: !118, size: 64, offset: 1728)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !124, file: !125, line: 94, baseType: !213, size: 64, offset: 1792)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !124, file: !125, line: 95, baseType: !106, size: 32, offset: 1856)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !124, file: !125, line: 95, baseType: !106, size: 32, offset: 1888)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !124, file: !125, line: 96, baseType: !217, size: 64, offset: 1920)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !124, file: !125, line: 96, baseType: !217, size: 64, offset: 1984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !124, file: !125, line: 97, baseType: !220, size: 64, offset: 2048)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !124, file: !125, line: 97, baseType: !222, size: 64, offset: 2112)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !124, file: !125, line: 98, baseType: !106, size: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !124, file: !125, line: 98, baseType: !106, size: 32, offset: 2208)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !124, file: !125, line: 99, baseType: !217, size: 64, offset: 2240)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !124, file: !125, line: 99, baseType: !217, size: 64, offset: 2304)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !124, file: !125, line: 100, baseType: !228, size: 64, offset: 2368)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !124, file: !125, line: 100, baseType: !230, size: 64, offset: 2432)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !124, file: !125, line: 101, baseType: !106, size: 32, offset: 2496)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !124, file: !125, line: 101, baseType: !106, size: 32, offset: 2528)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !124, file: !125, line: 102, baseType: !217, size: 64, offset: 2560)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !124, file: !125, line: 102, baseType: !217, size: 64, offset: 2624)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !124, file: !125, line: 103, baseType: !236, size: 64, offset: 2688)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !111)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !124, file: !125, line: 103, baseType: !239, size: 64, offset: 2752)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !124, file: !125, line: 104, baseType: !172, size: 64, offset: 2816)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !124, file: !125, line: 105, baseType: !106, size: 32, offset: 2880)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !124, file: !125, line: 106, baseType: !243, size: 128, offset: 2944)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !250)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !125, line: 64, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 61, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !246, file: !125, line: 62, baseType: !165, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !246, file: !125, line: 63, baseType: !118, size: 64, offset: 64)
!250 = !{!251}
!251 = !DISubrange(count: 2)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !124, file: !125, line: 107, baseType: !253, size: 64, offset: 3072)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !124, file: !125, line: 108, baseType: !118, size: 64, offset: 3136)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !124, file: !125, line: 109, baseType: !256, size: 64, offset: 3200)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!138, !118}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !124, file: !125, line: 111, baseType: !106, size: 32, offset: 3264)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !124, file: !125, line: 112, baseType: !261, size: 320, offset: 3328)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !307)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!138, !265, !122, !118}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !268)
!268 = !{!269, !270, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !267, file: !10, line: 100, baseType: !106, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !10, line: 101, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !282, !283, !284, !288, !290, !292, !293, !294}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !273, file: !10, line: 84, baseType: !202, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !273, file: !10, line: 85, baseType: !202, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !10, line: 86, baseType: !118, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !273, file: !10, line: 87, baseType: !194, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !273, file: !10, line: 88, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !273, file: !10, line: 89, baseType: !121, size: 8, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !273, file: !10, line: 90, baseType: !202, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !273, file: !10, line: 91, baseType: !285, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !286, line: 46, baseType: !287)
!286 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!287 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !273, file: !10, line: 92, baseType: !289, size: 32, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !10, line: 93, baseType: !291, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !10, line: 94, baseType: !271, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !273, file: !10, line: 95, baseType: !202, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !273, file: !10, line: 96, baseType: !118, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !267, file: !10, line: 102, baseType: !202, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !267, file: !10, line: 102, baseType: !202, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !267, file: !10, line: 103, baseType: !202, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !267, file: !10, line: 104, baseType: !114, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !267, file: !10, line: 105, baseType: !289, size: 32, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !267, file: !10, line: 105, baseType: !289, size: 32, offset: 416)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !267, file: !10, line: 105, baseType: !289, size: 32, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !267, file: !10, line: 106, baseType: !122, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !267, file: !10, line: 107, baseType: !304, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!307 = !{!308}
!308 = !DISubrange(count: 5)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !124, file: !125, line: 113, baseType: !310, size: 320, offset: 3648)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 320, elements: !307)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!138, !122, !118}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !124, file: !125, line: 114, baseType: !315, size: 320, offset: 3968)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 320, elements: !307)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !124, file: !125, line: 115, baseType: !289, size: 32, offset: 4288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !124, file: !125, line: 120, baseType: !304, size: 64, offset: 4352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !124, file: !125, line: 121, baseType: !289, size: 32, offset: 4416)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !321, line: 1451, baseType: !165)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !115, line: 331, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !115, line: 331, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !115, line: 338, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !115, line: 338, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !39, line: 1203, baseType: !92)
!330 = !{i32 7, !"Dwarf Version", i32 4}
!331 = !{i32 2, !"Debug Info Version", i32 3}
!332 = !{i32 1, !"wchar_size", i32 4}
!333 = !{i32 7, !"PIC Level", i32 2}
!334 = !{i32 7, !"uwtable", i32 1}
!335 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!336 = distinct !DISubprogram(name: "PCSetFromOptions_SOR", scope: !102, file: !102, line: 66, type: !337, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !447)
!337 = !DISubroutineType(types: !338)
!338 = !{!138, !265, !339}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !342, line: 37, size: 6720, elements: !343)
!342 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!343 = !{!344, !346, !411, !416, !417, !418, !419, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !440, !441, !442, !443, !444, !446}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !341, file: !342, line: 38, baseType: !345, size: 4480)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !125, line: 122, baseType: !124)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !341, file: !342, line: 38, baseType: !347, size: 1152, offset: 4480)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 1152, elements: !173)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !342, line: 13, size: 1152, elements: !349)
!349 = !{!350, !354, !362, !369, !375, !380, !381, !385, !387, !395, !396, !401, !402, !403, !404, !405, !409, !410}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !348, file: !342, line: 14, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!138, !339}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !348, file: !342, line: 15, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!138, !339, !358, !358}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !359, line: 21, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !359, line: 21, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !348, file: !342, line: 16, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!138, !339, !366, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !348, file: !342, line: 17, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!138, !339, !358, !358, !358, !111, !111, !111, !106, !289, !220, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !348, file: !342, line: 18, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!138, !339, !379, !358, !358, !358}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !348, file: !342, line: 19, baseType: !355, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !348, file: !342, line: 20, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!138, !339, !106, !358, !358, !358}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !348, file: !342, line: 21, baseType: !386, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !348, file: !342, line: 22, baseType: !388, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!138, !339, !391, !358, !358}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !392, line: 22, baseType: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !392, line: 22, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !348, file: !342, line: 23, baseType: !388, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !348, file: !342, line: 24, baseType: !397, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!138, !339, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !348, file: !342, line: 25, baseType: !355, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !348, file: !342, line: 26, baseType: !355, size: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !348, file: !342, line: 27, baseType: !351, size: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !348, file: !342, line: 28, baseType: !351, size: 64, offset: 896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !348, file: !342, line: 29, baseType: !406, size: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!138, !339, !144}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !348, file: !342, line: 30, baseType: !351, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !348, file: !342, line: 31, baseType: !406, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !341, file: !342, line: 39, baseType: !412, size: 64, offset: 5632)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !413, line: 14, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !413, line: 14, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !341, file: !342, line: 40, baseType: !106, size: 32, offset: 5696)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !341, file: !342, line: 41, baseType: !213, size: 64, offset: 5760)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !341, file: !342, line: 41, baseType: !213, size: 64, offset: 5824)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !341, file: !342, line: 42, baseType: !289, size: 32, offset: 5888)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !342, line: 43, baseType: !421, size: 32, offset: 5920)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !341, file: !342, line: 45, baseType: !106, size: 32, offset: 5952)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !341, file: !342, line: 46, baseType: !289, size: 32, offset: 5984)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !341, file: !342, line: 47, baseType: !366, size: 64, offset: 6016)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !341, file: !342, line: 47, baseType: !366, size: 64, offset: 6080)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !341, file: !342, line: 48, baseType: !358, size: 64, offset: 6144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !341, file: !342, line: 48, baseType: !358, size: 64, offset: 6208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !341, file: !342, line: 49, baseType: !289, size: 32, offset: 6272)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !341, file: !342, line: 50, baseType: !289, size: 32, offset: 6304)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !341, file: !342, line: 51, baseType: !431, size: 64, offset: 6336)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!138, !339, !106, !434, !434, !400, !118}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !437, line: 11, baseType: !438)
!437 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !437, line: 11, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !341, file: !342, line: 52, baseType: !118, size: 64, offset: 6400)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !342, line: 53, baseType: !118, size: 64, offset: 6464)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !341, file: !342, line: 54, baseType: !106, size: 32, offset: 6528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !341, file: !342, line: 55, baseType: !118, size: 64, offset: 6592)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !341, file: !342, line: 56, baseType: !445, size: 32, offset: 6656)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !341, file: !342, line: 57, baseType: !445, size: 32, offset: 6688)
!447 = !{!448, !449, !450, !451, !452, !453, !455, !457, !459, !461, !463, !465, !469, !471, !475, !477, !481, !483, !487, !489, !493, !495, !499}
!448 = !DILocalVariable(name: "PetscOptionsObject", arg: 1, scope: !336, file: !102, line: 66, type: !265)
!449 = !DILocalVariable(name: "pc", arg: 2, scope: !336, file: !102, line: 66, type: !339)
!450 = !DILocalVariable(name: "jac", scope: !336, file: !102, line: 68, type: !100)
!451 = !DILocalVariable(name: "ierr", scope: !336, file: !102, line: 69, type: !138)
!452 = !DILocalVariable(name: "flg", scope: !336, file: !102, line: 70, type: !289)
!453 = !DILocalVariable(name: "ierr__", scope: !454, file: !102, line: 73, type: !138)
!454 = distinct !DILexicalBlock(scope: !336, file: !102, line: 73, column: 64)
!455 = !DILocalVariable(name: "ierr__", scope: !456, file: !102, line: 74, type: !138)
!456 = distinct !DILexicalBlock(scope: !336, file: !102, line: 74, column: 124)
!457 = !DILocalVariable(name: "ierr__", scope: !458, file: !102, line: 75, type: !138)
!458 = distinct !DILexicalBlock(scope: !336, file: !102, line: 75, column: 116)
!459 = !DILocalVariable(name: "ierr__", scope: !460, file: !102, line: 76, type: !138)
!460 = distinct !DILexicalBlock(scope: !336, file: !102, line: 76, column: 119)
!461 = !DILocalVariable(name: "ierr__", scope: !462, file: !102, line: 77, type: !138)
!462 = distinct !DILexicalBlock(scope: !336, file: !102, line: 77, column: 128)
!463 = !DILocalVariable(name: "ierr__", scope: !464, file: !102, line: 78, type: !138)
!464 = distinct !DILexicalBlock(scope: !336, file: !102, line: 78, column: 99)
!465 = !DILocalVariable(name: "ierr__", scope: !466, file: !102, line: 79, type: !138)
!466 = distinct !DILexicalBlock(scope: !467, file: !102, line: 79, column: 62)
!467 = distinct !DILexicalBlock(scope: !468, file: !102, line: 79, column: 12)
!468 = distinct !DILexicalBlock(scope: !336, file: !102, line: 79, column: 7)
!469 = !DILocalVariable(name: "ierr__", scope: !470, file: !102, line: 80, type: !138)
!470 = distinct !DILexicalBlock(scope: !336, file: !102, line: 80, column: 117)
!471 = !DILocalVariable(name: "ierr__", scope: !472, file: !102, line: 81, type: !138)
!472 = distinct !DILexicalBlock(scope: !473, file: !102, line: 81, column: 61)
!473 = distinct !DILexicalBlock(scope: !474, file: !102, line: 81, column: 12)
!474 = distinct !DILexicalBlock(scope: !336, file: !102, line: 81, column: 7)
!475 = !DILocalVariable(name: "ierr__", scope: !476, file: !102, line: 82, type: !138)
!476 = distinct !DILexicalBlock(scope: !336, file: !102, line: 82, column: 96)
!477 = !DILocalVariable(name: "ierr__", scope: !478, file: !102, line: 83, type: !138)
!478 = distinct !DILexicalBlock(scope: !479, file: !102, line: 83, column: 60)
!479 = distinct !DILexicalBlock(scope: !480, file: !102, line: 83, column: 12)
!480 = distinct !DILexicalBlock(scope: !336, file: !102, line: 83, column: 7)
!481 = !DILocalVariable(name: "ierr__", scope: !482, file: !102, line: 84, type: !138)
!482 = distinct !DILexicalBlock(scope: !336, file: !102, line: 84, column: 124)
!483 = !DILocalVariable(name: "ierr__", scope: !484, file: !102, line: 85, type: !138)
!484 = distinct !DILexicalBlock(scope: !485, file: !102, line: 85, column: 68)
!485 = distinct !DILexicalBlock(scope: !486, file: !102, line: 85, column: 12)
!486 = distinct !DILexicalBlock(scope: !336, file: !102, line: 85, column: 7)
!487 = !DILocalVariable(name: "ierr__", scope: !488, file: !102, line: 86, type: !138)
!488 = distinct !DILexicalBlock(scope: !336, file: !102, line: 86, column: 112)
!489 = !DILocalVariable(name: "ierr__", scope: !490, file: !102, line: 87, type: !138)
!490 = distinct !DILexicalBlock(scope: !491, file: !102, line: 87, column: 67)
!491 = distinct !DILexicalBlock(scope: !492, file: !102, line: 87, column: 12)
!492 = distinct !DILexicalBlock(scope: !336, file: !102, line: 87, column: 7)
