; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/interface/tagger.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/interface/tagger.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 624, baseType: !5, size: 32, elements: !90)
!89 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!100 = !{!101, !104, !105, !108, !309, !310, !144, !311, !184, !314, !317, !194, !115, !279, !5}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !89, line: 330, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !89, line: 330, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !111, line: 73, size: 4480, elements: !112)
!111 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!112 = !{!113, !116, !165, !166, !168, !171, !172, !173, !174, !182, !183, !185, !189, !193, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206, !207, !208, !210, !211, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !227, !228, !231, !233, !234, !235, !245, !247, !248, !252, !253, !299, !304, !306, !307, !308}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !110, file: !111, line: 74, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !115)
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !110, file: !111, line: 75, baseType: !117, size: 448, offset: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 448, elements: !163)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !111, line: 53, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 45, size: 448, elements: !120)
!120 = !{!121, !127, !135, !140, !147, !151, !158}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !119, file: !111, line: 46, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !108, !126}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !115)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !119, file: !111, line: 47, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!125, !108, !131}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !132, line: 16, baseType: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !132, line: 16, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !119, file: !111, line: 48, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!125, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !119, file: !111, line: 49, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!125, !108, !144, !108}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !119, file: !111, line: 50, baseType: !148, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!125, !108, !144, !139}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !119, file: !111, line: 51, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!125, !108, !144, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !119, file: !111, line: 52, baseType: !159, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!125, !108, !144, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!163 = !{!164}
!164 = !DISubrange(count: 1)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !110, file: !111, line: 76, baseType: !101, size: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !111, line: 77, baseType: !167, size: 32, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !115)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !110, file: !111, line: 78, baseType: !169, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !170)
!170 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !110, file: !111, line: 78, baseType: !169, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !110, file: !111, line: 78, baseType: !169, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !110, file: !111, line: 78, baseType: !169, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 79, baseType: !175, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !178, line: 27, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !180, line: 43, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !110, file: !111, line: 80, baseType: !167, size: 32, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !110, file: !111, line: 81, baseType: !184, size: 32, offset: 992)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !115)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !110, file: !111, line: 82, baseType: !186, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !110, file: !111, line: 83, baseType: !190, size: 64, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !110, file: !111, line: 84, baseType: !194, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !110, file: !111, line: 85, baseType: !194, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !110, file: !111, line: 86, baseType: !194, size: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !110, file: !111, line: 87, baseType: !194, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !110, file: !111, line: 88, baseType: !108, size: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !110, file: !111, line: 89, baseType: !175, size: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 90, baseType: !194, size: 64, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !110, file: !111, line: 91, baseType: !194, size: 64, offset: 1600)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !110, file: !111, line: 92, baseType: !167, size: 32, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !110, file: !111, line: 93, baseType: !104, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !110, file: !111, line: 94, baseType: !205, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !176)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !110, file: !111, line: 95, baseType: !167, size: 32, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !110, file: !111, line: 95, baseType: !167, size: 32, offset: 1888)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !110, file: !111, line: 96, baseType: !209, size: 64, offset: 1920)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !110, file: !111, line: 96, baseType: !209, size: 64, offset: 1984)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !110, file: !111, line: 97, baseType: !212, size: 64, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !110, file: !111, line: 97, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !110, file: !111, line: 98, baseType: !167, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !110, file: !111, line: 98, baseType: !167, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !110, file: !111, line: 99, baseType: !209, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !110, file: !111, line: 99, baseType: !209, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !110, file: !111, line: 100, baseType: !220, size: 64, offset: 2368)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !170)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !110, file: !111, line: 100, baseType: !223, size: 64, offset: 2432)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !110, file: !111, line: 101, baseType: !167, size: 32, offset: 2496)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !110, file: !111, line: 101, baseType: !167, size: 32, offset: 2528)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !110, file: !111, line: 102, baseType: !209, size: 64, offset: 2560)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !110, file: !111, line: 102, baseType: !209, size: 64, offset: 2624)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !110, file: !111, line: 103, baseType: !229, size: 64, offset: 2688)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !221)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !110, file: !111, line: 103, baseType: !232, size: 64, offset: 2752)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !110, file: !111, line: 104, baseType: !162, size: 64, offset: 2816)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !110, file: !111, line: 105, baseType: !167, size: 32, offset: 2880)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !110, file: !111, line: 106, baseType: !236, size: 128, offset: 2944)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 128, elements: !243)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !111, line: 64, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 61, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !239, file: !111, line: 62, baseType: !155, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !239, file: !111, line: 63, baseType: !104, size: 64, offset: 64)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !110, file: !111, line: 107, baseType: !246, size: 64, offset: 3072)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !110, file: !111, line: 108, baseType: !104, size: 64, offset: 3136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !110, file: !111, line: 109, baseType: !249, size: 64, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!125, !104}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !110, file: !111, line: 111, baseType: !167, size: 32, offset: 3264)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !110, file: !111, line: 112, baseType: !254, size: 320, offset: 3328)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 320, elements: !297)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!125, !258, !108, !104}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !261)
!261 = !{!262, !263, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !260, file: !10, line: 100, baseType: !167, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !10, line: 101, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !275, !276, !277, !278, !280, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !266, file: !10, line: 84, baseType: !194, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !266, file: !10, line: 85, baseType: !194, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !10, line: 86, baseType: !104, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !266, file: !10, line: 87, baseType: !186, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !266, file: !10, line: 88, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !266, file: !10, line: 89, baseType: !146, size: 8, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !266, file: !10, line: 90, baseType: !194, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !266, file: !10, line: 91, baseType: !105, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !266, file: !10, line: 92, baseType: !279, size: 32, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !10, line: 93, baseType: !281, size: 32, offset: 544)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !10, line: 94, baseType: !264, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !266, file: !10, line: 95, baseType: !194, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !266, file: !10, line: 96, baseType: !104, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !260, file: !10, line: 102, baseType: !194, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !260, file: !10, line: 102, baseType: !194, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !260, file: !10, line: 103, baseType: !194, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !260, file: !10, line: 104, baseType: !101, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !260, file: !10, line: 105, baseType: !279, size: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !260, file: !10, line: 106, baseType: !108, size: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !260, file: !10, line: 107, baseType: !294, size: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!297 = !{!298}
!298 = !DISubrange(count: 5)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !110, file: !111, line: 113, baseType: !300, size: 320, offset: 3648)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 320, elements: !297)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!125, !108, !104}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !110, file: !111, line: 114, baseType: !305, size: 320, offset: 3968)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 320, elements: !297)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !110, file: !111, line: 115, baseType: !279, size: 32, offset: 4288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !110, file: !111, line: 120, baseType: !294, size: 64, offset: 4352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !110, file: !111, line: 121, baseType: !279, size: 32, offset: 4416)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !111, line: 130, baseType: !136)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !111, line: 131, baseType: !128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !313, line: 1451, baseType: !155)
!313 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !89, line: 331, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !89, line: 331, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !89, line: 338, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !89, line: 338, flags: DIFlagFwdDecl)
!320 = !{i32 7, !"Dwarf Version", i32 4}
!321 = !{i32 2, !"Debug Info Version", i32 3}
!322 = !{i32 1, !"wchar_size", i32 4}
!323 = !{i32 7, !"PIC Level", i32 2}
!324 = !{i32 7, !"uwtable", i32 1}
!325 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!326 = distinct !DISubprogram(name: "VecTaggerCreate", scope: !327, file: !327, line: 32, type: !328, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !675)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/tagger/interface/tagger.c", directory: "/home/users/ndemeye/xSDK")
!328 = !DISubroutineType(types: !329)
!329 = !{!125, !101, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTagger", file: !25, line: 721, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_VecTagger", file: !334, line: 339, size: 5120, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !338, !671, !672, !673, !674}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !333, file: !334, line: 340, baseType: !337, size: 4480)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !111, line: 122, baseType: !110)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !333, file: !334, line: 340, baseType: !339, size: 448, offset: 4480)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 448, elements: !163)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecTaggerOps", file: !334, line: 330, size: 448, elements: !341)
!341 = !{!342, !346, !347, !351, !352, !356, !667}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !340, file: !334, line: 331, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!125, !331}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !340, file: !334, line: 332, baseType: !343, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !340, file: !334, line: 333, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!125, !258, !331}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !340, file: !334, line: 334, baseType: !343, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !340, file: !334, line: 335, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!125, !331, !131}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "computeboxes", scope: !340, file: !334, line: 336, baseType: !357, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!125, !331, !360, !212, !660}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !334, line: 142, size: 12800, elements: !363)
!363 = !{!364, !365, !585, !606, !607, !608, !654, !655, !656, !657, !659}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !362, file: !334, line: 143, baseType: !337, size: 4480)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !362, file: !334, line: 143, baseType: !366, size: 5248, offset: 4480)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 5248, elements: !163)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !334, line: 23, size: 5248, elements: !368)
!368 = !{!369, !374, !379, !383, !387, !393, !398, !399, !400, !404, !408, !409, !410, !414, !418, !424, !425, !429, !433, !437, !438, !445, !449, !450, !454, !458, !459, !460, !464, !465, !472, !477, !478, !479, !483, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !504, !505, !506, !510, !514, !515, !516, !517, !521, !522, !523, !524, !525, !526, !527, !531, !532, !536, !543, !544, !549, !550, !554, !555, !556, !557, !558, !559, !560, !561, !565, !566, !567, !573, !577, !578, !579}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !367, file: !334, line: 24, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!125, !360, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !367, file: !334, line: 25, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!125, !360, !167, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !367, file: !334, line: 26, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!125, !167, !373}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !367, file: !334, line: 27, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!125, !360, !360, !229}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !367, file: !334, line: 28, baseType: !388, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!125, !360, !167, !391, !229}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !367, file: !334, line: 29, baseType: !394, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!125, !360, !397, !220}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !367, file: !334, line: 30, baseType: !384, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !367, file: !334, line: 31, baseType: !388, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !367, file: !334, line: 32, baseType: !401, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!125, !360, !230}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !367, file: !334, line: 33, baseType: !405, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!125, !360, !360}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !367, file: !334, line: 34, baseType: !401, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !367, file: !334, line: 35, baseType: !405, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !367, file: !334, line: 36, baseType: !411, size: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!125, !360, !230, !360}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !367, file: !334, line: 37, baseType: !415, size: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!125, !360, !230, !230, !360}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !367, file: !334, line: 38, baseType: !419, size: 64, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!125, !360, !167, !422, !373}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !367, file: !334, line: 39, baseType: !411, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !367, file: !334, line: 40, baseType: !426, size: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!125, !360, !230, !360, !360}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !367, file: !334, line: 41, baseType: !430, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!125, !360, !230, !230, !230, !360, !360}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !367, file: !334, line: 42, baseType: !434, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!125, !360, !360, !360}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !367, file: !334, line: 43, baseType: !434, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !367, file: !334, line: 44, baseType: !439, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!125, !360, !167, !442, !422, !444}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !367, file: !334, line: 45, baseType: !446, size: 64, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!125, !360}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !367, file: !334, line: 46, baseType: !446, size: 64, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !367, file: !334, line: 47, baseType: !451, size: 64, offset: 1472)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!125, !360, !232}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !367, file: !334, line: 48, baseType: !455, size: 64, offset: 1536)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!125, !360, !212}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !367, file: !334, line: 49, baseType: !455, size: 64, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !367, file: !334, line: 50, baseType: !451, size: 64, offset: 1664)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !367, file: !334, line: 51, baseType: !461, size: 64, offset: 1728)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!125, !360, !212, !220}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !367, file: !334, line: 52, baseType: !461, size: 64, offset: 1792)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !367, file: !334, line: 53, baseType: !466, size: 64, offset: 1856)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!125, !360, !469}
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !367, file: !334, line: 54, baseType: !473, size: 64, offset: 1920)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!125, !360, !476, !279}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !367, file: !334, line: 55, baseType: !439, size: 64, offset: 1984)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !367, file: !334, line: 56, baseType: !446, size: 64, offset: 2048)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !367, file: !334, line: 57, baseType: !480, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!125, !360, !131}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !367, file: !334, line: 58, baseType: !484, size: 64, offset: 2176)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!125, !360, !422}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !367, file: !334, line: 59, baseType: !484, size: 64, offset: 2240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !367, file: !334, line: 60, baseType: !384, size: 64, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !367, file: !334, line: 61, baseType: !384, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !367, file: !334, line: 62, baseType: !394, size: 64, offset: 2432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !367, file: !334, line: 63, baseType: !388, size: 64, offset: 2496)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !367, file: !334, line: 64, baseType: !388, size: 64, offset: 2560)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !367, file: !334, line: 65, baseType: !480, size: 64, offset: 2624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !367, file: !334, line: 66, baseType: !446, size: 64, offset: 2688)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !367, file: !334, line: 67, baseType: !446, size: 64, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !367, file: !334, line: 68, baseType: !497, size: 64, offset: 2816)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!125, !360, !500}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !501, line: 30, baseType: !502)
!501 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !501, line: 30, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !367, file: !334, line: 69, baseType: !439, size: 64, offset: 2880)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !367, file: !334, line: 70, baseType: !446, size: 64, offset: 2944)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !367, file: !334, line: 71, baseType: !507, size: 64, offset: 3008)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!125, !258, !360}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !367, file: !334, line: 72, baseType: !511, size: 64, offset: 3072)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!125, !360, !360, !220}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !367, file: !334, line: 73, baseType: !434, size: 64, offset: 3136)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !367, file: !334, line: 74, baseType: !434, size: 64, offset: 3200)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !367, file: !334, line: 75, baseType: !434, size: 64, offset: 3264)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !367, file: !334, line: 76, baseType: !518, size: 64, offset: 3328)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!125, !360, !167, !442, !229}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !367, file: !334, line: 77, baseType: !446, size: 64, offset: 3392)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !367, file: !334, line: 78, baseType: !446, size: 64, offset: 3456)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !367, file: !334, line: 79, baseType: !446, size: 64, offset: 3520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !367, file: !334, line: 80, baseType: !446, size: 64, offset: 3584)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !367, file: !334, line: 81, baseType: !401, size: 64, offset: 3648)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !367, file: !334, line: 82, baseType: !446, size: 64, offset: 3712)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !367, file: !334, line: 83, baseType: !528, size: 64, offset: 3776)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!125, !360, !167, !360, !444}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !367, file: !334, line: 84, baseType: !528, size: 64, offset: 3840)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !367, file: !334, line: 85, baseType: !533, size: 64, offset: 3904)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!125, !360, !360, !229, !229}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !367, file: !334, line: 86, baseType: !537, size: 64, offset: 3968)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!125, !360, !540, !373}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !501, line: 11, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !501, line: 11, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !367, file: !334, line: 87, baseType: !537, size: 64, offset: 4032)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !367, file: !334, line: 88, baseType: !545, size: 64, offset: 4096)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!125, !360, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !367, file: !334, line: 89, baseType: !545, size: 64, offset: 4160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !367, file: !334, line: 90, baseType: !551, size: 64, offset: 4224)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!125, !360, !167, !442, !442, !360, !444}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !367, file: !334, line: 91, baseType: !551, size: 64, offset: 4288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !367, file: !334, line: 92, baseType: !480, size: 64, offset: 4352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !367, file: !334, line: 93, baseType: !480, size: 64, offset: 4416)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !367, file: !334, line: 94, baseType: !405, size: 64, offset: 4480)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !367, file: !334, line: 95, baseType: !405, size: 64, offset: 4544)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !367, file: !334, line: 96, baseType: !405, size: 64, offset: 4608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !367, file: !334, line: 97, baseType: !405, size: 64, offset: 4672)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !367, file: !334, line: 98, baseType: !562, size: 64, offset: 4736)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!125, !360, !279}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !367, file: !334, line: 99, baseType: !451, size: 64, offset: 4800)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !367, file: !334, line: 100, baseType: !451, size: 64, offset: 4864)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !367, file: !334, line: 101, baseType: !568, size: 64, offset: 4928)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!125, !360, !232, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !367, file: !334, line: 102, baseType: !574, size: 64, offset: 4992)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!125, !360, !548, !571}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !367, file: !334, line: 103, baseType: !451, size: 64, offset: 5056)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !367, file: !334, line: 104, baseType: !545, size: 64, offset: 5120)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !367, file: !334, line: 105, baseType: !580, size: 64, offset: 5184)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!125, !167, !391, !373, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !362, file: !334, line: 144, baseType: !586, size: 64, offset: 9728)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !501, line: 60, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !589, line: 240, size: 640, elements: !590)
!589 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !588, file: !589, line: 241, baseType: !101, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !589, line: 242, baseType: !184, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !588, file: !589, line: 243, baseType: !167, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !588, file: !589, line: 243, baseType: !167, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !588, file: !589, line: 244, baseType: !167, size: 32, offset: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !588, file: !589, line: 244, baseType: !167, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !588, file: !589, line: 245, baseType: !212, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !588, file: !589, line: 246, baseType: !279, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !588, file: !589, line: 247, baseType: !167, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !588, file: !589, line: 251, baseType: !167, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !588, file: !589, line: 252, baseType: !500, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !588, file: !589, line: 253, baseType: !279, size: 32, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !588, file: !589, line: 254, baseType: !167, size: 32, offset: 544)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !588, file: !589, line: 254, baseType: !167, size: 32, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !588, file: !589, line: 255, baseType: !167, size: 32, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !334, line: 145, baseType: !104, size: 64, offset: 9792)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !362, file: !334, line: 146, baseType: !279, size: 32, offset: 9856)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !362, file: !334, line: 147, baseType: !609, size: 1344, offset: 9920)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !334, line: 140, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 114, size: 1344, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !630, !631, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !610, file: !334, line: 115, baseType: !167, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !610, file: !334, line: 116, baseType: !167, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !610, file: !334, line: 117, baseType: !167, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !610, file: !334, line: 118, baseType: !167, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !610, file: !334, line: 119, baseType: !167, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !610, file: !334, line: 120, baseType: !167, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !610, file: !334, line: 121, baseType: !212, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !610, file: !334, line: 122, baseType: !229, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !610, file: !334, line: 124, baseType: !101, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !334, line: 125, baseType: !184, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !610, file: !334, line: 125, baseType: !184, size: 32, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !610, file: !334, line: 126, baseType: !184, size: 32, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !610, file: !334, line: 126, baseType: !184, size: 32, offset: 480)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !610, file: !334, line: 127, baseType: !626, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !89, line: 339, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !89, line: 339, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !610, file: !334, line: 128, baseType: !626, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !610, file: !334, line: 129, baseType: !632, size: 64, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !89, line: 341, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !89, line: 351, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !634, file: !89, line: 354, baseType: !115, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !634, file: !89, line: 355, baseType: !115, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !634, file: !89, line: 356, baseType: !115, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !634, file: !89, line: 361, baseType: !115, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !634, file: !89, line: 362, baseType: !105, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !610, file: !334, line: 130, baseType: !167, size: 32, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !610, file: !334, line: 130, baseType: !167, size: 32, offset: 736)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !610, file: !334, line: 131, baseType: !229, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !610, file: !334, line: 131, baseType: !229, size: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !610, file: !334, line: 132, baseType: !212, size: 64, offset: 896)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !610, file: !334, line: 132, baseType: !212, size: 64, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !610, file: !334, line: 133, baseType: !167, size: 32, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !610, file: !334, line: 134, baseType: !212, size: 64, offset: 1088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !610, file: !334, line: 135, baseType: !167, size: 32, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !610, file: !334, line: 136, baseType: !279, size: 32, offset: 1184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !610, file: !334, line: 137, baseType: !279, size: 32, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !610, file: !334, line: 138, baseType: !444, size: 32, offset: 1248)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !610, file: !334, line: 139, baseType: !212, size: 64, offset: 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !362, file: !334, line: 147, baseType: !609, size: 1344, offset: 11264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !362, file: !334, line: 148, baseType: !279, size: 32, offset: 12608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !362, file: !334, line: 149, baseType: !167, size: 32, offset: 12640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !362, file: !334, line: 150, baseType: !658, size: 32, offset: 12672)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !362, file: !334, line: 157, baseType: !194, size: 64, offset: 12736)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecTaggerBox", file: !25, line: 768, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 765, size: 128, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !663, file: !25, line: 766, baseType: !230, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !663, file: !25, line: 767, baseType: !230, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "computeis", scope: !340, file: !334, line: 337, baseType: !668, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!125, !331, !360, !584}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !334, line: 341, baseType: !104, size: 64, offset: 4928)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !333, file: !334, line: 342, baseType: !167, size: 32, offset: 4992)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !333, file: !334, line: 343, baseType: !279, size: 32, offset: 5024)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !333, file: !334, line: 344, baseType: !279, size: 32, offset: 5056)
!675 = !{!676, !677, !678, !679, !680, !682}
!676 = !DILocalVariable(name: "comm", arg: 1, scope: !326, file: !327, line: 32, type: !101)
!677 = !DILocalVariable(name: "tagger", arg: 2, scope: !326, file: !327, line: 32, type: !330)
!678 = !DILocalVariable(name: "ierr", scope: !326, file: !327, line: 34, type: !125)
!679 = !DILocalVariable(name: "b", scope: !326, file: !327, line: 35, type: !331)
!680 = !DILocalVariable(name: "ierr__", scope: !681, file: !327, line: 39, type: !125)
!681 = distinct !DILexicalBlock(scope: !326, file: !327, line: 39, column: 39)
!682 = !DILocalVariable(name: "ierr__", scope: !683, file: !327, line: 41, type: !125)
!683 = distinct !DILexicalBlock(scope: !326, file: !327, line: 41, column: 117)
!684 = !DILocation(line: 0, scope: !326)
!685 = !DILocation(line: 35, column: 3, scope: !326)
!686 = !DILocation(line: 37, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !327, line: 37, column: 3)
!688 = distinct !DILexicalBlock(scope: !689, file: !327, line: 37, column: 3)
!689 = distinct !DILexicalBlock(scope: !326, file: !327, line: 37, column: 3)
!690 = !{!691, !691, i64 0}
!691 = !{!"any pointer", !692, i64 0}
!692 = !{!"omnipotent char", !693, i64 0}
!693 = !{!"Simple C/C++ TBAA"}
!694 = !DILocation(line: 37, column: 3, scope: !688)
!695 = !DILocation(line: 37, column: 3, scope: !696)
!696 = distinct !DILexicalBlock(scope: !697, file: !327, line: 37, column: 3)
!697 = distinct !DILexicalBlock(scope: !687, file: !327, line: 37, column: 3)
!698 = !{!699, !700, i64 1536}
!699 = !{!"", !692, i64 0, !692, i64 512, !692, i64 1024, !692, i64 1280, !700, i64 1536, !700, i64 1540, !692, i64 1544}
!700 = !{!"int", !692, i64 0}
!701 = !DILocation(line: 37, column: 3, scope: !697)
!702 = !DILocation(line: 37, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !696, file: !327, line: 37, column: 3)
!704 = !{!700, !700, i64 0}
!705 = !{!699, !700, i64 1540}
!706 = !DILocation(line: 38, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !327, line: 38, column: 3)
!708 = distinct !DILexicalBlock(scope: !326, file: !327, line: 38, column: 3)
!709 = !DILocation(line: 38, column: 3, scope: !708)
!710 = !DILocation(line: 38, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !708, file: !327, line: 38, column: 3)
!712 = !DILocation(line: 39, column: 10, scope: !326)
!713 = !DILocation(line: 0, scope: !681)
!714 = !DILocation(line: 39, column: 39, scope: !715)
!715 = distinct !DILexicalBlock(scope: !681, file: !327, line: 39, column: 39)
!716 = !DILocation(line: 39, column: 39, scope: !681)
!717 = !{!"branch_weights", i32 2000, i32 1}
!718 = !DILocation(line: 41, column: 10, scope: !326)
!719 = !{!"branch_weights", i32 2146410443, i32 1073205}
!720 = !DILocation(line: 0, scope: !683)
!721 = !DILocation(line: 41, column: 117, scope: !683)
!722 = !DILocation(line: 41, column: 117, scope: !723)
!723 = distinct !DILexicalBlock(scope: !683, file: !327, line: 41, column: 117)
!724 = !DILocation(line: 43, column: 3, scope: !326)
!725 = !DILocation(line: 43, column: 6, scope: !326)
!726 = !DILocation(line: 43, column: 18, scope: !326)
!727 = !{!728, !700, i64 624}
!728 = !{!"_p_VecTagger", !729, i64 0, !692, i64 560, !691, i64 616, !700, i64 624, !692, i64 628, !692, i64 632}
