; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/ftn-custom/zshellf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/ftn-custom/zshellf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }
%struct.PetscOps = type { {}*, i32 (%struct._p_PetscObject*, %struct._p_PetscViewer*)*, i32 (%struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject*)*, i32 (%struct._p_PetscObject*, i8*, %struct._p_PetscObject**)*, i32 (%struct._p_PetscObject*, i8*, void ()*)*, i32 (%struct._p_PetscObject*, i8*, void ()**)* }

!180 = !DIEnumerator(name: "FORTRAN_MATOP_DIAGONAL_SCALE", value: 7, isUnsigned: true)
!181 = !DIEnumerator(name: "FORTRAN_MATOP_ZERO_ENTRIES", value: 8, isUnsigned: true)
!182 = !DIEnumerator(name: "FORTRAN_MATOP_AXPY", value: 9, isUnsigned: true)
!183 = !DIEnumerator(name: "FORTRAN_MATOP_SHIFT", value: 10, isUnsigned: true)
!184 = !DIEnumerator(name: "FORTRAN_MATOP_DIAGONAL_SET", value: 11, isUnsigned: true)
!185 = !DIEnumerator(name: "FORTRAN_MATOP_DESTROY", value: 12, isUnsigned: true)
!186 = !DIEnumerator(name: "FORTRAN_MATOP_VIEW", value: 13, isUnsigned: true)
!187 = !DIEnumerator(name: "FORTRAN_MATOP_CREATE_VECS", value: 14, isUnsigned: true)
!188 = !DIEnumerator(name: "FORTRAN_MATOP_GET_DIAGONAL_BLOCK", value: 15, isUnsigned: true)
!189 = !DIEnumerator(name: "FORTRAN_MATOP_COPY", value: 16, isUnsigned: true)
!190 = !DIEnumerator(name: "FORTRAN_MATOP_SCALE", value: 17, isUnsigned: true)
!191 = !DIEnumerator(name: "FORTRAN_MATOP_SET_RANDOM", value: 18, isUnsigned: true)
!192 = !DIEnumerator(name: "FORTRAN_MATOP_ASSEMBLY_BEGIN", value: 19, isUnsigned: true)
!193 = !DIEnumerator(name: "FORTRAN_MATOP_ASSEMBLY_END", value: 20, isUnsigned: true)
!194 = !DIEnumerator(name: "FORTRAN_MATOP_SIZE", value: 21, isUnsigned: true)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 663, baseType: !5, size: 32, elements: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!197 = !{!198, !199, !200}
!198 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!199 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1288, baseType: !5, size: 32, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!203 = !DIEnumerator(name: "SOR_FORWARD_SWEEP", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "SOR_BACKWARD_SWEEP", value: 2, isUnsigned: true)
!205 = !DIEnumerator(name: "SOR_SYMMETRIC_SWEEP", value: 3, isUnsigned: true)
!206 = !DIEnumerator(name: "SOR_LOCAL_FORWARD_SWEEP", value: 4, isUnsigned: true)
!207 = !DIEnumerator(name: "SOR_LOCAL_BACKWARD_SWEEP", value: 8, isUnsigned: true)
!208 = !DIEnumerator(name: "SOR_LOCAL_SYMMETRIC_SWEEP", value: 12, isUnsigned: true)
!209 = !DIEnumerator(name: "SOR_ZERO_INITIAL_GUESS", value: 16, isUnsigned: true)
!210 = !DIEnumerator(name: "SOR_EISENSTAT", value: 32, isUnsigned: true)
!211 = !DIEnumerator(name: "SOR_APPLY_UPPER", value: 64, isUnsigned: true)
!212 = !DIEnumerator(name: "SOR_APPLY_LOWER", value: 128, isUnsigned: true)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 238, baseType: !5, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 285, baseType: !5, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!222 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!223 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!224 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 580, baseType: !5, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235}
!227 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!231 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!232 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!233 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!234 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!235 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 424, baseType: !5, size: 32, elements: !237)
!237 = !{!238, !239}
!238 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!240 = !{!241, !243, !451, !452, !261, !342, !332, !454, !467, !470, !458, !475, !480, !462, !483, !486, !491, !494, !499, !503, !506, !509, !516}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !151, line: 430, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !246, line: 73, size: 4480, elements: !247)
!246 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!247 = !{!248, !250, !303, !304, !306, !309, !310, !311, !312, !320, !321, !323, !327, !331, !333, !334, !335, !336, !337, !338, !339, !340, !341, !343, !345, !346, !347, !349, !350, !352, !354, !355, !356, !357, !358, !361, !363, !364, !365, !366, !367, !370, !372, !373, !374, !384, !386, !387, !391, !392, !441, !446, !448, !449, !450}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !245, file: !246, line: 74, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !151, line: 32, baseType: !242)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !245, file: !246, line: 75, baseType: !251, size: 448, offset: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 448, elements: !301)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !246, line: 53, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 45, size: 448, elements: !254)
!254 = !{!255, !265, !273, !278, !285, !289, !296}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !253, file: !246, line: 46, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !243, !260}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !151, line: 14, baseType: !242)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !262, line: 330, baseType: !263)
!262 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !262, line: 330, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !253, file: !246, line: 47, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!259, !243, !269}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !270, line: 16, baseType: !271)
!270 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !270, line: 16, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !253, file: !246, line: 48, baseType: !274, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!259, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !253, file: !246, line: 49, baseType: !279, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!259, !243, !282, !243}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !253, file: !246, line: 50, baseType: !286, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!259, !243, !282, !277}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !253, file: !246, line: 51, baseType: !290, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!259, !243, !282, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !253, file: !246, line: 52, baseType: !297, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!259, !243, !282, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!301 = !{!302}
!302 = !DISubrange(count: 1)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !245, file: !246, line: 76, baseType: !261, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !246, line: 77, baseType: !305, size: 32, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !151, line: 102, baseType: !242)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !245, file: !246, line: 78, baseType: !307, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !151, line: 360, baseType: !308)
!308 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !245, file: !246, line: 78, baseType: !307, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !245, file: !246, line: 78, baseType: !307, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !245, file: !246, line: 78, baseType: !307, size: 64, offset: 832)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !245, file: !246, line: 79, baseType: !313, size: 64, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !151, line: 442, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !151, line: 90, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !316, line: 27, baseType: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !318, line: 43, baseType: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!319 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !245, file: !246, line: 80, baseType: !305, size: 32, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !245, file: !246, line: 81, baseType: !322, size: 32, offset: 992)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !151, line: 49, baseType: !242)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !245, file: !246, line: 82, baseType: !324, size: 64, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !151, line: 465, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !151, line: 465, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !245, file: !246, line: 83, baseType: !328, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !151, line: 496, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !151, line: 496, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !245, file: !246, line: 84, baseType: !332, size: 64, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !245, file: !246, line: 85, baseType: !332, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !245, file: !246, line: 86, baseType: !332, size: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !245, file: !246, line: 87, baseType: !332, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !245, file: !246, line: 88, baseType: !243, size: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !245, file: !246, line: 89, baseType: !313, size: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 90, baseType: !332, size: 64, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !245, file: !246, line: 91, baseType: !332, size: 64, offset: 1600)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !245, file: !246, line: 92, baseType: !305, size: 32, offset: 1664)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !245, file: !246, line: 93, baseType: !342, size: 64, offset: 1728)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !245, file: !246, line: 94, baseType: !344, size: 64, offset: 1792)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !151, line: 455, baseType: !314)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !245, file: !246, line: 95, baseType: !305, size: 32, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !245, file: !246, line: 95, baseType: !305, size: 32, offset: 1888)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !245, file: !246, line: 96, baseType: !348, size: 64, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !245, file: !246, line: 96, baseType: !348, size: 64, offset: 1984)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !245, file: !246, line: 97, baseType: !351, size: 64, offset: 2048)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !245, file: !246, line: 97, baseType: !353, size: 64, offset: 2112)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !245, file: !246, line: 98, baseType: !305, size: 32, offset: 2176)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !245, file: !246, line: 98, baseType: !305, size: 32, offset: 2208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !245, file: !246, line: 99, baseType: !348, size: 64, offset: 2240)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !245, file: !246, line: 99, baseType: !348, size: 64, offset: 2304)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !245, file: !246, line: 100, baseType: !359, size: 64, offset: 2368)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !151, line: 189, baseType: !308)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !245, file: !246, line: 100, baseType: !362, size: 64, offset: 2432)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !245, file: !246, line: 101, baseType: !305, size: 32, offset: 2496)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !245, file: !246, line: 101, baseType: !305, size: 32, offset: 2528)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !245, file: !246, line: 102, baseType: !348, size: 64, offset: 2560)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !245, file: !246, line: 102, baseType: !348, size: 64, offset: 2624)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !245, file: !246, line: 103, baseType: !368, size: 64, offset: 2688)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !151, line: 305, baseType: !360)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !245, file: !246, line: 103, baseType: !371, size: 64, offset: 2752)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !245, file: !246, line: 104, baseType: !300, size: 64, offset: 2816)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !245, file: !246, line: 105, baseType: !305, size: 32, offset: 2880)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !245, file: !246, line: 106, baseType: !375, size: 128, offset: 2944)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 128, elements: !382)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !246, line: 64, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 61, size: 128, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !378, file: !246, line: 62, baseType: !293, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !378, file: !246, line: 63, baseType: !342, size: 64, offset: 64)
!382 = !{!383}
!383 = !DISubrange(count: 2)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !245, file: !246, line: 107, baseType: !385, size: 64, offset: 3072)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 64, elements: !382)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !245, file: !246, line: 108, baseType: !342, size: 64, offset: 3136)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !245, file: !246, line: 109, baseType: !388, size: 64, offset: 3200)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!259, !342}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !245, file: !246, line: 111, baseType: !305, size: 32, offset: 3264)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !245, file: !246, line: 112, baseType: !393, size: 320, offset: 3328)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 320, elements: !439)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!259, !397, !243, !342}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !156, line: 108, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !156, line: 99, size: 640, elements: !400)
!400 = !{!401, !402, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !399, file: !156, line: 100, baseType: !305, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !156, line: 101, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !156, line: 82, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !156, line: 83, size: 768, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !414, !415, !416, !420, !422, !424, !425, !426}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !405, file: !156, line: 84, baseType: !332, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !405, file: !156, line: 85, baseType: !332, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !156, line: 86, baseType: !342, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !405, file: !156, line: 87, baseType: !324, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !405, file: !156, line: 88, baseType: !412, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !405, file: !156, line: 89, baseType: !284, size: 8, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !405, file: !156, line: 90, baseType: !332, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !405, file: !156, line: 91, baseType: !417, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 46, baseType: !419)
!418 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!419 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !405, file: !156, line: 92, baseType: !421, size: 32, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !151, line: 170, baseType: !150)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !156, line: 93, baseType: !423, size: 32, offset: 544)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !156, line: 81, baseType: !155)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !156, line: 94, baseType: !403, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !405, file: !156, line: 95, baseType: !332, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !405, file: !156, line: 96, baseType: !342, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !399, file: !156, line: 102, baseType: !332, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !399, file: !156, line: 102, baseType: !332, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !399, file: !156, line: 103, baseType: !332, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !399, file: !156, line: 104, baseType: !261, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !399, file: !156, line: 105, baseType: !421, size: 32, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !399, file: !156, line: 105, baseType: !421, size: 32, offset: 416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !399, file: !156, line: 105, baseType: !421, size: 32, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !399, file: !156, line: 106, baseType: !243, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !399, file: !156, line: 107, baseType: !436, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !156, line: 10, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !156, line: 10, flags: DIFlagFwdDecl)
!439 = !{!440}
!440 = !DISubrange(count: 5)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !245, file: !246, line: 113, baseType: !442, size: 320, offset: 3648)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 320, elements: !439)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!259, !243, !342}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !245, file: !246, line: 114, baseType: !447, size: 320, offset: 3968)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, elements: !439)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !245, file: !246, line: 115, baseType: !421, size: 32, offset: 4288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !245, file: !246, line: 120, baseType: !436, size: 64, offset: 4352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !245, file: !246, line: 121, baseType: !421, size: 32, offset: 4416)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !453, line: 1451, baseType: !293)
!453 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!259, !457, !461, !461, !466}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !4, line: 16, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !4, line: 16, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !463, line: 21, baseType: !464)
!463 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !463, line: 21, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!259, !457, !461, !461, !461, !466}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!259, !457, !461, !359, !473, !359, !351, !351, !461, !466}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !4, line: 1291, baseType: !201)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!259, !457, !478, !457, !466}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !4, line: 238, baseType: !213)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!259, !457, !461, !466}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!259, !457, !466}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!259, !457, !368, !457, !489, !466}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !4, line: 285, baseType: !219)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!259, !457, !368, !466}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!259, !457, !461, !497, !466}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !151, line: 580, baseType: !225)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!259, !457, !502, !466}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!259, !457, !457, !466}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!259, !457, !457, !489, !466}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
