; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/symbrdn/symbrdn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/symbrdn/symbrdn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!297 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 1203, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 187, baseType: !7, size: 32, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314}
!308 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!313 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!314 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 790, baseType: !7, size: 32, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !319, !320, !321}
!318 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_NONE", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_SCALAR", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_DIAGONAL", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_USER", value: 3, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 663, baseType: !7, size: 32, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !326, !327}
!325 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !329)
!329 = !{!330}
!330 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!333 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!351 = !{!352, !1626, !374, !377, !458, !424, !398, !1665, !1666, !1667, !533, !448}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !354, line: 52, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 27, size: 6208, elements: !356)
!356 = !{!357, !567, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1618, !1622, !1623, !1624, !1625}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !355, file: !354, line: 29, baseType: !358, size: 4480)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !359, line: 122, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !359, line: 73, size: 4480, elements: !361)
!361 = !{!362, !364, !419, !420, !422, !425, !426, !427, !428, !436, !437, !439, !443, !447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !459, !461, !462, !463, !465, !466, !468, !470, !471, !472, !473, !474, !477, !479, !480, !481, !482, !483, !486, !488, !489, !490, !500, !502, !503, !507, !508, !557, !562, !564, !565, !566}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !360, file: !359, line: 74, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !360, file: !359, line: 75, baseType: !365, size: 448, offset: 64)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 448, elements: !417)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !359, line: 53, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 45, size: 448, elements: !368)
!368 = !{!369, !381, !389, !394, !401, !405, !412}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !367, file: !359, line: 46, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !374, !376}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !93)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !378, line: 330, baseType: !379)
!378 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !378, line: 330, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !367, file: !359, line: 47, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!373, !374, !385}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !386, line: 16, baseType: !387)
!386 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !386, line: 16, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !367, file: !359, line: 48, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!373, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !367, file: !359, line: 49, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!373, !374, !398, !374}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !367, file: !359, line: 50, baseType: !402, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!373, !374, !398, !393}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !367, file: !359, line: 51, baseType: !406, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!373, !374, !398, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !367, file: !359, line: 52, baseType: !413, size: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!373, !374, !398, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!417 = !{!418}
!418 = !DISubrange(count: 1)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !360, file: !359, line: 76, baseType: !377, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !360, file: !359, line: 77, baseType: !421, size: 32, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !360, file: !359, line: 78, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !424)
!424 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !360, file: !359, line: 78, baseType: !423, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !360, file: !359, line: 78, baseType: !423, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !360, file: !359, line: 78, baseType: !423, size: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !360, file: !359, line: 79, baseType: !429, size: 64, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !432, line: 27, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !434, line: 43, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!435 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !360, file: !359, line: 80, baseType: !421, size: 32, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !360, file: !359, line: 81, baseType: !438, size: 32, offset: 992)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !360, file: !359, line: 82, baseType: !440, size: 64, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !360, file: !359, line: 83, baseType: !444, size: 64, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !360, file: !359, line: 84, baseType: !448, size: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !360, file: !359, line: 85, baseType: !448, size: 64, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !360, file: !359, line: 86, baseType: !448, size: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !360, file: !359, line: 87, baseType: !448, size: 64, offset: 1344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !360, file: !359, line: 88, baseType: !374, size: 64, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !360, file: !359, line: 89, baseType: !429, size: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !360, file: !359, line: 90, baseType: !448, size: 64, offset: 1536)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !360, file: !359, line: 91, baseType: !448, size: 64, offset: 1600)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !360, file: !359, line: 92, baseType: !421, size: 32, offset: 1664)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !360, file: !359, line: 93, baseType: !458, size: 64, offset: 1728)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !359, line: 94, baseType: !460, size: 64, offset: 1792)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !430)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !360, file: !359, line: 95, baseType: !421, size: 32, offset: 1856)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !360, file: !359, line: 95, baseType: !421, size: 32, offset: 1888)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !360, file: !359, line: 96, baseType: !464, size: 64, offset: 1920)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !360, file: !359, line: 96, baseType: !464, size: 64, offset: 1984)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !360, file: !359, line: 97, baseType: !467, size: 64, offset: 2048)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !360, file: !359, line: 97, baseType: !469, size: 64, offset: 2112)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !360, file: !359, line: 98, baseType: !421, size: 32, offset: 2176)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !360, file: !359, line: 98, baseType: !421, size: 32, offset: 2208)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !360, file: !359, line: 99, baseType: !464, size: 64, offset: 2240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !360, file: !359, line: 99, baseType: !464, size: 64, offset: 2304)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !360, file: !359, line: 100, baseType: !475, size: 64, offset: 2368)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !424)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !360, file: !359, line: 100, baseType: !478, size: 64, offset: 2432)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !360, file: !359, line: 101, baseType: !421, size: 32, offset: 2496)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !360, file: !359, line: 101, baseType: !421, size: 32, offset: 2528)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !360, file: !359, line: 102, baseType: !464, size: 64, offset: 2560)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !360, file: !359, line: 102, baseType: !464, size: 64, offset: 2624)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !360, file: !359, line: 103, baseType: !484, size: 64, offset: 2688)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !476)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !360, file: !359, line: 103, baseType: !487, size: 64, offset: 2752)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !360, file: !359, line: 104, baseType: !416, size: 64, offset: 2816)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !360, file: !359, line: 105, baseType: !421, size: 32, offset: 2880)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !360, file: !359, line: 106, baseType: !491, size: 128, offset: 2944)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 128, elements: !498)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !359, line: 64, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 61, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !494, file: !359, line: 62, baseType: !409, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !494, file: !359, line: 63, baseType: !458, size: 64, offset: 64)
!498 = !{!499}
!499 = !DISubrange(count: 2)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !360, file: !359, line: 107, baseType: !501, size: 64, offset: 3072)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 64, elements: !498)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !360, file: !359, line: 108, baseType: !458, size: 64, offset: 3136)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !360, file: !359, line: 109, baseType: !504, size: 64, offset: 3200)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!373, !458}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !360, file: !359, line: 111, baseType: !421, size: 32, offset: 3264)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !360, file: !359, line: 112, baseType: !509, size: 320, offset: 3328)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 320, elements: !555)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!373, !513, !374, !458}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !516)
!516 = !{!517, !518, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !515, file: !12, line: 100, baseType: !421, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !515, file: !12, line: 101, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !530, !531, !532, !536, !538, !540, !541, !542}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !521, file: !12, line: 84, baseType: !448, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !521, file: !12, line: 85, baseType: !448, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !521, file: !12, line: 86, baseType: !458, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !521, file: !12, line: 87, baseType: !440, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !521, file: !12, line: 88, baseType: !528, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !521, file: !12, line: 89, baseType: !400, size: 8, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !521, file: !12, line: 90, baseType: !448, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !521, file: !12, line: 91, baseType: !533, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !534, line: 46, baseType: !535)
!534 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!535 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !521, file: !12, line: 92, baseType: !537, size: 32, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !521, file: !12, line: 93, baseType: !539, size: 32, offset: 544)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !12, line: 94, baseType: !519, size: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !521, file: !12, line: 95, baseType: !448, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !521, file: !12, line: 96, baseType: !458, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !515, file: !12, line: 102, baseType: !448, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !515, file: !12, line: 102, baseType: !448, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !515, file: !12, line: 103, baseType: !448, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !515, file: !12, line: 104, baseType: !377, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !515, file: !12, line: 105, baseType: !537, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !515, file: !12, line: 105, baseType: !537, size: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !515, file: !12, line: 105, baseType: !537, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !515, file: !12, line: 106, baseType: !374, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !515, file: !12, line: 107, baseType: !552, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!555 = !{!556}
!556 = !DISubrange(count: 5)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !360, file: !359, line: 113, baseType: !558, size: 320, offset: 3648)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 320, elements: !555)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!373, !374, !458}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !360, file: !359, line: 114, baseType: !563, size: 320, offset: 3968)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 320, elements: !555)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !360, file: !359, line: 115, baseType: !537, size: 32, offset: 4288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !360, file: !359, line: 120, baseType: !552, size: 64, offset: 4352)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !360, file: !359, line: 121, baseType: !537, size: 32, offset: 4416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !355, file: !354, line: 29, baseType: !568, size: 320, offset: 4480)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 320, elements: !417)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !354, line: 19, size: 320, elements: !570)
!570 = !{!571, !1588, !1589, !1590, !1591}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !569, file: !354, line: 20, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!373, !575, !604, !604}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !578, line: 436, size: 23424, elements: !579)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!579 = !{!580, !581, !1363, !1364, !1365, !1366, !1368, !1369, !1370, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1484, !1485, !1501, !1502, !1503, !1504, !1505, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1540, !1560, !1561, !1563, !1564, !1565, !1566, !1567, !1568, !1586, !1587}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !577, file: !578, line: 437, baseType: !358, size: 4480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !577, file: !578, line: 437, baseType: !582, size: 9472, offset: 4480)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 9472, elements: !417)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !578, line: 32, size: 9472, elements: !584)
!584 = !{!585, !594, !598, !599, !600, !899, !900, !901, !902, !903, !904, !905, !925, !929, !934, !940, !959, !964, !968, !969, !973, !978, !979, !984, !988, !992, !996, !1000, !1004, !1005, !1006, !1007, !1008, !1012, !1013, !1018, !1019, !1020, !1021, !1022, !1027, !1034, !1038, !1042, !1046, !1050, !1054, !1055, !1059, !1060, !1064, !1069, !1070, !1071, !1072, !1134, !1142, !1143, !1147, !1148, !1152, !1153, !1157, !1162, !1163, !1167, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1185, !1186, !1190, !1194, !1198, !1199, !1200, !1204, !1214, !1215, !1219, !1220, !1224, !1225, !1229, !1230, !1234, !1235, !1239, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1277, !1278, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1295, !1299, !1303, !1304, !1308, !1309, !1310, !1311, !1337, !1341, !1342, !1343, !1344, !1345, !1349, !1350, !1351, !1352, !1353, !1357, !1361, !1362}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !583, file: !578, line: 34, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!373, !575, !421, !589, !421, !589, !591, !593}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !583, file: !578, line: 35, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!373, !575, !421, !467, !469, !487}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !583, file: !578, line: 36, baseType: !595, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !583, file: !578, line: 37, baseType: !572, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !583, file: !578, line: 38, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!373, !575, !604, !604, !604}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !607, line: 142, size: 12800, elements: !608)
!607 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!608 = !{!609, !610, !825, !845, !846, !847, !893, !894, !895, !896, !898}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !606, file: !607, line: 143, baseType: !358, size: 4480)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !606, file: !607, line: 143, baseType: !611, size: 5248, offset: 4480)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 5248, elements: !417)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !607, line: 23, size: 5248, elements: !613)
!613 = !{!614, !619, !624, !628, !632, !638, !643, !644, !645, !649, !653, !654, !655, !659, !663, !667, !668, !672, !676, !680, !681, !685, !689, !690, !694, !698, !699, !700, !704, !705, !712, !717, !718, !719, !723, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !744, !745, !746, !750, !754, !755, !756, !757, !761, !762, !763, !764, !765, !766, !767, !771, !772, !776, !783, !784, !789, !790, !794, !795, !796, !797, !798, !799, !800, !801, !805, !806, !807, !813, !817, !818, !819}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !612, file: !607, line: 24, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!373, !604, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !612, file: !607, line: 25, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!373, !604, !421, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !612, file: !607, line: 26, baseType: !625, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!373, !421, !618}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !612, file: !607, line: 27, baseType: !629, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!373, !604, !604, !484}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !612, file: !607, line: 28, baseType: !633, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!373, !604, !421, !636, !484}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !612, file: !607, line: 29, baseType: !639, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!373, !604, !642, !475}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !612, file: !607, line: 30, baseType: !629, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !612, file: !607, line: 31, baseType: !633, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !612, file: !607, line: 32, baseType: !646, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!373, !604, !485}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !612, file: !607, line: 33, baseType: !650, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!373, !604, !604}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !612, file: !607, line: 34, baseType: !646, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !612, file: !607, line: 35, baseType: !650, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !612, file: !607, line: 36, baseType: !656, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!373, !604, !485, !604}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !612, file: !607, line: 37, baseType: !660, size: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!373, !604, !485, !485, !604}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !612, file: !607, line: 38, baseType: !664, size: 64, offset: 896)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!373, !604, !421, !591, !618}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !612, file: !607, line: 39, baseType: !656, size: 64, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !612, file: !607, line: 40, baseType: !669, size: 64, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!373, !604, !485, !604, !604}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !612, file: !607, line: 41, baseType: !673, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!373, !604, !485, !485, !485, !604, !604}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !612, file: !607, line: 42, baseType: !677, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!373, !604, !604, !604}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !612, file: !607, line: 43, baseType: !677, size: 64, offset: 1216)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !612, file: !607, line: 44, baseType: !682, size: 64, offset: 1280)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!373, !604, !421, !589, !591, !593}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !612, file: !607, line: 45, baseType: !686, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!373, !604}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !612, file: !607, line: 46, baseType: !686, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !612, file: !607, line: 47, baseType: !691, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!373, !604, !487}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !612, file: !607, line: 48, baseType: !695, size: 64, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!373, !604, !467}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !612, file: !607, line: 49, baseType: !695, size: 64, offset: 1600)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !612, file: !607, line: 50, baseType: !691, size: 64, offset: 1664)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !612, file: !607, line: 51, baseType: !701, size: 64, offset: 1728)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!373, !604, !467, !475}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !612, file: !607, line: 52, baseType: !701, size: 64, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !612, file: !607, line: 53, baseType: !706, size: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!373, !604, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !612, file: !607, line: 54, baseType: !713, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!373, !604, !716, !537}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !612, file: !607, line: 55, baseType: !682, size: 64, offset: 1984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !612, file: !607, line: 56, baseType: !686, size: 64, offset: 2048)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !612, file: !607, line: 57, baseType: !720, size: 64, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!373, !604, !385}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !612, file: !607, line: 58, baseType: !724, size: 64, offset: 2176)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!373, !604, !591}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !612, file: !607, line: 59, baseType: !724, size: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !612, file: !607, line: 60, baseType: !629, size: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !612, file: !607, line: 61, baseType: !629, size: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !612, file: !607, line: 62, baseType: !639, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !612, file: !607, line: 63, baseType: !633, size: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !612, file: !607, line: 64, baseType: !633, size: 64, offset: 2560)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !612, file: !607, line: 65, baseType: !720, size: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !612, file: !607, line: 66, baseType: !686, size: 64, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !612, file: !607, line: 67, baseType: !686, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !612, file: !607, line: 68, baseType: !737, size: 64, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!373, !604, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !741, line: 30, baseType: !742)
!741 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !741, line: 30, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !612, file: !607, line: 69, baseType: !682, size: 64, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !612, file: !607, line: 70, baseType: !686, size: 64, offset: 2944)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !612, file: !607, line: 71, baseType: !747, size: 64, offset: 3008)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!373, !513, !604}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !612, file: !607, line: 72, baseType: !751, size: 64, offset: 3072)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!373, !604, !604, !475}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !612, file: !607, line: 73, baseType: !677, size: 64, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !612, file: !607, line: 74, baseType: !677, size: 64, offset: 3200)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !612, file: !607, line: 75, baseType: !677, size: 64, offset: 3264)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !612, file: !607, line: 76, baseType: !758, size: 64, offset: 3328)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!373, !604, !421, !589, !484}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !612, file: !607, line: 77, baseType: !686, size: 64, offset: 3392)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !612, file: !607, line: 78, baseType: !686, size: 64, offset: 3456)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !612, file: !607, line: 79, baseType: !686, size: 64, offset: 3520)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !612, file: !607, line: 80, baseType: !686, size: 64, offset: 3584)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !612, file: !607, line: 81, baseType: !646, size: 64, offset: 3648)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !612, file: !607, line: 82, baseType: !686, size: 64, offset: 3712)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !612, file: !607, line: 83, baseType: !768, size: 64, offset: 3776)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!373, !604, !421, !604, !593}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !612, file: !607, line: 84, baseType: !768, size: 64, offset: 3840)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !612, file: !607, line: 85, baseType: !773, size: 64, offset: 3904)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!373, !604, !604, !484, !484}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !612, file: !607, line: 86, baseType: !777, size: 64, offset: 3968)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!373, !604, !780, !618}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !741, line: 11, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !741, line: 11, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !612, file: !607, line: 87, baseType: !777, size: 64, offset: 4032)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !612, file: !607, line: 88, baseType: !785, size: 64, offset: 4096)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!373, !604, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !612, file: !607, line: 89, baseType: !785, size: 64, offset: 4160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !612, file: !607, line: 90, baseType: !791, size: 64, offset: 4224)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!373, !604, !421, !589, !589, !604, !593}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !612, file: !607, line: 91, baseType: !791, size: 64, offset: 4288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !612, file: !607, line: 92, baseType: !720, size: 64, offset: 4352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !612, file: !607, line: 93, baseType: !720, size: 64, offset: 4416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !612, file: !607, line: 94, baseType: !650, size: 64, offset: 4480)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !612, file: !607, line: 95, baseType: !650, size: 64, offset: 4544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !612, file: !607, line: 96, baseType: !650, size: 64, offset: 4608)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !612, file: !607, line: 97, baseType: !650, size: 64, offset: 4672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !612, file: !607, line: 98, baseType: !802, size: 64, offset: 4736)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!373, !604, !537}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !612, file: !607, line: 99, baseType: !691, size: 64, offset: 4800)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !612, file: !607, line: 100, baseType: !691, size: 64, offset: 4864)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !612, file: !607, line: 101, baseType: !808, size: 64, offset: 4928)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!373, !604, !487, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !612, file: !607, line: 102, baseType: !814, size: 64, offset: 4992)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!373, !604, !788, !811}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !612, file: !607, line: 103, baseType: !691, size: 64, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !612, file: !607, line: 104, baseType: !785, size: 64, offset: 5120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !612, file: !607, line: 105, baseType: !820, size: 64, offset: 5184)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!373, !421, !636, !618, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !606, file: !607, line: 144, baseType: !826, size: 64, offset: 9728)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !741, line: 60, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !828, file: !135, line: 241, baseType: !377, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !135, line: 242, baseType: !438, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !828, file: !135, line: 243, baseType: !421, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !828, file: !135, line: 243, baseType: !421, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !828, file: !135, line: 244, baseType: !421, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !828, file: !135, line: 244, baseType: !421, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !828, file: !135, line: 245, baseType: !467, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !828, file: !135, line: 246, baseType: !537, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !828, file: !135, line: 247, baseType: !421, size: 32, offset: 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !828, file: !135, line: 251, baseType: !421, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !828, file: !135, line: 252, baseType: !740, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !828, file: !135, line: 253, baseType: !537, size: 32, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !828, file: !135, line: 254, baseType: !421, size: 32, offset: 544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !828, file: !135, line: 254, baseType: !421, size: 32, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !828, file: !135, line: 255, baseType: !421, size: 32, offset: 608)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !606, file: !607, line: 145, baseType: !458, size: 64, offset: 9792)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !606, file: !607, line: 146, baseType: !537, size: 32, offset: 9856)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !606, file: !607, line: 147, baseType: !848, size: 1344, offset: 9920)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !607, line: 140, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !607, line: 114, size: 1344, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !869, !870, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !849, file: !607, line: 115, baseType: !421, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !849, file: !607, line: 116, baseType: !421, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !849, file: !607, line: 117, baseType: !421, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !849, file: !607, line: 118, baseType: !421, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !849, file: !607, line: 119, baseType: !421, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !849, file: !607, line: 120, baseType: !421, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !849, file: !607, line: 121, baseType: !467, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !849, file: !607, line: 122, baseType: !484, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !849, file: !607, line: 124, baseType: !377, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !607, line: 125, baseType: !438, size: 32, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !849, file: !607, line: 125, baseType: !438, size: 32, offset: 416)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !849, file: !607, line: 126, baseType: !438, size: 32, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !849, file: !607, line: 126, baseType: !438, size: 32, offset: 480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !849, file: !607, line: 127, baseType: !865, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !378, line: 339, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !378, line: 339, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !849, file: !607, line: 128, baseType: !865, size: 64, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !849, file: !607, line: 129, baseType: !871, size: 64, offset: 640)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !378, line: 341, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !378, line: 351, size: 192, elements: !874)
!874 = !{!875, !876, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !873, file: !378, line: 354, baseType: !93, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !873, file: !378, line: 355, baseType: !93, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !873, file: !378, line: 356, baseType: !93, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !873, file: !378, line: 361, baseType: !93, size: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !873, file: !378, line: 362, baseType: !533, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !849, file: !607, line: 130, baseType: !421, size: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !849, file: !607, line: 130, baseType: !421, size: 32, offset: 736)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !849, file: !607, line: 131, baseType: !484, size: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !849, file: !607, line: 131, baseType: !484, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !849, file: !607, line: 132, baseType: !467, size: 64, offset: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !849, file: !607, line: 132, baseType: !467, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !849, file: !607, line: 133, baseType: !421, size: 32, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !849, file: !607, line: 134, baseType: !467, size: 64, offset: 1088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !849, file: !607, line: 135, baseType: !421, size: 32, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !849, file: !607, line: 136, baseType: !537, size: 32, offset: 1184)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !849, file: !607, line: 137, baseType: !537, size: 32, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !849, file: !607, line: 138, baseType: !593, size: 32, offset: 1248)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !849, file: !607, line: 139, baseType: !467, size: 64, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !606, file: !607, line: 147, baseType: !848, size: 1344, offset: 11264)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !606, file: !607, line: 148, baseType: !537, size: 32, offset: 12608)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !606, file: !607, line: 149, baseType: !421, size: 32, offset: 12640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !606, file: !607, line: 150, baseType: !897, size: 32, offset: 12672)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !57)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !606, file: !607, line: 157, baseType: !448, size: 64, offset: 12736)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !583, file: !578, line: 40, baseType: !572, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !583, file: !578, line: 41, baseType: !601, size: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !583, file: !578, line: 42, baseType: !572, size: 64, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !583, file: !578, line: 43, baseType: !601, size: 64, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !583, file: !578, line: 44, baseType: !572, size: 64, offset: 576)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !583, file: !578, line: 46, baseType: !601, size: 64, offset: 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !583, file: !578, line: 47, baseType: !906, size: 64, offset: 704)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!373, !575, !780, !780, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !65, line: 1239, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 1226, size: 704, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !912, file: !65, line: 1227, baseType: !476, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !912, file: !65, line: 1228, baseType: !476, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !912, file: !65, line: 1229, baseType: !476, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !912, file: !65, line: 1230, baseType: !476, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !912, file: !65, line: 1231, baseType: !476, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !912, file: !65, line: 1232, baseType: !476, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !912, file: !65, line: 1233, baseType: !476, size: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !912, file: !65, line: 1234, baseType: !476, size: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !912, file: !65, line: 1236, baseType: !476, size: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !912, file: !65, line: 1237, baseType: !476, size: 64, offset: 576)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !912, file: !65, line: 1238, baseType: !476, size: 64, offset: 640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !583, file: !578, line: 48, baseType: !926, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!373, !575, !780, !909}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !583, file: !578, line: 49, baseType: !930, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!373, !575, !604, !476, !933, !476, !421, !421, !604}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !65, line: 1291, baseType: !64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !583, file: !578, line: 50, baseType: !935, size: 64, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!373, !575, !938, !939}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !65, line: 238, baseType: !77)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !583, file: !578, line: 52, baseType: !941, size: 64, offset: 960)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!373, !575, !944, !945}
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !65, line: 612, baseType: !83)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !947, file: !65, line: 593, baseType: !423, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !947, file: !65, line: 594, baseType: !423, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !947, file: !65, line: 594, baseType: !423, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !947, file: !65, line: 594, baseType: !423, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !947, file: !65, line: 595, baseType: !423, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !947, file: !65, line: 596, baseType: !423, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !947, file: !65, line: 597, baseType: !423, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !947, file: !65, line: 598, baseType: !423, size: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !947, file: !65, line: 598, baseType: !423, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !947, file: !65, line: 599, baseType: !423, size: 64, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !583, file: !578, line: 53, baseType: !960, size: 64, offset: 1024)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!373, !575, !575, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !583, file: !578, line: 54, baseType: !965, size: 64, offset: 1088)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!373, !575, !604}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !583, file: !578, line: 55, baseType: !572, size: 64, offset: 1152)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !583, file: !578, line: 56, baseType: !970, size: 64, offset: 1216)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!373, !575, !642, !475}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !583, file: !578, line: 58, baseType: !974, size: 64, offset: 1280)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!373, !575, !977}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !65, line: 424, baseType: !88)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !583, file: !578, line: 59, baseType: !974, size: 64, offset: 1344)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !583, file: !578, line: 60, baseType: !980, size: 64, offset: 1408)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!373, !575, !983, !537}
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !65, line: 469, baseType: !92)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !583, file: !578, line: 61, baseType: !985, size: 64, offset: 1472)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!373, !575}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !583, file: !578, line: 63, baseType: !989, size: 64, offset: 1536)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!373, !575, !421, !589, !485, !604, !604}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !583, file: !578, line: 64, baseType: !993, size: 64, offset: 1600)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!373, !575, !575, !780, !780, !909}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !583, file: !578, line: 65, baseType: !997, size: 64, offset: 1664)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!373, !575, !575, !909}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !583, file: !578, line: 66, baseType: !1001, size: 64, offset: 1728)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!373, !575, !575, !780, !909}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !583, file: !578, line: 67, baseType: !997, size: 64, offset: 1792)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !583, file: !578, line: 69, baseType: !985, size: 64, offset: 1856)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !583, file: !578, line: 70, baseType: !993, size: 64, offset: 1920)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !583, file: !578, line: 71, baseType: !1001, size: 64, offset: 1984)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !583, file: !578, line: 72, baseType: !1009, size: 64, offset: 2048)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!373, !575, !939}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !583, file: !578, line: 73, baseType: !985, size: 64, offset: 2112)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !583, file: !578, line: 75, baseType: !1014, size: 64, offset: 2176)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!373, !575, !1017, !939}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !65, line: 563, baseType: !123)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !583, file: !578, line: 76, baseType: !572, size: 64, offset: 2240)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !583, file: !578, line: 77, baseType: !572, size: 64, offset: 2304)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !583, file: !578, line: 78, baseType: !906, size: 64, offset: 2368)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !583, file: !578, line: 79, baseType: !926, size: 64, offset: 2432)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !583, file: !578, line: 81, baseType: !1023, size: 64, offset: 2496)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!373, !575, !485, !575, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !65, line: 285, baseType: !128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !583, file: !578, line: 82, baseType: !1028, size: 64, offset: 2560)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!373, !575, !421, !1031, !1031, !938, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !583, file: !578, line: 83, baseType: !1035, size: 64, offset: 2624)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!373, !575, !421, !824, !421}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !583, file: !578, line: 84, baseType: !1039, size: 64, offset: 2688)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!373, !575, !421, !589, !421, !589, !484}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !583, file: !578, line: 85, baseType: !1043, size: 64, offset: 2752)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!373, !575, !575, !1026}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !583, file: !578, line: 87, baseType: !1047, size: 64, offset: 2816)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!373, !575, !604, !467}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !583, file: !578, line: 88, baseType: !1051, size: 64, offset: 2880)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!373, !575, !485}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !583, file: !578, line: 89, baseType: !1051, size: 64, offset: 2944)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !583, file: !578, line: 90, baseType: !1056, size: 64, offset: 3008)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!373, !575, !604, !593}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !583, file: !578, line: 91, baseType: !989, size: 64, offset: 3072)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !583, file: !578, line: 93, baseType: !1061, size: 64, offset: 3136)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!373, !575, !709}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !583, file: !578, line: 94, baseType: !1065, size: 64, offset: 3200)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!373, !575, !421, !537, !537, !467, !1068, !1068, !963}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !583, file: !578, line: 95, baseType: !1065, size: 64, offset: 3264)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !583, file: !578, line: 96, baseType: !1065, size: 64, offset: 3328)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !583, file: !578, line: 97, baseType: !1065, size: 64, offset: 3392)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !583, file: !578, line: 99, baseType: !1073, size: 64, offset: 3456)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!373, !575, !1076, !1079}
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !741, line: 51, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !741, line: 51, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !65, line: 1378, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !578, line: 609, size: 6208, elements: !1082)
!1082 = !{!1083, !1084, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1103, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1121, !1122, !1123, !1124, !1125, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1081, file: !578, line: 610, baseType: !358, size: 4480)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1081, file: !578, line: 610, baseType: !1085, size: 32, offset: 4480)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !417)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1081, file: !578, line: 611, baseType: !421, size: 32, offset: 4512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1081, file: !578, line: 611, baseType: !421, size: 32, offset: 4544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1081, file: !578, line: 611, baseType: !421, size: 32, offset: 4576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1081, file: !578, line: 612, baseType: !421, size: 32, offset: 4608)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1081, file: !578, line: 613, baseType: !421, size: 32, offset: 4640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1081, file: !578, line: 614, baseType: !467, size: 64, offset: 4672)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1081, file: !578, line: 615, baseType: !469, size: 64, offset: 4736)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1081, file: !578, line: 616, baseType: !824, size: 64, offset: 4800)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1081, file: !578, line: 617, baseType: !467, size: 64, offset: 4864)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1081, file: !578, line: 618, baseType: !1096, size: 64, offset: 4928)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !578, line: 602, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 598, size: 128, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1098, file: !578, line: 599, baseType: !421, size: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1098, file: !578, line: 600, baseType: !421, size: 32, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1098, file: !578, line: 601, baseType: !484, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1081, file: !578, line: 619, baseType: !1104, size: 64, offset: 4992)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !578, line: 607, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 604, size: 128, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1106, file: !578, line: 605, baseType: !421, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1106, file: !578, line: 606, baseType: !484, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1081, file: !578, line: 620, baseType: !484, size: 64, offset: 5056)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1081, file: !578, line: 621, baseType: !476, size: 64, offset: 5120)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1081, file: !578, line: 622, baseType: !476, size: 64, offset: 5184)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1081, file: !578, line: 623, baseType: !604, size: 64, offset: 5248)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1081, file: !578, line: 623, baseType: !604, size: 64, offset: 5312)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1081, file: !578, line: 623, baseType: !604, size: 64, offset: 5376)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1081, file: !578, line: 624, baseType: !537, size: 32, offset: 5440)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1081, file: !578, line: 625, baseType: !1118, size: 64, offset: 5504)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!373}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1081, file: !578, line: 626, baseType: !458, size: 64, offset: 5568)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1081, file: !578, line: 627, baseType: !604, size: 64, offset: 5632)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1081, file: !578, line: 628, baseType: !421, size: 32, offset: 5696)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1081, file: !578, line: 629, baseType: !398, size: 64, offset: 5760)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1081, file: !578, line: 630, baseType: !1126, size: 32, offset: 5824)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !135, line: 213, baseType: !134)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1081, file: !578, line: 631, baseType: !421, size: 32, offset: 5856)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1081, file: !578, line: 631, baseType: !421, size: 32, offset: 5888)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1081, file: !578, line: 632, baseType: !537, size: 32, offset: 5920)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1081, file: !578, line: 633, baseType: !537, size: 32, offset: 5952)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1081, file: !578, line: 634, baseType: !409, size: 64, offset: 6016)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1081, file: !578, line: 634, baseType: !458, size: 64, offset: 6080)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1081, file: !578, line: 635, baseType: !429, size: 64, offset: 6144)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !583, file: !578, line: 100, baseType: !1135, size: 64, offset: 3520)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!373, !575, !421, !421, !1138, !1141}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !135, line: 215, baseType: !1140)
!1140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !583, file: !578, line: 101, baseType: !985, size: 64, offset: 3584)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !583, file: !578, line: 102, baseType: !1144, size: 64, offset: 3648)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!373, !575, !780, !780, !939}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !583, file: !578, line: 103, baseType: !586, size: 64, offset: 3712)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !583, file: !578, line: 105, baseType: !1149, size: 64, offset: 3776)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!373, !575, !780, !780, !938, !939}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !583, file: !578, line: 106, baseType: !985, size: 64, offset: 3840)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !583, file: !578, line: 107, baseType: !1154, size: 64, offset: 3904)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!373, !575, !385}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !583, file: !578, line: 108, baseType: !1158, size: 64, offset: 3968)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!373, !575, !1161, !938, !939}
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !65, line: 25, baseType: !398)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !583, file: !578, line: 109, baseType: !1118, size: 64, offset: 4032)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !583, file: !578, line: 111, baseType: !1164, size: 64, offset: 4096)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!373, !575, !575, !575, !476, !575}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !583, file: !578, line: 112, baseType: !1168, size: 64, offset: 4160)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!373, !575, !575, !575, !575}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !583, file: !578, line: 113, baseType: !1172, size: 64, offset: 4224)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!373, !575, !740, !740}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !583, file: !578, line: 114, baseType: !586, size: 64, offset: 4288)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !583, file: !578, line: 115, baseType: !989, size: 64, offset: 4352)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !583, file: !578, line: 117, baseType: !1047, size: 64, offset: 4416)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !583, file: !578, line: 118, baseType: !1047, size: 64, offset: 4480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !583, file: !578, line: 119, baseType: !1158, size: 64, offset: 4544)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !583, file: !578, line: 120, baseType: !1181, size: 64, offset: 4608)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!373, !575, !1184, !963}
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !65, line: 1675, baseType: !139)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !583, file: !578, line: 121, baseType: !1118, size: 64, offset: 4672)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !583, file: !578, line: 123, baseType: !1187, size: 64, offset: 4736)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!373, !575, !421, !458}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !583, file: !578, line: 124, baseType: !1191, size: 64, offset: 4800)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!373, !575, !1079, !604, !458}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !583, file: !578, line: 125, baseType: !1195, size: 64, offset: 4864)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!373, !513, !575}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !583, file: !578, line: 126, baseType: !572, size: 64, offset: 4928)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !583, file: !578, line: 127, baseType: !572, size: 64, offset: 4992)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !583, file: !578, line: 129, baseType: !1201, size: 64, offset: 5056)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!373, !575, !824}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !583, file: !578, line: 130, baseType: !1205, size: 64, offset: 5120)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!373, !575, !1208, !1208}
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !38, line: 654, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !38, line: 653, size: 128, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1210, file: !38, line: 653, baseType: !421, size: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1210, file: !38, line: 653, baseType: !604, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !583, file: !578, line: 131, baseType: !1205, size: 64, offset: 5184)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !583, file: !578, line: 132, baseType: !1216, size: 64, offset: 5248)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!373, !575, !467, !467, !467}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !583, file: !578, line: 133, baseType: !1154, size: 64, offset: 5312)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !583, file: !578, line: 135, baseType: !1221, size: 64, offset: 5376)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!373, !575, !476, !963}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !583, file: !578, line: 136, baseType: !1221, size: 64, offset: 5440)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !583, file: !578, line: 137, baseType: !1226, size: 64, offset: 5504)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!373, !575, !963}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !583, file: !578, line: 138, baseType: !586, size: 64, offset: 5568)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !583, file: !578, line: 139, baseType: !1231, size: 64, offset: 5632)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!373, !575, !618, !618}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !583, file: !578, line: 141, baseType: !1118, size: 64, offset: 5696)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !583, file: !578, line: 142, baseType: !1236, size: 64, offset: 5760)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!373, !575, !575, !476, !575}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !583, file: !578, line: 143, baseType: !1240, size: 64, offset: 5824)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!373, !575, !575, !575}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !583, file: !578, line: 144, baseType: !1118, size: 64, offset: 5888)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !583, file: !578, line: 145, baseType: !1236, size: 64, offset: 5952)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !583, file: !578, line: 147, baseType: !1240, size: 64, offset: 6016)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !583, file: !578, line: 148, baseType: !1118, size: 64, offset: 6080)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !583, file: !578, line: 149, baseType: !1236, size: 64, offset: 6144)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !583, file: !578, line: 150, baseType: !1240, size: 64, offset: 6208)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !583, file: !578, line: 151, baseType: !1250, size: 64, offset: 6272)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!373, !575, !537}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !583, file: !578, line: 153, baseType: !985, size: 64, offset: 6336)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !583, file: !578, line: 154, baseType: !985, size: 64, offset: 6400)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !583, file: !578, line: 155, baseType: !985, size: 64, offset: 6464)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !583, file: !578, line: 156, baseType: !985, size: 64, offset: 6528)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !583, file: !578, line: 157, baseType: !1154, size: 64, offset: 6592)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !583, file: !578, line: 159, baseType: !1259, size: 64, offset: 6656)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!373, !575, !421, !591}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !583, file: !578, line: 160, baseType: !985, size: 64, offset: 6720)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !583, file: !578, line: 161, baseType: !985, size: 64, offset: 6784)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !583, file: !578, line: 162, baseType: !985, size: 64, offset: 6848)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !583, file: !578, line: 163, baseType: !985, size: 64, offset: 6912)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !583, file: !578, line: 165, baseType: !1240, size: 64, offset: 6976)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !583, file: !578, line: 166, baseType: !1240, size: 64, offset: 7040)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !583, file: !578, line: 167, baseType: !1047, size: 64, offset: 7104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !583, file: !578, line: 168, baseType: !1270, size: 64, offset: 7168)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!373, !575, !604, !421}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !583, file: !578, line: 169, baseType: !1274, size: 64, offset: 7232)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!373, !575, !963, !467}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !583, file: !578, line: 171, baseType: !1009, size: 64, offset: 7296)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !583, file: !578, line: 172, baseType: !985, size: 64, offset: 7360)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !583, file: !578, line: 173, baseType: !1280, size: 64, offset: 7424)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!373, !575, !467, !1068}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !583, file: !578, line: 174, baseType: !1144, size: 64, offset: 7488)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !583, file: !578, line: 175, baseType: !1144, size: 64, offset: 7552)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !583, file: !578, line: 177, baseType: !572, size: 64, offset: 7616)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !583, file: !578, line: 178, baseType: !935, size: 64, offset: 7680)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !583, file: !578, line: 179, baseType: !572, size: 64, offset: 7744)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !583, file: !578, line: 180, baseType: !601, size: 64, offset: 7808)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !583, file: !578, line: 181, baseType: !1290, size: 64, offset: 7872)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!373, !575, !377, !938, !939}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !583, file: !578, line: 183, baseType: !1201, size: 64, offset: 7936)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !583, file: !578, line: 184, baseType: !970, size: 64, offset: 8000)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !583, file: !578, line: 185, baseType: !1296, size: 64, offset: 8064)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!373, !575, !788}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !583, file: !578, line: 186, baseType: !1300, size: 64, offset: 8128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!373, !575, !421, !589, !484}
