; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/convert.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/convert.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!238 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !{!301, !319, !400, !340}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !304, line: 73, size: 4480, elements: !305)
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!305 = !{!306, !308, !361, !362, !364, !367, !368, !369, !370, !378, !379, !381, !385, !389, !391, !392, !393, !394, !395, !396, !397, !398, !399, !401, !403, !404, !405, !407, !408, !410, !412, !413, !414, !415, !416, !419, !421, !422, !423, !424, !425, !428, !430, !431, !432, !442, !444, !445, !449, !450, !499, !504, !506, !507, !508}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !303, file: !304, line: 74, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !303, file: !304, line: 75, baseType: !309, size: 448, offset: 64)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 448, elements: !359)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !304, line: 53, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 45, size: 448, elements: !312)
!312 = !{!313, !323, !331, !336, !343, !347, !354}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !311, file: !304, line: 46, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !301, !318}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !320, line: 330, baseType: !321)
!320 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !320, line: 330, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !311, file: !304, line: 47, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!317, !301, !327}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !328, line: 16, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !328, line: 16, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !311, file: !304, line: 48, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!317, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !311, file: !304, line: 49, baseType: !337, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!317, !301, !340, !301}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !311, file: !304, line: 50, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!317, !301, !340, !335}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !311, file: !304, line: 51, baseType: !348, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!317, !301, !340, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !311, file: !304, line: 52, baseType: !355, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!317, !301, !340, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!359 = !{!360}
!360 = !DISubrange(count: 1)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !303, file: !304, line: 76, baseType: !319, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 77, baseType: !363, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !303, file: !304, line: 78, baseType: !365, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !366)
!366 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !303, file: !304, line: 78, baseType: !365, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !303, file: !304, line: 78, baseType: !365, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !303, file: !304, line: 78, baseType: !365, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !303, file: !304, line: 79, baseType: !371, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !374, line: 27, baseType: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !376, line: 43, baseType: !377)
!376 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!377 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !303, file: !304, line: 80, baseType: !363, size: 32, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !303, file: !304, line: 81, baseType: !380, size: 32, offset: 992)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !303, file: !304, line: 82, baseType: !382, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !303, file: !304, line: 83, baseType: !386, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !303, file: !304, line: 84, baseType: !390, size: 64, offset: 1152)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !303, file: !304, line: 85, baseType: !390, size: 64, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !303, file: !304, line: 86, baseType: !390, size: 64, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !303, file: !304, line: 87, baseType: !390, size: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !303, file: !304, line: 88, baseType: !301, size: 64, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !303, file: !304, line: 89, baseType: !371, size: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !304, line: 90, baseType: !390, size: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !303, file: !304, line: 91, baseType: !390, size: 64, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !303, file: !304, line: 92, baseType: !363, size: 32, offset: 1664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !303, file: !304, line: 93, baseType: !400, size: 64, offset: 1728)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !304, line: 94, baseType: !402, size: 64, offset: 1792)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !372)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !303, file: !304, line: 95, baseType: !363, size: 32, offset: 1856)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !303, file: !304, line: 95, baseType: !363, size: 32, offset: 1888)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !303, file: !304, line: 96, baseType: !406, size: 64, offset: 1920)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !303, file: !304, line: 96, baseType: !406, size: 64, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !303, file: !304, line: 97, baseType: !409, size: 64, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !303, file: !304, line: 97, baseType: !411, size: 64, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !303, file: !304, line: 98, baseType: !363, size: 32, offset: 2176)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !303, file: !304, line: 98, baseType: !363, size: 32, offset: 2208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !303, file: !304, line: 99, baseType: !406, size: 64, offset: 2240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !303, file: !304, line: 99, baseType: !406, size: 64, offset: 2304)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !303, file: !304, line: 100, baseType: !417, size: 64, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !366)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !303, file: !304, line: 100, baseType: !420, size: 64, offset: 2432)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !303, file: !304, line: 101, baseType: !363, size: 32, offset: 2496)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !303, file: !304, line: 101, baseType: !363, size: 32, offset: 2528)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !303, file: !304, line: 102, baseType: !406, size: 64, offset: 2560)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !303, file: !304, line: 102, baseType: !406, size: 64, offset: 2624)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !303, file: !304, line: 103, baseType: !426, size: 64, offset: 2688)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !418)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !303, file: !304, line: 103, baseType: !429, size: 64, offset: 2752)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !303, file: !304, line: 104, baseType: !358, size: 64, offset: 2816)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !303, file: !304, line: 105, baseType: !363, size: 32, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !303, file: !304, line: 106, baseType: !433, size: 128, offset: 2944)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 128, elements: !440)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !304, line: 64, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 61, size: 128, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !436, file: !304, line: 62, baseType: !351, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !436, file: !304, line: 63, baseType: !400, size: 64, offset: 64)
!440 = !{!441}
!441 = !DISubrange(count: 2)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !303, file: !304, line: 107, baseType: !443, size: 64, offset: 3072)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, elements: !440)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !303, file: !304, line: 108, baseType: !400, size: 64, offset: 3136)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !303, file: !304, line: 109, baseType: !446, size: 64, offset: 3200)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!317, !400}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !303, file: !304, line: 111, baseType: !363, size: 32, offset: 3264)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !303, file: !304, line: 112, baseType: !451, size: 320, offset: 3328)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 320, elements: !497)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!317, !455, !301, !400}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !458)
!458 = !{!459, !460, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !457, file: !10, line: 100, baseType: !363, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !10, line: 101, baseType: !461, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !472, !473, !474, !478, !480, !482, !483, !484}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !463, file: !10, line: 84, baseType: !390, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !463, file: !10, line: 85, baseType: !390, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !10, line: 86, baseType: !400, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !463, file: !10, line: 87, baseType: !382, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !463, file: !10, line: 88, baseType: !470, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !463, file: !10, line: 89, baseType: !342, size: 8, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !463, file: !10, line: 90, baseType: !390, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !463, file: !10, line: 91, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !476, line: 46, baseType: !477)
!476 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!477 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !463, file: !10, line: 92, baseType: !479, size: 32, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !10, line: 93, baseType: !481, size: 32, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !10, line: 94, baseType: !461, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !463, file: !10, line: 95, baseType: !390, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !463, file: !10, line: 96, baseType: !400, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !457, file: !10, line: 102, baseType: !390, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !457, file: !10, line: 102, baseType: !390, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !457, file: !10, line: 103, baseType: !390, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !457, file: !10, line: 104, baseType: !319, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 416)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !457, file: !10, line: 105, baseType: !479, size: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !457, file: !10, line: 106, baseType: !301, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !457, file: !10, line: 107, baseType: !494, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!497 = !{!498}
!498 = !DISubrange(count: 5)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !303, file: !304, line: 113, baseType: !500, size: 320, offset: 3648)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !497)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!317, !301, !400}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !303, file: !304, line: 114, baseType: !505, size: 320, offset: 3968)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 320, elements: !497)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !303, file: !304, line: 115, baseType: !479, size: 32, offset: 4288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !303, file: !304, line: 120, baseType: !494, size: 64, offset: 4352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !303, file: !304, line: 121, baseType: !479, size: 32, offset: 4416)
!509 = !{i32 7, !"Dwarf Version", i32 4}
!510 = !{i32 2, !"Debug Info Version", i32 3}
!511 = !{i32 1, !"wchar_size", i32 4}
!512 = !{i32 7, !"PIC Level", i32 2}
!513 = !{i32 7, !"uwtable", i32 1}
!514 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!515 = distinct !DISubprogram(name: "MatConvert_Basic", scope: !516, file: !516, line: 10, type: !517, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1288)
!516 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/convert.c", directory: "/home/users/ndemeye/xSDK")
!517 = !DISubroutineType(types: !518)
!518 = !{!317, !519, !1287, !598, !599}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !522, line: 436, size: 23424, elements: !523)
!522 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!523 = !{!524, !526, !1030, !1050, !1051, !1052, !1054, !1055, !1056, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1183, !1184, !1200, !1201, !1202, !1203, !1204, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1239, !1259, !1260, !1262, !1263, !1264, !1265, !1266, !1267, !1285, !1286}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !521, file: !522, line: 437, baseType: !525, size: 4480)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !304, line: 122, baseType: !303)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !521, file: !522, line: 437, baseType: !527, size: 9472, offset: 4480)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 9472, elements: !359)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !522, line: 32, size: 9472, elements: !529)
!529 = !{!530, !539, !543, !544, !551, !555, !556, !557, !558, !559, !560, !561, !585, !589, !594, !600, !619, !624, !628, !629, !634, !639, !640, !645, !649, !653, !657, !661, !665, !666, !667, !668, !669, !673, !674, !679, !680, !681, !682, !683, !688, !695, !700, !704, !708, !712, !716, !717, !721, !722, !729, !734, !735, !736, !737, !799, !807, !808, !812, !813, !817, !818, !822, !824, !825, !829, !833, !840, !841, !842, !843, !844, !845, !850, !851, !855, !859, !863, !864, !865, !869, !879, !880, !884, !885, !889, !890, !894, !895, !900, !901, !905, !909, !910, !911, !912, !913, !914, !915, !919, !920, !921, !922, !923, !924, !928, !929, !930, !931, !932, !933, !934, !935, !939, !943, !944, !945, !949, !950, !951, !952, !953, !954, !955, !959, !960, !961, !966, !970, !971, !975, !976, !977, !978, !1004, !1008, !1009, !1010, !1011, !1012, !1016, !1017, !1018, !1019, !1020, !1024, !1028, !1029}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !528, file: !522, line: 34, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!317, !519, !363, !534, !363, !534, !536, !538}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !528, file: !522, line: 35, baseType: !540, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!317, !519, !363, !409, !411, !429}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !528, file: !522, line: 36, baseType: !540, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !528, file: !522, line: 37, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!317, !519, !548, !548}
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !528, file: !522, line: 38, baseType: !552, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!317, !519, !548, !548, !548}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !528, file: !522, line: 40, baseType: !545, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !528, file: !522, line: 41, baseType: !552, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !528, file: !522, line: 42, baseType: !545, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !528, file: !522, line: 43, baseType: !552, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !528, file: !522, line: 44, baseType: !545, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !528, file: !522, line: 46, baseType: !552, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !528, file: !522, line: 47, baseType: !562, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!317, !519, !565, !565, !569}
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !566, line: 11, baseType: !567)
!566 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !566, line: 11, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !572, file: !36, line: 1227, baseType: !418, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !572, file: !36, line: 1228, baseType: !418, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !572, file: !36, line: 1229, baseType: !418, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !572, file: !36, line: 1230, baseType: !418, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !572, file: !36, line: 1231, baseType: !418, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !572, file: !36, line: 1232, baseType: !418, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !572, file: !36, line: 1233, baseType: !418, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !572, file: !36, line: 1234, baseType: !418, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !572, file: !36, line: 1236, baseType: !418, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !572, file: !36, line: 1237, baseType: !418, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !572, file: !36, line: 1238, baseType: !418, size: 64, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !528, file: !522, line: 48, baseType: !586, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!317, !519, !565, !569}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !528, file: !522, line: 49, baseType: !590, size: 64, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!317, !519, !548, !418, !593, !418, !363, !363, !548}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !528, file: !522, line: 50, baseType: !595, size: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!317, !519, !598, !599}
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !528, file: !522, line: 52, baseType: !601, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!317, !519, !604, !605}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !607, file: !36, line: 593, baseType: !365, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !607, file: !36, line: 594, baseType: !365, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !607, file: !36, line: 594, baseType: !365, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !607, file: !36, line: 594, baseType: !365, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !607, file: !36, line: 595, baseType: !365, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !607, file: !36, line: 596, baseType: !365, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !607, file: !36, line: 597, baseType: !365, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !607, file: !36, line: 598, baseType: !365, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !607, file: !36, line: 598, baseType: !365, size: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !607, file: !36, line: 599, baseType: !365, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !528, file: !522, line: 53, baseType: !620, size: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!317, !519, !519, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !528, file: !522, line: 54, baseType: !625, size: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!317, !519, !548}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !528, file: !522, line: 55, baseType: !545, size: 64, offset: 1152)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !528, file: !522, line: 56, baseType: !630, size: 64, offset: 1216)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!317, !519, !633, !417}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !528, file: !522, line: 58, baseType: !635, size: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!317, !519, !638}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !528, file: !522, line: 59, baseType: !635, size: 64, offset: 1344)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !528, file: !522, line: 60, baseType: !641, size: 64, offset: 1408)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!317, !519, !644, !479}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !528, file: !522, line: 61, baseType: !646, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!317, !519}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !528, file: !522, line: 63, baseType: !650, size: 64, offset: 1536)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!317, !519, !363, !534, !427, !548, !548}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !528, file: !522, line: 64, baseType: !654, size: 64, offset: 1600)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!317, !519, !519, !565, !565, !569}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !528, file: !522, line: 65, baseType: !658, size: 64, offset: 1664)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!317, !519, !519, !569}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !528, file: !522, line: 66, baseType: !662, size: 64, offset: 1728)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!317, !519, !519, !565, !569}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !528, file: !522, line: 67, baseType: !658, size: 64, offset: 1792)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !528, file: !522, line: 69, baseType: !646, size: 64, offset: 1856)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !528, file: !522, line: 70, baseType: !654, size: 64, offset: 1920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !528, file: !522, line: 71, baseType: !662, size: 64, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !528, file: !522, line: 72, baseType: !670, size: 64, offset: 2048)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!317, !519, !599}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !528, file: !522, line: 73, baseType: !646, size: 64, offset: 2112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !528, file: !522, line: 75, baseType: !675, size: 64, offset: 2176)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!317, !519, !678, !599}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !528, file: !522, line: 76, baseType: !545, size: 64, offset: 2240)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !528, file: !522, line: 77, baseType: !545, size: 64, offset: 2304)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !528, file: !522, line: 78, baseType: !562, size: 64, offset: 2368)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !528, file: !522, line: 79, baseType: !586, size: 64, offset: 2432)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !528, file: !522, line: 81, baseType: !684, size: 64, offset: 2496)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!317, !519, !427, !519, !687}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !528, file: !522, line: 82, baseType: !689, size: 64, offset: 2560)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!317, !519, !363, !692, !692, !598, !694}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !528, file: !522, line: 83, baseType: !696, size: 64, offset: 2624)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!317, !519, !363, !699, !363}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !528, file: !522, line: 84, baseType: !701, size: 64, offset: 2688)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!317, !519, !363, !534, !363, !534, !426}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !528, file: !522, line: 85, baseType: !705, size: 64, offset: 2752)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!317, !519, !519, !687}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !528, file: !522, line: 87, baseType: !709, size: 64, offset: 2816)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!317, !519, !548, !409}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !528, file: !522, line: 88, baseType: !713, size: 64, offset: 2880)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!317, !519, !427}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !528, file: !522, line: 89, baseType: !713, size: 64, offset: 2944)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !528, file: !522, line: 90, baseType: !718, size: 64, offset: 3008)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!317, !519, !548, !538}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !528, file: !522, line: 91, baseType: !650, size: 64, offset: 3072)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !528, file: !522, line: 93, baseType: !723, size: 64, offset: 3136)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!317, !519, !726}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !528, file: !522, line: 94, baseType: !730, size: 64, offset: 3200)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!317, !519, !363, !479, !479, !409, !733, !733, !623}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !528, file: !522, line: 95, baseType: !730, size: 64, offset: 3264)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !528, file: !522, line: 96, baseType: !730, size: 64, offset: 3328)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !528, file: !522, line: 97, baseType: !730, size: 64, offset: 3392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !528, file: !522, line: 99, baseType: !738, size: 64, offset: 3456)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!317, !519, !741, !744}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !566, line: 51, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !566, line: 51, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !522, line: 609, size: 6208, elements: !747)
!747 = !{!748, !749, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !768, !775, !776, !777, !778, !779, !780, !781, !782, !786, !787, !788, !789, !790, !792, !793, !794, !795, !796, !797, !798}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !746, file: !522, line: 610, baseType: !525, size: 4480)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !746, file: !522, line: 610, baseType: !750, size: 32, offset: 4480)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !359)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !746, file: !522, line: 611, baseType: !363, size: 32, offset: 4512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !746, file: !522, line: 611, baseType: !363, size: 32, offset: 4544)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !746, file: !522, line: 611, baseType: !363, size: 32, offset: 4576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !746, file: !522, line: 612, baseType: !363, size: 32, offset: 4608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !746, file: !522, line: 613, baseType: !363, size: 32, offset: 4640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !746, file: !522, line: 614, baseType: !409, size: 64, offset: 4672)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !746, file: !522, line: 615, baseType: !411, size: 64, offset: 4736)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !746, file: !522, line: 616, baseType: !699, size: 64, offset: 4800)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !746, file: !522, line: 617, baseType: !409, size: 64, offset: 4864)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !746, file: !522, line: 618, baseType: !761, size: 64, offset: 4928)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !522, line: 602, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 598, size: 128, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !763, file: !522, line: 599, baseType: !363, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !763, file: !522, line: 600, baseType: !363, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !763, file: !522, line: 601, baseType: !426, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !746, file: !522, line: 619, baseType: !769, size: 64, offset: 4992)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !522, line: 607, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 604, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !771, file: !522, line: 605, baseType: !363, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !771, file: !522, line: 606, baseType: !426, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !746, file: !522, line: 620, baseType: !426, size: 64, offset: 5056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !746, file: !522, line: 621, baseType: !418, size: 64, offset: 5120)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !746, file: !522, line: 622, baseType: !418, size: 64, offset: 5184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !746, file: !522, line: 623, baseType: !548, size: 64, offset: 5248)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !746, file: !522, line: 623, baseType: !548, size: 64, offset: 5312)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !746, file: !522, line: 623, baseType: !548, size: 64, offset: 5376)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !746, file: !522, line: 624, baseType: !479, size: 32, offset: 5440)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !746, file: !522, line: 625, baseType: !783, size: 64, offset: 5504)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!317}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !746, file: !522, line: 626, baseType: !400, size: 64, offset: 5568)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !746, file: !522, line: 627, baseType: !548, size: 64, offset: 5632)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !746, file: !522, line: 628, baseType: !363, size: 32, offset: 5696)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !746, file: !522, line: 629, baseType: !340, size: 64, offset: 5760)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !746, file: !522, line: 630, baseType: !791, size: 32, offset: 5824)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !746, file: !522, line: 631, baseType: !363, size: 32, offset: 5856)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !746, file: !522, line: 631, baseType: !363, size: 32, offset: 5888)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !746, file: !522, line: 632, baseType: !479, size: 32, offset: 5920)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !746, file: !522, line: 633, baseType: !479, size: 32, offset: 5952)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !746, file: !522, line: 634, baseType: !351, size: 64, offset: 6016)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !746, file: !522, line: 634, baseType: !400, size: 64, offset: 6080)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !746, file: !522, line: 635, baseType: !371, size: 64, offset: 6144)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !528, file: !522, line: 100, baseType: !800, size: 64, offset: 3520)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!317, !519, !363, !363, !803, !806}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !805)
!805 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !528, file: !522, line: 101, baseType: !646, size: 64, offset: 3584)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !528, file: !522, line: 102, baseType: !809, size: 64, offset: 3648)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!317, !519, !565, !565, !599}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !528, file: !522, line: 103, baseType: !531, size: 64, offset: 3712)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !528, file: !522, line: 105, baseType: !814, size: 64, offset: 3776)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!317, !519, !565, !565, !598, !599}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !528, file: !522, line: 106, baseType: !646, size: 64, offset: 3840)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !528, file: !522, line: 107, baseType: !819, size: 64, offset: 3904)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!317, !519, !327}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !528, file: !522, line: 108, baseType: !823, size: 64, offset: 3968)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !528, file: !522, line: 109, baseType: !783, size: 64, offset: 4032)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !528, file: !522, line: 111, baseType: !826, size: 64, offset: 4096)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!317, !519, !519, !519, !418, !519}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !528, file: !522, line: 112, baseType: !830, size: 64, offset: 4160)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!317, !519, !519, !519, !519}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !528, file: !522, line: 113, baseType: !834, size: 64, offset: 4224)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!317, !519, !837, !837}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !566, line: 30, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !566, line: 30, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !528, file: !522, line: 114, baseType: !531, size: 64, offset: 4288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !528, file: !522, line: 115, baseType: !650, size: 64, offset: 4352)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !528, file: !522, line: 117, baseType: !709, size: 64, offset: 4416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !528, file: !522, line: 118, baseType: !709, size: 64, offset: 4480)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !528, file: !522, line: 119, baseType: !823, size: 64, offset: 4544)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !528, file: !522, line: 120, baseType: !846, size: 64, offset: 4608)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!317, !519, !849, !623}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !528, file: !522, line: 121, baseType: !783, size: 64, offset: 4672)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !528, file: !522, line: 123, baseType: !852, size: 64, offset: 4736)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!317, !519, !363, !400}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !528, file: !522, line: 124, baseType: !856, size: 64, offset: 4800)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!317, !519, !744, !548, !400}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !528, file: !522, line: 125, baseType: !860, size: 64, offset: 4864)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!317, !455, !519}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !528, file: !522, line: 126, baseType: !545, size: 64, offset: 4928)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !528, file: !522, line: 127, baseType: !545, size: 64, offset: 4992)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !528, file: !522, line: 129, baseType: !866, size: 64, offset: 5056)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!317, !519, !699}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !528, file: !522, line: 130, baseType: !870, size: 64, offset: 5120)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!317, !519, !873, !873}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !875, file: !60, line: 653, baseType: !363, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !875, file: !60, line: 653, baseType: !548, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !528, file: !522, line: 131, baseType: !870, size: 64, offset: 5184)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !528, file: !522, line: 132, baseType: !881, size: 64, offset: 5248)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!317, !519, !409, !409, !409}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !528, file: !522, line: 133, baseType: !819, size: 64, offset: 5312)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !528, file: !522, line: 135, baseType: !886, size: 64, offset: 5376)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!317, !519, !418, !623}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !528, file: !522, line: 136, baseType: !886, size: 64, offset: 5440)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !528, file: !522, line: 137, baseType: !891, size: 64, offset: 5504)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!317, !519, !623}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !528, file: !522, line: 138, baseType: !531, size: 64, offset: 5568)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !528, file: !522, line: 139, baseType: !896, size: 64, offset: 5632)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!317, !519, !899, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !528, file: !522, line: 141, baseType: !783, size: 64, offset: 5696)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !528, file: !522, line: 142, baseType: !902, size: 64, offset: 5760)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!317, !519, !519, !418, !519}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !528, file: !522, line: 143, baseType: !906, size: 64, offset: 5824)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!317, !519, !519, !519}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !528, file: !522, line: 144, baseType: !783, size: 64, offset: 5888)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !528, file: !522, line: 145, baseType: !902, size: 64, offset: 5952)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !528, file: !522, line: 147, baseType: !906, size: 64, offset: 6016)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !528, file: !522, line: 148, baseType: !783, size: 64, offset: 6080)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !528, file: !522, line: 149, baseType: !902, size: 64, offset: 6144)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !528, file: !522, line: 150, baseType: !906, size: 64, offset: 6208)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !528, file: !522, line: 151, baseType: !916, size: 64, offset: 6272)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!317, !519, !479}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !528, file: !522, line: 153, baseType: !646, size: 64, offset: 6336)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !528, file: !522, line: 154, baseType: !646, size: 64, offset: 6400)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !528, file: !522, line: 155, baseType: !646, size: 64, offset: 6464)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !528, file: !522, line: 156, baseType: !646, size: 64, offset: 6528)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !528, file: !522, line: 157, baseType: !819, size: 64, offset: 6592)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !528, file: !522, line: 159, baseType: !925, size: 64, offset: 6656)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!317, !519, !363, !536}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !528, file: !522, line: 160, baseType: !646, size: 64, offset: 6720)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !528, file: !522, line: 161, baseType: !646, size: 64, offset: 6784)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !528, file: !522, line: 162, baseType: !646, size: 64, offset: 6848)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !528, file: !522, line: 163, baseType: !646, size: 64, offset: 6912)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !528, file: !522, line: 165, baseType: !906, size: 64, offset: 6976)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !528, file: !522, line: 166, baseType: !906, size: 64, offset: 7040)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !528, file: !522, line: 167, baseType: !709, size: 64, offset: 7104)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !528, file: !522, line: 168, baseType: !936, size: 64, offset: 7168)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!317, !519, !548, !363}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !528, file: !522, line: 169, baseType: !940, size: 64, offset: 7232)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!317, !519, !623, !409}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !528, file: !522, line: 171, baseType: !670, size: 64, offset: 7296)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !528, file: !522, line: 172, baseType: !646, size: 64, offset: 7360)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !528, file: !522, line: 173, baseType: !946, size: 64, offset: 7424)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!317, !519, !409, !733}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !528, file: !522, line: 174, baseType: !809, size: 64, offset: 7488)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !528, file: !522, line: 175, baseType: !809, size: 64, offset: 7552)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !528, file: !522, line: 177, baseType: !545, size: 64, offset: 7616)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !528, file: !522, line: 178, baseType: !595, size: 64, offset: 7680)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !528, file: !522, line: 179, baseType: !545, size: 64, offset: 7744)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !528, file: !522, line: 180, baseType: !552, size: 64, offset: 7808)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !528, file: !522, line: 181, baseType: !956, size: 64, offset: 7872)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!317, !519, !319, !598, !599}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !528, file: !522, line: 183, baseType: !866, size: 64, offset: 7936)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !528, file: !522, line: 184, baseType: !630, size: 64, offset: 8000)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !528, file: !522, line: 185, baseType: !962, size: 64, offset: 8064)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!317, !519, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !528, file: !522, line: 186, baseType: !967, size: 64, offset: 8128)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!317, !519, !363, !534, !426}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !528, file: !522, line: 187, baseType: !689, size: 64, offset: 8192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !528, file: !522, line: 189, baseType: !972, size: 64, offset: 8256)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!317, !519, !363, !363, !409, !536}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !528, file: !522, line: 190, baseType: !783, size: 64, offset: 8320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !528, file: !522, line: 191, baseType: !902, size: 64, offset: 8384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !528, file: !522, line: 192, baseType: !906, size: 64, offset: 8448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !528, file: !522, line: 193, baseType: !979, size: 64, offset: 8512)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!317, !519, !741, !982}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !522, line: 660, size: 5312, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !984, file: !522, line: 661, baseType: !525, size: 4480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !984, file: !522, line: 661, baseType: !750, size: 32, offset: 4480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !984, file: !522, line: 662, baseType: !363, size: 32, offset: 4512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !984, file: !522, line: 662, baseType: !363, size: 32, offset: 4544)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !984, file: !522, line: 662, baseType: !363, size: 32, offset: 4576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !984, file: !522, line: 663, baseType: !363, size: 32, offset: 4608)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !984, file: !522, line: 664, baseType: !363, size: 32, offset: 4640)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !984, file: !522, line: 665, baseType: !409, size: 64, offset: 4672)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !984, file: !522, line: 666, baseType: !409, size: 64, offset: 4736)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !984, file: !522, line: 667, baseType: !363, size: 32, offset: 4800)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !984, file: !522, line: 668, baseType: !791, size: 32, offset: 4832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !984, file: !522, line: 670, baseType: !409, size: 64, offset: 4864)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !984, file: !522, line: 670, baseType: !409, size: 64, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !984, file: !522, line: 671, baseType: !409, size: 64, offset: 4992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !984, file: !522, line: 672, baseType: !409, size: 64, offset: 5056)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !984, file: !522, line: 673, baseType: !409, size: 64, offset: 5120)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !984, file: !522, line: 674, baseType: !363, size: 32, offset: 5184)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !984, file: !522, line: 675, baseType: !409, size: 64, offset: 5248)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !528, file: !522, line: 195, baseType: !1005, size: 64, offset: 8576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!317, !982, !519, !519}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !528, file: !522, line: 196, baseType: !1005, size: 64, offset: 8640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !528, file: !522, line: 197, baseType: !783, size: 64, offset: 8704)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !528, file: !522, line: 198, baseType: !902, size: 64, offset: 8768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !528, file: !522, line: 199, baseType: !906, size: 64, offset: 8832)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !528, file: !522, line: 201, baseType: !1013, size: 64, offset: 8896)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!317, !519, !363, !363}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !528, file: !522, line: 202, baseType: !684, size: 64, offset: 8960)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !528, file: !522, line: 203, baseType: !552, size: 64, offset: 9024)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !528, file: !522, line: 204, baseType: !738, size: 64, offset: 9088)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !528, file: !522, line: 205, baseType: !866, size: 64, offset: 9152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !528, file: !522, line: 206, baseType: !1021, size: 64, offset: 9216)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!317, !319, !519, !363, !598, !599}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !528, file: !522, line: 208, baseType: !1025, size: 64, offset: 9280)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!317, !363, !694}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !528, file: !522, line: 209, baseType: !906, size: 64, offset: 9344)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !528, file: !522, line: 210, baseType: !701, size: 64, offset: 9408)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !521, file: !522, line: 438, baseType: !1031, size: 64, offset: 13952)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !566, line: 60, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1033, file: !114, line: 241, baseType: !319, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !114, line: 242, baseType: !380, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1033, file: !114, line: 243, baseType: !363, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1033, file: !114, line: 243, baseType: !363, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1033, file: !114, line: 244, baseType: !363, size: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1033, file: !114, line: 244, baseType: !363, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1033, file: !114, line: 245, baseType: !409, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1033, file: !114, line: 246, baseType: !479, size: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1033, file: !114, line: 247, baseType: !363, size: 32, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1033, file: !114, line: 251, baseType: !363, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1033, file: !114, line: 252, baseType: !837, size: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1033, file: !114, line: 253, baseType: !479, size: 32, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1033, file: !114, line: 254, baseType: !363, size: 32, offset: 544)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1033, file: !114, line: 254, baseType: !363, size: 32, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1033, file: !114, line: 255, baseType: !363, size: 32, offset: 608)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !521, file: !522, line: 438, baseType: !1031, size: 64, offset: 14016)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !521, file: !522, line: 439, baseType: !400, size: 64, offset: 14080)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !521, file: !522, line: 440, baseType: !1053, size: 32, offset: 14144)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !521, file: !522, line: 441, baseType: !479, size: 32, offset: 14176)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !521, file: !522, line: 442, baseType: !479, size: 32, offset: 14208)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !521, file: !522, line: 443, baseType: !1057, size: 448, offset: 14272)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 448, elements: !1059)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !340)
!1059 = !{!1060}
!1060 = !DISubrange(count: 7)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !521, file: !522, line: 444, baseType: !479, size: 32, offset: 14720)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !521, file: !522, line: 445, baseType: !479, size: 32, offset: 14752)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !521, file: !522, line: 446, baseType: !363, size: 32, offset: 14784)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !521, file: !522, line: 447, baseType: !402, size: 64, offset: 14848)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !521, file: !522, line: 448, baseType: !402, size: 64, offset: 14912)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !521, file: !522, line: 449, baseType: !606, size: 640, offset: 14976)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !521, file: !522, line: 450, baseType: !538, size: 32, offset: 15616)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !521, file: !522, line: 451, baseType: !1069, size: 2880, offset: 15680)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !522, line: 318, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !522, line: 319, size: 2880, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1091, !1092, !1097, !1102, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1117, !1118, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1150, !1151, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1174, !1175, !1176, !1180, !1181}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1070, file: !522, line: 320, baseType: !363, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1070, file: !522, line: 321, baseType: !363, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1070, file: !522, line: 322, baseType: !363, size: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1070, file: !522, line: 323, baseType: !363, size: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1070, file: !522, line: 324, baseType: !363, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1070, file: !522, line: 325, baseType: !363, size: 32, offset: 160)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1070, file: !522, line: 326, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !522, line: 293, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !522, line: 295, size: 448, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !522, line: 296, baseType: !1079, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1081, file: !522, line: 297, baseType: !426, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1081, file: !522, line: 297, baseType: !426, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1081, file: !522, line: 298, baseType: !409, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1081, file: !522, line: 298, baseType: !409, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1081, file: !522, line: 299, baseType: !363, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1081, file: !522, line: 300, baseType: !363, size: 32, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1081, file: !522, line: 301, baseType: !363, size: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1070, file: !522, line: 326, baseType: !1079, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1070, file: !522, line: 328, baseType: !1093, size: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!317, !519, !1096, !409}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1070, file: !522, line: 329, baseType: !1098, size: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!317, !1096, !1101, !411, !411, !429, !409}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1070, file: !522, line: 330, baseType: !1103, size: 64, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!317, !1096}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1070, file: !522, line: 331, baseType: !1103, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1070, file: !522, line: 334, baseType: !319, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !522, line: 335, baseType: !380, size: 32, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1070, file: !522, line: 335, baseType: !380, size: 32, offset: 672)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1070, file: !522, line: 336, baseType: !380, size: 32, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1070, file: !522, line: 336, baseType: !380, size: 32, offset: 736)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1070, file: !522, line: 337, baseType: !1113, size: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !320, line: 339, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !320, line: 339, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1070, file: !522, line: 338, baseType: !1113, size: 64, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1070, file: !522, line: 339, baseType: !1119, size: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !320, line: 341, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !320, line: 351, size: 192, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1121, file: !320, line: 354, baseType: !72, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1121, file: !320, line: 355, baseType: !72, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1121, file: !320, line: 356, baseType: !72, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1121, file: !320, line: 361, baseType: !72, size: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1121, file: !320, line: 362, baseType: !475, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1070, file: !522, line: 340, baseType: !363, size: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1070, file: !522, line: 340, baseType: !363, size: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1070, file: !522, line: 341, baseType: !426, size: 64, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1070, file: !522, line: 342, baseType: !409, size: 64, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1070, file: !522, line: 343, baseType: !429, size: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1070, file: !522, line: 344, baseType: !411, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1070, file: !522, line: 345, baseType: !363, size: 32, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1070, file: !522, line: 346, baseType: !1101, size: 64, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1070, file: !522, line: 347, baseType: !479, size: 32, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1070, file: !522, line: 348, baseType: !363, size: 32, offset: 1440)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1070, file: !522, line: 351, baseType: !479, size: 32, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1070, file: !522, line: 352, baseType: !479, size: 32, offset: 1504)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1070, file: !522, line: 353, baseType: !380, size: 32, offset: 1536)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1070, file: !522, line: 354, baseType: !380, size: 32, offset: 1568)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1070, file: !522, line: 355, baseType: !1101, size: 64, offset: 1600)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1070, file: !522, line: 356, baseType: !1101, size: 64, offset: 1664)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1070, file: !522, line: 357, baseType: !1145, size: 64, offset: 1728)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !522, line: 310, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 308, size: 32, elements: !1148)
!1148 = !{!1149}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1147, file: !522, line: 309, baseType: !363, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1070, file: !522, line: 357, baseType: !1145, size: 64, offset: 1792)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1070, file: !522, line: 358, baseType: !1152, size: 64, offset: 1856)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !522, line: 316, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 312, size: 128, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1154, file: !522, line: 313, baseType: !400, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1154, file: !522, line: 314, baseType: !363, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1154, file: !522, line: 315, baseType: !342, size: 8, offset: 96)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1070, file: !522, line: 359, baseType: !1152, size: 64, offset: 1920)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1070, file: !522, line: 360, baseType: !1152, size: 64, offset: 1984)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1070, file: !522, line: 361, baseType: !363, size: 32, offset: 2048)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1070, file: !522, line: 362, baseType: !380, size: 32, offset: 2080)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1070, file: !522, line: 363, baseType: !363, size: 32, offset: 2112)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1070, file: !522, line: 364, baseType: !1101, size: 64, offset: 2176)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1070, file: !522, line: 365, baseType: !1119, size: 64, offset: 2240)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1070, file: !522, line: 366, baseType: !380, size: 32, offset: 2304)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1070, file: !522, line: 367, baseType: !380, size: 32, offset: 2336)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1070, file: !522, line: 368, baseType: !1113, size: 64, offset: 2368)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1070, file: !522, line: 369, baseType: !1113, size: 64, offset: 2432)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1070, file: !522, line: 370, baseType: !1171, size: 64, offset: 2496)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1070, file: !522, line: 371, baseType: !1171, size: 64, offset: 2560)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1070, file: !522, line: 372, baseType: !1171, size: 64, offset: 2624)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1070, file: !522, line: 373, baseType: !1177, size: 64, offset: 2688)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !320, line: 331, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !320, line: 331, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1070, file: !522, line: 374, baseType: !475, size: 64, offset: 2752)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1070, file: !522, line: 375, baseType: !1182, size: 64, offset: 2816)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !521, file: !522, line: 451, baseType: !1069, size: 2880, offset: 18560)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !521, file: !522, line: 452, baseType: !1185, size: 64, offset: 21440)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !522, line: 681, size: 4864, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1195, !1199}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1187, file: !522, line: 682, baseType: !525, size: 4480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1187, file: !522, line: 682, baseType: !750, size: 32, offset: 4480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1187, file: !522, line: 683, baseType: !479, size: 32, offset: 4512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1187, file: !522, line: 684, baseType: !363, size: 32, offset: 4544)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1187, file: !522, line: 685, baseType: !899, size: 64, offset: 4608)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1187, file: !522, line: 686, baseType: !426, size: 64, offset: 4672)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1187, file: !522, line: 687, baseType: !1196, size: 64, offset: 4736)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!317, !1185, !548, !400}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1187, file: !522, line: 688, baseType: !400, size: 64, offset: 4800)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !521, file: !522, line: 453, baseType: !1185, size: 64, offset: 21504)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !521, file: !522, line: 454, baseType: !1185, size: 64, offset: 21568)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !521, file: !522, line: 455, baseType: !363, size: 32, offset: 21632)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !521, file: !522, line: 456, baseType: !479, size: 32, offset: 21664)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !521, file: !522, line: 457, baseType: !1205, size: 320, offset: 21696)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !522, line: 399, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 394, size: 320, elements: !1207)
!1207 = !{!1208, !1209, !1213, !1214}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1206, file: !522, line: 395, baseType: !363, size: 32)
