; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/pbvec.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/pbvec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 155, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!43 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!44 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 475, baseType: !7, size: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 701, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 472, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 663, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !76)
!76 = !{!77}
!77 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!78 = !{!79, !83, !84, !86, !288, !291, !170, !85, !121, !294, !254, !205, !7, !648, !188, !304, !621, !146, !578, !390, !258}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !80, line: 330, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !80, line: 330, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !85)
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !89, line: 73, size: 4480, elements: !90)
!89 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!90 = !{!91, !93, !142, !143, !145, !148, !149, !150, !151, !159, !160, !161, !165, !169, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !182, !183, !184, !186, !187, !189, !191, !192, !193, !194, !195, !198, !200, !201, !202, !203, !204, !207, !209, !210, !211, !221, !223, !224, !228, !229, !278, !283, !285, !286, !287}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !88, file: !89, line: 74, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !85)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !88, file: !89, line: 75, baseType: !94, size: 448, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 448, elements: !140)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !89, line: 53, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 45, size: 448, elements: !97)
!97 = !{!98, !104, !112, !117, !124, !128, !135}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !96, file: !89, line: 46, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !86, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !85)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !96, file: !89, line: 47, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!102, !86, !108}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !109, line: 16, baseType: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !109, line: 16, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !89, line: 48, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!102, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !96, file: !89, line: 49, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!102, !86, !121, !86}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !96, file: !89, line: 50, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!102, !86, !121, !116}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !96, file: !89, line: 51, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!102, !86, !121, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !96, file: !89, line: 52, baseType: !136, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!102, !86, !121, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !88, file: !89, line: 76, baseType: !79, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !89, line: 77, baseType: !144, size: 32, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !85)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !88, file: !89, line: 78, baseType: !146, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !147)
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !88, file: !89, line: 78, baseType: !146, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !88, file: !89, line: 78, baseType: !146, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !88, file: !89, line: 78, baseType: !146, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !88, file: !89, line: 79, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !155, line: 27, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !157, line: 43, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!158 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !88, file: !89, line: 80, baseType: !144, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !88, file: !89, line: 81, baseType: !84, size: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !88, file: !89, line: 82, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !88, file: !89, line: 83, baseType: !166, size: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !88, file: !89, line: 84, baseType: !170, size: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !88, file: !89, line: 85, baseType: !170, size: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !88, file: !89, line: 86, baseType: !170, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !88, file: !89, line: 87, baseType: !170, size: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !88, file: !89, line: 88, baseType: !86, size: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !88, file: !89, line: 89, baseType: !152, size: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !89, line: 90, baseType: !170, size: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !88, file: !89, line: 91, baseType: !170, size: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !88, file: !89, line: 92, baseType: !144, size: 32, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !88, file: !89, line: 93, baseType: !83, size: 64, offset: 1728)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !88, file: !89, line: 94, baseType: !181, size: 64, offset: 1792)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !153)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !88, file: !89, line: 95, baseType: !144, size: 32, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !88, file: !89, line: 95, baseType: !144, size: 32, offset: 1888)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !88, file: !89, line: 96, baseType: !185, size: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !88, file: !89, line: 96, baseType: !185, size: 64, offset: 1984)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !88, file: !89, line: 97, baseType: !188, size: 64, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !88, file: !89, line: 97, baseType: !190, size: 64, offset: 2112)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !88, file: !89, line: 98, baseType: !144, size: 32, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !88, file: !89, line: 98, baseType: !144, size: 32, offset: 2208)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !88, file: !89, line: 99, baseType: !185, size: 64, offset: 2240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !88, file: !89, line: 99, baseType: !185, size: 64, offset: 2304)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !88, file: !89, line: 100, baseType: !196, size: 64, offset: 2368)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !147)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !88, file: !89, line: 100, baseType: !199, size: 64, offset: 2432)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !88, file: !89, line: 101, baseType: !144, size: 32, offset: 2496)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !88, file: !89, line: 101, baseType: !144, size: 32, offset: 2528)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !88, file: !89, line: 102, baseType: !185, size: 64, offset: 2560)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !88, file: !89, line: 102, baseType: !185, size: 64, offset: 2624)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !88, file: !89, line: 103, baseType: !205, size: 64, offset: 2688)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !197)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !88, file: !89, line: 103, baseType: !208, size: 64, offset: 2752)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !88, file: !89, line: 104, baseType: !139, size: 64, offset: 2816)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !88, file: !89, line: 105, baseType: !144, size: 32, offset: 2880)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !88, file: !89, line: 106, baseType: !212, size: 128, offset: 2944)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !219)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !89, line: 64, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 61, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !215, file: !89, line: 62, baseType: !132, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !215, file: !89, line: 63, baseType: !83, size: 64, offset: 64)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !88, file: !89, line: 107, baseType: !222, size: 64, offset: 3072)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !219)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !88, file: !89, line: 108, baseType: !83, size: 64, offset: 3136)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !88, file: !89, line: 109, baseType: !225, size: 64, offset: 3200)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!102, !83}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !88, file: !89, line: 111, baseType: !144, size: 32, offset: 3264)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !88, file: !89, line: 112, baseType: !230, size: 320, offset: 3328)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 320, elements: !276)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!102, !234, !86, !83}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !237)
!237 = !{!238, !239, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !236, file: !12, line: 100, baseType: !144, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !12, line: 101, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !251, !252, !253, !257, !259, !261, !262, !263}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !242, file: !12, line: 84, baseType: !170, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !242, file: !12, line: 85, baseType: !170, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !12, line: 86, baseType: !83, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !242, file: !12, line: 87, baseType: !162, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !242, file: !12, line: 88, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !242, file: !12, line: 89, baseType: !123, size: 8, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !242, file: !12, line: 90, baseType: !170, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !242, file: !12, line: 91, baseType: !254, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !255, line: 46, baseType: !256)
!255 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!256 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !242, file: !12, line: 92, baseType: !258, size: 32, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !12, line: 93, baseType: !260, size: 32, offset: 544)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !12, line: 94, baseType: !240, size: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !242, file: !12, line: 95, baseType: !170, size: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !242, file: !12, line: 96, baseType: !83, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !236, file: !12, line: 102, baseType: !170, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !236, file: !12, line: 102, baseType: !170, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !236, file: !12, line: 103, baseType: !170, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !236, file: !12, line: 104, baseType: !79, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !236, file: !12, line: 105, baseType: !258, size: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !236, file: !12, line: 105, baseType: !258, size: 32, offset: 416)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !236, file: !12, line: 105, baseType: !258, size: 32, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !236, file: !12, line: 106, baseType: !86, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !236, file: !12, line: 107, baseType: !273, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!276 = !{!277}
!277 = !DISubrange(count: 5)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !88, file: !89, line: 113, baseType: !279, size: 320, offset: 3648)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 320, elements: !276)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!102, !86, !83}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !88, file: !89, line: 114, baseType: !284, size: 320, offset: 3968)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 320, elements: !276)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !88, file: !89, line: 115, baseType: !258, size: 32, offset: 4288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !88, file: !89, line: 120, baseType: !273, size: 64, offset: 4352)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !88, file: !89, line: 121, baseType: !258, size: 32, offset: 4416)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !80, line: 331, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !80, line: 331, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !80, line: 338, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !80, line: 338, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_MPI", file: !296, line: 45, baseType: !297)
!296 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/impls/mpi/pvecimpl.h", directory: "/home/users/ndemeye/xSDK")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 22, size: 1216, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !606, !612, !613, !614, !615, !616, !617, !619, !620, !628, !629, !640, !641, !642, !646, !647}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !297, file: !296, line: 23, baseType: !205, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "array_allocated", scope: !297, file: !296, line: 23, baseType: !205, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "unplacedarray", scope: !297, file: !296, line: 23, baseType: !205, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nghost", scope: !297, file: !296, line: 24, baseType: !144, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "localrep", scope: !297, file: !296, line: 25, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !307, line: 142, size: 12800, elements: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!308 = !{!309, !311, !531, !552, !553, !554, !600, !601, !602, !603, !605}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !306, file: !307, line: 143, baseType: !310, size: 4480)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !89, line: 122, baseType: !88)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !306, file: !307, line: 143, baseType: !312, size: 5248, offset: 4480)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 5248, elements: !140)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !307, line: 23, size: 5248, elements: !314)
!314 = !{!315, !320, !325, !329, !333, !339, !344, !345, !346, !350, !354, !355, !356, !360, !364, !370, !371, !375, !379, !383, !384, !391, !395, !396, !400, !404, !405, !406, !410, !411, !418, !423, !424, !425, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !450, !451, !452, !456, !460, !461, !462, !463, !467, !468, !469, !470, !471, !472, !473, !477, !478, !482, !489, !490, !495, !496, !500, !501, !502, !503, !504, !505, !506, !507, !511, !512, !513, !519, !523, !524, !525}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !313, file: !307, line: 24, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!102, !304, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !313, file: !307, line: 25, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!102, !304, !144, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !313, file: !307, line: 26, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!102, !144, !319}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !313, file: !307, line: 27, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!102, !304, !304, !205}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !313, file: !307, line: 28, baseType: !334, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!102, !304, !144, !337, !205}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !313, file: !307, line: 29, baseType: !340, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!102, !304, !343, !196}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !313, file: !307, line: 30, baseType: !330, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !313, file: !307, line: 31, baseType: !334, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !313, file: !307, line: 32, baseType: !347, size: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!102, !304, !206}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !313, file: !307, line: 33, baseType: !351, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!102, !304, !304}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !307, line: 34, baseType: !347, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !313, file: !307, line: 35, baseType: !351, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !313, file: !307, line: 36, baseType: !357, size: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!102, !304, !206, !304}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !313, file: !307, line: 37, baseType: !361, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!102, !304, !206, !206, !304}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !313, file: !307, line: 38, baseType: !365, size: 64, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!102, !304, !144, !368, !319}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !313, file: !307, line: 39, baseType: !357, size: 64, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !313, file: !307, line: 40, baseType: !372, size: 64, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!102, !304, !206, !304, !304}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !313, file: !307, line: 41, baseType: !376, size: 64, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!102, !304, !206, !206, !206, !304, !304}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !313, file: !307, line: 42, baseType: !380, size: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!102, !304, !304, !304}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !313, file: !307, line: 43, baseType: !380, size: 64, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !313, file: !307, line: 44, baseType: !385, size: 64, offset: 1280)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!102, !304, !144, !388, !368, !390}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !313, file: !307, line: 45, baseType: !392, size: 64, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!102, !304}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !313, file: !307, line: 46, baseType: !392, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !313, file: !307, line: 47, baseType: !397, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!102, !304, !208}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !313, file: !307, line: 48, baseType: !401, size: 64, offset: 1536)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!102, !304, !188}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !313, file: !307, line: 49, baseType: !401, size: 64, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !313, file: !307, line: 50, baseType: !397, size: 64, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !313, file: !307, line: 51, baseType: !407, size: 64, offset: 1728)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!102, !304, !188, !196}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !313, file: !307, line: 52, baseType: !407, size: 64, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !313, file: !307, line: 53, baseType: !412, size: 64, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!102, !304, !415}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !313, file: !307, line: 54, baseType: !419, size: 64, offset: 1920)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!102, !304, !422, !258}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !313, file: !307, line: 55, baseType: !385, size: 64, offset: 1984)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !313, file: !307, line: 56, baseType: !392, size: 64, offset: 2048)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !313, file: !307, line: 57, baseType: !426, size: 64, offset: 2112)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!102, !304, !108}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !313, file: !307, line: 58, baseType: !430, size: 64, offset: 2176)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!102, !304, !368}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !313, file: !307, line: 59, baseType: !430, size: 64, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !313, file: !307, line: 60, baseType: !330, size: 64, offset: 2304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !313, file: !307, line: 61, baseType: !330, size: 64, offset: 2368)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !313, file: !307, line: 62, baseType: !340, size: 64, offset: 2432)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !313, file: !307, line: 63, baseType: !334, size: 64, offset: 2496)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !313, file: !307, line: 64, baseType: !334, size: 64, offset: 2560)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !313, file: !307, line: 65, baseType: !426, size: 64, offset: 2624)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !313, file: !307, line: 66, baseType: !392, size: 64, offset: 2688)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !313, file: !307, line: 67, baseType: !392, size: 64, offset: 2752)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !313, file: !307, line: 68, baseType: !443, size: 64, offset: 2816)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!102, !304, !446}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !447, line: 30, baseType: !448)
!447 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !447, line: 30, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !313, file: !307, line: 69, baseType: !385, size: 64, offset: 2880)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !313, file: !307, line: 70, baseType: !392, size: 64, offset: 2944)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !313, file: !307, line: 71, baseType: !453, size: 64, offset: 3008)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!102, !234, !304}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !313, file: !307, line: 72, baseType: !457, size: 64, offset: 3072)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!102, !304, !304, !196}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !313, file: !307, line: 73, baseType: !380, size: 64, offset: 3136)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !313, file: !307, line: 74, baseType: !380, size: 64, offset: 3200)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !313, file: !307, line: 75, baseType: !380, size: 64, offset: 3264)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !313, file: !307, line: 76, baseType: !464, size: 64, offset: 3328)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!102, !304, !144, !388, !205}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !313, file: !307, line: 77, baseType: !392, size: 64, offset: 3392)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !313, file: !307, line: 78, baseType: !392, size: 64, offset: 3456)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !313, file: !307, line: 79, baseType: !392, size: 64, offset: 3520)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !313, file: !307, line: 80, baseType: !392, size: 64, offset: 3584)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !313, file: !307, line: 81, baseType: !347, size: 64, offset: 3648)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !313, file: !307, line: 82, baseType: !392, size: 64, offset: 3712)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !313, file: !307, line: 83, baseType: !474, size: 64, offset: 3776)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!102, !304, !144, !304, !390}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !313, file: !307, line: 84, baseType: !474, size: 64, offset: 3840)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !313, file: !307, line: 85, baseType: !479, size: 64, offset: 3904)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!102, !304, !304, !205, !205}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !313, file: !307, line: 86, baseType: !483, size: 64, offset: 3968)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!102, !304, !486, !319}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !447, line: 11, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !447, line: 11, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !313, file: !307, line: 87, baseType: !483, size: 64, offset: 4032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !313, file: !307, line: 88, baseType: !491, size: 64, offset: 4096)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!102, !304, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !313, file: !307, line: 89, baseType: !491, size: 64, offset: 4160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !313, file: !307, line: 90, baseType: !497, size: 64, offset: 4224)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!102, !304, !144, !388, !388, !304, !390}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !313, file: !307, line: 91, baseType: !497, size: 64, offset: 4288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !313, file: !307, line: 92, baseType: !426, size: 64, offset: 4352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !313, file: !307, line: 93, baseType: !426, size: 64, offset: 4416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !313, file: !307, line: 94, baseType: !351, size: 64, offset: 4480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !313, file: !307, line: 95, baseType: !351, size: 64, offset: 4544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !313, file: !307, line: 96, baseType: !351, size: 64, offset: 4608)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !313, file: !307, line: 97, baseType: !351, size: 64, offset: 4672)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !313, file: !307, line: 98, baseType: !508, size: 64, offset: 4736)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!102, !304, !258}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !313, file: !307, line: 99, baseType: !397, size: 64, offset: 4800)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !313, file: !307, line: 100, baseType: !397, size: 64, offset: 4864)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !313, file: !307, line: 101, baseType: !514, size: 64, offset: 4928)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!102, !304, !208, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !313, file: !307, line: 102, baseType: !520, size: 64, offset: 4992)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!102, !304, !494, !517}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !313, file: !307, line: 103, baseType: !397, size: 64, offset: 5056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !313, file: !307, line: 104, baseType: !491, size: 64, offset: 5120)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !313, file: !307, line: 105, baseType: !526, size: 64, offset: 5184)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!102, !144, !337, !319, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !306, file: !307, line: 144, baseType: !532, size: 64, offset: 9728)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !447, line: 60, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !535, line: 240, size: 640, elements: !536)
!535 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !534, file: !535, line: 241, baseType: !79, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !535, line: 242, baseType: !84, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !534, file: !535, line: 243, baseType: !144, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !534, file: !535, line: 243, baseType: !144, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !534, file: !535, line: 244, baseType: !144, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !534, file: !535, line: 244, baseType: !144, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !534, file: !535, line: 245, baseType: !188, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !534, file: !535, line: 246, baseType: !258, size: 32, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !534, file: !535, line: 247, baseType: !144, size: 32, offset: 352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !534, file: !535, line: 251, baseType: !144, size: 32, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !534, file: !535, line: 252, baseType: !446, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !534, file: !535, line: 253, baseType: !258, size: 32, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !534, file: !535, line: 254, baseType: !144, size: 32, offset: 544)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !534, file: !535, line: 254, baseType: !144, size: 32, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !534, file: !535, line: 255, baseType: !144, size: 32, offset: 608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !307, line: 145, baseType: !83, size: 64, offset: 9792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !306, file: !307, line: 146, baseType: !258, size: 32, offset: 9856)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !306, file: !307, line: 147, baseType: !555, size: 1344, offset: 9920)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !307, line: 140, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 114, size: 1344, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !576, !577, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !556, file: !307, line: 115, baseType: !144, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !556, file: !307, line: 116, baseType: !144, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !556, file: !307, line: 117, baseType: !144, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !556, file: !307, line: 118, baseType: !144, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !556, file: !307, line: 119, baseType: !144, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !556, file: !307, line: 120, baseType: !144, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !556, file: !307, line: 121, baseType: !188, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !556, file: !307, line: 122, baseType: !205, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !556, file: !307, line: 124, baseType: !79, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !307, line: 125, baseType: !84, size: 32, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !556, file: !307, line: 125, baseType: !84, size: 32, offset: 416)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !556, file: !307, line: 126, baseType: !84, size: 32, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !556, file: !307, line: 126, baseType: !84, size: 32, offset: 480)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !556, file: !307, line: 127, baseType: !572, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !80, line: 339, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !80, line: 339, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !556, file: !307, line: 128, baseType: !572, size: 64, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !556, file: !307, line: 129, baseType: !578, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !80, line: 341, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !80, line: 351, size: 192, elements: !581)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !580, file: !80, line: 354, baseType: !85, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !580, file: !80, line: 355, baseType: !85, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !580, file: !80, line: 356, baseType: !85, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !580, file: !80, line: 361, baseType: !85, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !580, file: !80, line: 362, baseType: !254, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !556, file: !307, line: 130, baseType: !144, size: 32, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !556, file: !307, line: 130, baseType: !144, size: 32, offset: 736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !556, file: !307, line: 131, baseType: !205, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !556, file: !307, line: 131, baseType: !205, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !556, file: !307, line: 132, baseType: !188, size: 64, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !556, file: !307, line: 132, baseType: !188, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !556, file: !307, line: 133, baseType: !144, size: 32, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !556, file: !307, line: 134, baseType: !188, size: 64, offset: 1088)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !556, file: !307, line: 135, baseType: !144, size: 32, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !556, file: !307, line: 136, baseType: !258, size: 32, offset: 1184)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !556, file: !307, line: 137, baseType: !258, size: 32, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !556, file: !307, line: 138, baseType: !390, size: 32, offset: 1248)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !556, file: !307, line: 139, baseType: !188, size: 64, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !306, file: !307, line: 147, baseType: !555, size: 1344, offset: 11264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !306, file: !307, line: 148, baseType: !258, size: 32, offset: 12608)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 149, baseType: !144, size: 32, offset: 12640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !306, file: !307, line: 150, baseType: !604, size: 32, offset: 12672)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !306, file: !307, line: 157, baseType: !170, size: 64, offset: 12736)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "localupdate", scope: !297, file: !296, line: 26, baseType: !607, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !608, line: 59, baseType: !609)
!608 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !608, line: 15, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !608, line: 15, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !297, file: !296, line: 28, baseType: !258, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !297, file: !296, line: 29, baseType: !258, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !297, file: !296, line: 30, baseType: !258, size: 32, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !297, file: !296, line: 31, baseType: !84, size: 32, offset: 480)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !297, file: !296, line: 32, baseType: !84, size: 32, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !297, file: !296, line: 33, baseType: !618, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !297, file: !296, line: 34, baseType: !618, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !297, file: !296, line: 35, baseType: !621, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecAssemblyHeader", file: !296, line: 11, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 7, size: 96, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !623, file: !296, line: 8, baseType: !144, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !623, file: !296, line: 9, baseType: !144, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bcount", scope: !623, file: !296, line: 10, baseType: !144, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !297, file: !296, line: 35, baseType: !621, size: 64, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sendptrs", scope: !297, file: !296, line: 36, baseType: !630, size: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecAssemblyFrame", file: !296, line: 20, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 13, size: 320, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !632, file: !296, line: 14, baseType: !188, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "intb", scope: !632, file: !296, line: 15, baseType: !188, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "scalars", scope: !632, file: !296, line: 16, baseType: !205, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "scalarb", scope: !632, file: !296, line: 17, baseType: !205, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pendings", scope: !632, file: !296, line: 18, baseType: !123, size: 8, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pendingb", scope: !632, file: !296, line: 19, baseType: !123, size: 8, offset: 264)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !297, file: !296, line: 37, baseType: !572, size: 64, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !297, file: !296, line: 38, baseType: !572, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvint", scope: !297, file: !296, line: 39, baseType: !643, size: 64, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvscalar", scope: !297, file: !296, line: 40, baseType: !643, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !297, file: !296, line: 41, baseType: !643, size: 64, offset: 1152)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !75)
!650 = !{!0}
!651 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/mpi/pbvec.c", directory: "/home/users/ndemeye/xSDK")
!652 = !{i32 7, !"Dwarf Version", i32 4}
!653 = !{i32 2, !"Debug Info Version", i32 3}
!654 = !{i32 1, !"wchar_size", i32 4}
!655 = !{i32 7, !"PIC Level", i32 2}
!656 = !{i32 7, !"uwtable", i32 1}
!657 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!658 = distinct !DISubprogram(name: "VecDot_MPI", scope: !651, file: !651, line: 8, type: !331, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !668, !670, !674, !675, !677, !683, !684, !686, !689, !690, !692, !695}
!660 = !DILocalVariable(name: "xin", arg: 1, scope: !658, file: !651, line: 8, type: !304)
!661 = !DILocalVariable(name: "yin", arg: 2, scope: !658, file: !651, line: 8, type: !304)
!662 = !DILocalVariable(name: "z", arg: 3, scope: !658, file: !651, line: 8, type: !205)
!663 = !DILocalVariable(name: "sum", scope: !658, file: !651, line: 10, type: !206)
!664 = !DILocalVariable(name: "work", scope: !658, file: !651, line: 10, type: !206)
!665 = !DILocalVariable(name: "ierr", scope: !658, file: !651, line: 11, type: !102)
!666 = !DILocalVariable(name: "ierr__", scope: !667, file: !651, line: 14, type: !102)
!667 = distinct !DILexicalBlock(scope: !658, file: !651, line: 14, column: 36)
!668 = !DILocalVariable(name: "_4_ierr", scope: !669, file: !651, line: 15, type: !102)
!669 = distinct !DILexicalBlock(scope: !658, file: !651, line: 15, column: 10)
!670 = !DILocalVariable(name: "a_b1", scope: !669, file: !651, line: 15, type: !671)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 6)
!674 = !DILocalVariable(name: "a_b2", scope: !669, file: !651, line: 15, type: !671)
!675 = !DILocalVariable(name: "_7_errorcode", scope: !676, file: !651, line: 15, type: !102)
!676 = distinct !DILexicalBlock(scope: !669, file: !651, line: 15, column: 10)
!677 = !DILocalVariable(name: "_7_errorstring", scope: !678, file: !651, line: 15, type: !680)
!678 = distinct !DILexicalBlock(scope: !679, file: !651, line: 15, column: 10)
!679 = distinct !DILexicalBlock(scope: !676, file: !651, line: 15, column: 10)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 256)
!683 = !DILocalVariable(name: "_7_resultlen", scope: !678, file: !651, line: 15, type: !84)
!684 = !DILocalVariable(name: "_7_errorcode", scope: !685, file: !651, line: 15, type: !102)
!685 = distinct !DILexicalBlock(scope: !669, file: !651, line: 15, column: 10)
!686 = !DILocalVariable(name: "_7_errorstring", scope: !687, file: !651, line: 15, type: !680)
!687 = distinct !DILexicalBlock(scope: !688, file: !651, line: 15, column: 10)
!688 = distinct !DILexicalBlock(scope: !685, file: !651, line: 15, column: 10)
!689 = !DILocalVariable(name: "_7_resultlen", scope: !687, file: !651, line: 15, type: !84)
!690 = !DILocalVariable(name: "_7_errorcode", scope: !691, file: !651, line: 15, type: !102)
!691 = distinct !DILexicalBlock(scope: !658, file: !651, line: 15, column: 94)
!692 = !DILocalVariable(name: "_7_errorstring", scope: !693, file: !651, line: 15, type: !680)
!693 = distinct !DILexicalBlock(scope: !694, file: !651, line: 15, column: 94)
!694 = distinct !DILexicalBlock(scope: !691, file: !651, line: 15, column: 94)
!695 = !DILocalVariable(name: "_7_resultlen", scope: !693, file: !651, line: 15, type: !84)
!696 = !DILocation(line: 0, scope: !658)
