; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflationspace.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflationspace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!87 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!88 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!89 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!90 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!91 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!99 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!100 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!101 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!102 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 424, baseType: !7, size: 32, elements: !104)
!104 = !{!105, !106}
!105 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 344, baseType: !7, size: 32, elements: !108)
!108 = !{!109, !110}
!109 = !DIEnumerator(name: "MAT_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "MAT_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 362, baseType: !7, size: 32, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121}
!113 = !DIEnumerator(name: "PC_DEFLATION_SPACE_HAAR", value: 0, isUnsigned: true)
!114 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB2", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB4", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB8", value: 3, isUnsigned: true)
!117 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB16", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "PC_DEFLATION_SPACE_BIORTH22", value: 5, isUnsigned: true)
!119 = !DIEnumerator(name: "PC_DEFLATION_SPACE_MEYER", value: 6, isUnsigned: true)
!120 = !DIEnumerator(name: "PC_DEFLATION_SPACE_AGGREGATION", value: 7, isUnsigned: true)
!121 = !DIEnumerator(name: "PC_DEFLATION_SPACE_USER", value: 8, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!124 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!142 = !{!143, !146, !150, !151, !209, !351, !28, !186, !236, !352}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !144, line: 46, baseType: !145)
!144 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!145 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !147, line: 330, baseType: !148)
!147 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !147, line: 330, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !154, line: 73, size: 4480, elements: !155)
!154 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!155 = !{!156, !158, !207, !208, !210, !213, !214, !215, !216, !224, !225, !227, !231, !235, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250, !252, !253, !255, !257, !258, !259, !260, !261, !264, !266, !267, !268, !269, !270, !273, !275, !276, !277, !287, !289, !290, !294, !295, !341, !346, !348, !349, !350}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !153, file: !154, line: 74, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !153, file: !154, line: 75, baseType: !159, size: 448, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 448, elements: !205)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !154, line: 53, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 45, size: 448, elements: !162)
!162 = !{!163, !169, !177, !182, !189, !193, !200}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !161, file: !154, line: 46, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !151, !168}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !161, file: !154, line: 47, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!167, !151, !173}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !174, line: 16, baseType: !175)
!174 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !174, line: 16, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !161, file: !154, line: 48, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!167, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !161, file: !154, line: 49, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!167, !151, !186, !151}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !161, file: !154, line: 50, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!167, !151, !186, !181}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !161, file: !154, line: 51, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!167, !151, !186, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !161, file: !154, line: 52, baseType: !201, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!167, !151, !186, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !153, file: !154, line: 76, baseType: !146, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !154, line: 77, baseType: !209, size: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !153, file: !154, line: 78, baseType: !211, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !212)
!212 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !153, file: !154, line: 78, baseType: !211, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !153, file: !154, line: 78, baseType: !211, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !153, file: !154, line: 78, baseType: !211, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 79, baseType: !217, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !220, line: 27, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !222, line: 43, baseType: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!223 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !153, file: !154, line: 80, baseType: !209, size: 32, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !153, file: !154, line: 81, baseType: !226, size: 32, offset: 992)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !153, file: !154, line: 82, baseType: !228, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !153, file: !154, line: 83, baseType: !232, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !153, file: !154, line: 84, baseType: !236, size: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !153, file: !154, line: 85, baseType: !236, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !153, file: !154, line: 86, baseType: !236, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !153, file: !154, line: 87, baseType: !236, size: 64, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !153, file: !154, line: 88, baseType: !151, size: 64, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !153, file: !154, line: 89, baseType: !217, size: 64, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 90, baseType: !236, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !153, file: !154, line: 91, baseType: !236, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !153, file: !154, line: 92, baseType: !209, size: 32, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !153, file: !154, line: 93, baseType: !150, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !153, file: !154, line: 94, baseType: !247, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !218)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !153, file: !154, line: 95, baseType: !209, size: 32, offset: 1856)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !153, file: !154, line: 95, baseType: !209, size: 32, offset: 1888)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !153, file: !154, line: 96, baseType: !251, size: 64, offset: 1920)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !153, file: !154, line: 96, baseType: !251, size: 64, offset: 1984)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !153, file: !154, line: 97, baseType: !254, size: 64, offset: 2048)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !153, file: !154, line: 97, baseType: !256, size: 64, offset: 2112)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !153, file: !154, line: 98, baseType: !209, size: 32, offset: 2176)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !153, file: !154, line: 98, baseType: !209, size: 32, offset: 2208)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !153, file: !154, line: 99, baseType: !251, size: 64, offset: 2240)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !153, file: !154, line: 99, baseType: !251, size: 64, offset: 2304)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !153, file: !154, line: 100, baseType: !262, size: 64, offset: 2368)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !212)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !153, file: !154, line: 100, baseType: !265, size: 64, offset: 2432)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !153, file: !154, line: 101, baseType: !209, size: 32, offset: 2496)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !153, file: !154, line: 101, baseType: !209, size: 32, offset: 2528)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !153, file: !154, line: 102, baseType: !251, size: 64, offset: 2560)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !153, file: !154, line: 102, baseType: !251, size: 64, offset: 2624)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !153, file: !154, line: 103, baseType: !271, size: 64, offset: 2688)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !263)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !153, file: !154, line: 103, baseType: !274, size: 64, offset: 2752)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !153, file: !154, line: 104, baseType: !204, size: 64, offset: 2816)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !153, file: !154, line: 105, baseType: !209, size: 32, offset: 2880)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !153, file: !154, line: 106, baseType: !278, size: 128, offset: 2944)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !285)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !154, line: 64, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 61, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !281, file: !154, line: 62, baseType: !197, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !281, file: !154, line: 63, baseType: !150, size: 64, offset: 64)
!285 = !{!286}
!286 = !DISubrange(count: 2)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !153, file: !154, line: 107, baseType: !288, size: 64, offset: 3072)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 64, elements: !285)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !153, file: !154, line: 108, baseType: !150, size: 64, offset: 3136)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !153, file: !154, line: 109, baseType: !291, size: 64, offset: 3200)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!167, !150}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !153, file: !154, line: 111, baseType: !209, size: 32, offset: 3264)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !153, file: !154, line: 112, baseType: !296, size: 320, offset: 3328)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !339)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!167, !300, !151, !150}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !303)
!303 = !{!304, !305, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !302, file: !12, line: 100, baseType: !209, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !12, line: 101, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !317, !318, !319, !320, !322, !324, !325, !326}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !308, file: !12, line: 84, baseType: !236, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !308, file: !12, line: 85, baseType: !236, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !12, line: 86, baseType: !150, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !308, file: !12, line: 87, baseType: !228, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !308, file: !12, line: 88, baseType: !315, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !308, file: !12, line: 89, baseType: !188, size: 8, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !308, file: !12, line: 90, baseType: !236, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !308, file: !12, line: 91, baseType: !143, size: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !12, line: 92, baseType: !321, size: 32, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !12, line: 93, baseType: !323, size: 32, offset: 544)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !12, line: 94, baseType: !306, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !308, file: !12, line: 95, baseType: !236, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !308, file: !12, line: 96, baseType: !150, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !302, file: !12, line: 102, baseType: !236, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !302, file: !12, line: 102, baseType: !236, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !302, file: !12, line: 103, baseType: !236, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !302, file: !12, line: 104, baseType: !146, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !302, file: !12, line: 105, baseType: !321, size: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !302, file: !12, line: 105, baseType: !321, size: 32, offset: 416)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !302, file: !12, line: 105, baseType: !321, size: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !302, file: !12, line: 106, baseType: !151, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !302, file: !12, line: 107, baseType: !336, size: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!339 = !{!340}
!340 = !DISubrange(count: 5)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !153, file: !154, line: 113, baseType: !342, size: 320, offset: 3648)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 320, elements: !339)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!167, !151, !150}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !153, file: !154, line: 114, baseType: !347, size: 320, offset: 3968)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 320, elements: !339)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !153, file: !154, line: 115, baseType: !321, size: 32, offset: 4288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !153, file: !154, line: 120, baseType: !336, size: 64, offset: 4352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !153, file: !154, line: 121, baseType: !321, size: 32, offset: 4416)
!351 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Deflation", file: !354, line: 25, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/deflation/deflation.h", directory: "/home/users/ndemeye/xSDK")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 7, size: 1024, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !365, !366, !367, !368, !373, !375, !479, !480, !482, !483, !485, !486, !487, !488}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !355, file: !354, line: 8, baseType: !321, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "correct", scope: !355, file: !354, line: 9, baseType: !321, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "correctfact", scope: !355, file: !354, line: 10, baseType: !272, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reductionfact", scope: !355, file: !354, line: 11, baseType: !209, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !355, file: !354, line: 12, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Wt", scope: !355, file: !354, line: 12, baseType: !362, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "WtA", scope: !355, file: !354, line: 12, baseType: !362, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "WtAW", scope: !355, file: !354, line: 12, baseType: !362, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "WtAWinv", scope: !355, file: !354, line: 13, baseType: !369, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !370, line: 22, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !370, line: 22, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ksptype", scope: !355, file: !354, line: 14, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPType", file: !370, line: 31, baseType: !186)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !355, file: !354, line: 15, baseType: !376, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !379, line: 37, size: 6720, elements: !380)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!380 = !{!381, !383, !443, !448, !449, !450, !451, !452, !454, !455, !456, !457, !458, !459, !460, !461, !462, !472, !473, !474, !475, !476, !478}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !378, file: !379, line: 38, baseType: !382, size: 4480)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !154, line: 122, baseType: !153)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !378, file: !379, line: 38, baseType: !384, size: 1152, offset: 4480)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1152, elements: !205)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !379, line: 13, size: 1152, elements: !386)
!386 = !{!387, !391, !399, !403, !409, !414, !415, !419, !423, !427, !428, !433, !434, !435, !436, !437, !441, !442}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !385, file: !379, line: 14, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!167, !376}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !385, file: !379, line: 15, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!167, !376, !395, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !396, line: 21, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !396, line: 21, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !385, file: !379, line: 16, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!167, !376, !362, !362}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !385, file: !379, line: 17, baseType: !404, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!167, !376, !395, !395, !395, !263, !263, !263, !209, !321, !254, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !385, file: !379, line: 18, baseType: !410, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!167, !376, !413, !395, !395, !395}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !385, file: !379, line: 19, baseType: !392, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !385, file: !379, line: 20, baseType: !416, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!167, !376, !209, !395, !395, !395}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !385, file: !379, line: 21, baseType: !420, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!167, !300, !376}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !385, file: !379, line: 22, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!167, !376, !369, !395, !395}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !385, file: !379, line: 23, baseType: !424, size: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !385, file: !379, line: 24, baseType: !429, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!167, !376, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !385, file: !379, line: 25, baseType: !392, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !385, file: !379, line: 26, baseType: !392, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !385, file: !379, line: 27, baseType: !388, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !385, file: !379, line: 28, baseType: !388, size: 64, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !385, file: !379, line: 29, baseType: !438, size: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!167, !376, !173}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !385, file: !379, line: 30, baseType: !388, size: 64, offset: 1024)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !385, file: !379, line: 31, baseType: !438, size: 64, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !378, file: !379, line: 39, baseType: !444, size: 64, offset: 5632)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !445, line: 14, baseType: !446)
!445 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !445, line: 14, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !378, file: !379, line: 40, baseType: !209, size: 32, offset: 5696)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !378, file: !379, line: 41, baseType: !247, size: 64, offset: 5760)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !378, file: !379, line: 41, baseType: !247, size: 64, offset: 5824)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !378, file: !379, line: 42, baseType: !321, size: 32, offset: 5888)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !378, file: !379, line: 43, baseType: !453, size: 32, offset: 5920)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !378, file: !379, line: 45, baseType: !209, size: 32, offset: 5952)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !378, file: !379, line: 46, baseType: !321, size: 32, offset: 5984)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !378, file: !379, line: 47, baseType: !362, size: 64, offset: 6016)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !378, file: !379, line: 47, baseType: !362, size: 64, offset: 6080)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !378, file: !379, line: 48, baseType: !395, size: 64, offset: 6144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !378, file: !379, line: 48, baseType: !395, size: 64, offset: 6208)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !378, file: !379, line: 49, baseType: !321, size: 32, offset: 6272)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !378, file: !379, line: 50, baseType: !321, size: 32, offset: 6304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !378, file: !379, line: 51, baseType: !463, size: 64, offset: 6336)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!167, !376, !209, !466, !466, !432, !150}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !469, line: 11, baseType: !470)
!469 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !469, line: 11, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !378, file: !379, line: 52, baseType: !150, size: 64, offset: 6400)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !379, line: 53, baseType: !150, size: 64, offset: 6464)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !378, file: !379, line: 54, baseType: !209, size: 32, offset: 6528)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !378, file: !379, line: 55, baseType: !150, size: 64, offset: 6592)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !378, file: !379, line: 56, baseType: !477, size: 32, offset: 6656)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !378, file: !379, line: 57, baseType: !477, size: 32, offset: 6688)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !355, file: !354, line: 16, baseType: !395, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "workcoarse", scope: !355, file: !354, line: 17, baseType: !481, size: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !355, file: !354, line: 18, baseType: !186, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !355, file: !354, line: 20, baseType: !484, size: 32, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCDeflationSpaceType", file: !27, line: 372, baseType: !111)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spacesize", scope: !355, file: !354, line: 21, baseType: !209, size: 32, offset: 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !355, file: !354, line: 22, baseType: !209, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "maxlvl", scope: !355, file: !354, line: 23, baseType: !209, size: 32, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "extendsp", scope: !355, file: !354, line: 24, baseType: !321, size: 32, offset: 960)
!489 = !{!0, !490, !496, !501, !506, !511}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "db4", scope: !2, file: !492, line: 5, type: !493, isLocal: false, isDefinition: true)
!492 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflationspace.c", directory: "/home/users/ndemeye/xSDK")
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 4)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "db8", scope: !2, file: !492, line: 7, type: !498, isLocal: false, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 512, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 8)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "db16", scope: !2, file: !492, line: 16, type: !503, isLocal: false, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 1024, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 16)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "biorth22", scope: !2, file: !492, line: 33, type: !508, isLocal: false, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 384, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 6)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "meyer", scope: !2, file: !492, line: 40, type: !513, isLocal: false, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 3968, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 62)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !285)
!517 = !{i32 7, !"Dwarf Version", i32 4}
!518 = !{i32 2, !"Debug Info Version", i32 3}
!519 = !{i32 1, !"wchar_size", i32 4}
!520 = !{i32 7, !"PIC Level", i32 2}
!521 = !{i32 7, !"uwtable", i32 1}
!522 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!523 = distinct !DISubprogram(name: "PCDeflationGetSpaceHaar", scope: !492, file: !492, line: 84, type: !524, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!167, !376, !432, !209}
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !570, !574, !576, !578}
!527 = !DILocalVariable(name: "pc", arg: 1, scope: !523, file: !492, line: 84, type: !376)
!528 = !DILocalVariable(name: "W", arg: 2, scope: !523, file: !492, line: 84, type: !432)
!529 = !DILocalVariable(name: "size", arg: 3, scope: !523, file: !492, line: 84, type: !209)
!530 = !DILocalVariable(name: "A", scope: !523, file: !492, line: 86, type: !362)
!531 = !DILocalVariable(name: "defl", scope: !523, file: !492, line: 86, type: !362)
!532 = !DILocalVariable(name: "i", scope: !523, file: !492, line: 87, type: !209)
!533 = !DILocalVariable(name: "j", scope: !523, file: !492, line: 87, type: !209)
!534 = !DILocalVariable(name: "len", scope: !523, file: !492, line: 87, type: !209)
!535 = !DILocalVariable(name: "ilo", scope: !523, file: !492, line: 87, type: !209)
!536 = !DILocalVariable(name: "ihi", scope: !523, file: !492, line: 87, type: !209)
!537 = !DILocalVariable(name: "Iidx", scope: !523, file: !492, line: 87, type: !254)
!538 = !DILocalVariable(name: "m", scope: !523, file: !492, line: 87, type: !209)
!539 = !DILocalVariable(name: "M", scope: !523, file: !492, line: 87, type: !209)
