; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpitr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpitr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_op_t = type opaque
%struct.ompi_info_t = type opaque
%struct.ompi_win_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscMPIDump = private unnamed_addr constant [13 x i8] c"PetscMPIDump\00", align 1
@.str = private unnamed_addr constant [75 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpitr.c\00", align 1
@PETSC_COMM_WORLD = external local_unnamed_addr global %struct.ompi_communicator_t*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpitr.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 663, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!10 = !{!11, !13, !17, !18, !19, !22, !25, !27, !30}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !14, line: 330, baseType: !15)
!14 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !14, line: 330, flags: DIFlagFwdDecl)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !14, line: 331, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !14, line: 331, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !14, line: 338, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !14, line: 338, flags: DIFlagFwdDecl)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{i32 7, !"PIC Level", i32 2}
!35 = !{i32 7, !"uwtable", i32 1}
!36 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!37 = distinct !DISubprogram(name: "PetscMPIDump", scope: !38, file: !38, line: 27, type: !39, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !99)
!38 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/utils/mpitr.c", directory: "/home/users/ndemeye/xSDK")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !42, line: 14, baseType: !18)
!42 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 7, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 245, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !69, !70, !71, !72, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !94, !95}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 246, baseType: !18, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 251, baseType: !11, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 252, baseType: !11, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 253, baseType: !11, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 254, baseType: !11, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 255, baseType: !11, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 256, baseType: !11, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 257, baseType: !11, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 258, baseType: !11, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 260, baseType: !11, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 261, baseType: !11, size: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 262, baseType: !11, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 264, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 160, size: 192, elements: !64)
!64 = !{!65, !66, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !63, file: !47, line: 161, baseType: !62, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !63, file: !47, line: 162, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !63, file: !47, line: 166, baseType: !18, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 266, baseType: !67, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 268, baseType: !18, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 272, baseType: !18, size: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 274, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 140, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 278, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 279, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 280, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 284, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 154, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 293, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 141, baseType: !75)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 301, baseType: !17, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 302, baseType: !17, size: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 303, baseType: !17, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 304, baseType: !17, size: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 306, baseType: !27, size: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 307, baseType: !18, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 309, baseType: !96, size: 160, offset: 1568)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 20)
!99 = !{!100, !101, !102, !104, !106, !107, !108, !109, !111, !117, !118, !120, !124, !126, !128, !130, !133, !134, !136, !139, !140}
!100 = !DILocalVariable(name: "fd", arg: 1, scope: !37, file: !38, line: 27, type: !43)
!101 = !DILocalVariable(name: "ierr", scope: !37, file: !38, line: 29, type: !41)
!102 = !DILocalVariable(name: "rank", scope: !37, file: !38, line: 30, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !42, line: 49, baseType: !18)
!104 = !DILocalVariable(name: "tsends", scope: !37, file: !38, line: 31, type: !105)
!105 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!106 = !DILocalVariable(name: "trecvs", scope: !37, file: !38, line: 31, type: !105)
!107 = !DILocalVariable(name: "work", scope: !37, file: !38, line: 31, type: !105)
!108 = !DILocalVariable(name: "err", scope: !37, file: !38, line: 32, type: !18)
!109 = !DILocalVariable(name: "_7_errorcode", scope: !110, file: !38, line: 35, type: !41)
!110 = distinct !DILexicalBlock(scope: !37, file: !38, line: 35, column: 48)
!111 = !DILocalVariable(name: "_7_errorstring", scope: !112, file: !38, line: 35, type: !114)
!112 = distinct !DILexicalBlock(scope: !113, file: !38, line: 35, column: 48)
!113 = distinct !DILexicalBlock(scope: !110, file: !38, line: 35, column: 48)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256)
!117 = !DILocalVariable(name: "_7_resultlen", scope: !112, file: !38, line: 35, type: !103)
!118 = !DILocalVariable(name: "ierr__", scope: !119, file: !38, line: 39, type: !41)
!119 = distinct !DILexicalBlock(scope: !37, file: !38, line: 39, column: 56)
!120 = !DILocalVariable(name: "ierr__", scope: !121, file: !38, line: 41, type: !41)
!121 = distinct !DILexicalBlock(scope: !122, file: !38, line: 41, column: 115)
!122 = distinct !DILexicalBlock(scope: !123, file: !38, line: 40, column: 65)
!123 = distinct !DILexicalBlock(scope: !37, file: !38, line: 40, column: 7)
!124 = !DILocalVariable(name: "ierr__", scope: !125, file: !38, line: 42, type: !41)
!125 = distinct !DILexicalBlock(scope: !122, file: !38, line: 42, column: 170)
!126 = !DILocalVariable(name: "ierr__", scope: !127, file: !38, line: 46, type: !41)
!127 = distinct !DILexicalBlock(scope: !37, file: !38, line: 46, column: 54)
!128 = !DILocalVariable(name: "_7_errorcode", scope: !129, file: !38, line: 49, type: !41)
!129 = distinct !DILexicalBlock(scope: !37, file: !38, line: 49, column: 76)
!130 = !DILocalVariable(name: "_7_errorstring", scope: !131, file: !38, line: 49, type: !114)
!131 = distinct !DILexicalBlock(scope: !132, file: !38, line: 49, column: 76)
!132 = distinct !DILexicalBlock(scope: !129, file: !38, line: 49, column: 76)
!133 = !DILocalVariable(name: "_7_resultlen", scope: !131, file: !38, line: 49, type: !103)
!134 = !DILocalVariable(name: "_7_errorcode", scope: !135, file: !38, line: 51, type: !41)
!135 = distinct !DILexicalBlock(scope: !37, file: !38, line: 51, column: 76)
!136 = !DILocalVariable(name: "_7_errorstring", scope: !137, file: !38, line: 51, type: !114)
!137 = distinct !DILexicalBlock(scope: !138, file: !38, line: 51, column: 76)
!138 = distinct !DILexicalBlock(scope: !135, file: !38, line: 51, column: 76)
!139 = !DILocalVariable(name: "_7_resultlen", scope: !137, file: !38, line: 51, type: !103)
!140 = !DILocalVariable(name: "ierr__", scope: !141, file: !38, line: 53, type: !41)
!141 = distinct !DILexicalBlock(scope: !142, file: !38, line: 53, column: 107)
!142 = distinct !DILexicalBlock(scope: !143, file: !38, line: 52, column: 34)
!143 = distinct !DILexicalBlock(scope: !37, file: !38, line: 52, column: 7)
!144 = !DILocation(line: 0, scope: !37)
