; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/mapping/aomapping.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/mapping/aomapping.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "AOps", scope: !2, file: !55, line: 121, type: !278, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !277, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/mapping/aomapping.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !{!53, !66, !70, !71, !74, !155, !60, !238, !272, !273, !274, !62}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "AO_Mapping", file: !55, line: 16, baseType: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/mapping/aomapping.c", directory: "/home/users/ndemeye/xSDK")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 10, size: 320, elements: !57)
!57 = !{!58, !61, !63, !64, !65}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !56, file: !55, line: 11, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !56, file: !55, line: 12, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "appPerm", scope: !56, file: !55, line: 13, baseType: !62, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "petsc", scope: !56, file: !55, line: 14, baseType: !62, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "petscPerm", scope: !56, file: !55, line: 15, baseType: !62, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !67, line: 330, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !67, line: 330, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !77, line: 73, size: 4480, elements: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!78 = !{!79, !81, !127, !128, !129, !132, !133, !134, !135, !143, !144, !146, !150, !154, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !167, !168, !169, !171, !172, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !187, !188, !191, !193, !194, !195, !205, !207, !208, !212, !213, !262, !267, !269, !270, !271}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !76, file: !77, line: 74, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !60)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !76, file: !77, line: 75, baseType: !82, size: 448, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 448, elements: !125)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !77, line: 53, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 45, size: 448, elements: !85)
!85 = !{!86, !92, !100, !105, !109, !113, !120}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !84, file: !77, line: 46, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !74, !91}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !60)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !84, file: !77, line: 47, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!90, !74, !96}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !97, line: 16, baseType: !98)
!97 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !97, line: 16, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !84, file: !77, line: 48, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!90, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !84, file: !77, line: 49, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!90, !74, !71, !74}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !84, file: !77, line: 50, baseType: !110, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!90, !74, !71, !104}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !84, file: !77, line: 51, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!90, !74, !71, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !84, file: !77, line: 52, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!90, !74, !71, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !76, file: !77, line: 76, baseType: !66, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !77, line: 77, baseType: !59, size: 32, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !76, file: !77, line: 78, baseType: !130, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !131)
!131 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !76, file: !77, line: 78, baseType: !130, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !76, file: !77, line: 78, baseType: !130, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !76, file: !77, line: 78, baseType: !130, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !76, file: !77, line: 79, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !139, line: 27, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !141, line: 43, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!142 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !76, file: !77, line: 80, baseType: !59, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !76, file: !77, line: 81, baseType: !145, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !60)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !76, file: !77, line: 82, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !76, file: !77, line: 83, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !76, file: !77, line: 84, baseType: !155, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !76, file: !77, line: 85, baseType: !155, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !76, file: !77, line: 86, baseType: !155, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !76, file: !77, line: 87, baseType: !155, size: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !76, file: !77, line: 88, baseType: !74, size: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !76, file: !77, line: 89, baseType: !136, size: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 90, baseType: !155, size: 64, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !76, file: !77, line: 91, baseType: !155, size: 64, offset: 1600)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !76, file: !77, line: 92, baseType: !59, size: 32, offset: 1664)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !76, file: !77, line: 93, baseType: !70, size: 64, offset: 1728)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !76, file: !77, line: 94, baseType: !166, size: 64, offset: 1792)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !137)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !76, file: !77, line: 95, baseType: !59, size: 32, offset: 1856)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !76, file: !77, line: 95, baseType: !59, size: 32, offset: 1888)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !76, file: !77, line: 96, baseType: !170, size: 64, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !76, file: !77, line: 96, baseType: !170, size: 64, offset: 1984)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !76, file: !77, line: 97, baseType: !62, size: 64, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !76, file: !77, line: 97, baseType: !174, size: 64, offset: 2112)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !76, file: !77, line: 98, baseType: !59, size: 32, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !76, file: !77, line: 98, baseType: !59, size: 32, offset: 2208)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !76, file: !77, line: 99, baseType: !170, size: 64, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !76, file: !77, line: 99, baseType: !170, size: 64, offset: 2304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !76, file: !77, line: 100, baseType: !180, size: 64, offset: 2368)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !131)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !76, file: !77, line: 100, baseType: !183, size: 64, offset: 2432)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !76, file: !77, line: 101, baseType: !59, size: 32, offset: 2496)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !76, file: !77, line: 101, baseType: !59, size: 32, offset: 2528)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !76, file: !77, line: 102, baseType: !170, size: 64, offset: 2560)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !76, file: !77, line: 102, baseType: !170, size: 64, offset: 2624)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !76, file: !77, line: 103, baseType: !189, size: 64, offset: 2688)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !181)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !76, file: !77, line: 103, baseType: !192, size: 64, offset: 2752)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !76, file: !77, line: 104, baseType: !124, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !76, file: !77, line: 105, baseType: !59, size: 32, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !76, file: !77, line: 106, baseType: !196, size: 128, offset: 2944)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !203)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !77, line: 64, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 61, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !199, file: !77, line: 62, baseType: !117, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !199, file: !77, line: 63, baseType: !70, size: 64, offset: 64)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !76, file: !77, line: 107, baseType: !206, size: 64, offset: 3072)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !203)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !76, file: !77, line: 108, baseType: !70, size: 64, offset: 3136)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !76, file: !77, line: 109, baseType: !209, size: 64, offset: 3200)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!90, !70}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !76, file: !77, line: 111, baseType: !59, size: 32, offset: 3264)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !76, file: !77, line: 112, baseType: !214, size: 320, offset: 3328)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 320, elements: !260)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!90, !218, !74, !70}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !221)
!221 = !{!222, !223, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !12, line: 100, baseType: !59, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !12, line: 101, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !235, !236, !237, !241, !243, !245, !246, !247}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !226, file: !12, line: 84, baseType: !155, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !226, file: !12, line: 85, baseType: !155, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !12, line: 86, baseType: !70, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !226, file: !12, line: 87, baseType: !147, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !226, file: !12, line: 88, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !226, file: !12, line: 89, baseType: !73, size: 8, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !226, file: !12, line: 90, baseType: !155, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !226, file: !12, line: 91, baseType: !238, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 46, baseType: !240)
!239 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!240 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !226, file: !12, line: 92, baseType: !242, size: 32, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !12, line: 93, baseType: !244, size: 32, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !12, line: 94, baseType: !224, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !226, file: !12, line: 95, baseType: !155, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !226, file: !12, line: 96, baseType: !70, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !220, file: !12, line: 102, baseType: !155, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !220, file: !12, line: 102, baseType: !155, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !220, file: !12, line: 103, baseType: !155, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !220, file: !12, line: 104, baseType: !66, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !220, file: !12, line: 106, baseType: !74, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !220, file: !12, line: 107, baseType: !257, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!260 = !{!261}
!261 = !DISubrange(count: 5)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !76, file: !77, line: 113, baseType: !263, size: 320, offset: 3648)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!90, !74, !70}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !76, file: !77, line: 114, baseType: !268, size: 320, offset: 3968)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 320, elements: !260)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !76, file: !77, line: 115, baseType: !242, size: 32, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !76, file: !77, line: 120, baseType: !257, size: 64, offset: 4352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !76, file: !77, line: 121, baseType: !242, size: 32, offset: 4416)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !77, line: 130, baseType: !101)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !77, line: 131, baseType: !93)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !67, line: 331, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !67, line: 331, flags: DIFlagFwdDecl)
!277 = !{!0}
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AOOps", file: !279, line: 19, size: 512, elements: !280)
!279 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/ao/aoimpl.h", directory: "/home/users/ndemeye/xSDK")
!280 = !{!281, !303, !307, !311, !312, !313, !314, !318}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !278, file: !279, line: 21, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!90, !285, !96}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AO", file: !286, line: 17, baseType: !287)
!286 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscao.h", directory: "/home/users/ndemeye/xSDK")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_AO", file: !279, line: 32, size: 5248, elements: !289)
!289 = !{!290, !292, !294, !295, !296, !301, !302}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !288, file: !279, line: 33, baseType: !291, size: 4480)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !77, line: 122, baseType: !76)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !288, file: !279, line: 33, baseType: !293, size: 512, offset: 4480)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 512, elements: !125)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !288, file: !279, line: 34, baseType: !59, size: 32, offset: 4992)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !288, file: !279, line: 34, baseType: !59, size: 32, offset: 5024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "isapp", scope: !288, file: !279, line: 35, baseType: !297, size: 64, offset: 5056)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !298, line: 11, baseType: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !298, line: 11, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ispetsc", scope: !288, file: !279, line: 36, baseType: !297, size: 64, offset: 5120)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !279, line: 37, baseType: !70, size: 64, offset: 5184)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !278, file: !279, line: 22, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!90, !285}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplication", scope: !278, file: !279, line: 24, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!90, !285, !59, !62}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetsc", scope: !278, file: !279, line: 25, baseType: !308, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplicationpermuteint", scope: !278, file: !279, line: 26, baseType: !308, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetscpermuteint", scope: !278, file: !279, line: 27, baseType: !308, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplicationpermutereal", scope: !278, file: !279, line: 28, baseType: !315, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!90, !285, !59, !180}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetscpermutereal", scope: !278, file: !279, line: 29, baseType: !315, size: 64, offset: 448)
!319 = !{i32 7, !"Dwarf Version", i32 4}
!320 = !{i32 2, !"Debug Info Version", i32 3}
!321 = !{i32 1, !"wchar_size", i32 4}
!322 = !{i32 7, !"PIC Level", i32 2}
!323 = !{i32 7, !"uwtable", i32 1}
!324 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!325 = distinct !DISubprogram(name: "AODestroy_Mapping", scope: !55, file: !55, line: 18, type: !305, scopeLine: 19, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !326)
!326 = !{!327, !328, !329, !330, !332}
!327 = !DILocalVariable(name: "ao", arg: 1, scope: !325, file: !55, line: 18, type: !285)
!328 = !DILocalVariable(name: "aomap", scope: !325, file: !55, line: 20, type: !53)
!329 = !DILocalVariable(name: "ierr", scope: !325, file: !55, line: 21, type: !90)
!330 = !DILocalVariable(name: "ierr__", scope: !331, file: !55, line: 24, type: !90)
!331 = distinct !DILexicalBlock(scope: !325, file: !55, line: 24, column: 78)
!332 = !DILocalVariable(name: "ierr__", scope: !333, file: !55, line: 25, type: !90)
!333 = distinct !DILexicalBlock(scope: !325, file: !55, line: 25, column: 27)
!334 = !DILocation(line: 0, scope: !325)
!335 = !DILocation(line: 20, column: 45, scope: !325)
!336 = !{!337, !342, i64 648}
!337 = !{!"_p_AO", !338, i64 0, !340, i64 560, !339, i64 624, !339, i64 628, !342, i64 632, !342, i64 640, !342, i64 648}
!338 = !{!"_p_PetscObject", !339, i64 0, !340, i64 8, !342, i64 64, !339, i64 72, !343, i64 80, !343, i64 88, !343, i64 96, !343, i64 104, !344, i64 112, !339, i64 120, !339, i64 124, !342, i64 128, !342, i64 136, !342, i64 144, !342, i64 152, !342, i64 160, !342, i64 168, !342, i64 176, !344, i64 184, !342, i64 192, !342, i64 200, !339, i64 208, !342, i64 216, !344, i64 224, !339, i64 232, !339, i64 236, !342, i64 240, !342, i64 248, !342, i64 256, !342, i64 264, !339, i64 272, !339, i64 276, !342, i64 280, !342, i64 288, !342, i64 296, !342, i64 304, !339, i64 312, !339, i64 316, !342, i64 320, !342, i64 328, !342, i64 336, !342, i64 344, !342, i64 352, !339, i64 360, !340, i64 368, !340, i64 384, !342, i64 392, !342, i64 400, !339, i64 408, !340, i64 416, !340, i64 456, !340, i64 496, !340, i64 536, !342, i64 544, !340, i64 552}
!339 = !{!"int", !340, i64 0}
!340 = !{!"omnipotent char", !341, i64 0}
!341 = !{!"Simple C/C++ TBAA"}
!342 = !{!"any pointer", !340, i64 0}
!343 = !{!"double", !340, i64 0}
!344 = !{!"long", !340, i64 0}
!345 = !DILocation(line: 23, column: 3, scope: !346)
!346 = distinct !DILexicalBlock(scope: !347, file: !55, line: 23, column: 3)
!347 = distinct !DILexicalBlock(scope: !348, file: !55, line: 23, column: 3)
!348 = distinct !DILexicalBlock(scope: !325, file: !55, line: 23, column: 3)
!349 = !{!342, !342, i64 0}
!350 = !DILocation(line: 23, column: 3, scope: !347)
!351 = !DILocation(line: 23, column: 3, scope: !352)
!352 = distinct !DILexicalBlock(scope: !353, file: !55, line: 23, column: 3)
!353 = distinct !DILexicalBlock(scope: !346, file: !55, line: 23, column: 3)
!354 = !{!355, !339, i64 1536}
!355 = !{!"", !340, i64 0, !340, i64 512, !340, i64 1024, !340, i64 1280, !339, i64 1536, !339, i64 1540, !340, i64 1544}
!356 = !DILocation(line: 23, column: 3, scope: !353)
!357 = !DILocation(line: 23, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !352, file: !55, line: 23, column: 3)
!359 = !{!339, !339, i64 0}
!360 = !{!355, !339, i64 1540}
!361 = !DILocation(line: 24, column: 10, scope: !325)
!362 = !DILocation(line: 0, scope: !331)
!363 = !DILocation(line: 24, column: 78, scope: !364)
!364 = distinct !DILexicalBlock(scope: !331, file: !55, line: 24, column: 78)
!365 = !DILocation(line: 24, column: 78, scope: !331)
!366 = !{!"branch_weights", i32 2000, i32 1}
!367 = !DILocation(line: 25, column: 10, scope: !325)
!368 = !DILocation(line: 0, scope: !333)
