; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/bag/f90-custom/zbagf90.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/bag/f90-custom/zbagf90.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscBag = type { %struct.ompi_communicator_t*, i32, i8*, i32, [64 x i8], [128 x i8], i8*, %struct._n_PetscBagItem* }
%struct._n_PetscBagItem = type { i32, i32, i32, [64 x i8], [128 x i8], i8**, i32, %struct._n_PetscBagItem* }
%struct._p_PetscViewer = type opaque

@PETSC_COMM_WORLD = external local_unnamed_addr global %struct.ompi_communicator_t*, align 8
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@PETSC_NULL_CHARACTER_Fortran = external local_unnamed_addr global i8*, align 8
@__func__.petscbagregisterint_ = private unnamed_addr constant [21 x i8] c"petscbagregisterint_\00", align 1
@.str = private unnamed_addr constant [94 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/bag/f90-custom/zbagf90.c\00", align 1
@PetscTrFree = external local_unnamed_addr global i32 (i8*, i32, i8*, i8*)*, align 8
@__func__.petscbagregisterint64_ = private unnamed_addr constant [23 x i8] c"petscbagregisterint64_\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/bag/f90-custom/zbagf90.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!7 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!29 = !{!30, !36, !40, !41}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !32, line: 135, baseType: !33)
!32 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !34, line: 100, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !37, line: 330, baseType: !38)
!37 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !37, line: 330, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !35)
!42 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!43 = !{i32 7, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{i32 7, !"PIC Level", i32 2}
!47 = !{i32 7, !"uwtable", i32 1}
!48 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!49 = distinct !DISubprogram(name: "petscbagcreate_", scope: !50, file: !50, line: 43, type: !51, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !97)
!50 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/bag/f90-custom/zbagf90.c", directory: "/home/users/ndemeye/xSDK")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !55, !56, !95}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBag", file: !58, line: 32, baseType: !59)
!58 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscbag.h", directory: "/home/users/ndemeye/xSDK")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscBag", file: !61, line: 18, size: 1920, elements: !62)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/bagimpl.h", directory: "/home/users/ndemeye/xSDK")
!62 = !{!63, !64, !66, !67, !68, !73, !77, !79}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bagcomm", scope: !60, file: !61, line: 19, baseType: !36, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bagsize", scope: !60, file: !61, line: 20, baseType: !65, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !54)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "structlocation", scope: !60, file: !61, line: 21, baseType: !40, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !60, file: !61, line: 22, baseType: !65, size: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bagname", scope: !60, file: !61, line: 23, baseType: !69, size: 512, offset: 224)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, elements: !71)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !{!72}
!72 = !DISubrange(count: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "baghelp", scope: !60, file: !61, line: 24, baseType: !74, size: 1024, offset: 736)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bagprefix", scope: !60, file: !61, line: 25, baseType: !78, size: 64, offset: 1792)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bagitems", scope: !60, file: !61, line: 26, baseType: !80, size: 64, offset: 1856)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBagItem", file: !58, line: 33, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscBagItem", file: !61, line: 8, size: 1856, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !92, !94}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !82, file: !61, line: 9, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !4, line: 389, baseType: !3)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !82, file: !61, line: 10, baseType: !65, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "msize", scope: !82, file: !61, line: 11, baseType: !65, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !61, line: 12, baseType: !69, size: 512, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !82, file: !61, line: 12, baseType: !74, size: 1024, offset: 608)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !82, file: !61, line: 13, baseType: !91, size: 64, offset: 1664)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !82, file: !61, line: 14, baseType: !93, size: 32, offset: 1728)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !25)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !61, line: 15, baseType: !80, size: 64, offset: 1792)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !54)
!97 = !{!98, !99, !100, !101}
!98 = !DILocalVariable(name: "comm", arg: 1, scope: !49, file: !50, line: 43, type: !53)
!99 = !DILocalVariable(name: "bagsize", arg: 2, scope: !49, file: !50, line: 43, type: !55)
!100 = !DILocalVariable(name: "bag", arg: 3, scope: !49, file: !50, line: 43, type: !56)
!101 = !DILocalVariable(name: "ierr", arg: 4, scope: !49, file: !50, line: 43, type: !95)
!102 = !DILocation(line: 0, scope: !49)
!103 = !DILocation(line: 45, column: 39, scope: !49)
!104 = !{!105, !105, i64 0}
!105 = !{!"int", !106, i64 0}
!106 = !{!"omnipotent char", !107, i64 0}
!107 = !{!"Simple C/C++ TBAA"}
!108 = !DILocation(line: 45, column: 26, scope: !49)
!109 = !DILocation(line: 45, column: 48, scope: !49)
!110 = !{!111, !111, i64 0}
!111 = !{!"long", !106, i64 0}
!112 = !DILocation(line: 45, column: 11, scope: !49)
!113 = !DILocation(line: 45, column: 9, scope: !49)
!114 = !DILocation(line: 46, column: 1, scope: !49)
!115 = !DISubprogram(name: "PetscBagCreate", scope: !58, file: !58, line: 35, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !119)
!116 = !DISubroutineType(types: !117)
!117 = !{!54, !38, !35, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!119 = !{}
!120 = !DISubprogram(name: "MPI_Comm_f2c", scope: !37, file: !37, line: 1292, type: !121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !119)
!121 = !DISubroutineType(types: !122)
!122 = !{!38, !54}
!123 = distinct !DISubprogram(name: "petscbagdestroy_", scope: !50, file: !50, line: 48, type: !124, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !56, !95}
!126 = !{!127, !128}
!127 = !DILocalVariable(name: "bag", arg: 1, scope: !123, file: !50, line: 48, type: !56)
!128 = !DILocalVariable(name: "ierr", arg: 2, scope: !123, file: !50, line: 48, type: !95)
!129 = !DILocation(line: 0, scope: !123)
!130 = !DILocation(line: 50, column: 11, scope: !123)
!131 = !DILocation(line: 50, column: 9, scope: !123)
!132 = !DILocation(line: 51, column: 1, scope: !123)
!133 = !DISubprogram(name: "PetscBagDestroy", scope: !58, file: !58, line: 36, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !119)
!134 = !DISubroutineType(types: !135)
!135 = !{!54, !118}
!136 = distinct !DISubprogram(name: "petscbagview_", scope: !50, file: !50, line: 53, type: !137, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !144)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !56, !139, !95}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !141, line: 16, baseType: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !141, line: 16, flags: DIFlagFwdDecl)
!144 = !{!145, !146, !147, !148}
!145 = !DILocalVariable(name: "bag", arg: 1, scope: !136, file: !50, line: 53, type: !56)
!146 = !DILocalVariable(name: "viewer", arg: 2, scope: !136, file: !50, line: 53, type: !139)
!147 = !DILocalVariable(name: "ierr", arg: 3, scope: !136, file: !50, line: 53, type: !95)
!148 = !DILocalVariable(name: "v", scope: !136, file: !50, line: 55, type: !140)
!149 = !DILocation(line: 0, scope: !136)
!150 = !DILocation(line: 56, column: 3, scope: !151)
