; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/psort.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/psort.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscLayout = type { %struct.ompi_communicator_t*, i32, i32, i32, i32, i32, i32*, i32, i32, i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct._p_ISLocalToGlobalMapping = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_request_t = type opaque
%struct.ompi_status_public_t = type { i32, i32, i32, i32, i64 }
%struct.ompi_op_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscParallelSortInt = private unnamed_addr constant [21 x i8] c"PetscParallelSortInt\00", align 1
@.str = private unnamed_addr constant [78 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/psort.c\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"Null Pointer: Parameter # %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/psort.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !15, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 663, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!17 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 624, baseType: !5, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!42 = !{!43, !46, !47, !49, !50, !52, !55, !58, !60, !61, !62, !63, !72, !73}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !36, line: 330, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !36, line: 330, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !36, line: 331, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !36, line: 331, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !59)
!59 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !49)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !49)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !36, line: 341, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !36, line: 351, size: 192, elements: !66)
!66 = !{!67, !68, !69, !70, !71}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !65, file: !36, line: 354, baseType: !49, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !65, file: !36, line: 355, baseType: !49, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !65, file: !36, line: 356, baseType: !49, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !65, file: !36, line: 361, baseType: !49, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !65, file: !36, line: 362, baseType: !52, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !59)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !36, line: 338, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !36, line: 338, flags: DIFlagFwdDecl)
!76 = !{i32 7, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 4}
!79 = !{i32 7, !"PIC Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 1}
!81 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!82 = distinct !DISubprogram(name: "PetscParallelSortInt", scope: !83, file: !83, line: 335, type: !84, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !112)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/utils/psort.c", directory: "/home/users/ndemeye/xSDK")
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !87, !87, !100, !100}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !49)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !88, line: 60, baseType: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !91, line: 240, size: 640, elements: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !101, !102, !103, !104, !108, !109, !110, !111}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !90, file: !91, line: 241, baseType: !43, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !91, line: 242, baseType: !60, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !90, file: !91, line: 243, baseType: !61, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !90, file: !91, line: 243, baseType: !61, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !90, file: !91, line: 244, baseType: !61, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !90, file: !91, line: 244, baseType: !61, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !90, file: !91, line: 245, baseType: !100, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !90, file: !91, line: 246, baseType: !62, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !90, file: !91, line: 247, baseType: !61, size: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !90, file: !91, line: 251, baseType: !61, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !90, file: !91, line: 252, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !88, line: 30, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !88, line: 30, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !90, file: !91, line: 253, baseType: !62, size: 32, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !90, file: !91, line: 254, baseType: !61, size: 32, offset: 544)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !90, file: !91, line: 254, baseType: !61, size: 32, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !90, file: !91, line: 255, baseType: !61, size: 32, offset: 608)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !123, !129, !130, !132, !134, !136, !139, !140, !146, !148, !152, !154, !156, !158, !160}
!113 = !DILocalVariable(name: "mapin", arg: 1, scope: !82, file: !83, line: 335, type: !87)
!114 = !DILocalVariable(name: "mapout", arg: 2, scope: !82, file: !83, line: 335, type: !87)
!115 = !DILocalVariable(name: "keysin", arg: 3, scope: !82, file: !83, line: 335, type: !100)
!116 = !DILocalVariable(name: "keysout", arg: 4, scope: !82, file: !83, line: 335, type: !100)
!117 = !DILocalVariable(name: "size", scope: !82, file: !83, line: 337, type: !60)
!118 = !DILocalVariable(name: "result", scope: !82, file: !83, line: 338, type: !60)
!119 = !DILocalVariable(name: "keysincopy", scope: !82, file: !83, line: 339, type: !100)
!120 = !DILocalVariable(name: "ierr", scope: !82, file: !83, line: 340, type: !86)
!121 = !DILocalVariable(name: "_7_errorcode", scope: !122, file: !83, line: 345, type: !86)
!122 = distinct !DILexicalBlock(scope: !82, file: !83, line: 345, column: 63)
!123 = !DILocalVariable(name: "_7_errorstring", scope: !124, file: !83, line: 345, type: !126)
!124 = distinct !DILexicalBlock(scope: !125, file: !83, line: 345, column: 63)
!125 = distinct !DILexicalBlock(scope: !122, file: !83, line: 345, column: 63)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 256)
!129 = !DILocalVariable(name: "_7_resultlen", scope: !124, file: !83, line: 345, type: !60)
!130 = !DILocalVariable(name: "ierr__", scope: !131, file: !83, line: 347, type: !86)
!131 = distinct !DILexicalBlock(scope: !82, file: !83, line: 347, column: 34)
!132 = !DILocalVariable(name: "ierr__", scope: !133, file: !83, line: 348, type: !86)
!133 = distinct !DILexicalBlock(scope: !82, file: !83, line: 348, column: 35)
!134 = !DILocalVariable(name: "_7_errorcode", scope: !135, file: !83, line: 352, type: !86)
!135 = distinct !DILexicalBlock(scope: !82, file: !83, line: 352, column: 44)
!136 = !DILocalVariable(name: "_7_errorstring", scope: !137, file: !83, line: 352, type: !126)
!137 = distinct !DILexicalBlock(scope: !138, file: !83, line: 352, column: 44)
!138 = distinct !DILexicalBlock(scope: !135, file: !83, line: 352, column: 44)
!139 = !DILocalVariable(name: "_7_resultlen", scope: !137, file: !83, line: 352, type: !60)
!140 = !DILocalVariable(name: "ierr__", scope: !141, file: !83, line: 355, type: !86)
!141 = distinct !DILexicalBlock(scope: !142, file: !83, line: 355, column: 72)
!142 = distinct !DILexicalBlock(scope: !143, file: !83, line: 354, column: 28)
!143 = distinct !DILexicalBlock(scope: !144, file: !83, line: 354, column: 9)
!144 = distinct !DILexicalBlock(scope: !145, file: !83, line: 353, column: 18)
!145 = distinct !DILexicalBlock(scope: !82, file: !83, line: 353, column: 7)
!146 = !DILocalVariable(name: "ierr__", scope: !147, file: !83, line: 357, type: !86)
!147 = distinct !DILexicalBlock(scope: !144, file: !83, line: 357, column: 45)
!148 = !DILocalVariable(name: "ierr__", scope: !149, file: !83, line: 361, type: !86)
!149 = distinct !DILexicalBlock(scope: !150, file: !83, line: 361, column: 48)
!150 = distinct !DILexicalBlock(scope: !151, file: !83, line: 360, column: 26)
!151 = distinct !DILexicalBlock(scope: !82, file: !83, line: 360, column: 7)
!152 = !DILocalVariable(name: "ierr__", scope: !153, file: !83, line: 362, type: !86)
!153 = distinct !DILexicalBlock(scope: !150, file: !83, line: 362, column: 73)
!154 = !DILocalVariable(name: "ierr__", scope: !155, file: !83, line: 365, type: !86)
!155 = distinct !DILexicalBlock(scope: !82, file: !83, line: 365, column: 74)
!156 = !DILocalVariable(name: "sorted", scope: !157, file: !83, line: 368, type: !62)
!157 = distinct !DILexicalBlock(scope: !82, file: !83, line: 367, column: 3)
