; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/sortso.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/sortso.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.PetscTimSortStack = type { i32, i32 }
%struct.PetscTimSortBuffer = type { i8*, i64, i64, [8 x i8] }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MIN_GALLOP_GLOBAL", scope: !2, file: !264, line: 23, type: !116, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !263, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/sortso.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !{!53, !153, !72, !228, !143, !93, !162, !262, !170}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !56, line: 73, size: 4480, elements: !57)
!56 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!57 = !{!58, !61, !114, !115, !117, !120, !121, !122, !123, !131, !132, !134, !138, !142, !144, !145, !146, !147, !148, !149, !150, !151, !152, !154, !156, !157, !158, !160, !161, !163, !165, !166, !167, !168, !169, !172, !174, !175, !176, !177, !178, !181, !183, !184, !185, !195, !197, !198, !202, !203, !252, !257, !259, !260, !261}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !55, file: !56, line: 74, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !55, file: !56, line: 75, baseType: !62, size: 448, offset: 64)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 448, elements: !112)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !56, line: 53, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 45, size: 448, elements: !65)
!65 = !{!66, !76, !84, !89, !96, !100, !107}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !64, file: !56, line: 46, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !53, !71}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !60)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !73, line: 330, baseType: !74)
!73 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !73, line: 330, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !64, file: !56, line: 47, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!70, !53, !80}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !81, line: 16, baseType: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !81, line: 16, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !64, file: !56, line: 48, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!70, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !64, file: !56, line: 49, baseType: !90, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!70, !53, !93, !53}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !64, file: !56, line: 50, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!70, !53, !93, !88}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !64, file: !56, line: 51, baseType: !101, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!70, !53, !93, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !64, file: !56, line: 52, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!70, !53, !93, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !55, file: !56, line: 76, baseType: !72, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !56, line: 77, baseType: !116, size: 32, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !60)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !55, file: !56, line: 78, baseType: !118, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !119)
!119 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !55, file: !56, line: 78, baseType: !118, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !55, file: !56, line: 78, baseType: !118, size: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !55, file: !56, line: 78, baseType: !118, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !55, file: !56, line: 79, baseType: !124, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !127, line: 27, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !129, line: 43, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!130 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !55, file: !56, line: 80, baseType: !116, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !55, file: !56, line: 81, baseType: !133, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !60)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !55, file: !56, line: 82, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !55, file: !56, line: 83, baseType: !139, size: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !55, file: !56, line: 84, baseType: !143, size: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !55, file: !56, line: 85, baseType: !143, size: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !55, file: !56, line: 86, baseType: !143, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !55, file: !56, line: 87, baseType: !143, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !55, file: !56, line: 88, baseType: !53, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !55, file: !56, line: 89, baseType: !124, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !56, line: 90, baseType: !143, size: 64, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !55, file: !56, line: 91, baseType: !143, size: 64, offset: 1600)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !55, file: !56, line: 92, baseType: !116, size: 32, offset: 1664)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !55, file: !56, line: 93, baseType: !153, size: 64, offset: 1728)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !55, file: !56, line: 94, baseType: !155, size: 64, offset: 1792)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !125)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !55, file: !56, line: 95, baseType: !116, size: 32, offset: 1856)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !55, file: !56, line: 95, baseType: !116, size: 32, offset: 1888)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !55, file: !56, line: 96, baseType: !159, size: 64, offset: 1920)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !55, file: !56, line: 96, baseType: !159, size: 64, offset: 1984)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !55, file: !56, line: 97, baseType: !162, size: 64, offset: 2048)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !55, file: !56, line: 97, baseType: !164, size: 64, offset: 2112)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !55, file: !56, line: 98, baseType: !116, size: 32, offset: 2176)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !55, file: !56, line: 98, baseType: !116, size: 32, offset: 2208)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !55, file: !56, line: 99, baseType: !159, size: 64, offset: 2240)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !55, file: !56, line: 99, baseType: !159, size: 64, offset: 2304)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !55, file: !56, line: 100, baseType: !170, size: 64, offset: 2368)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !119)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !55, file: !56, line: 100, baseType: !173, size: 64, offset: 2432)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !55, file: !56, line: 101, baseType: !116, size: 32, offset: 2496)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !55, file: !56, line: 101, baseType: !116, size: 32, offset: 2528)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !55, file: !56, line: 102, baseType: !159, size: 64, offset: 2560)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !55, file: !56, line: 102, baseType: !159, size: 64, offset: 2624)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !55, file: !56, line: 103, baseType: !179, size: 64, offset: 2688)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !171)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !55, file: !56, line: 103, baseType: !182, size: 64, offset: 2752)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !55, file: !56, line: 104, baseType: !111, size: 64, offset: 2816)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !55, file: !56, line: 105, baseType: !116, size: 32, offset: 2880)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !55, file: !56, line: 106, baseType: !186, size: 128, offset: 2944)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 128, elements: !193)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !56, line: 64, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 61, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !189, file: !56, line: 62, baseType: !104, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !189, file: !56, line: 63, baseType: !153, size: 64, offset: 64)
!193 = !{!194}
!194 = !DISubrange(count: 2)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !55, file: !56, line: 107, baseType: !196, size: 64, offset: 3072)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !193)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !55, file: !56, line: 108, baseType: !153, size: 64, offset: 3136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !55, file: !56, line: 109, baseType: !199, size: 64, offset: 3200)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!70, !153}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !55, file: !56, line: 111, baseType: !116, size: 32, offset: 3264)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !55, file: !56, line: 112, baseType: !204, size: 320, offset: 3328)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !250)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!70, !208, !53, !153}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !211)
!211 = !{!212, !213, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !210, file: !12, line: 100, baseType: !116, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !12, line: 101, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !225, !226, !227, !231, !233, !235, !236, !237}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !216, file: !12, line: 84, baseType: !143, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !216, file: !12, line: 85, baseType: !143, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !12, line: 86, baseType: !153, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !216, file: !12, line: 87, baseType: !135, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !216, file: !12, line: 88, baseType: !223, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !216, file: !12, line: 89, baseType: !95, size: 8, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !216, file: !12, line: 90, baseType: !143, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !216, file: !12, line: 91, baseType: !228, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !229, line: 46, baseType: !230)
!229 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!230 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !216, file: !12, line: 92, baseType: !232, size: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !12, line: 93, baseType: !234, size: 32, offset: 544)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !12, line: 94, baseType: !214, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !216, file: !12, line: 95, baseType: !143, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !216, file: !12, line: 96, baseType: !153, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !210, file: !12, line: 102, baseType: !143, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !210, file: !12, line: 102, baseType: !143, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !210, file: !12, line: 103, baseType: !143, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !210, file: !12, line: 104, baseType: !72, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !210, file: !12, line: 105, baseType: !232, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !210, file: !12, line: 105, baseType: !232, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !210, file: !12, line: 105, baseType: !232, size: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !210, file: !12, line: 106, baseType: !53, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !210, file: !12, line: 107, baseType: !247, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!250 = !{!251}
!251 = !DISubrange(count: 5)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !55, file: !56, line: 113, baseType: !253, size: 320, offset: 3648)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 320, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!70, !53, !153}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !55, file: !56, line: 114, baseType: !258, size: 320, offset: 3968)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, elements: !250)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !55, file: !56, line: 115, baseType: !232, size: 32, offset: 4288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !55, file: !56, line: 120, baseType: !247, size: 64, offset: 4352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !55, file: !56, line: 121, baseType: !232, size: 32, offset: 4416)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!263 = !{!0}
!264 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/utils/sortso.c", directory: "/home/users/ndemeye/xSDK")
!265 = !{i32 7, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{i32 1, !"wchar_size", i32 4}
!268 = !{i32 7, !"PIC Level", i32 2}
!269 = !{i32 7, !"uwtable", i32 1}
!270 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!271 = distinct !DISubprogram(name: "PetscTimSort", scope: !264, file: !264, line: 977, type: !272, scopeLine: 978, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !279)
!272 = !DISubroutineType(types: !273)
!273 = !{!70, !116, !153, !228, !274, !153}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!60, !277, !277, !153}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !298, !305, !306, !308, !309, !313, !317, !319, !322, !324, !326}
!280 = !DILocalVariable(name: "n", arg: 1, scope: !271, file: !264, line: 977, type: !116)
!281 = !DILocalVariable(name: "arr", arg: 2, scope: !271, file: !264, line: 977, type: !153)
!282 = !DILocalVariable(name: "size", arg: 3, scope: !271, file: !264, line: 977, type: !228)
!283 = !DILocalVariable(name: "cmp", arg: 4, scope: !271, file: !264, line: 977, type: !274)
!284 = !DILocalVariable(name: "ctx", arg: 5, scope: !271, file: !264, line: 977, type: !153)
!285 = !DILocalVariable(name: "stacksize", scope: !271, file: !264, line: 979, type: !116)
!286 = !DILocalVariable(name: "minrun", scope: !271, file: !264, line: 979, type: !116)
!287 = !DILocalVariable(name: "runstart", scope: !271, file: !264, line: 979, type: !116)
!288 = !DILocalVariable(name: "runend", scope: !271, file: !264, line: 979, type: !116)
!289 = !DILocalVariable(name: "runstack", scope: !271, file: !264, line: 980, type: !290)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 8192, align: 64, elements: !296)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTimSortStack", file: !264, line: 542, baseType: !292, align: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 539, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !264, line: 540, baseType: !116, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !292, file: !264, line: 541, baseType: !116, size: 32, offset: 32)
!296 = !{!297}
!297 = !DISubrange(count: 128)
!298 = !DILocalVariable(name: "buff", scope: !271, file: !264, line: 981, type: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTimSortBuffer", file: !264, line: 548, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 544, size: 256, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !300, file: !264, line: 545, baseType: !143, size: 64, align: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !300, file: !264, line: 546, baseType: !228, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !300, file: !264, line: 547, baseType: !228, size: 64, offset: 128)
!305 = !DILocalVariable(name: "ierr", scope: !271, file: !264, line: 982, type: !70)
!306 = !DILocalVariable(name: "t", scope: !307, file: !264, line: 990, type: !116)
!307 = distinct !DILexicalBlock(scope: !271, file: !264, line: 989, column: 3)
!308 = !DILocalVariable(name: "r", scope: !307, file: !264, line: 990, type: !116)
!309 = !DILocalVariable(name: "ierr__", scope: !310, file: !264, line: 999, type: !70)
!310 = distinct !DILexicalBlock(scope: !311, file: !264, line: 999, column: 54)
!311 = distinct !DILexicalBlock(scope: !312, file: !264, line: 998, column: 32)
!312 = distinct !DILexicalBlock(scope: !271, file: !264, line: 998, column: 7)
!313 = !DILocalVariable(name: "ierr__", scope: !314, file: !264, line: 1001, type: !70)
!314 = distinct !DILexicalBlock(scope: !315, file: !264, line: 1001, column: 88)
!315 = distinct !DILexicalBlock(scope: !316, file: !264, line: 1000, column: 17)
!316 = distinct !DILexicalBlock(scope: !311, file: !264, line: 1000, column: 9)
!317 = !DILocalVariable(name: "ierr__", scope: !318, file: !264, line: 1004, type: !70)
!318 = distinct !DILexicalBlock(scope: !271, file: !264, line: 1004, column: 56)
!319 = !DILocalVariable(name: "ierr__", scope: !320, file: !264, line: 1010, type: !70)
!320 = distinct !DILexicalBlock(scope: !321, file: !264, line: 1010, column: 110)
!321 = distinct !DILexicalBlock(scope: !271, file: !264, line: 1008, column: 24)
!322 = !DILocalVariable(name: "ierr__", scope: !323, file: !264, line: 1013, type: !70)
!323 = distinct !DILexicalBlock(scope: !321, file: !264, line: 1013, column: 104)
!324 = !DILocalVariable(name: "ierr__", scope: !325, file: !264, line: 1019, type: !70)
!325 = distinct !DILexicalBlock(scope: !271, file: !264, line: 1019, column: 101)
!326 = !DILocalVariable(name: "ierr__", scope: !327, file: !264, line: 1020, type: !70)
!327 = distinct !DILexicalBlock(scope: !271, file: !264, line: 1020, column: 30)
!328 = !DILocation(line: 0, scope: !271)
!329 = !DILocation(line: 980, column: 3, scope: !271)
!330 = !DILocation(line: 980, column: 22, scope: !271)
!331 = !DILocation(line: 981, column: 3, scope: !271)
!332 = !DILocation(line: 981, column: 22, scope: !271)
!333 = !DILocation(line: 986, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !264, line: 986, column: 3)
!335 = distinct !DILexicalBlock(scope: !336, file: !264, line: 986, column: 3)
!336 = distinct !DILexicalBlock(scope: !271, file: !264, line: 986, column: 3)
!337 = !{!338, !338, i64 0}
!338 = !{!"any pointer", !339, i64 0}
!339 = !{!"omnipotent char", !340, i64 0}
!340 = !{!"Simple C/C++ TBAA"}
!341 = !DILocation(line: 986, column: 3, scope: !335)
!342 = !DILocation(line: 986, column: 3, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !264, line: 986, column: 3)
!344 = distinct !DILexicalBlock(scope: !334, file: !264, line: 986, column: 3)
!345 = !{!346, !347, i64 1536}
!346 = !{!"", !339, i64 0, !339, i64 512, !339, i64 1024, !339, i64 1280, !347, i64 1536, !347, i64 1540, !339, i64 1544}
!347 = !{!"int", !339, i64 0}
!348 = !DILocation(line: 986, column: 3, scope: !344)
!349 = !DILocation(line: 986, column: 3, scope: !350)
!350 = distinct !DILexicalBlock(scope: !343, file: !264, line: 986, column: 3)
!351 = !{!347, !347, i64 0}
!352 = !{!346, !347, i64 1540}
!353 = !DILocation(line: 0, scope: !307)
!354 = !DILocation(line: 992, column: 14, scope: !307)
!355 = !DILocation(line: 992, column: 5, scope: !307)
!356 = !DILocation(line: 993, column: 14, scope: !357)
!357 = distinct !DILexicalBlock(scope: !307, file: !264, line: 992, column: 21)
!358 = !DILocation(line: 993, column: 9, scope: !357)
!359 = !DILocation(line: 994, column: 9, scope: !357)
!360 = distinct !{!360, !355, !361, !362}
!361 = !DILocation(line: 995, column: 5, scope: !307)
!362 = !{!"llvm.loop.mustprogress"}
!363 = !DILocation(line: 996, column: 16, scope: !307)
