; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 719, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117}
!116 = !DIEnumerator(name: "KSP_CG_SYMMETRIC", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_CG_HERMITIAN", value: 1, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 663, baseType: !5, size: 32, elements: !120)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!120 = !{!121, !122, !123}
!121 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 155, baseType: !5, size: 32, elements: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140}
!134 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!135 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!136 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!137 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!138 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!139 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!140 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!141 = !{!142, !164, !168, !169, !365, !204, !332, !155, !367, !370, !252, !26, !373, !152}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_CG", file: !144, line: 37, baseType: !145)
!144 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/cg/cgimpl.h", directory: "/home/users/ndemeye/xSDK")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 29, size: 576, elements: !146)
!146 = !{!147, !149, !153, !154, !156, !158, !159, !161, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !144, line: 30, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCGType", file: !33, line: 719, baseType: !114)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !145, file: !144, line: 31, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !152)
!152 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !145, file: !144, line: 31, baseType: !150, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ned", scope: !145, file: !144, line: 32, baseType: !155, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !145, file: !144, line: 33, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !145, file: !144, line: 33, baseType: !157, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !145, file: !144, line: 34, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !145, file: !144, line: 34, baseType: !160, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "singlereduction", scope: !145, file: !144, line: 36, baseType: !163, size: 32, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !165, line: 330, baseType: !166)
!165 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !165, line: 330, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !172, line: 73, size: 4480, elements: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!173 = !{!174, !176, !225, !226, !227, !229, !230, !231, !232, !240, !241, !243, !247, !251, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266, !268, !269, !271, !273, !274, !275, !276, !277, !278, !280, !281, !282, !283, !284, !285, !287, !288, !289, !299, !301, !302, !306, !307, !355, !360, !362, !363, !364}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !171, file: !172, line: 74, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !171, file: !172, line: 75, baseType: !177, size: 448, offset: 64)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 448, elements: !223)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !172, line: 53, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 45, size: 448, elements: !180)
!180 = !{!181, !187, !195, !200, !207, !211, !218}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !179, file: !172, line: 46, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !169, !186}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !179, file: !172, line: 47, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!185, !169, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !192, line: 16, baseType: !193)
!192 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !192, line: 16, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !179, file: !172, line: 48, baseType: !196, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!185, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !179, file: !172, line: 49, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!185, !169, !204, !169}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !179, file: !172, line: 50, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!185, !169, !204, !199}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !179, file: !172, line: 51, baseType: !212, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!185, !169, !204, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !179, file: !172, line: 52, baseType: !219, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!185, !169, !204, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!223 = !{!224}
!224 = !DISubrange(count: 1)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !171, file: !172, line: 76, baseType: !164, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !172, line: 77, baseType: !155, size: 32, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !171, file: !172, line: 78, baseType: !228, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !171, file: !172, line: 78, baseType: !228, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !171, file: !172, line: 78, baseType: !228, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !171, file: !172, line: 78, baseType: !228, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !172, line: 79, baseType: !233, size: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !236, line: 27, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !238, line: 43, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!239 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !171, file: !172, line: 80, baseType: !155, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !171, file: !172, line: 81, baseType: !242, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !171, file: !172, line: 82, baseType: !244, size: 64, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !171, file: !172, line: 83, baseType: !248, size: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !171, file: !172, line: 84, baseType: !252, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !171, file: !172, line: 85, baseType: !252, size: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !171, file: !172, line: 86, baseType: !252, size: 64, offset: 1280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !171, file: !172, line: 87, baseType: !252, size: 64, offset: 1344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !172, line: 88, baseType: !169, size: 64, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !171, file: !172, line: 89, baseType: !233, size: 64, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !172, line: 90, baseType: !252, size: 64, offset: 1536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !171, file: !172, line: 91, baseType: !252, size: 64, offset: 1600)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !171, file: !172, line: 92, baseType: !155, size: 32, offset: 1664)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !171, file: !172, line: 93, baseType: !168, size: 64, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !172, line: 94, baseType: !263, size: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !234)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !171, file: !172, line: 95, baseType: !155, size: 32, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !171, file: !172, line: 95, baseType: !155, size: 32, offset: 1888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !171, file: !172, line: 96, baseType: !267, size: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !171, file: !172, line: 96, baseType: !267, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !171, file: !172, line: 97, baseType: !270, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !171, file: !172, line: 97, baseType: !272, size: 64, offset: 2112)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !171, file: !172, line: 98, baseType: !155, size: 32, offset: 2176)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !171, file: !172, line: 98, baseType: !155, size: 32, offset: 2208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !171, file: !172, line: 99, baseType: !267, size: 64, offset: 2240)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !171, file: !172, line: 99, baseType: !267, size: 64, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !171, file: !172, line: 100, baseType: !160, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !171, file: !172, line: 100, baseType: !279, size: 64, offset: 2432)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !171, file: !172, line: 101, baseType: !155, size: 32, offset: 2496)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !171, file: !172, line: 101, baseType: !155, size: 32, offset: 2528)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !171, file: !172, line: 102, baseType: !267, size: 64, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !171, file: !172, line: 102, baseType: !267, size: 64, offset: 2624)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !171, file: !172, line: 103, baseType: !157, size: 64, offset: 2688)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !171, file: !172, line: 103, baseType: !286, size: 64, offset: 2752)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !171, file: !172, line: 104, baseType: !222, size: 64, offset: 2816)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !171, file: !172, line: 105, baseType: !155, size: 32, offset: 2880)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !171, file: !172, line: 106, baseType: !290, size: 128, offset: 2944)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !297)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !172, line: 64, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 61, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !293, file: !172, line: 62, baseType: !215, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !293, file: !172, line: 63, baseType: !168, size: 64, offset: 64)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !171, file: !172, line: 107, baseType: !300, size: 64, offset: 3072)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !297)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !171, file: !172, line: 108, baseType: !168, size: 64, offset: 3136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !171, file: !172, line: 109, baseType: !303, size: 64, offset: 3200)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!185, !168}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !171, file: !172, line: 111, baseType: !155, size: 32, offset: 3264)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !171, file: !172, line: 112, baseType: !308, size: 320, offset: 3328)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 320, elements: !353)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!185, !312, !169, !168}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !315)
!315 = !{!316, !317, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !314, file: !10, line: 100, baseType: !155, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !10, line: 101, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !329, !330, !331, !335, !336, !338, !339, !340}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !320, file: !10, line: 84, baseType: !252, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !320, file: !10, line: 85, baseType: !252, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !10, line: 86, baseType: !168, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !320, file: !10, line: 87, baseType: !244, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !320, file: !10, line: 88, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !320, file: !10, line: 89, baseType: !206, size: 8, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !320, file: !10, line: 90, baseType: !252, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !320, file: !10, line: 91, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !333, line: 46, baseType: !334)
!333 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!334 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !10, line: 92, baseType: !163, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !10, line: 93, baseType: !337, size: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !10, line: 94, baseType: !318, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !320, file: !10, line: 95, baseType: !252, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !320, file: !10, line: 96, baseType: !168, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !314, file: !10, line: 102, baseType: !252, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !314, file: !10, line: 102, baseType: !252, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !314, file: !10, line: 103, baseType: !252, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !314, file: !10, line: 104, baseType: !164, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !314, file: !10, line: 105, baseType: !163, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !314, file: !10, line: 105, baseType: !163, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !314, file: !10, line: 105, baseType: !163, size: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !314, file: !10, line: 106, baseType: !169, size: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !314, file: !10, line: 107, baseType: !350, size: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!353 = !{!354}
!354 = !DISubrange(count: 5)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !171, file: !172, line: 113, baseType: !356, size: 320, offset: 3648)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 320, elements: !353)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!185, !169, !168}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !171, file: !172, line: 114, baseType: !361, size: 320, offset: 3968)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 320, elements: !353)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !171, file: !172, line: 115, baseType: !163, size: 32, offset: 4288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !171, file: !172, line: 120, baseType: !350, size: 64, offset: 4352)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !171, file: !172, line: 121, baseType: !163, size: 32, offset: 4416)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !366, line: 1451, baseType: !215)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !165, line: 331, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !165, line: 331, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !165, line: 338, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !165, line: 338, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !132)
!374 = !{i32 7, !"Dwarf Version", i32 4}
!375 = !{i32 2, !"Debug Info Version", i32 3}
!376 = !{i32 1, !"wchar_size", i32 4}
!377 = !{i32 7, !"PIC Level", i32 2}
!378 = !{i32 7, !"uwtable", i32 1}
!379 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!380 = distinct !DISubprogram(name: "KSPDestroy_CG", scope: !381, file: !381, line: 428, type: !382, scopeLine: 429, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !626)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/cg.c", directory: "/home/users/ndemeye/xSDK")
!382 = !DISubroutineType(types: !383)
!383 = !{!185, !384}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !387)
!387 = !{!388, !390, !441, !446, !447, !448, !449, !479, !480, !481, !482, !483, !485, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !519, !525, !526, !527, !528, !533, !534, !535, !536, !541, !542, !543, !544, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !596, !597, !598, !599, !600, !607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !623, !624, !625}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !386, file: !102, line: 76, baseType: !389, size: 4480)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !172, line: 122, baseType: !171)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !386, file: !102, line: 76, baseType: !391, size: 896, offset: 4480)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 896, elements: !223)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !393)
!393 = !{!394, !402, !406, !408, !416, !417, !421, !422, !426, !430, !434, !435, !439, !440}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !392, file: !102, line: 19, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!185, !384, !398, !401}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !125, line: 21, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !125, line: 21, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !392, file: !102, line: 22, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!185, !384, !398, !398, !401}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !392, file: !102, line: 25, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !392, file: !102, line: 26, baseType: !409, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!185, !384, !412, !412}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !413, line: 16, baseType: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !413, line: 16, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !392, file: !102, line: 27, baseType: !407, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !392, file: !102, line: 28, baseType: !418, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!185, !312, !384}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !392, file: !102, line: 29, baseType: !407, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !392, file: !102, line: 30, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!185, !384, !160, !160}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !392, file: !102, line: 31, baseType: !427, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!185, !384, !155, !160, !160, !270}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !392, file: !102, line: 32, baseType: !431, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!185, !384, !163, !163, !270, !401, !160, !160}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !392, file: !102, line: 33, baseType: !407, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !392, file: !102, line: 34, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!185, !384, !191}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !392, file: !102, line: 35, baseType: !407, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !392, file: !102, line: 36, baseType: !436, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !386, file: !102, line: 77, baseType: !442, size: 64, offset: 5376)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !443, line: 14, baseType: !444)
!443 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !443, line: 14, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !386, file: !102, line: 78, baseType: !163, size: 32, offset: 5440)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !386, file: !102, line: 79, baseType: !163, size: 32, offset: 5472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !386, file: !102, line: 81, baseType: !155, size: 32, offset: 5504)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !386, file: !102, line: 82, baseType: !450, size: 64, offset: 5568)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !453)
!453 = !{!454, !455, !475, !476, !477, !478}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !452, file: !102, line: 55, baseType: !389, size: 4480)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !452, file: !102, line: 55, baseType: !456, size: 448, offset: 4480)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 448, elements: !223)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !458)
!458 = !{!459, !463, !464, !468, !469, !470, !474}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !457, file: !102, line: 42, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!185, !450, !398, !398}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !457, file: !102, line: 43, baseType: !460, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !457, file: !102, line: 44, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!185, !450}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !457, file: !102, line: 45, baseType: !465, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !457, file: !102, line: 46, baseType: !465, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !457, file: !102, line: 47, baseType: !471, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!185, !450, !191}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !457, file: !102, line: 48, baseType: !465, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !452, file: !102, line: 56, baseType: !384, size: 64, offset: 4928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !452, file: !102, line: 57, baseType: !412, size: 64, offset: 4992)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !452, file: !102, line: 58, baseType: !263, size: 64, offset: 5056)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !102, line: 59, baseType: !168, size: 64, offset: 5120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !386, file: !102, line: 83, baseType: !163, size: 32, offset: 5632)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !386, file: !102, line: 84, baseType: !163, size: 32, offset: 5664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !386, file: !102, line: 85, baseType: !163, size: 32, offset: 5696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !386, file: !102, line: 86, baseType: !163, size: 32, offset: 5728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !386, file: !102, line: 87, baseType: !484, size: 32, offset: 5760)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !386, file: !102, line: 88, baseType: !486, size: 384, offset: 5792)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 384, elements: !487)
!487 = !{!488, !489}
!488 = !DISubrange(count: 4)
!489 = !DISubrange(count: 3)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !386, file: !102, line: 89, baseType: !151, size: 64, offset: 6208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !386, file: !102, line: 90, baseType: !151, size: 64, offset: 6272)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !386, file: !102, line: 91, baseType: !151, size: 64, offset: 6336)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !386, file: !102, line: 92, baseType: !151, size: 64, offset: 6400)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !386, file: !102, line: 93, baseType: !151, size: 64, offset: 6464)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !386, file: !102, line: 94, baseType: !151, size: 64, offset: 6528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !386, file: !102, line: 95, baseType: !497, size: 32, offset: 6592)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !386, file: !102, line: 96, baseType: !163, size: 32, offset: 6624)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !386, file: !102, line: 98, baseType: !398, size: 64, offset: 6656)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !386, file: !102, line: 98, baseType: !398, size: 64, offset: 6720)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !386, file: !102, line: 102, baseType: !160, size: 64, offset: 6784)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !386, file: !102, line: 103, baseType: !160, size: 64, offset: 6848)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !386, file: !102, line: 104, baseType: !155, size: 32, offset: 6912)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !386, file: !102, line: 105, baseType: !155, size: 32, offset: 6944)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !386, file: !102, line: 106, baseType: !163, size: 32, offset: 6976)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !386, file: !102, line: 107, baseType: !160, size: 64, offset: 7040)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !386, file: !102, line: 108, baseType: !160, size: 64, offset: 7104)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !386, file: !102, line: 109, baseType: !155, size: 32, offset: 7168)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !386, file: !102, line: 110, baseType: !155, size: 32, offset: 7200)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !386, file: !102, line: 111, baseType: !163, size: 32, offset: 7232)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !386, file: !102, line: 113, baseType: !155, size: 32, offset: 7264)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !386, file: !102, line: 114, baseType: !163, size: 32, offset: 7296)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !386, file: !102, line: 117, baseType: !155, size: 32, offset: 7328)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !386, file: !102, line: 120, baseType: !515, size: 320, offset: 7360)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 320, elements: !353)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!185, !384, !155, !151, !168}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !386, file: !102, line: 121, baseType: !520, size: 320, offset: 7680)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !353)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!185, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !386, file: !102, line: 122, baseType: !361, size: 320, offset: 8000)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !386, file: !102, line: 123, baseType: !155, size: 32, offset: 8320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !386, file: !102, line: 124, baseType: !163, size: 32, offset: 8352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !386, file: !102, line: 126, baseType: !529, size: 320, offset: 8384)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 320, elements: !353)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!185, !384, !168}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !386, file: !102, line: 127, baseType: !520, size: 320, offset: 8704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !386, file: !102, line: 128, baseType: !361, size: 320, offset: 9024)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !386, file: !102, line: 129, baseType: !155, size: 32, offset: 9344)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !386, file: !102, line: 131, baseType: !537, size: 64, offset: 9408)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!185, !384, !155, !151, !540, !168}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !386, file: !102, line: 132, baseType: !303, size: 64, offset: 9472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !386, file: !102, line: 133, baseType: !168, size: 64, offset: 9536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !386, file: !102, line: 135, baseType: !168, size: 64, offset: 9600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !386, file: !102, line: 137, baseType: !545, size: 64, offset: 9664)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !102, line: 139, baseType: !168, size: 64, offset: 9728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9792)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9824)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9888)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 9984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !386, file: !102, line: 142, baseType: !163, size: 32, offset: 10208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10304)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10368)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10432)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10496)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10624)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10688)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10816)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10880)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 10944)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 11008)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !386, file: !102, line: 143, baseType: !191, size: 64, offset: 11072)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11136)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11168)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11200)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11232)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11264)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11296)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11328)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11360)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11392)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11424)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11456)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11488)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11520)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !386, file: !102, line: 144, baseType: !578, size: 32, offset: 11552)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !386, file: !102, line: 147, baseType: !155, size: 32, offset: 11584)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !386, file: !102, line: 148, baseType: !401, size: 64, offset: 11648)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !386, file: !102, line: 150, baseType: !595, size: 32, offset: 11712)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !386, file: !102, line: 151, baseType: !163, size: 32, offset: 11744)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !386, file: !102, line: 153, baseType: !155, size: 32, offset: 11776)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !386, file: !102, line: 154, baseType: !155, size: 32, offset: 11808)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !386, file: !102, line: 156, baseType: !163, size: 32, offset: 11840)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !386, file: !102, line: 161, baseType: !601, size: 192, offset: 11904)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !102, line: 157, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !601, file: !102, line: 158, baseType: !412, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !601, file: !102, line: 158, baseType: !412, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !601, file: !102, line: 159, baseType: !163, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !601, file: !102, line: 160, baseType: !163, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !386, file: !102, line: 163, baseType: !608, size: 32, offset: 12096)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !386, file: !102, line: 165, baseType: !484, size: 32, offset: 12128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !386, file: !102, line: 166, baseType: !608, size: 32, offset: 12160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !386, file: !102, line: 171, baseType: !163, size: 32, offset: 12192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !386, file: !102, line: 172, baseType: !163, size: 32, offset: 12224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !386, file: !102, line: 173, baseType: !163, size: 32, offset: 12256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !386, file: !102, line: 174, baseType: !398, size: 64, offset: 12288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !386, file: !102, line: 175, baseType: !398, size: 64, offset: 12352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !386, file: !102, line: 177, baseType: !155, size: 32, offset: 12416)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !386, file: !102, line: 178, baseType: !163, size: 32, offset: 12448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !386, file: !102, line: 180, baseType: !191, size: 64, offset: 12480)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !386, file: !102, line: 182, baseType: !620, size: 64, offset: 12544)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!185, !384, !398, !398, !168}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !386, file: !102, line: 183, baseType: !620, size: 64, offset: 12608)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !386, file: !102, line: 184, baseType: !168, size: 64, offset: 12672)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !386, file: !102, line: 184, baseType: !168, size: 64, offset: 12736)
!626 = !{!627, !628, !629, !630, !632, !634, !636}
!627 = !DILocalVariable(name: "ksp", arg: 1, scope: !380, file: !381, line: 428, type: !384)
!628 = !DILocalVariable(name: "cg", scope: !380, file: !381, line: 430, type: !142)
!629 = !DILocalVariable(name: "ierr", scope: !380, file: !381, line: 431, type: !185)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !381, line: 434, type: !185)
!631 = distinct !DILexicalBlock(scope: !380, file: !381, line: 434, column: 48)
!632 = !DILocalVariable(name: "ierr__", scope: !633, file: !381, line: 435, type: !185)
!633 = distinct !DILexicalBlock(scope: !380, file: !381, line: 435, column: 33)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !381, line: 436, type: !185)
!635 = distinct !DILexicalBlock(scope: !380, file: !381, line: 436, column: 77)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !381, line: 437, type: !185)
!637 = distinct !DILexicalBlock(scope: !380, file: !381, line: 437, column: 88)
!638 = !DILocation(line: 0, scope: !380)
!639 = !DILocation(line: 430, column: 38, scope: !380)
!640 = !{!641, !646, i64 1216}
!641 = !{!"_p_KSP", !642, i64 0, !644, i64 560, !646, i64 672, !644, i64 680, !644, i64 684, !643, i64 688, !646, i64 696, !644, i64 704, !644, i64 708, !644, i64 712, !644, i64 716, !644, i64 720, !644, i64 724, !647, i64 776, !647, i64 784, !647, i64 792, !647, i64 800, !647, i64 808, !647, i64 816, !644, i64 824, !644, i64 828, !646, i64 832, !646, i64 840, !646, i64 848, !646, i64 856, !643, i64 864, !643, i64 868, !644, i64 872, !646, i64 880, !646, i64 888, !643, i64 896, !643, i64 900, !644, i64 904, !643, i64 908, !644, i64 912, !643, i64 916, !644, i64 920, !644, i64 960, !644, i64 1000, !643, i64 1040, !644, i64 1044, !644, i64 1048, !644, i64 1088, !644, i64 1128, !643, i64 1168, !646, i64 1176, !646, i64 1184, !646, i64 1192, !646, i64 1200, !646, i64 1208, !646, i64 1216, !644, i64 1224, !644, i64 1228, !644, i64 1232, !644, i64 1236, !644, i64 1240, !644, i64 1244, !644, i64 1248, !644, i64 1252, !644, i64 1256, !644, i64 1260, !644, i64 1264, !644, i64 1268, !644, i64 1272, !644, i64 1276, !646, i64 1280, !646, i64 1288, !646, i64 1296, !646, i64 1304, !646, i64 1312, !646, i64 1320, !646, i64 1328, !646, i64 1336, !646, i64 1344, !646, i64 1352, !646, i64 1360, !646, i64 1368, !646, i64 1376, !646, i64 1384, !644, i64 1392, !644, i64 1396, !644, i64 1400, !644, i64 1404, !644, i64 1408, !644, i64 1412, !644, i64 1416, !644, i64 1420, !644, i64 1424, !644, i64 1428, !644, i64 1432, !644, i64 1436, !644, i64 1440, !644, i64 1444, !643, i64 1448, !646, i64 1456, !644, i64 1464, !644, i64 1468, !643, i64 1472, !643, i64 1476, !644, i64 1480, !649, i64 1488, !644, i64 1512, !644, i64 1516, !644, i64 1520, !644, i64 1524, !644, i64 1528, !644, i64 1532, !646, i64 1536, !646, i64 1544, !643, i64 1552, !644, i64 1556, !646, i64 1560, !646, i64 1568, !646, i64 1576, !646, i64 1584, !646, i64 1592}
!642 = !{!"_p_PetscObject", !643, i64 0, !644, i64 8, !646, i64 64, !643, i64 72, !647, i64 80, !647, i64 88, !647, i64 96, !647, i64 104, !648, i64 112, !643, i64 120, !643, i64 124, !646, i64 128, !646, i64 136, !646, i64 144, !646, i64 152, !646, i64 160, !646, i64 168, !646, i64 176, !648, i64 184, !646, i64 192, !646, i64 200, !643, i64 208, !646, i64 216, !648, i64 224, !643, i64 232, !643, i64 236, !646, i64 240, !646, i64 248, !646, i64 256, !646, i64 264, !643, i64 272, !643, i64 276, !646, i64 280, !646, i64 288, !646, i64 296, !646, i64 304, !643, i64 312, !643, i64 316, !646, i64 320, !646, i64 328, !646, i64 336, !646, i64 344, !646, i64 352, !643, i64 360, !644, i64 368, !644, i64 384, !646, i64 392, !646, i64 400, !643, i64 408, !644, i64 416, !644, i64 456, !644, i64 496, !644, i64 536, !646, i64 544, !644, i64 552}
!643 = !{!"int", !644, i64 0}
!644 = !{!"omnipotent char", !645, i64 0}
