; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/pounders/pounders.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/pounders/pounders.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "set", scope: !2, file: !3, line: 646, type: !195, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "TaoSolve_POUNDERS", scope: !3, file: !3, line: 629, type: !4, scopeLine: 630, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !488, retainedNodes: !629)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/pounders/pounders.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !10, line: 118, baseType: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !13, line: 45, size: 14656, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !244, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !335, !341, !343, !344, !345, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !435, !436, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !480, !481, !482, !483, !484, !485, !486, !487}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !12, file: !13, line: 46, baseType: !16, size: 4480)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !17, line: 122, baseType: !18)
!17 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !17, line: 73, size: 4480, elements: !19)
!19 = !{!20, !22, !76, !77, !79, !82, !83, !84, !85, !93, !94, !96, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !118, !119, !120, !122, !123, !125, !127, !128, !129, !130, !131, !134, !136, !137, !138, !139, !140, !143, !145, !146, !147, !157, !159, !160, !164, !165, !234, !239, !241, !242, !243}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !18, file: !17, line: 74, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !18, file: !17, line: 75, baseType: !23, size: 448, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 448, elements: !74)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !17, line: 53, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 448, elements: !26)
!26 = !{!27, !38, !46, !51, !58, !62, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !25, file: !17, line: 46, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!6, !31, !33}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !35, line: 330, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !35, line: 330, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !25, file: !17, line: 47, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !31, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !43, line: 16, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !25, file: !17, line: 48, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !25, file: !17, line: 49, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !31, !55, !31}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !25, file: !17, line: 50, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !31, !55, !50}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !25, file: !17, line: 51, baseType: !63, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !31, !55, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !25, file: !17, line: 52, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !31, !55, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !17, line: 76, baseType: !34, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 77, baseType: !78, size: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !81)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !17, line: 79, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 27, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !18, file: !17, line: 80, baseType: !78, size: 32, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !18, file: !17, line: 81, baseType: !95, size: 32, offset: 992)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !18, file: !17, line: 82, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !18, file: !17, line: 83, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !18, file: !17, line: 84, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !18, file: !17, line: 85, baseType: !105, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !18, file: !17, line: 86, baseType: !105, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !18, file: !17, line: 87, baseType: !105, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !17, line: 88, baseType: !31, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !18, file: !17, line: 89, baseType: !86, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 90, baseType: !105, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !18, file: !17, line: 91, baseType: !105, size: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !18, file: !17, line: 92, baseType: !78, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !18, file: !17, line: 93, baseType: !115, size: 64, offset: 1728)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !17, line: 94, baseType: !117, size: 64, offset: 1792)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !87)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1856)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1888)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !18, file: !17, line: 97, baseType: !124, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !18, file: !17, line: 97, baseType: !126, size: 64, offset: 2112)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !18, file: !17, line: 100, baseType: !132, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !18, file: !17, line: 100, baseType: !135, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2496)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2528)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2560)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2624)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !18, file: !17, line: 103, baseType: !141, size: 64, offset: 2688)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !133)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !18, file: !17, line: 103, baseType: !144, size: 64, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !18, file: !17, line: 104, baseType: !73, size: 64, offset: 2816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !18, file: !17, line: 105, baseType: !78, size: 32, offset: 2880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !18, file: !17, line: 106, baseType: !148, size: 128, offset: 2944)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !17, line: 64, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 61, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !151, file: !17, line: 62, baseType: !66, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !151, file: !17, line: 63, baseType: !115, size: 64, offset: 64)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !18, file: !17, line: 107, baseType: !158, size: 64, offset: 3072)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !18, file: !17, line: 108, baseType: !115, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !18, file: !17, line: 109, baseType: !161, size: 64, offset: 3200)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!6, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !18, file: !17, line: 111, baseType: !78, size: 32, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !18, file: !17, line: 112, baseType: !166, size: 320, offset: 3328)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !232)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !170, !31, !115}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !172, line: 108, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !172, line: 99, size: 640, elements: !174)
!174 = !{!175, !176, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !173, file: !172, line: 100, baseType: !78, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 101, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !172, line: 82, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !172, line: 83, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !188, !189, !190, !194, !201, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !179, file: !172, line: 84, baseType: !105, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !179, file: !172, line: 85, baseType: !105, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !172, line: 86, baseType: !115, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !179, file: !172, line: 87, baseType: !97, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !172, line: 88, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !179, file: !172, line: 89, baseType: !57, size: 8, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !179, file: !172, line: 90, baseType: !105, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !179, file: !172, line: 91, baseType: !191, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !179, file: !172, line: 92, baseType: !195, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !197, size: 32, elements: !198)
!197 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !172, line: 93, baseType: !202, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !172, line: 81, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 81, baseType: !197, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!209 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!210 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!211 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!212 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!213 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!215 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!216 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !172, line: 94, baseType: !177, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !179, file: !172, line: 95, baseType: !105, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !172, line: 96, baseType: !115, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !173, file: !172, line: 103, baseType: !105, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !173, file: !172, line: 104, baseType: !34, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !173, file: !172, line: 106, baseType: !31, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !173, file: !172, line: 107, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !172, line: 10, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !172, line: 10, flags: DIFlagFwdDecl)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !18, file: !17, line: 113, baseType: !235, size: 320, offset: 3648)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!6, !31, !115}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !18, file: !17, line: 114, baseType: !240, size: 320, offset: 3968)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !232)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !18, file: !17, line: 115, baseType: !195, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !18, file: !17, line: 120, baseType: !229, size: 64, offset: 4352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !18, file: !17, line: 121, baseType: !195, size: 32, offset: 4416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !12, file: !13, line: 46, baseType: !245, size: 1536, offset: 4480)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1536, elements: !74)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !13, line: 13, size: 1536, elements: !247)
!247 = !{!248, !256, !260, !264, !272, !273, !274, !275, !276, !277, !278, !282, !286, !287, !288, !289, !293, !297, !298, !302, !304, !305, !309, !313}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !246, file: !13, line: 15, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!6, !9, !252, !132, !115}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !253, line: 21, baseType: !254)
!253 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !253, line: 21, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !246, file: !13, line: 16, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!6, !9, !252, !132, !252, !115}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !246, file: !13, line: 17, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!6, !9, !252, !252, !115}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !246, file: !13, line: 18, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!6, !9, !252, !268, !268, !115}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !269, line: 16, baseType: !270)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !269, line: 16, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !246, file: !13, line: 19, baseType: !261, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !246, file: !13, line: 20, baseType: !265, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !246, file: !13, line: 21, baseType: !261, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !246, file: !13, line: 22, baseType: !261, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !246, file: !13, line: 23, baseType: !261, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !246, file: !13, line: 24, baseType: !265, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !246, file: !13, line: 25, baseType: !279, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!6, !9, !252, !268, !268, !268, !115}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !246, file: !13, line: 26, baseType: !283, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!6, !9, !252, !268, !115}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !246, file: !13, line: 27, baseType: !265, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !246, file: !13, line: 28, baseType: !265, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !246, file: !13, line: 29, baseType: !261, size: 64, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !246, file: !13, line: 30, baseType: !290, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!6, !9, !78, !115}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !246, file: !13, line: 31, baseType: !294, size: 64, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!6, !9, !115}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !246, file: !13, line: 32, baseType: !161, size: 64, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !246, file: !13, line: 35, baseType: !299, size: 64, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!6, !9, !252, !252}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !246, file: !13, line: 36, baseType: !303, size: 64, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !246, file: !13, line: 37, baseType: !303, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !246, file: !13, line: 38, baseType: !306, size: 64, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!6, !9, !42}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !246, file: !13, line: 39, baseType: !310, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!6, !170, !9}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !246, file: !13, line: 40, baseType: !303, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !12, file: !13, line: 47, baseType: !115, size: 64, offset: 6016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !12, file: !13, line: 48, baseType: !115, size: 64, offset: 6080)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !12, file: !13, line: 49, baseType: !115, size: 64, offset: 6144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !12, file: !13, line: 50, baseType: !115, size: 64, offset: 6208)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !12, file: !13, line: 51, baseType: !115, size: 64, offset: 6272)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !12, file: !13, line: 52, baseType: !115, size: 64, offset: 6336)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !12, file: !13, line: 53, baseType: !115, size: 64, offset: 6400)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !12, file: !13, line: 54, baseType: !115, size: 64, offset: 6464)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !12, file: !13, line: 55, baseType: !115, size: 64, offset: 6528)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !12, file: !13, line: 56, baseType: !115, size: 64, offset: 6592)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !12, file: !13, line: 57, baseType: !115, size: 64, offset: 6656)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !12, file: !13, line: 58, baseType: !115, size: 64, offset: 6720)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !12, file: !13, line: 59, baseType: !115, size: 64, offset: 6784)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !12, file: !13, line: 60, baseType: !115, size: 64, offset: 6848)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !12, file: !13, line: 61, baseType: !115, size: 64, offset: 6912)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !12, file: !13, line: 62, baseType: !115, size: 64, offset: 6976)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !12, file: !13, line: 63, baseType: !115, size: 64, offset: 7040)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !12, file: !13, line: 65, baseType: !332, size: 640, offset: 7104)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 640, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 10)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !12, file: !13, line: 66, baseType: !336, size: 640, offset: 7744)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 640, elements: !333)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!6, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !12, file: !13, line: 67, baseType: !342, size: 640, offset: 8384)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 640, elements: !333)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !12, file: !13, line: 68, baseType: !78, size: 32, offset: 9024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !12, file: !13, line: 69, baseType: !115, size: 64, offset: 9088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !12, file: !13, line: 70, baseType: !346, size: 32, offset: 9152)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !10, line: 196, baseType: !347)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 181, baseType: !8, size: 32, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!349 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!350 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!351 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!352 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!353 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!354 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!355 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!356 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!357 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!358 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!359 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!360 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!361 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !12, file: !13, line: 72, baseType: !195, size: 32, offset: 9184)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 73, baseType: !115, size: 64, offset: 9216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !12, file: !13, line: 75, baseType: !252, size: 64, offset: 9280)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !12, file: !13, line: 76, baseType: !252, size: 64, offset: 9344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !12, file: !13, line: 77, baseType: !252, size: 64, offset: 9408)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !12, file: !13, line: 78, baseType: !252, size: 64, offset: 9472)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !12, file: !13, line: 79, baseType: !252, size: 64, offset: 9536)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !12, file: !13, line: 80, baseType: !252, size: 64, offset: 9600)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !12, file: !13, line: 81, baseType: !252, size: 64, offset: 9664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !12, file: !13, line: 82, baseType: !252, size: 64, offset: 9728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !12, file: !13, line: 83, baseType: !252, size: 64, offset: 9792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !12, file: !13, line: 84, baseType: !268, size: 64, offset: 9856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !12, file: !13, line: 85, baseType: !268, size: 64, offset: 9920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !12, file: !13, line: 86, baseType: !268, size: 64, offset: 9984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !12, file: !13, line: 87, baseType: !252, size: 64, offset: 10048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !12, file: !13, line: 88, baseType: !252, size: 64, offset: 10112)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !12, file: !13, line: 89, baseType: !268, size: 64, offset: 10176)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !12, file: !13, line: 90, baseType: !268, size: 64, offset: 10240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !12, file: !13, line: 91, baseType: !252, size: 64, offset: 10304)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !12, file: !13, line: 92, baseType: !78, size: 32, offset: 10368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !12, file: !13, line: 93, baseType: !124, size: 64, offset: 10432)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !12, file: !13, line: 94, baseType: !124, size: 64, offset: 10496)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !12, file: !13, line: 95, baseType: !132, size: 64, offset: 10560)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !12, file: !13, line: 96, baseType: !252, size: 64, offset: 10624)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !12, file: !13, line: 97, baseType: !252, size: 64, offset: 10688)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !12, file: !13, line: 98, baseType: !252, size: 64, offset: 10752)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !12, file: !13, line: 99, baseType: !268, size: 64, offset: 10816)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !12, file: !13, line: 100, baseType: !268, size: 64, offset: 10880)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !12, file: !13, line: 101, baseType: !268, size: 64, offset: 10944)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !12, file: !13, line: 102, baseType: !268, size: 64, offset: 11008)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !12, file: !13, line: 103, baseType: !268, size: 64, offset: 11072)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !12, file: !13, line: 104, baseType: !268, size: 64, offset: 11136)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !12, file: !13, line: 105, baseType: !268, size: 64, offset: 11200)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !12, file: !13, line: 106, baseType: !268, size: 64, offset: 11264)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !12, file: !13, line: 107, baseType: !268, size: 64, offset: 11328)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !12, file: !13, line: 108, baseType: !268, size: 64, offset: 11392)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !12, file: !13, line: 109, baseType: !268, size: 64, offset: 11456)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !12, file: !13, line: 110, baseType: !400, size: 64, offset: 11520)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !401, line: 11, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !401, line: 11, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !12, file: !13, line: 111, baseType: !400, size: 64, offset: 11584)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !12, file: !13, line: 112, baseType: !133, size: 64, offset: 11648)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !12, file: !13, line: 113, baseType: !133, size: 64, offset: 11712)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !12, file: !13, line: 114, baseType: !133, size: 64, offset: 11776)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !12, file: !13, line: 115, baseType: !133, size: 64, offset: 11840)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !12, file: !13, line: 116, baseType: !133, size: 64, offset: 11904)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !12, file: !13, line: 117, baseType: !133, size: 64, offset: 11968)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !12, file: !13, line: 119, baseType: !78, size: 32, offset: 12032)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !12, file: !13, line: 120, baseType: !78, size: 32, offset: 12064)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !12, file: !13, line: 121, baseType: !78, size: 32, offset: 12096)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !12, file: !13, line: 122, baseType: !78, size: 32, offset: 12128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !12, file: !13, line: 123, baseType: !78, size: 32, offset: 12160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !12, file: !13, line: 124, baseType: !78, size: 32, offset: 12192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !12, file: !13, line: 125, baseType: !78, size: 32, offset: 12224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !12, file: !13, line: 126, baseType: !78, size: 32, offset: 12256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !12, file: !13, line: 127, baseType: !78, size: 32, offset: 12288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !12, file: !13, line: 128, baseType: !78, size: 32, offset: 12320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !12, file: !13, line: 129, baseType: !78, size: 32, offset: 12352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !12, file: !13, line: 130, baseType: !78, size: 32, offset: 12384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !12, file: !13, line: 131, baseType: !78, size: 32, offset: 12416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !12, file: !13, line: 132, baseType: !78, size: 32, offset: 12448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !12, file: !13, line: 133, baseType: !78, size: 32, offset: 12480)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !12, file: !13, line: 134, baseType: !78, size: 32, offset: 12512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !12, file: !13, line: 135, baseType: !78, size: 32, offset: 12544)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !12, file: !13, line: 137, baseType: !78, size: 32, offset: 12576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !12, file: !13, line: 138, baseType: !78, size: 32, offset: 12608)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !12, file: !13, line: 140, baseType: !431, size: 64, offset: 12672)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !432, line: 5, baseType: !433)
!432 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !432, line: 5, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !12, file: !13, line: 141, baseType: !195, size: 32, offset: 12736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !12, file: !13, line: 142, baseType: !437, size: 64, offset: 12800)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !438, line: 22, baseType: !439)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !438, line: 22, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !12, file: !13, line: 143, baseType: !133, size: 64, offset: 12864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !12, file: !13, line: 144, baseType: !133, size: 64, offset: 12928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !12, file: !13, line: 146, baseType: !133, size: 64, offset: 12992)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !12, file: !13, line: 147, baseType: !133, size: 64, offset: 13056)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !12, file: !13, line: 148, baseType: !133, size: 64, offset: 13120)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !12, file: !13, line: 149, baseType: !133, size: 64, offset: 13184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !12, file: !13, line: 150, baseType: !133, size: 64, offset: 13248)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !12, file: !13, line: 151, baseType: !133, size: 64, offset: 13312)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !12, file: !13, line: 152, baseType: !133, size: 64, offset: 13376)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !12, file: !13, line: 153, baseType: !195, size: 32, offset: 13440)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !12, file: !13, line: 154, baseType: !195, size: 32, offset: 13472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !12, file: !13, line: 155, baseType: !195, size: 32, offset: 13504)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !12, file: !13, line: 156, baseType: !195, size: 32, offset: 13536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !12, file: !13, line: 157, baseType: !195, size: 32, offset: 13568)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !12, file: !13, line: 158, baseType: !195, size: 32, offset: 13600)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !12, file: !13, line: 159, baseType: !195, size: 32, offset: 13632)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !12, file: !13, line: 160, baseType: !195, size: 32, offset: 13664)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !12, file: !13, line: 161, baseType: !195, size: 32, offset: 13696)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !12, file: !13, line: 162, baseType: !195, size: 32, offset: 13728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !12, file: !13, line: 163, baseType: !195, size: 32, offset: 13760)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !12, file: !13, line: 164, baseType: !195, size: 32, offset: 13792)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !12, file: !13, line: 165, baseType: !195, size: 32, offset: 13824)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !12, file: !13, line: 166, baseType: !195, size: 32, offset: 13856)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !12, file: !13, line: 167, baseType: !195, size: 32, offset: 13888)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !12, file: !13, line: 168, baseType: !195, size: 32, offset: 13920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !12, file: !13, line: 169, baseType: !195, size: 32, offset: 13952)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !12, file: !13, line: 170, baseType: !195, size: 32, offset: 13984)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !12, file: !13, line: 171, baseType: !195, size: 32, offset: 14016)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !12, file: !13, line: 172, baseType: !195, size: 32, offset: 14048)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !12, file: !13, line: 173, baseType: !195, size: 32, offset: 14080)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !12, file: !13, line: 174, baseType: !195, size: 32, offset: 14112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !12, file: !13, line: 175, baseType: !195, size: 32, offset: 14144)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !12, file: !13, line: 177, baseType: !474, size: 32, offset: 14176)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !10, line: 26, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 26, baseType: !197, size: 32, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!478 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!479 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !12, file: !13, line: 178, baseType: !78, size: 32, offset: 14208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !12, file: !13, line: 179, baseType: !132, size: 64, offset: 14272)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !12, file: !13, line: 180, baseType: !132, size: 64, offset: 14336)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !12, file: !13, line: 181, baseType: !132, size: 64, offset: 14400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !12, file: !13, line: 182, baseType: !124, size: 64, offset: 14464)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !12, file: !13, line: 183, baseType: !78, size: 32, offset: 14528)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !12, file: !13, line: 184, baseType: !195, size: 32, offset: 14560)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !12, file: !13, line: 185, baseType: !195, size: 32, offset: 14592)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !530, globals: !627, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/pounders/pounders.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!490 = !{!196, !203, !347, !475, !491, !497, !508, !515, !522, !526}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 663, baseType: !197, size: 32, elements: !493)
!492 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!493 = !{!494, !495, !496}
!494 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!495 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!496 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!497 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 580, baseType: !197, size: 32, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507}
!499 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!500 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!501 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!502 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!503 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!504 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!505 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!506 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!507 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !253, line: 30, baseType: !197, size: 32, elements: !509)
!509 = !{!510, !511, !512, !513, !514}
!510 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!511 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!512 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!513 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!514 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!515 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !253, line: 155, baseType: !197, size: 32, elements: !516)
!516 = !{!517, !518, !519, !520, !521}
!517 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!518 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!519 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!520 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!521 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !269, line: 424, baseType: !197, size: 32, elements: !523)
!523 = !{!524, !525}
!524 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!525 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !492, line: 726, baseType: !197, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!530 = !{!531, !191, !31, !34, !115, !55, !133, !105, !8, !81, !78}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_POUNDERS", file: !533, line: 86, baseType: !534)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/leastsquares/impls/pounders/pounders.h", directory: "/home/users/ndemeye/xSDK")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 6, size: 5056, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !570, !571, !572, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "npmax", scope: !534, file: !533, line: 7, baseType: !78, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !534, file: !533, line: 8, baseType: !78, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !534, file: !533, line: 9, baseType: !78, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !534, file: !533, line: 9, baseType: !78, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Xhist", scope: !534, file: !533, line: 10, baseType: !541, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Fhist", scope: !534, file: !533, line: 11, baseType: !541, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Fres", scope: !534, file: !533, line: 12, baseType: !132, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RES", scope: !534, file: !533, line: 13, baseType: !132, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !534, file: !533, line: 14, baseType: !132, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "work2", scope: !534, file: !533, line: 15, baseType: !132, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "work3", scope: !534, file: !533, line: 16, baseType: !132, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !534, file: !533, line: 17, baseType: !132, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mwork", scope: !534, file: !533, line: 18, baseType: !132, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Disp", scope: !534, file: !533, line: 19, baseType: !132, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Fdiff", scope: !534, file: !533, line: 20, baseType: !132, size: 64, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !534, file: !533, line: 21, baseType: !132, size: 64, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Hres", scope: !534, file: !533, line: 22, baseType: !132, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Gres", scope: !534, file: !533, line: 23, baseType: !132, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Gdel", scope: !534, file: !533, line: 24, baseType: !132, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Hdel", scope: !534, file: !533, line: 25, baseType: !132, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Gpoints", scope: !534, file: !533, line: 26, baseType: !132, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !534, file: !533, line: 27, baseType: !132, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Xsubproblem", scope: !534, file: !533, line: 28, baseType: !132, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !534, file: !533, line: 29, baseType: !124, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "minindex", scope: !534, file: !533, line: 30, baseType: !78, size: 32, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nmodelpoints", scope: !534, file: !533, line: 31, baseType: !78, size: 32, offset: 1440)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "model_indices", scope: !534, file: !533, line: 32, baseType: !124, size: 64, offset: 1472)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "last_nmodelpoints", scope: !534, file: !533, line: 33, baseType: !78, size: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "last_model_indices", scope: !534, file: !533, line: 34, baseType: !124, size: 64, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "interp_indices", scope: !534, file: !533, line: 35, baseType: !124, size: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "iwork", scope: !534, file: !533, line: 36, baseType: !568, size: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !7, line: 140, baseType: !8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !534, file: !533, line: 37, baseType: !132, size: 64, offset: 1792)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nHist", scope: !534, file: !533, line: 38, baseType: !78, size: 32, offset: 1856)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "scatterf", scope: !534, file: !533, line: 39, baseType: !573, size: 64, offset: 1920)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !574, line: 59, baseType: !575)
!574 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !574, line: 15, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !574, line: 15, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scatterx", scope: !534, file: !533, line: 39, baseType: !573, size: 64, offset: 1984)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "localf", scope: !534, file: !533, line: 40, baseType: !252, size: 64, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "localx", scope: !534, file: !533, line: 40, baseType: !252, size: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "localfmin", scope: !534, file: !533, line: 40, baseType: !252, size: 64, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "localxmin", scope: !534, file: !533, line: 40, baseType: !252, size: 64, offset: 2240)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "workxvec", scope: !534, file: !533, line: 41, baseType: !252, size: 64, offset: 2304)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "workfvec", scope: !534, file: !533, line: 41, baseType: !252, size: 64, offset: 2368)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !533, line: 42, baseType: !95, size: 32, offset: 2432)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !534, file: !533, line: 44, baseType: !133, size: 64, offset: 2496)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "delta0", scope: !534, file: !533, line: 45, baseType: !133, size: 64, offset: 2560)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "usegqt", scope: !534, file: !533, line: 46, baseType: !195, size: 32, offset: 2624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Hs", scope: !534, file: !533, line: 47, baseType: !268, size: 64, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !534, file: !533, line: 48, baseType: !252, size: 64, offset: 2752)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "deltamax", scope: !534, file: !533, line: 50, baseType: !133, size: 64, offset: 2816)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "deltamin", scope: !534, file: !533, line: 51, baseType: !133, size: 64, offset: 2880)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !534, file: !533, line: 52, baseType: !133, size: 64, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !534, file: !533, line: 53, baseType: !133, size: 64, offset: 3008)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "theta1", scope: !534, file: !533, line: 54, baseType: !133, size: 64, offset: 3072)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "theta2", scope: !534, file: !533, line: 55, baseType: !133, size: 64, offset: 3136)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gamma0", scope: !534, file: !533, line: 56, baseType: !133, size: 64, offset: 3200)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1", scope: !534, file: !533, line: 57, baseType: !133, size: 64, offset: 3264)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "eta0", scope: !534, file: !533, line: 58, baseType: !133, size: 64, offset: 3328)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "eta1", scope: !534, file: !533, line: 59, baseType: !133, size: 64, offset: 3392)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gqt_rtol", scope: !534, file: !533, line: 60, baseType: !133, size: 64, offset: 3456)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gqt_maxits", scope: !534, file: !533, line: 61, baseType: !78, size: 32, offset: 3520)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "q_is_I", scope: !534, file: !533, line: 64, baseType: !78, size: 32, offset: 3552)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !534, file: !533, line: 65, baseType: !132, size: 64, offset: 3584)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Q_tmp", scope: !534, file: !533, line: 66, baseType: !132, size: 64, offset: 3648)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !534, file: !533, line: 67, baseType: !132, size: 64, offset: 3712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tau_tmp", scope: !534, file: !533, line: 68, baseType: !132, size: 64, offset: 3776)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "npmaxwork", scope: !534, file: !533, line: 69, baseType: !132, size: 64, offset: 3840)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "npmaxiwork", scope: !534, file: !533, line: 70, baseType: !568, size: 64, offset: 3904)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !534, file: !533, line: 72, baseType: !132, size: 64, offset: 3968)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "L_tmp", scope: !534, file: !533, line: 73, baseType: !132, size: 64, offset: 4032)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "L_save", scope: !534, file: !533, line: 74, baseType: !132, size: 64, offset: 4096)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !534, file: !533, line: 75, baseType: !132, size: 64, offset: 4160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !534, file: !533, line: 76, baseType: !132, size: 64, offset: 4224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !534, file: !533, line: 77, baseType: !132, size: 64, offset: 4288)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !534, file: !533, line: 78, baseType: !132, size: 64, offset: 4352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !534, file: !533, line: 79, baseType: !132, size: 64, offset: 4416)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !534, file: !533, line: 80, baseType: !132, size: 64, offset: 4480)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "subtao", scope: !534, file: !533, line: 82, baseType: !9, size: 64, offset: 4544)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "subxl", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "subxu", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4672)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "subx", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "subpdel", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4800)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "subndel", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4864)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "subb", scope: !534, file: !533, line: 83, baseType: !252, size: 64, offset: 4928)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "subH", scope: !534, file: !533, line: 84, baseType: !268, size: 64, offset: 4992)
!627 = !{!628}
!628 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !704, !708, !710, !712, !714, !716, !718, !720, !722, !724, !728, !730, !732, !737, !739, !741, !743, !745, !748, !750, !752, !754, !756, !758, !760, !762, !767, !769, !771, !773, !775, !777, !779, !781, !783, !787, !789, !791, !793, !795, !797, !799, !801, !803, !805, !807, !809, !811, !813, !817, !819, !821, !823, !825, !827, !829, !831, !837, !839, !841, !843, !845, !849, !853, !855, !857, !859, !863, !865, !869, !871, !873, !878, !880, !882, !889, !891, !893, !895, !897, !899, !903, !905, !909, !911, !915, !917, !921, !923, !927, !929, !931, !933, !935, !937, !939, !941, !943, !945, !947}
!630 = !DILocalVariable(name: "tao", arg: 1, scope: !2, file: !3, line: 629, type: !9)
!631 = !DILocalVariable(name: "mfqP", scope: !2, file: !3, line: 631, type: !531)
!632 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 632, type: !78)
!633 = !DILocalVariable(name: "ii", scope: !2, file: !3, line: 632, type: !78)
!634 = !DILocalVariable(name: "j", scope: !2, file: !3, line: 632, type: !78)
!635 = !DILocalVariable(name: "k", scope: !2, file: !3, line: 632, type: !78)
!636 = !DILocalVariable(name: "l", scope: !2, file: !3, line: 632, type: !78)
!637 = !DILocalVariable(name: "step", scope: !2, file: !3, line: 633, type: !133)
!638 = !DILocalVariable(name: "low", scope: !2, file: !3, line: 634, type: !78)
!639 = !DILocalVariable(name: "high", scope: !2, file: !3, line: 634, type: !78)
!640 = !DILocalVariable(name: "minnorm", scope: !2, file: !3, line: 635, type: !133)
!641 = !DILocalVariable(name: "x", scope: !2, file: !3, line: 636, type: !132)
!642 = !DILocalVariable(name: "f", scope: !2, file: !3, line: 636, type: !132)
!643 = !DILocalVariable(name: "xmint", scope: !2, file: !3, line: 637, type: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!646 = !DILocalVariable(name: "fmin", scope: !2, file: !3, line: 637, type: !644)
!647 = !DILocalVariable(name: "cres", scope: !2, file: !3, line: 638, type: !133)
!648 = !DILocalVariable(name: "deltaold", scope: !2, file: !3, line: 638, type: !133)
!649 = !DILocalVariable(name: "gnorm", scope: !2, file: !3, line: 639, type: !133)
!650 = !DILocalVariable(name: "info", scope: !2, file: !3, line: 640, type: !569)
!651 = !DILocalVariable(name: "ione", scope: !2, file: !3, line: 640, type: !569)
!652 = !DILocalVariable(name: "iblas", scope: !2, file: !3, line: 640, type: !569)
!653 = !DILocalVariable(name: "valid", scope: !2, file: !3, line: 641, type: !195)
!654 = !DILocalVariable(name: "same", scope: !2, file: !3, line: 641, type: !195)
!655 = !DILocalVariable(name: "mdec", scope: !2, file: !3, line: 642, type: !133)
!656 = !DILocalVariable(name: "rho", scope: !2, file: !3, line: 642, type: !133)
!657 = !DILocalVariable(name: "normxsp", scope: !2, file: !3, line: 642, type: !133)
!658 = !DILocalVariable(name: "one", scope: !2, file: !3, line: 643, type: !133)
!659 = !DILocalVariable(name: "zero", scope: !2, file: !3, line: 643, type: !133)
!660 = !DILocalVariable(name: "ratio", scope: !2, file: !3, line: 643, type: !133)
!661 = !DILocalVariable(name: "blasm", scope: !2, file: !3, line: 644, type: !569)
!662 = !DILocalVariable(name: "blasn", scope: !2, file: !3, line: 644, type: !569)
!663 = !DILocalVariable(name: "blasncopy", scope: !2, file: !3, line: 644, type: !569)
!664 = !DILocalVariable(name: "blasnpmax", scope: !2, file: !3, line: 644, type: !569)
