; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/ftn-custom/ztaosolverf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/ftn-custom/ztaosolverf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }

!4 = !{!5, !11, !26, !43, !48, !54}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 181, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!30 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!31 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!32 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!33 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!34 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!35 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 55, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!60 = !{!61, !64, !67, !68, !69, !73, !271, !238, !273, !276, !107, !277}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !65, line: 100, baseType: !66)
!65 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !70, line: 330, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !70, line: 330, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !55, line: 73, size: 4480, elements: !76)
!76 = !{!77, !79, !125, !126, !128, !131, !132, !133, !134, !142, !143, !145, !149, !153, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !167, !168, !170, !171, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !187, !188, !191, !193, !194, !195, !205, !207, !208, !212, !213, !261, !266, !268, !269, !270}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !75, file: !55, line: 74, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !75, file: !55, line: 75, baseType: !80, size: 448, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 448, elements: !123)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !55, line: 53, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 45, size: 448, elements: !83)
!83 = !{!84, !90, !98, !103, !110, !114, !118}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !82, file: !55, line: 46, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !73, !89}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !82, file: !55, line: 47, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!88, !73, !94}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !95, line: 16, baseType: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !95, line: 16, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !82, file: !55, line: 48, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!88, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !82, file: !55, line: 49, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!88, !73, !107, !73}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !82, file: !55, line: 50, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!88, !73, !107, !102}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !82, file: !55, line: 51, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!88, !73, !107, !61}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !82, file: !55, line: 52, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!88, !73, !107, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !75, file: !55, line: 76, baseType: !69, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !55, line: 77, baseType: !127, size: 32, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !130)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !75, file: !55, line: 79, baseType: !135, size: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !138, line: 27, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !140, line: 43, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!141 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !75, file: !55, line: 80, baseType: !127, size: 32, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !75, file: !55, line: 81, baseType: !144, size: 32, offset: 992)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !75, file: !55, line: 82, baseType: !146, size: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !75, file: !55, line: 83, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !75, file: !55, line: 84, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !75, file: !55, line: 85, baseType: !154, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !75, file: !55, line: 86, baseType: !154, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !75, file: !55, line: 87, baseType: !154, size: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !75, file: !55, line: 88, baseType: !73, size: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !75, file: !55, line: 89, baseType: !135, size: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !55, line: 90, baseType: !154, size: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !75, file: !55, line: 91, baseType: !154, size: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !75, file: !55, line: 92, baseType: !127, size: 32, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !75, file: !55, line: 93, baseType: !68, size: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !75, file: !55, line: 94, baseType: !165, size: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !75, file: !55, line: 95, baseType: !127, size: 32, offset: 1856)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !75, file: !55, line: 95, baseType: !127, size: 32, offset: 1888)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !75, file: !55, line: 96, baseType: !169, size: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !75, file: !55, line: 96, baseType: !169, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !75, file: !55, line: 97, baseType: !172, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !75, file: !55, line: 97, baseType: !174, size: 64, offset: 2112)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !75, file: !55, line: 98, baseType: !127, size: 32, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !75, file: !55, line: 98, baseType: !127, size: 32, offset: 2208)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !75, file: !55, line: 99, baseType: !169, size: 64, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !75, file: !55, line: 99, baseType: !169, size: 64, offset: 2304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !75, file: !55, line: 100, baseType: !180, size: 64, offset: 2368)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !130)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !75, file: !55, line: 100, baseType: !183, size: 64, offset: 2432)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !75, file: !55, line: 101, baseType: !127, size: 32, offset: 2496)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !75, file: !55, line: 101, baseType: !127, size: 32, offset: 2528)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !75, file: !55, line: 102, baseType: !169, size: 64, offset: 2560)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !75, file: !55, line: 102, baseType: !169, size: 64, offset: 2624)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !75, file: !55, line: 103, baseType: !189, size: 64, offset: 2688)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !181)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !75, file: !55, line: 103, baseType: !192, size: 64, offset: 2752)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !75, file: !55, line: 104, baseType: !122, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !75, file: !55, line: 105, baseType: !127, size: 32, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !75, file: !55, line: 106, baseType: !196, size: 128, offset: 2944)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !203)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !55, line: 64, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 61, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !199, file: !55, line: 62, baseType: !61, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !199, file: !55, line: 63, baseType: !68, size: 64, offset: 64)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !75, file: !55, line: 107, baseType: !206, size: 64, offset: 3072)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, elements: !203)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !75, file: !55, line: 108, baseType: !68, size: 64, offset: 3136)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !75, file: !55, line: 109, baseType: !209, size: 64, offset: 3200)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!88, !68}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !75, file: !55, line: 111, baseType: !127, size: 32, offset: 3264)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !75, file: !55, line: 112, baseType: !214, size: 320, offset: 3328)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 320, elements: !259)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!88, !218, !73, !68}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !221)
!221 = !{!222, !223, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !12, line: 100, baseType: !127, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !12, line: 101, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !235, !236, !237, !240, !242, !244, !245, !246}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !226, file: !12, line: 84, baseType: !154, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !226, file: !12, line: 85, baseType: !154, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !12, line: 86, baseType: !68, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !226, file: !12, line: 87, baseType: !146, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !226, file: !12, line: 88, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !226, file: !12, line: 89, baseType: !109, size: 8, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !226, file: !12, line: 90, baseType: !154, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !226, file: !12, line: 91, baseType: !238, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 46, baseType: !66)
!239 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !226, file: !12, line: 92, baseType: !241, size: 32, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !12, line: 93, baseType: !243, size: 32, offset: 544)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !12, line: 94, baseType: !224, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !226, file: !12, line: 95, baseType: !154, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !226, file: !12, line: 96, baseType: !68, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !220, file: !12, line: 103, baseType: !154, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !220, file: !12, line: 104, baseType: !69, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !220, file: !12, line: 106, baseType: !73, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !220, file: !12, line: 107, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!259 = !{!260}
!260 = !DISubrange(count: 5)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !75, file: !55, line: 113, baseType: !262, size: 320, offset: 3648)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !259)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!88, !73, !68}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !75, file: !55, line: 114, baseType: !267, size: 320, offset: 3968)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 320, elements: !259)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !75, file: !55, line: 115, baseType: !241, size: 32, offset: 4288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !75, file: !55, line: 120, baseType: !256, size: 64, offset: 4352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !75, file: !55, line: 121, baseType: !241, size: 32, offset: 4416)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !272, line: 1451, baseType: !61)
!272 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !275, line: 135, baseType: !64)
!275 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !280, line: 45, size: 14656, elements: !281)
!280 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!281 = !{!282, !284, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !382, !384, !385, !386, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !461, !462, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !501, !502, !503, !504, !505, !506, !507, !508}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !279, file: !280, line: 46, baseType: !283, size: 4480)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !55, line: 122, baseType: !75)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !279, file: !280, line: 46, baseType: !285, size: 1536, offset: 4480)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 1536, elements: !123)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !280, line: 13, size: 1536, elements: !287)
!287 = !{!288, !296, !300, !304, !312, !313, !314, !315, !316, !317, !318, !322, !326, !327, !328, !329, !333, !337, !338, !342, !346, !347, !351, !355}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !286, file: !280, line: 15, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!88, !277, !292, !180, !68}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !293, line: 21, baseType: !294)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !293, line: 21, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !286, file: !280, line: 16, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!88, !277, !292, !180, !292, !68}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !286, file: !280, line: 17, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!88, !277, !292, !292, !68}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !286, file: !280, line: 18, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!88, !277, !292, !308, !308, !68}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !309, line: 16, baseType: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !309, line: 16, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !286, file: !280, line: 19, baseType: !301, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !286, file: !280, line: 20, baseType: !305, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !286, file: !280, line: 21, baseType: !301, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !286, file: !280, line: 22, baseType: !301, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !286, file: !280, line: 23, baseType: !301, size: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !286, file: !280, line: 24, baseType: !305, size: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !286, file: !280, line: 25, baseType: !319, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!88, !277, !292, !308, !308, !308, !68}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !286, file: !280, line: 26, baseType: !323, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!88, !277, !292, !308, !68}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !286, file: !280, line: 27, baseType: !305, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !286, file: !280, line: 28, baseType: !305, size: 64, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !286, file: !280, line: 29, baseType: !301, size: 64, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !286, file: !280, line: 30, baseType: !330, size: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!88, !277, !127, !68}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !286, file: !280, line: 31, baseType: !334, size: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!88, !277, !68}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !286, file: !280, line: 32, baseType: !209, size: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !286, file: !280, line: 35, baseType: !339, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!88, !277, !292, !292}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !286, file: !280, line: 36, baseType: !343, size: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!88, !277}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !286, file: !280, line: 37, baseType: !343, size: 64, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !286, file: !280, line: 38, baseType: !348, size: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!88, !277, !94}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !286, file: !280, line: 39, baseType: !352, size: 64, offset: 1408)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!88, !218, !277}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !286, file: !280, line: 40, baseType: !343, size: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !279, file: !280, line: 47, baseType: !68, size: 64, offset: 6016)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !279, file: !280, line: 48, baseType: !68, size: 64, offset: 6080)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !279, file: !280, line: 49, baseType: !68, size: 64, offset: 6144)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !279, file: !280, line: 50, baseType: !68, size: 64, offset: 6208)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !279, file: !280, line: 51, baseType: !68, size: 64, offset: 6272)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !279, file: !280, line: 52, baseType: !68, size: 64, offset: 6336)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !279, file: !280, line: 53, baseType: !68, size: 64, offset: 6400)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !279, file: !280, line: 54, baseType: !68, size: 64, offset: 6464)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !279, file: !280, line: 55, baseType: !68, size: 64, offset: 6528)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !279, file: !280, line: 56, baseType: !68, size: 64, offset: 6592)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !279, file: !280, line: 57, baseType: !68, size: 64, offset: 6656)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !279, file: !280, line: 58, baseType: !68, size: 64, offset: 6720)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !279, file: !280, line: 59, baseType: !68, size: 64, offset: 6784)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !279, file: !280, line: 60, baseType: !68, size: 64, offset: 6848)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !279, file: !280, line: 61, baseType: !68, size: 64, offset: 6912)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !279, file: !280, line: 62, baseType: !68, size: 64, offset: 6976)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !279, file: !280, line: 63, baseType: !68, size: 64, offset: 7040)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !279, file: !280, line: 65, baseType: !374, size: 640, offset: 7104)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 640, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 10)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !279, file: !280, line: 66, baseType: !378, size: 640, offset: 7744)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 640, elements: !375)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!88, !67}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !279, file: !280, line: 67, baseType: !383, size: 640, offset: 8384)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 640, elements: !375)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !279, file: !280, line: 68, baseType: !127, size: 32, offset: 9024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !279, file: !280, line: 69, baseType: !68, size: 64, offset: 9088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !279, file: !280, line: 70, baseType: !387, size: 32, offset: 9152)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !279, file: !280, line: 72, baseType: !241, size: 32, offset: 9184)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !280, line: 73, baseType: !68, size: 64, offset: 9216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !279, file: !280, line: 75, baseType: !292, size: 64, offset: 9280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !279, file: !280, line: 76, baseType: !292, size: 64, offset: 9344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !279, file: !280, line: 77, baseType: !292, size: 64, offset: 9408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !279, file: !280, line: 78, baseType: !292, size: 64, offset: 9472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !279, file: !280, line: 79, baseType: !292, size: 64, offset: 9536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !279, file: !280, line: 80, baseType: !292, size: 64, offset: 9600)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !279, file: !280, line: 81, baseType: !292, size: 64, offset: 9664)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !279, file: !280, line: 82, baseType: !292, size: 64, offset: 9728)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !279, file: !280, line: 83, baseType: !292, size: 64, offset: 9792)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !279, file: !280, line: 84, baseType: !308, size: 64, offset: 9856)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !279, file: !280, line: 85, baseType: !308, size: 64, offset: 9920)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !279, file: !280, line: 86, baseType: !308, size: 64, offset: 9984)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !279, file: !280, line: 87, baseType: !292, size: 64, offset: 10048)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !279, file: !280, line: 88, baseType: !292, size: 64, offset: 10112)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !279, file: !280, line: 89, baseType: !308, size: 64, offset: 10176)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !279, file: !280, line: 90, baseType: !308, size: 64, offset: 10240)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !279, file: !280, line: 91, baseType: !292, size: 64, offset: 10304)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !279, file: !280, line: 92, baseType: !127, size: 32, offset: 10368)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !279, file: !280, line: 93, baseType: !172, size: 64, offset: 10432)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !279, file: !280, line: 94, baseType: !172, size: 64, offset: 10496)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !279, file: !280, line: 95, baseType: !180, size: 64, offset: 10560)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !279, file: !280, line: 96, baseType: !292, size: 64, offset: 10624)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !279, file: !280, line: 97, baseType: !292, size: 64, offset: 10688)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !279, file: !280, line: 98, baseType: !292, size: 64, offset: 10752)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !279, file: !280, line: 99, baseType: !308, size: 64, offset: 10816)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !279, file: !280, line: 100, baseType: !308, size: 64, offset: 10880)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !279, file: !280, line: 101, baseType: !308, size: 64, offset: 10944)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !279, file: !280, line: 102, baseType: !308, size: 64, offset: 11008)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !279, file: !280, line: 103, baseType: !308, size: 64, offset: 11072)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !279, file: !280, line: 104, baseType: !308, size: 64, offset: 11136)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !279, file: !280, line: 105, baseType: !308, size: 64, offset: 11200)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !279, file: !280, line: 106, baseType: !308, size: 64, offset: 11264)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !279, file: !280, line: 107, baseType: !308, size: 64, offset: 11328)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !279, file: !280, line: 108, baseType: !308, size: 64, offset: 11392)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !279, file: !280, line: 109, baseType: !308, size: 64, offset: 11456)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !279, file: !280, line: 110, baseType: !426, size: 64, offset: 11520)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !427, line: 11, baseType: !428)
!427 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !427, line: 11, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !279, file: !280, line: 111, baseType: !426, size: 64, offset: 11584)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !279, file: !280, line: 112, baseType: !181, size: 64, offset: 11648)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !279, file: !280, line: 113, baseType: !181, size: 64, offset: 11712)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !279, file: !280, line: 114, baseType: !181, size: 64, offset: 11776)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !279, file: !280, line: 115, baseType: !181, size: 64, offset: 11840)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !279, file: !280, line: 116, baseType: !181, size: 64, offset: 11904)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !279, file: !280, line: 117, baseType: !181, size: 64, offset: 11968)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !279, file: !280, line: 119, baseType: !127, size: 32, offset: 12032)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !279, file: !280, line: 120, baseType: !127, size: 32, offset: 12064)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !279, file: !280, line: 121, baseType: !127, size: 32, offset: 12096)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !279, file: !280, line: 122, baseType: !127, size: 32, offset: 12128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !279, file: !280, line: 123, baseType: !127, size: 32, offset: 12160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !279, file: !280, line: 124, baseType: !127, size: 32, offset: 12192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !279, file: !280, line: 125, baseType: !127, size: 32, offset: 12224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !279, file: !280, line: 126, baseType: !127, size: 32, offset: 12256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !279, file: !280, line: 127, baseType: !127, size: 32, offset: 12288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !279, file: !280, line: 128, baseType: !127, size: 32, offset: 12320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !279, file: !280, line: 129, baseType: !127, size: 32, offset: 12352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !279, file: !280, line: 130, baseType: !127, size: 32, offset: 12384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !279, file: !280, line: 131, baseType: !127, size: 32, offset: 12416)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !279, file: !280, line: 132, baseType: !127, size: 32, offset: 12448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !279, file: !280, line: 133, baseType: !127, size: 32, offset: 12480)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !279, file: !280, line: 134, baseType: !127, size: 32, offset: 12512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !279, file: !280, line: 135, baseType: !127, size: 32, offset: 12544)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !279, file: !280, line: 137, baseType: !127, size: 32, offset: 12576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !279, file: !280, line: 138, baseType: !127, size: 32, offset: 12608)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !279, file: !280, line: 140, baseType: !457, size: 64, offset: 12672)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !458, line: 5, baseType: !459)
!458 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !458, line: 5, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !279, file: !280, line: 141, baseType: !241, size: 32, offset: 12736)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !279, file: !280, line: 142, baseType: !463, size: 64, offset: 12800)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !464, line: 22, baseType: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !464, line: 22, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !279, file: !280, line: 143, baseType: !181, size: 64, offset: 12864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !279, file: !280, line: 144, baseType: !181, size: 64, offset: 12928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !279, file: !280, line: 146, baseType: !181, size: 64, offset: 12992)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !279, file: !280, line: 147, baseType: !181, size: 64, offset: 13056)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !279, file: !280, line: 148, baseType: !181, size: 64, offset: 13120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !279, file: !280, line: 149, baseType: !181, size: 64, offset: 13184)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !279, file: !280, line: 150, baseType: !181, size: 64, offset: 13248)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !279, file: !280, line: 151, baseType: !181, size: 64, offset: 13312)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !279, file: !280, line: 152, baseType: !181, size: 64, offset: 13376)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !279, file: !280, line: 153, baseType: !241, size: 32, offset: 13440)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !279, file: !280, line: 154, baseType: !241, size: 32, offset: 13472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !279, file: !280, line: 155, baseType: !241, size: 32, offset: 13504)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !279, file: !280, line: 156, baseType: !241, size: 32, offset: 13536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !279, file: !280, line: 157, baseType: !241, size: 32, offset: 13568)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !279, file: !280, line: 158, baseType: !241, size: 32, offset: 13600)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !279, file: !280, line: 159, baseType: !241, size: 32, offset: 13632)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !279, file: !280, line: 160, baseType: !241, size: 32, offset: 13664)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !279, file: !280, line: 161, baseType: !241, size: 32, offset: 13696)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !279, file: !280, line: 162, baseType: !241, size: 32, offset: 13728)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !279, file: !280, line: 163, baseType: !241, size: 32, offset: 13760)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !279, file: !280, line: 164, baseType: !241, size: 32, offset: 13792)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !279, file: !280, line: 165, baseType: !241, size: 32, offset: 13824)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !279, file: !280, line: 166, baseType: !241, size: 32, offset: 13856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !279, file: !280, line: 167, baseType: !241, size: 32, offset: 13888)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !279, file: !280, line: 168, baseType: !241, size: 32, offset: 13920)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !279, file: !280, line: 169, baseType: !241, size: 32, offset: 13952)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !279, file: !280, line: 170, baseType: !241, size: 32, offset: 13984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !279, file: !280, line: 171, baseType: !241, size: 32, offset: 14016)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !279, file: !280, line: 172, baseType: !241, size: 32, offset: 14048)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !279, file: !280, line: 173, baseType: !241, size: 32, offset: 14080)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !279, file: !280, line: 174, baseType: !241, size: 32, offset: 14112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !279, file: !280, line: 175, baseType: !241, size: 32, offset: 14144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !279, file: !280, line: 177, baseType: !500, size: 32, offset: 14176)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !279, file: !280, line: 178, baseType: !127, size: 32, offset: 14208)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !279, file: !280, line: 179, baseType: !180, size: 64, offset: 14272)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !279, file: !280, line: 180, baseType: !180, size: 64, offset: 14336)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !279, file: !280, line: 181, baseType: !180, size: 64, offset: 14400)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !279, file: !280, line: 182, baseType: !172, size: 64, offset: 14464)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !279, file: !280, line: 183, baseType: !127, size: 32, offset: 14528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !279, file: !280, line: 184, baseType: !241, size: 32, offset: 14560)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !279, file: !280, line: 185, baseType: !241, size: 32, offset: 14592)
!509 = !{!0}
!510 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/interface/ftn-custom/ztaosolverf.c", directory: "/home/users/ndemeye/xSDK")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 64, size: 640, elements: !512)
!512 = !{!513, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !511, file: !510, line: 65, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !55, line: 56, baseType: !28)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "grad", scope: !511, file: !510, line: 66, baseType: !514, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "objgrad", scope: !511, file: !510, line: 67, baseType: !514, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hess", scope: !511, file: !510, line: 68, baseType: !514, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lsres", scope: !511, file: !510, line: 69, baseType: !514, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lsjac", scope: !511, file: !510, line: 70, baseType: !514, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "jac", scope: !511, file: !510, line: 71, baseType: !514, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jacstate", scope: !511, file: !510, line: 72, baseType: !514, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "jacdesign", scope: !511, file: !510, line: 73, baseType: !514, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !511, file: !510, line: 74, baseType: !514, size: 32, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !511, file: !510, line: 75, baseType: !514, size: 32, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mondestroy", scope: !511, file: !510, line: 76, baseType: !514, size: 32, offset: 352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "convtest", scope: !511, file: !510, line: 77, baseType: !514, size: 32, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !511, file: !510, line: 78, baseType: !514, size: 32, offset: 416)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "jacineq", scope: !511, file: !510, line: 79, baseType: !514, size: 32, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "jaceq", scope: !511, file: !510, line: 80, baseType: !514, size: 32, offset: 480)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "conineq", scope: !511, file: !510, line: 81, baseType: !514, size: 32, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "coneq", scope: !511, file: !510, line: 82, baseType: !514, size: 32, offset: 544)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !511, file: !510, line: 83, baseType: !514, size: 32, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !511, file: !510, line: 84, baseType: !514, size: 32, offset: 608)
!534 = !{i32 7, !"Dwarf Version", i32 4}
!535 = !{i32 2, !"Debug Info Version", i32 3}
!536 = !{i32 1, !"wchar_size", i32 4}
!537 = !{i32 7, !"PIC Level", i32 2}
!538 = !{i32 7, !"uwtable", i32 1}
!539 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!540 = distinct !DISubprogram(name: "taosetobjectiveroutine_", scope: !510, file: !510, line: 186, type: !541, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543, !544, !68, !548}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !543, !547, !180, !68, !548}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!549 = !{!550, !551, !552, !553}
!550 = !DILocalVariable(name: "tao", arg: 1, scope: !540, file: !510, line: 186, type: !543)
!551 = !DILocalVariable(name: "func", arg: 2, scope: !540, file: !510, line: 186, type: !544)
!552 = !DILocalVariable(name: "ctx", arg: 3, scope: !540, file: !510, line: 186, type: !68)
!553 = !DILocalVariable(name: "ierr", arg: 4, scope: !540, file: !510, line: 186, type: !548)
!554 = !DILocation(line: 0, scope: !540)
!555 = !DILocation(line: 188, column: 5, scope: !556)
!556 = distinct !DILexicalBlock(scope: !540, file: !510, line: 188, column: 5)
!557 = !{!558, !558, i64 0}
!558 = !{!"any pointer", !559, i64 0}
!559 = !{!"omnipotent char", !560, i64 0}
!560 = !{!"Simple C/C++ TBAA"}
!561 = !DILocation(line: 188, column: 5, scope: !540)
!562 = !DILocation(line: 188, column: 5, scope: !563)
!563 = distinct !DILexicalBlock(scope: !556, file: !510, line: 188, column: 5)
!564 = !DILocation(line: 188, column: 5, scope: !565)
!565 = distinct !DILexicalBlock(scope: !563, file: !510, line: 188, column: 5)
!566 = !DILocation(line: 189, column: 56, scope: !540)
!567 = !DILocation(line: 189, column: 99, scope: !540)
!568 = !DILocation(line: 189, column: 13, scope: !540)
!569 = !DILocation(line: 189, column: 11, scope: !540)
!570 = !{!571, !571, i64 0}
!571 = !{!"int", !559, i64 0}
!572 = !DILocation(line: 190, column: 10, scope: !573)
!573 = distinct !DILexicalBlock(scope: !540, file: !510, line: 190, column: 9)
!574 = !DILocation(line: 190, column: 9, scope: !540)
!575 = !DILocation(line: 190, column: 48, scope: !573)
!576 = !DILocation(line: 190, column: 25, scope: !573)
!577 = !DILocation(line: 190, column: 17, scope: !573)
!578 = !DILocation(line: 191, column: 1, scope: !540)
!579 = !DISubprogram(name: "PetscError", scope: !49, file: !49, line: 668, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{!88, !71, !28, !107, !107, !28, !48, !107, null}
!582 = !{}
!583 = !DISubprogram(name: "PetscObjectSetFortranCallback", scope: !55, file: !55, line: 176, type: !584, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!584 = !DISubroutineType(types: !585)
!585 = !{!28, !74, !54, !586, !61, !68}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!587 = !DISubprogram(name: "TaoSetObjectiveRoutine", scope: !27, file: !27, line: 236, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !582)
!588 = !DISubroutineType(types: !589)
!589 = !{!28, !278, !590, !68}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!28, !278, !294, !593, !68}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
