; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/ftn-custom/ztaolinesearchf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/ftn-custom/ztaolinesearchf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TaoLineSearch = type { %struct._p_PetscObject, [1 x %struct._TaoLineSearchOps], i8*, i8*, i8*, i8*, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec*, %struct._p_Vec*, double, double, %struct._p_Vec*, %struct._p_Vec*, double, double, i32, i32, i32, i32, i32, double, double, double, double, double, %struct._p_Tao* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !368, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/ftn-custom/ztaolinesearchf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 6, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!29 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!30 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!31 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!32 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!33 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!34 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!35 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!36 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!37 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!38 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!39 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 663, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!46 = !{!47, !255, !256, !221, !146, !258, !65, !261, !97, !136, !263, !359, !362, !365}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !50, line: 73, size: 4480, elements: !51)
!50 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!51 = !{!52, !54, !107, !108, !110, !113, !114, !115, !116, !124, !125, !127, !131, !135, !137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !149, !150, !151, !153, !154, !156, !158, !159, !160, !161, !162, !165, !167, !168, !169, !170, !171, !174, !176, !177, !178, !188, !190, !191, !195, !196, !245, !250, !252, !253, !254}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !49, file: !50, line: 74, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !49, file: !50, line: 75, baseType: !55, size: 448, offset: 64)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 448, elements: !105)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !50, line: 53, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 45, size: 448, elements: !58)
!58 = !{!59, !69, !77, !82, !89, !93, !100}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !57, file: !50, line: 46, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !47, !64}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !66, line: 330, baseType: !67)
!66 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !66, line: 330, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !57, file: !50, line: 47, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!63, !47, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !74, line: 16, baseType: !75)
!74 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !74, line: 16, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !57, file: !50, line: 48, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!63, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !57, file: !50, line: 49, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!63, !47, !86, !47}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !57, file: !50, line: 50, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!63, !47, !86, !81}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !57, file: !50, line: 51, baseType: !94, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!63, !47, !86, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !57, file: !50, line: 52, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!63, !47, !86, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !49, file: !50, line: 76, baseType: !65, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !50, line: 77, baseType: !109, size: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !49, file: !50, line: 78, baseType: !111, size: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !112)
!112 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !49, file: !50, line: 78, baseType: !111, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !49, file: !50, line: 78, baseType: !111, size: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !49, file: !50, line: 78, baseType: !111, size: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !49, file: !50, line: 79, baseType: !117, size: 64, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !120, line: 27, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !122, line: 43, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!123 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !49, file: !50, line: 80, baseType: !109, size: 32, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !49, file: !50, line: 81, baseType: !126, size: 32, offset: 992)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !49, file: !50, line: 82, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !49, file: !50, line: 83, baseType: !132, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !49, file: !50, line: 84, baseType: !136, size: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !49, file: !50, line: 85, baseType: !136, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !49, file: !50, line: 86, baseType: !136, size: 64, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !49, file: !50, line: 87, baseType: !136, size: 64, offset: 1344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !49, file: !50, line: 88, baseType: !47, size: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !49, file: !50, line: 89, baseType: !117, size: 64, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 90, baseType: !136, size: 64, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !49, file: !50, line: 91, baseType: !136, size: 64, offset: 1600)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !49, file: !50, line: 92, baseType: !109, size: 32, offset: 1664)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !49, file: !50, line: 93, baseType: !146, size: 64, offset: 1728)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !49, file: !50, line: 94, baseType: !148, size: 64, offset: 1792)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !118)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !49, file: !50, line: 95, baseType: !109, size: 32, offset: 1856)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !49, file: !50, line: 95, baseType: !109, size: 32, offset: 1888)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !49, file: !50, line: 96, baseType: !152, size: 64, offset: 1920)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !49, file: !50, line: 96, baseType: !152, size: 64, offset: 1984)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !49, file: !50, line: 97, baseType: !155, size: 64, offset: 2048)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !49, file: !50, line: 97, baseType: !157, size: 64, offset: 2112)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !49, file: !50, line: 98, baseType: !109, size: 32, offset: 2176)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !49, file: !50, line: 98, baseType: !109, size: 32, offset: 2208)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !49, file: !50, line: 99, baseType: !152, size: 64, offset: 2240)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !49, file: !50, line: 99, baseType: !152, size: 64, offset: 2304)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !49, file: !50, line: 100, baseType: !163, size: 64, offset: 2368)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !49, file: !50, line: 100, baseType: !166, size: 64, offset: 2432)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !49, file: !50, line: 101, baseType: !109, size: 32, offset: 2496)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !49, file: !50, line: 101, baseType: !109, size: 32, offset: 2528)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !49, file: !50, line: 102, baseType: !152, size: 64, offset: 2560)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !49, file: !50, line: 102, baseType: !152, size: 64, offset: 2624)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !49, file: !50, line: 103, baseType: !172, size: 64, offset: 2688)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !164)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !49, file: !50, line: 103, baseType: !175, size: 64, offset: 2752)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !49, file: !50, line: 104, baseType: !104, size: 64, offset: 2816)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !49, file: !50, line: 105, baseType: !109, size: 32, offset: 2880)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !49, file: !50, line: 106, baseType: !179, size: 128, offset: 2944)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, elements: !186)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !50, line: 64, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 61, size: 128, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !182, file: !50, line: 62, baseType: !97, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !182, file: !50, line: 63, baseType: !146, size: 64, offset: 64)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !49, file: !50, line: 107, baseType: !189, size: 64, offset: 3072)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !186)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !49, file: !50, line: 108, baseType: !146, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !49, file: !50, line: 109, baseType: !192, size: 64, offset: 3200)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!63, !146}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !49, file: !50, line: 111, baseType: !109, size: 32, offset: 3264)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !49, file: !50, line: 112, baseType: !197, size: 320, offset: 3328)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 320, elements: !243)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!63, !201, !47, !146}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !204)
!204 = !{!205, !206, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !203, file: !10, line: 100, baseType: !109, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !10, line: 101, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !218, !219, !220, !224, !226, !228, !229, !230}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !209, file: !10, line: 84, baseType: !136, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !209, file: !10, line: 85, baseType: !136, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !10, line: 86, baseType: !146, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !209, file: !10, line: 87, baseType: !128, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !209, file: !10, line: 88, baseType: !216, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !209, file: !10, line: 89, baseType: !88, size: 8, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !209, file: !10, line: 90, baseType: !136, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !209, file: !10, line: 91, baseType: !221, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !222, line: 46, baseType: !223)
!222 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!223 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !209, file: !10, line: 92, baseType: !225, size: 32, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !10, line: 93, baseType: !227, size: 32, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !10, line: 94, baseType: !207, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !209, file: !10, line: 95, baseType: !136, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !209, file: !10, line: 96, baseType: !146, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !203, file: !10, line: 102, baseType: !136, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !203, file: !10, line: 102, baseType: !136, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !203, file: !10, line: 103, baseType: !136, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !203, file: !10, line: 104, baseType: !65, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !203, file: !10, line: 105, baseType: !225, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !203, file: !10, line: 105, baseType: !225, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !203, file: !10, line: 105, baseType: !225, size: 32, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !203, file: !10, line: 106, baseType: !47, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !203, file: !10, line: 107, baseType: !240, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!243 = !{!244}
!244 = !DISubrange(count: 5)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !49, file: !50, line: 113, baseType: !246, size: 320, offset: 3648)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 320, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!63, !47, !146}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !49, file: !50, line: 114, baseType: !251, size: 320, offset: 3968)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 320, elements: !243)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !49, file: !50, line: 115, baseType: !225, size: 32, offset: 4288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !49, file: !50, line: 120, baseType: !240, size: 64, offset: 4352)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !49, file: !50, line: 121, baseType: !225, size: 32, offset: 4416)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !257, line: 1451, baseType: !97)
!257 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !260, line: 135, baseType: !261)
!260 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !262, line: 100, baseType: !223)
!262 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !357, !163, !146, !358}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !25, line: 5, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !270, line: 22, size: 7104, elements: !271)
!270 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taolinesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!271 = !{!272, !274, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !269, file: !270, line: 23, baseType: !273, size: 4480)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !50, line: 122, baseType: !49)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !269, file: !270, line: 23, baseType: !275, size: 704, offset: 4480)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 704, elements: !105)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoLineSearchOps", file: !270, line: 8, size: 704, elements: !277)
!277 = !{!278, !286, !290, !294, !298, !302, !306, !310, !314, !315, !316}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !276, file: !270, line: 9, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!63, !267, !282, !163, !146}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !283, line: 21, baseType: !284)
!283 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !283, line: 21, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !276, file: !270, line: 10, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!63, !267, !282, !282, !146}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !276, file: !270, line: 11, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!63, !267, !282, !163, !282, !146}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgts", scope: !276, file: !270, line: 12, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!63, !267, !282, !282, !163, !163, !146}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !276, file: !270, line: 13, baseType: !299, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!63, !267}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !276, file: !270, line: 14, baseType: !303, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!63, !267, !282, !163, !282, !282}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !276, file: !270, line: 15, baseType: !307, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!63, !267, !73}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !276, file: !270, line: 16, baseType: !311, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!63, !201, !267}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !276, file: !270, line: 17, baseType: !299, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !276, file: !270, line: 18, baseType: !299, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !276, file: !270, line: 19, baseType: !299, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_func", scope: !269, file: !270, line: 24, baseType: !146, size: 64, offset: 5184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_grad", scope: !269, file: !270, line: 25, baseType: !146, size: 64, offset: 5248)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgrad", scope: !269, file: !270, line: 26, baseType: !146, size: 64, offset: 5312)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgts", scope: !269, file: !270, line: 27, baseType: !146, size: 64, offset: 5376)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "usemonitor", scope: !269, file: !270, line: 28, baseType: !225, size: 32, offset: 5440)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !269, file: !270, line: 29, baseType: !73, size: 64, offset: 5504)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !269, file: !270, line: 31, baseType: !225, size: 32, offset: 5568)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "usegts", scope: !269, file: !270, line: 32, baseType: !225, size: 32, offset: 5600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "usetaoroutines", scope: !269, file: !270, line: 33, baseType: !225, size: 32, offset: 5632)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjective", scope: !269, file: !270, line: 34, baseType: !225, size: 32, offset: 5664)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "hasgradient", scope: !269, file: !270, line: 35, baseType: !225, size: 32, offset: 5696)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjectiveandgradient", scope: !269, file: !270, line: 36, baseType: !225, size: 32, offset: 5728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 37, baseType: !146, size: 64, offset: 5760)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !269, file: !270, line: 40, baseType: !282, size: 64, offset: 5824)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !269, file: !270, line: 41, baseType: !282, size: 64, offset: 5888)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !269, file: !270, line: 42, baseType: !109, size: 32, offset: 5952)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !269, file: !270, line: 44, baseType: !282, size: 64, offset: 6016)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !269, file: !270, line: 45, baseType: !282, size: 64, offset: 6080)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "f_fullstep", scope: !269, file: !270, line: 46, baseType: !164, size: 64, offset: 6144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "new_f", scope: !269, file: !270, line: 47, baseType: !164, size: 64, offset: 6208)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "new_x", scope: !269, file: !270, line: 48, baseType: !282, size: 64, offset: 6272)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "new_g", scope: !269, file: !270, line: 49, baseType: !282, size: 64, offset: 6336)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !269, file: !270, line: 51, baseType: !164, size: 64, offset: 6400)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !269, file: !270, line: 52, baseType: !164, size: 64, offset: 6464)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !269, file: !270, line: 54, baseType: !109, size: 32, offset: 6528)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nfeval", scope: !269, file: !270, line: 55, baseType: !109, size: 32, offset: 6560)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ngeval", scope: !269, file: !270, line: 56, baseType: !109, size: 32, offset: 6592)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nfgeval", scope: !269, file: !270, line: 57, baseType: !109, size: 32, offset: 6624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !269, file: !270, line: 58, baseType: !346, size: 32, offset: 6656)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearchConvergedReason", file: !25, line: 19, baseType: !24)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !269, file: !270, line: 60, baseType: !164, size: 64, offset: 6720)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ftol", scope: !269, file: !270, line: 61, baseType: !164, size: 64, offset: 6784)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !269, file: !270, line: 62, baseType: !164, size: 64, offset: 6848)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stepmin", scope: !269, file: !270, line: 63, baseType: !164, size: 64, offset: 6912)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "stepmax", scope: !269, file: !270, line: 64, baseType: !164, size: 64, offset: 6976)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tao", scope: !269, file: !270, line: 66, baseType: !353, size: 64, offset: 7040)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !354, line: 118, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !354, line: 118, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !266, !357, !357, !146, !358}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !266, !357, !163, !357, !146, !358}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !266, !357, !357, !163, !163, !146, !358}
!368 = !{!369, !372, !374, !376, !378}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "NFUNCS", scope: !0, file: !371, line: 27, type: !26, isLocal: true, isDefinition: true)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/ftn-custom/ztaolinesearchf.c", directory: "/home/users/ndemeye/xSDK")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "OBJ", scope: !0, file: !371, line: 23, type: !26, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "GRAD", scope: !0, file: !371, line: 24, type: !26, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "OBJGRAD", scope: !0, file: !371, line: 25, type: !26, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "OBJGTS", scope: !0, file: !371, line: 26, type: !26, isLocal: true, isDefinition: true)
!380 = !{i32 7, !"Dwarf Version", i32 4}
!381 = !{i32 2, !"Debug Info Version", i32 3}
!382 = !{i32 1, !"wchar_size", i32 4}
!383 = !{i32 7, !"PIC Level", i32 2}
!384 = !{i32 7, !"uwtable", i32 1}
!385 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!386 = distinct !DISubprogram(name: "taolinesearchsetobjectiveroutine_", scope: !371, file: !371, line: 66, type: !387, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !266, !263, !146, !358}
!389 = !{!390, !391, !392, !393}
!390 = !DILocalVariable(name: "ls", arg: 1, scope: !386, file: !371, line: 66, type: !266)
!391 = !DILocalVariable(name: "func", arg: 2, scope: !386, file: !371, line: 66, type: !263)
!392 = !DILocalVariable(name: "ctx", arg: 3, scope: !386, file: !371, line: 66, type: !146)
!393 = !DILocalVariable(name: "ierr", arg: 4, scope: !386, file: !371, line: 66, type: !358)
!394 = !DILocation(line: 0, scope: !386)
!395 = !DILocation(line: 68, column: 5, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !371, line: 68, column: 5)
!397 = distinct !DILexicalBlock(scope: !386, file: !371, line: 68, column: 5)
!398 = !{!399, !399, i64 0}
!399 = !{!"any pointer", !400, i64 0}
!400 = !{!"omnipotent char", !401, i64 0}
!401 = !{!"Simple C/C++ TBAA"}
!402 = !{!403, !399, i64 352}
