; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/taosolver.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/interface/taosolver.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!33 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!34 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!35 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!56 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !75)
!75 = !{!76}
!76 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 624, baseType: !7, size: 32, elements: !79)
!78 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!79 = !{!80, !81, !82, !83}
!80 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 155, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!91 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!92 = !{!93, !96, !97, !100, !300, !301, !135, !302, !306, !307, !185, !28, !161, !308, !122, !311, !318, !153, !319, !146, !305, !175, !321, !324, !7}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !78, line: 330, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !78, line: 330, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !98, line: 46, baseType: !99)
!98 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!99 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !103, line: 73, size: 4480, elements: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!104 = !{!105, !107, !156, !157, !159, !162, !163, !164, !165, !173, !174, !176, !180, !184, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !201, !202, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !236, !238, !239, !243, !244, !290, !295, !297, !298, !299}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !102, file: !103, line: 74, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !102, file: !103, line: 75, baseType: !108, size: 448, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 448, elements: !154)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !103, line: 53, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 45, size: 448, elements: !111)
!111 = !{!112, !118, !126, !131, !138, !142, !149}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !110, file: !103, line: 46, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !100, !117}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !110, file: !103, line: 47, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!116, !100, !122}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !123, line: 16, baseType: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !123, line: 16, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !110, file: !103, line: 48, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!116, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !110, file: !103, line: 49, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!116, !100, !135, !100}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !110, file: !103, line: 50, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!116, !100, !135, !130}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !110, file: !103, line: 51, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!116, !100, !135, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !110, file: !103, line: 52, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!116, !100, !135, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !102, file: !103, line: 76, baseType: !93, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !103, line: 77, baseType: !158, size: 32, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !102, file: !103, line: 78, baseType: !160, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !161)
!161 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !102, file: !103, line: 78, baseType: !160, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !102, file: !103, line: 78, baseType: !160, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !102, file: !103, line: 78, baseType: !160, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !103, line: 79, baseType: !166, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !169, line: 27, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !171, line: 43, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !102, file: !103, line: 80, baseType: !158, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !102, file: !103, line: 81, baseType: !175, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !102, file: !103, line: 82, baseType: !177, size: 64, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !102, file: !103, line: 83, baseType: !181, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !102, file: !103, line: 84, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !102, file: !103, line: 85, baseType: !185, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !102, file: !103, line: 86, baseType: !185, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !102, file: !103, line: 87, baseType: !185, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !102, file: !103, line: 88, baseType: !100, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !102, file: !103, line: 89, baseType: !166, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 90, baseType: !185, size: 64, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !102, file: !103, line: 91, baseType: !185, size: 64, offset: 1600)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !102, file: !103, line: 92, baseType: !158, size: 32, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !102, file: !103, line: 93, baseType: !96, size: 64, offset: 1728)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !103, line: 94, baseType: !196, size: 64, offset: 1792)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !167)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !102, file: !103, line: 95, baseType: !158, size: 32, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !102, file: !103, line: 95, baseType: !158, size: 32, offset: 1888)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !102, file: !103, line: 96, baseType: !200, size: 64, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !102, file: !103, line: 96, baseType: !200, size: 64, offset: 1984)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !102, file: !103, line: 97, baseType: !203, size: 64, offset: 2048)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !102, file: !103, line: 97, baseType: !205, size: 64, offset: 2112)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !102, file: !103, line: 98, baseType: !158, size: 32, offset: 2176)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !102, file: !103, line: 98, baseType: !158, size: 32, offset: 2208)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !102, file: !103, line: 99, baseType: !200, size: 64, offset: 2240)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !102, file: !103, line: 99, baseType: !200, size: 64, offset: 2304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !102, file: !103, line: 100, baseType: !211, size: 64, offset: 2368)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !161)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !102, file: !103, line: 100, baseType: !214, size: 64, offset: 2432)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !102, file: !103, line: 101, baseType: !158, size: 32, offset: 2496)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !102, file: !103, line: 101, baseType: !158, size: 32, offset: 2528)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !102, file: !103, line: 102, baseType: !200, size: 64, offset: 2560)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !102, file: !103, line: 102, baseType: !200, size: 64, offset: 2624)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !102, file: !103, line: 103, baseType: !220, size: 64, offset: 2688)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !212)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !102, file: !103, line: 103, baseType: !223, size: 64, offset: 2752)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !102, file: !103, line: 104, baseType: !153, size: 64, offset: 2816)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !102, file: !103, line: 105, baseType: !158, size: 32, offset: 2880)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !102, file: !103, line: 106, baseType: !227, size: 128, offset: 2944)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !234)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !103, line: 64, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 61, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !230, file: !103, line: 62, baseType: !146, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !230, file: !103, line: 63, baseType: !96, size: 64, offset: 64)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !102, file: !103, line: 107, baseType: !237, size: 64, offset: 3072)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !234)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !102, file: !103, line: 108, baseType: !96, size: 64, offset: 3136)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !102, file: !103, line: 109, baseType: !240, size: 64, offset: 3200)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!116, !96}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !102, file: !103, line: 111, baseType: !158, size: 32, offset: 3264)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !102, file: !103, line: 112, baseType: !245, size: 320, offset: 3328)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !288)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!116, !249, !100, !96}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !252)
!252 = !{!253, !254, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !251, file: !12, line: 100, baseType: !158, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !12, line: 101, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !266, !267, !268, !269, !271, !273, !274, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !257, file: !12, line: 84, baseType: !185, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !257, file: !12, line: 85, baseType: !185, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !12, line: 86, baseType: !96, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !257, file: !12, line: 87, baseType: !177, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !257, file: !12, line: 88, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !257, file: !12, line: 89, baseType: !137, size: 8, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !257, file: !12, line: 90, baseType: !185, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !257, file: !12, line: 91, baseType: !97, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !257, file: !12, line: 92, baseType: !270, size: 32, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !12, line: 93, baseType: !272, size: 32, offset: 544)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !12, line: 94, baseType: !255, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !257, file: !12, line: 95, baseType: !185, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !257, file: !12, line: 96, baseType: !96, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !251, file: !12, line: 102, baseType: !185, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !251, file: !12, line: 102, baseType: !185, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !251, file: !12, line: 103, baseType: !185, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !251, file: !12, line: 104, baseType: !93, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !251, file: !12, line: 105, baseType: !270, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !251, file: !12, line: 105, baseType: !270, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !251, file: !12, line: 105, baseType: !270, size: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !251, file: !12, line: 106, baseType: !100, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !251, file: !12, line: 107, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!288 = !{!289}
!289 = !DISubrange(count: 5)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !102, file: !103, line: 113, baseType: !291, size: 320, offset: 3648)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!116, !100, !96}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !102, file: !103, line: 114, baseType: !296, size: 320, offset: 3968)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 320, elements: !288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !102, file: !103, line: 115, baseType: !270, size: 32, offset: 4288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !102, file: !103, line: 120, baseType: !285, size: 64, offset: 4352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !102, file: !103, line: 121, baseType: !270, size: 32, offset: 4416)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !103, line: 130, baseType: !127)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !103, line: 131, baseType: !119)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!116, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !74)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!116}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoMonitorDrawCtx", file: !27, line: 353, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TaoMonitorDrawCtx", file: !314, line: 20, size: 128, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/interface/taosolver.c", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !313, file: !314, line: 21, baseType: !122, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "howoften", scope: !313, file: !314, line: 22, baseType: !158, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !320, line: 1451, baseType: !146)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !78, line: 331, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !78, line: 331, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !78, line: 338, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !78, line: 338, flags: DIFlagFwdDecl)
!327 = !{!0, !328, !330, !335, !600, !602, !606, !608, !610, !612, !614, !616}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "TaoList", scope: !2, file: !314, line: 6, type: !177, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "TaoSubSetTypes", scope: !2, file: !314, line: 18, type: !332, isLocal: false, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 384, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 6)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "set", scope: !337, file: !314, line: 208, type: !270, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "TaoSolve", scope: !314, file: !314, line: 205, type: !338, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !566)
!338 = !DISubroutineType(types: !339)
!339 = !{!116, !340}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !343, line: 45, size: 14656, elements: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!344 = !{!345, !347, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !437, !439, !441, !442, !443, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !518, !519, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !558, !559, !560, !561, !562, !563, !564, !565}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !342, file: !343, line: 46, baseType: !346, size: 4480)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !103, line: 122, baseType: !102)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !343, line: 46, baseType: !348, size: 1536, offset: 4480)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1536, elements: !154)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !343, line: 13, size: 1536, elements: !350)
!350 = !{!351, !358, !362, !366, !374, !375, !376, !377, !378, !379, !380, !384, !388, !389, !390, !391, !395, !399, !400, !404, !406, !407, !411, !415}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !349, file: !343, line: 15, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!116, !340, !355, !211, !96}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !85, line: 21, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !85, line: 21, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !349, file: !343, line: 16, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!116, !340, !355, !211, !355, !96}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !349, file: !343, line: 17, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!116, !340, !355, !355, !96}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !349, file: !343, line: 18, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!116, !340, !355, !370, !370, !96}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !371, line: 16, baseType: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !371, line: 16, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !349, file: !343, line: 19, baseType: !363, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !349, file: !343, line: 20, baseType: !367, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !349, file: !343, line: 21, baseType: !363, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !349, file: !343, line: 22, baseType: !363, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !349, file: !343, line: 23, baseType: !363, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !349, file: !343, line: 24, baseType: !367, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !349, file: !343, line: 25, baseType: !381, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!116, !340, !355, !370, !370, !370, !96}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !349, file: !343, line: 26, baseType: !385, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!116, !340, !355, !370, !96}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !349, file: !343, line: 27, baseType: !367, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !349, file: !343, line: 28, baseType: !367, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !349, file: !343, line: 29, baseType: !363, size: 64, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !349, file: !343, line: 30, baseType: !392, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!116, !340, !158, !96}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !349, file: !343, line: 31, baseType: !396, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!116, !340, !96}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !349, file: !343, line: 32, baseType: !240, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !349, file: !343, line: 35, baseType: !401, size: 64, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!116, !340, !355, !355}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !349, file: !343, line: 36, baseType: !405, size: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !349, file: !343, line: 37, baseType: !405, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !343, line: 38, baseType: !408, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!116, !340, !122}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !349, file: !343, line: 39, baseType: !412, size: 64, offset: 1408)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!116, !249, !340}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !349, file: !343, line: 40, baseType: !405, size: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !342, file: !343, line: 47, baseType: !96, size: 64, offset: 6016)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !342, file: !343, line: 48, baseType: !96, size: 64, offset: 6080)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !342, file: !343, line: 49, baseType: !96, size: 64, offset: 6144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !342, file: !343, line: 50, baseType: !96, size: 64, offset: 6208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !342, file: !343, line: 51, baseType: !96, size: 64, offset: 6272)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !342, file: !343, line: 52, baseType: !96, size: 64, offset: 6336)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !342, file: !343, line: 53, baseType: !96, size: 64, offset: 6400)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !342, file: !343, line: 54, baseType: !96, size: 64, offset: 6464)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !342, file: !343, line: 55, baseType: !96, size: 64, offset: 6528)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !342, file: !343, line: 56, baseType: !96, size: 64, offset: 6592)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !342, file: !343, line: 57, baseType: !96, size: 64, offset: 6656)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !342, file: !343, line: 58, baseType: !96, size: 64, offset: 6720)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !342, file: !343, line: 59, baseType: !96, size: 64, offset: 6784)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !342, file: !343, line: 60, baseType: !96, size: 64, offset: 6848)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !342, file: !343, line: 61, baseType: !96, size: 64, offset: 6912)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !342, file: !343, line: 62, baseType: !96, size: 64, offset: 6976)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !342, file: !343, line: 63, baseType: !96, size: 64, offset: 7040)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !342, file: !343, line: 65, baseType: !434, size: 640, offset: 7104)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 640, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 10)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !342, file: !343, line: 66, baseType: !438, size: 640, offset: 7744)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 640, elements: !435)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !342, file: !343, line: 67, baseType: !440, size: 640, offset: 8384)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 640, elements: !435)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !342, file: !343, line: 68, baseType: !158, size: 32, offset: 9024)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !342, file: !343, line: 69, baseType: !96, size: 64, offset: 9088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !342, file: !343, line: 70, baseType: !444, size: 32, offset: 9152)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !342, file: !343, line: 72, baseType: !270, size: 32, offset: 9184)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !343, line: 73, baseType: !96, size: 64, offset: 9216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !342, file: !343, line: 75, baseType: !355, size: 64, offset: 9280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !342, file: !343, line: 76, baseType: !355, size: 64, offset: 9344)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !342, file: !343, line: 77, baseType: !355, size: 64, offset: 9408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !342, file: !343, line: 78, baseType: !355, size: 64, offset: 9472)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !342, file: !343, line: 79, baseType: !355, size: 64, offset: 9536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !342, file: !343, line: 80, baseType: !355, size: 64, offset: 9600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !342, file: !343, line: 81, baseType: !355, size: 64, offset: 9664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !342, file: !343, line: 82, baseType: !355, size: 64, offset: 9728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !342, file: !343, line: 83, baseType: !355, size: 64, offset: 9792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !342, file: !343, line: 84, baseType: !370, size: 64, offset: 9856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !342, file: !343, line: 85, baseType: !370, size: 64, offset: 9920)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !342, file: !343, line: 86, baseType: !370, size: 64, offset: 9984)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !342, file: !343, line: 87, baseType: !355, size: 64, offset: 10048)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !342, file: !343, line: 88, baseType: !355, size: 64, offset: 10112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !342, file: !343, line: 89, baseType: !370, size: 64, offset: 10176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !342, file: !343, line: 90, baseType: !370, size: 64, offset: 10240)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !342, file: !343, line: 91, baseType: !355, size: 64, offset: 10304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !342, file: !343, line: 92, baseType: !158, size: 32, offset: 10368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !342, file: !343, line: 93, baseType: !203, size: 64, offset: 10432)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !342, file: !343, line: 94, baseType: !203, size: 64, offset: 10496)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !342, file: !343, line: 95, baseType: !211, size: 64, offset: 10560)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !342, file: !343, line: 96, baseType: !355, size: 64, offset: 10624)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !342, file: !343, line: 97, baseType: !355, size: 64, offset: 10688)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !342, file: !343, line: 98, baseType: !355, size: 64, offset: 10752)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !342, file: !343, line: 99, baseType: !370, size: 64, offset: 10816)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !342, file: !343, line: 100, baseType: !370, size: 64, offset: 10880)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !342, file: !343, line: 101, baseType: !370, size: 64, offset: 10944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !342, file: !343, line: 102, baseType: !370, size: 64, offset: 11008)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !342, file: !343, line: 103, baseType: !370, size: 64, offset: 11072)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !342, file: !343, line: 104, baseType: !370, size: 64, offset: 11136)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !342, file: !343, line: 105, baseType: !370, size: 64, offset: 11200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !342, file: !343, line: 106, baseType: !370, size: 64, offset: 11264)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !342, file: !343, line: 107, baseType: !370, size: 64, offset: 11328)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !342, file: !343, line: 108, baseType: !370, size: 64, offset: 11392)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !342, file: !343, line: 109, baseType: !370, size: 64, offset: 11456)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !342, file: !343, line: 110, baseType: !483, size: 64, offset: 11520)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !484, line: 11, baseType: !485)
!484 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !484, line: 11, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !342, file: !343, line: 111, baseType: !483, size: 64, offset: 11584)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !342, file: !343, line: 112, baseType: !212, size: 64, offset: 11648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !342, file: !343, line: 113, baseType: !212, size: 64, offset: 11712)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !342, file: !343, line: 114, baseType: !212, size: 64, offset: 11776)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !342, file: !343, line: 115, baseType: !212, size: 64, offset: 11840)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !342, file: !343, line: 116, baseType: !212, size: 64, offset: 11904)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !342, file: !343, line: 117, baseType: !212, size: 64, offset: 11968)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !342, file: !343, line: 119, baseType: !158, size: 32, offset: 12032)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !342, file: !343, line: 120, baseType: !158, size: 32, offset: 12064)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !342, file: !343, line: 121, baseType: !158, size: 32, offset: 12096)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !342, file: !343, line: 122, baseType: !158, size: 32, offset: 12128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !342, file: !343, line: 123, baseType: !158, size: 32, offset: 12160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !342, file: !343, line: 124, baseType: !158, size: 32, offset: 12192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !342, file: !343, line: 125, baseType: !158, size: 32, offset: 12224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !342, file: !343, line: 126, baseType: !158, size: 32, offset: 12256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !342, file: !343, line: 127, baseType: !158, size: 32, offset: 12288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !342, file: !343, line: 128, baseType: !158, size: 32, offset: 12320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !342, file: !343, line: 129, baseType: !158, size: 32, offset: 12352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !342, file: !343, line: 130, baseType: !158, size: 32, offset: 12384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !342, file: !343, line: 131, baseType: !158, size: 32, offset: 12416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !342, file: !343, line: 132, baseType: !158, size: 32, offset: 12448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !342, file: !343, line: 133, baseType: !158, size: 32, offset: 12480)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !342, file: !343, line: 134, baseType: !158, size: 32, offset: 12512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !342, file: !343, line: 135, baseType: !158, size: 32, offset: 12544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !342, file: !343, line: 137, baseType: !158, size: 32, offset: 12576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !342, file: !343, line: 138, baseType: !158, size: 32, offset: 12608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !342, file: !343, line: 140, baseType: !514, size: 64, offset: 12672)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !515, line: 5, baseType: !516)
!515 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !515, line: 5, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !342, file: !343, line: 141, baseType: !270, size: 32, offset: 12736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !342, file: !343, line: 142, baseType: !520, size: 64, offset: 12800)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !521, line: 22, baseType: !522)
!521 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !521, line: 22, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !342, file: !343, line: 143, baseType: !212, size: 64, offset: 12864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !342, file: !343, line: 144, baseType: !212, size: 64, offset: 12928)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !342, file: !343, line: 146, baseType: !212, size: 64, offset: 12992)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !342, file: !343, line: 147, baseType: !212, size: 64, offset: 13056)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !342, file: !343, line: 148, baseType: !212, size: 64, offset: 13120)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !342, file: !343, line: 149, baseType: !212, size: 64, offset: 13184)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !342, file: !343, line: 150, baseType: !212, size: 64, offset: 13248)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !342, file: !343, line: 151, baseType: !212, size: 64, offset: 13312)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !342, file: !343, line: 152, baseType: !212, size: 64, offset: 13376)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !342, file: !343, line: 153, baseType: !270, size: 32, offset: 13440)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !342, file: !343, line: 154, baseType: !270, size: 32, offset: 13472)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !342, file: !343, line: 155, baseType: !270, size: 32, offset: 13504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !342, file: !343, line: 156, baseType: !270, size: 32, offset: 13536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !342, file: !343, line: 157, baseType: !270, size: 32, offset: 13568)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !342, file: !343, line: 158, baseType: !270, size: 32, offset: 13600)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !342, file: !343, line: 159, baseType: !270, size: 32, offset: 13632)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !342, file: !343, line: 160, baseType: !270, size: 32, offset: 13664)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !342, file: !343, line: 161, baseType: !270, size: 32, offset: 13696)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !342, file: !343, line: 162, baseType: !270, size: 32, offset: 13728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !342, file: !343, line: 163, baseType: !270, size: 32, offset: 13760)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !342, file: !343, line: 164, baseType: !270, size: 32, offset: 13792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !342, file: !343, line: 165, baseType: !270, size: 32, offset: 13824)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !342, file: !343, line: 166, baseType: !270, size: 32, offset: 13856)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !342, file: !343, line: 167, baseType: !270, size: 32, offset: 13888)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !342, file: !343, line: 168, baseType: !270, size: 32, offset: 13920)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !342, file: !343, line: 169, baseType: !270, size: 32, offset: 13952)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !342, file: !343, line: 170, baseType: !270, size: 32, offset: 13984)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !342, file: !343, line: 171, baseType: !270, size: 32, offset: 14016)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !342, file: !343, line: 172, baseType: !270, size: 32, offset: 14048)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !342, file: !343, line: 173, baseType: !270, size: 32, offset: 14080)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !342, file: !343, line: 174, baseType: !270, size: 32, offset: 14112)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !342, file: !343, line: 175, baseType: !270, size: 32, offset: 14144)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !342, file: !343, line: 177, baseType: !557, size: 32, offset: 14176)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !342, file: !343, line: 178, baseType: !158, size: 32, offset: 14208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !342, file: !343, line: 179, baseType: !211, size: 64, offset: 14272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !342, file: !343, line: 180, baseType: !211, size: 64, offset: 14336)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !342, file: !343, line: 181, baseType: !211, size: 64, offset: 14400)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !342, file: !343, line: 182, baseType: !203, size: 64, offset: 14464)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !342, file: !343, line: 183, baseType: !158, size: 32, offset: 14528)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !342, file: !343, line: 184, baseType: !270, size: 32, offset: 14560)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !342, file: !343, line: 185, baseType: !270, size: 32, offset: 14592)
!566 = !{!567, !568, !569, !571, !573, !575, !579, !581, !585, !587, !589, !591, !597}
!567 = !DILocalVariable(name: "tao", arg: 1, scope: !337, file: !314, line: 205, type: !340)
!568 = !DILocalVariable(name: "ierr", scope: !337, file: !314, line: 207, type: !116)
!569 = !DILocalVariable(name: "ierr__", scope: !570, file: !314, line: 218, type: !116)
!570 = distinct !DILexicalBlock(scope: !337, file: !314, line: 218, column: 104)
!571 = !DILocalVariable(name: "ierr__", scope: !572, file: !314, line: 220, type: !116)
!572 = distinct !DILexicalBlock(scope: !337, file: !314, line: 220, column: 24)
!573 = !DILocalVariable(name: "ierr__", scope: !574, file: !314, line: 221, type: !116)
!574 = distinct !DILexicalBlock(scope: !337, file: !314, line: 221, column: 34)
!575 = !DILocalVariable(name: "ierr__", scope: !576, file: !314, line: 223, type: !116)
!576 = distinct !DILexicalBlock(scope: !577, file: !314, line: 223, column: 48)
!577 = distinct !DILexicalBlock(scope: !578, file: !314, line: 222, column: 24)
!578 = distinct !DILexicalBlock(scope: !337, file: !314, line: 222, column: 7)
!579 = !DILocalVariable(name: "ierr__", scope: !580, file: !314, line: 226, type: !116)
!580 = distinct !DILexicalBlock(scope: !337, file: !314, line: 226, column: 50)
!581 = !DILocalVariable(name: "ierr__", scope: !582, file: !314, line: 227, type: !116)
!582 = distinct !DILexicalBlock(scope: !583, file: !314, line: 227, column: 57)
!583 = distinct !DILexicalBlock(scope: !584, file: !314, line: 227, column: 24)
!584 = distinct !DILexicalBlock(scope: !337, file: !314, line: 227, column: 7)
!585 = !DILocalVariable(name: "ierr__", scope: !586, file: !314, line: 228, type: !116)
!586 = distinct !DILexicalBlock(scope: !337, file: !314, line: 228, column: 48)
!587 = !DILocalVariable(name: "ierr__", scope: !588, file: !314, line: 230, type: !116)
!588 = distinct !DILexicalBlock(scope: !337, file: !314, line: 230, column: 82)
!589 = !DILocalVariable(name: "ierr__", scope: !590, file: !314, line: 233, type: !116)
!590 = distinct !DILexicalBlock(scope: !337, file: !314, line: 233, column: 51)
!591 = !DILocalVariable(name: "ierr__", scope: !592, file: !314, line: 237, type: !116)
!592 = distinct !DILexicalBlock(scope: !593, file: !314, line: 237, column: 144)
!593 = distinct !DILexicalBlock(scope: !594, file: !314, line: 236, column: 26)
!594 = distinct !DILexicalBlock(scope: !595, file: !314, line: 236, column: 9)
!595 = distinct !DILexicalBlock(scope: !596, file: !314, line: 235, column: 25)
!596 = distinct !DILexicalBlock(scope: !337, file: !314, line: 235, column: 7)
!597 = !DILocalVariable(name: "ierr__", scope: !598, file: !314, line: 239, type: !116)
!598 = distinct !DILexicalBlock(scope: !599, file: !314, line: 239, column: 150)
!599 = distinct !DILexicalBlock(scope: !594, file: !314, line: 238, column: 12)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "TAO_CLASSID", scope: !2, file: !314, line: 8, type: !106, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "TAO_Solve", scope: !2, file: !314, line: 10, type: !604, isLocal: false, isDefinition: true)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !605, line: 80, baseType: !28)
!605 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "TAO_ObjectiveEval", scope: !2, file: !314, line: 11, type: !604, isLocal: false, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "TAO_GradientEval", scope: !2, file: !314, line: 12, type: !604, isLocal: false, isDefinition: true)
