; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexdistribute.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexdistribute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "asiz", scope: !2, file: !3, line: 184, type: !78, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "DMPlexGetAdjacency_Internal", scope: !3, file: !3, line: 182, type: !4, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1070, retainedNodes: !1269)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexdistribute.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !78, !195, !195, !195, !124, !126}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !10, line: 14, baseType: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !13, line: 202, size: 40000, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !244, !551, !555, !556, !557, !558, !572, !573, !581, !582, !590, !591, !592, !593, !597, !598, !602, !604, !606, !607, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !635, !647, !659, !671, !680, !681, !700, !701, !702, !703, !704, !705, !707, !797, !798, !818, !819, !820, !821, !822, !823, !827, !828, !832, !833, !834, !835, !836, !837, !838, !839, !840, !850, !862, !863, !864, !873, !969, !970, !1058, !1059, !1060, !1061, !1063, !1065, !1066, !1067, !1068, !1069}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !12, file: !13, line: 203, baseType: !16, size: 4480)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !17, line: 122, baseType: !18)
!17 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !17, line: 73, size: 4480, elements: !19)
!19 = !{!20, !22, !76, !77, !79, !82, !83, !84, !85, !93, !94, !96, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !118, !119, !120, !122, !123, !125, !127, !128, !129, !130, !131, !134, !136, !137, !138, !139, !140, !143, !145, !146, !147, !157, !159, !160, !164, !165, !234, !239, !241, !242, !243}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !18, file: !17, line: 74, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !18, file: !17, line: 75, baseType: !23, size: 448, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 448, elements: !74)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !17, line: 53, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 448, elements: !26)
!26 = !{!27, !38, !46, !51, !58, !62, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !25, file: !17, line: 46, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!6, !31, !33}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !35, line: 330, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !35, line: 330, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !25, file: !17, line: 47, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !31, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !43, line: 16, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !25, file: !17, line: 48, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !25, file: !17, line: 49, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !31, !55, !31}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !25, file: !17, line: 50, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !31, !55, !50}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !25, file: !17, line: 51, baseType: !63, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !31, !55, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !25, file: !17, line: 52, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !31, !55, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !17, line: 76, baseType: !34, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 77, baseType: !78, size: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !81)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !17, line: 79, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 27, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !18, file: !17, line: 80, baseType: !78, size: 32, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !18, file: !17, line: 81, baseType: !95, size: 32, offset: 992)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !18, file: !17, line: 82, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !18, file: !17, line: 83, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !18, file: !17, line: 84, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !18, file: !17, line: 85, baseType: !105, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !18, file: !17, line: 86, baseType: !105, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !18, file: !17, line: 87, baseType: !105, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !17, line: 88, baseType: !31, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !18, file: !17, line: 89, baseType: !86, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 90, baseType: !105, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !18, file: !17, line: 91, baseType: !105, size: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !18, file: !17, line: 92, baseType: !78, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !18, file: !17, line: 93, baseType: !115, size: 64, offset: 1728)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !17, line: 94, baseType: !117, size: 64, offset: 1792)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !87)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1856)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1888)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !18, file: !17, line: 97, baseType: !124, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !18, file: !17, line: 97, baseType: !126, size: 64, offset: 2112)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !18, file: !17, line: 100, baseType: !132, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !18, file: !17, line: 100, baseType: !135, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2496)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2528)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2560)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2624)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !18, file: !17, line: 103, baseType: !141, size: 64, offset: 2688)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !133)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !18, file: !17, line: 103, baseType: !144, size: 64, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !18, file: !17, line: 104, baseType: !73, size: 64, offset: 2816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !18, file: !17, line: 105, baseType: !78, size: 32, offset: 2880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !18, file: !17, line: 106, baseType: !148, size: 128, offset: 2944)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !17, line: 64, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 61, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !151, file: !17, line: 62, baseType: !66, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !151, file: !17, line: 63, baseType: !115, size: 64, offset: 64)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !18, file: !17, line: 107, baseType: !158, size: 64, offset: 3072)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !18, file: !17, line: 108, baseType: !115, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !18, file: !17, line: 109, baseType: !161, size: 64, offset: 3200)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!6, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !18, file: !17, line: 111, baseType: !78, size: 32, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !18, file: !17, line: 112, baseType: !166, size: 320, offset: 3328)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !232)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !170, !31, !115}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !172, line: 108, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !172, line: 99, size: 640, elements: !174)
!174 = !{!175, !176, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !173, file: !172, line: 100, baseType: !78, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 101, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !172, line: 82, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !172, line: 83, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !188, !189, !190, !194, !201, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !179, file: !172, line: 84, baseType: !105, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !179, file: !172, line: 85, baseType: !105, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !172, line: 86, baseType: !115, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !179, file: !172, line: 87, baseType: !97, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !172, line: 88, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !179, file: !172, line: 89, baseType: !57, size: 8, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !179, file: !172, line: 90, baseType: !105, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !179, file: !172, line: 91, baseType: !191, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !179, file: !172, line: 92, baseType: !195, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !197, size: 32, elements: !198)
!197 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !172, line: 93, baseType: !202, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !172, line: 81, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 81, baseType: !197, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!209 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!210 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!211 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!212 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!213 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!215 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!216 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !172, line: 94, baseType: !177, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !179, file: !172, line: 95, baseType: !105, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !172, line: 96, baseType: !115, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !173, file: !172, line: 103, baseType: !105, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !173, file: !172, line: 104, baseType: !34, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !173, file: !172, line: 106, baseType: !31, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !173, file: !172, line: 107, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !172, line: 10, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !172, line: 10, flags: DIFlagFwdDecl)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !18, file: !17, line: 113, baseType: !235, size: 320, offset: 3648)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!6, !31, !115}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !18, file: !17, line: 114, baseType: !240, size: 320, offset: 3968)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !232)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !18, file: !17, line: 115, baseType: !195, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !18, file: !17, line: 120, baseType: !229, size: 64, offset: 4352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !18, file: !17, line: 121, baseType: !195, size: 32, offset: 4416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !12, file: !13, line: 203, baseType: !245, size: 3456, offset: 4480)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 3456, elements: !74)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !13, line: 30, size: 3456, elements: !247)
!247 = !{!248, !252, !253, !258, !262, !266, !267, !268, !277, !278, !279, !291, !292, !300, !314, !323, !327, !331, !332, !337, !338, !342, !343, !347, !348, !405, !409, !425, !426, !427, !428, !429, !430, !431, !435, !441, !445, !450, !454, !465, !469, !479, !486, !490, !491, !497, !508, !512, !522, !526, !534, !538, !546, !547}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !246, file: !13, line: 31, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!6, !9, !42}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !246, file: !13, line: 32, baseType: !249, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !246, file: !13, line: 33, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!6, !9, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !246, file: !13, line: 34, baseType: !259, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!6, !170, !9}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !246, file: !13, line: 35, baseType: !263, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!6, !9}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !246, file: !13, line: 36, baseType: !263, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !246, file: !13, line: 37, baseType: !263, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !246, file: !13, line: 38, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!6, !9, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !274, line: 21, baseType: !275)
!274 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !274, line: 21, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !246, file: !13, line: 39, baseType: !269, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !246, file: !13, line: 40, baseType: !263, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !246, file: !13, line: 41, baseType: !280, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!6, !9, !124, !283, !285}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !288, line: 11, baseType: !289)
!288 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !288, line: 11, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !246, file: !13, line: 42, baseType: !254, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !246, file: !13, line: 43, baseType: !293, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!6, !9, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !10, line: 165, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !10, line: 165, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !246, file: !13, line: 45, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!6, !9, !304, !310}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !305, line: 213, baseType: !306)
!305 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 213, baseType: !197, size: 32, elements: !307)
!307 = !{!308, !309}
!308 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !288, line: 51, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !288, line: 51, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !246, file: !13, line: 46, baseType: !315, size: 64, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!6, !9, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !320, line: 16, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !320, line: 16, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !246, file: !13, line: 47, baseType: !324, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!6, !9, !9, !318, !272}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !246, file: !13, line: 48, baseType: !328, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!6, !9, !9, !318}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !246, file: !13, line: 49, baseType: !328, size: 64, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !246, file: !13, line: 50, baseType: !333, size: 64, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!6, !9, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !246, file: !13, line: 51, baseType: !328, size: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !246, file: !13, line: 53, baseType: !339, size: 64, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!6, !9, !34, !257}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !246, file: !13, line: 54, baseType: !339, size: 64, offset: 1344)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !246, file: !13, line: 55, baseType: !344, size: 64, offset: 1408)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!6, !9, !78, !257}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !246, file: !13, line: 56, baseType: !344, size: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !246, file: !13, line: 57, baseType: !349, size: 64, offset: 1536)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!6, !9, !352, !257}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !353, line: 12, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !356, line: 16, size: 5120, elements: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmlabelimpl.h", directory: "/home/users/ndemeye/xSDK")
!357 = !{!358, !359, !361, !362, !363, !364, !365, !366, !367, !385, !400, !401, !402}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !355, file: !356, line: 17, baseType: !16, size: 4480)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !355, file: !356, line: 17, baseType: !360, size: 32, offset: 4480)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !74)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "numStrata", scope: !355, file: !356, line: 18, baseType: !78, size: 32, offset: 4512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "defaultValue", scope: !355, file: !356, line: 19, baseType: !78, size: 32, offset: 4544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "stratumValues", scope: !355, file: !356, line: 20, baseType: !124, size: 64, offset: 4608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "validIS", scope: !355, file: !356, line: 22, baseType: !336, size: 64, offset: 4672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stratumSizes", scope: !355, file: !356, line: 23, baseType: !124, size: 64, offset: 4736)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !355, file: !356, line: 24, baseType: !286, size: 64, offset: 4800)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hmap", scope: !355, file: !356, line: 26, baseType: !368, size: 64, offset: 4864)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapI", file: !369, line: 6, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashmapi.h", directory: "/home/users/ndemeye/xSDK")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapI_t", file: !369, line: 6, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapI_s", file: !369, line: 6, size: 320, elements: !373)
!373 = !{!374, !378, !379, !380, !381, !383, !384}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !372, file: !369, line: 6, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !376, line: 166, baseType: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !376, line: 139, baseType: !197)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !372, file: !369, line: 6, baseType: !375, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !372, file: !369, line: 6, baseType: !375, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !372, file: !369, line: 6, baseType: !375, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !369, line: 6, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !372, file: !369, line: 6, baseType: !124, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !372, file: !369, line: 6, baseType: !124, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !355, file: !356, line: 27, baseType: !386, size: 64, offset: 4928)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHSetI", file: !388, line: 6, baseType: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/hashseti.h", directory: "/home/users/ndemeye/xSDK")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HSetI_t", file: !388, line: 6, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HSetI_s", file: !388, line: 6, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !391, file: !388, line: 6, baseType: !375, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !391, file: !388, line: 6, baseType: !375, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !391, file: !388, line: 6, baseType: !375, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !391, file: !388, line: 6, baseType: !375, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !388, line: 6, baseType: !382, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !391, file: !388, line: 6, baseType: !124, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !391, file: !388, line: 6, baseType: !105, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !355, file: !356, line: 29, baseType: !78, size: 32, offset: 4992)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !355, file: !356, line: 29, baseType: !78, size: 32, offset: 5024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bt", scope: !355, file: !356, line: 30, baseType: !403, size: 64, offset: 5056)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBT", file: !404, line: 29, baseType: !105)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscbt.h", directory: "/home/users/ndemeye/xSDK")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !246, file: !13, line: 58, baseType: !406, size: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!6, !9, !273, !352, !257}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !246, file: !13, line: 60, baseType: !410, size: 64, offset: 1664)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!6, !9, !273, !413, !273}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !7, line: 580, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 580, baseType: !197, size: 32, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424}
!416 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!417 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!420 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!421 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!422 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!423 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!424 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !246, file: !13, line: 61, baseType: !410, size: 64, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !246, file: !13, line: 62, baseType: !410, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !246, file: !13, line: 63, baseType: !410, size: 64, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !246, file: !13, line: 64, baseType: !410, size: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !246, file: !13, line: 65, baseType: !410, size: 64, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !246, file: !13, line: 67, baseType: !263, size: 64, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !246, file: !13, line: 69, baseType: !432, size: 64, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!6, !9, !273, !273}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !246, file: !13, line: 71, baseType: !436, size: 64, offset: 2176)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!6, !9, !78, !439, !286, !257}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !246, file: !13, line: 72, baseType: !442, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!6, !257, !78, !285, !257}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !246, file: !13, line: 73, baseType: !446, size: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!6, !9, !124, !283, !285, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !246, file: !13, line: 74, baseType: !451, size: 64, offset: 2368)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!6, !9, !124, !283, !285, !285, !449}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !246, file: !13, line: 75, baseType: !455, size: 64, offset: 2432)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!6, !9, !78, !257, !458, !458, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !461, line: 59, baseType: !462)
!461 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !461, line: 15, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !461, line: 15, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !246, file: !13, line: 77, baseType: !466, size: 64, offset: 2496)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!6, !9, !78, !124, !124}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !246, file: !13, line: 78, baseType: !470, size: 64, offset: 2560)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!6, !9, !273, !473, !462}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !10, line: 74, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 74, baseType: !197, size: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!477 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!478 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !246, file: !13, line: 79, baseType: !480, size: 64, offset: 2624)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!6, !9, !124, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !246, file: !13, line: 80, baseType: !487, size: 64, offset: 2688)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!6, !9, !132, !132}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !246, file: !13, line: 81, baseType: !487, size: 64, offset: 2752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !246, file: !13, line: 82, baseType: !492, size: 64, offset: 2816)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!6, !9, !273, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !246, file: !13, line: 84, baseType: !498, size: 64, offset: 2880)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!6, !9, !133, !501, !507, !413, !273}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!6, !78, !133, !505, !78, !141, !115}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !246, file: !13, line: 85, baseType: !509, size: 64, offset: 2944)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!6, !9, !133, !352, !78, !439, !78, !439, !501, !507, !413, !273}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !246, file: !13, line: 86, baseType: !513, size: 64, offset: 3008)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!6, !9, !133, !273, !516, !413, !273}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !78, !78, !78, !439, !439, !520, !520, !520, !439, !439, !520, !520, !520, !133, !505, !78, !520, !141}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !246, file: !13, line: 87, baseType: !523, size: 64, offset: 3072)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!6, !9, !133, !352, !78, !439, !78, !439, !273, !516, !413, !273}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !246, file: !13, line: 88, baseType: !527, size: 64, offset: 3136)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!6, !9, !133, !352, !78, !439, !78, !439, !273, !530, !413, !273}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !78, !78, !78, !439, !439, !520, !520, !520, !439, !439, !520, !520, !520, !133, !505, !505, !78, !520, !141}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !246, file: !13, line: 89, baseType: !535, size: 64, offset: 3200)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!6, !9, !133, !501, !507, !273, !132}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !246, file: !13, line: 90, baseType: !539, size: 64, offset: 3264)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!6, !9, !133, !542, !507, !273, !505, !132}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!6, !78, !133, !505, !505, !78, !141, !115}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !246, file: !13, line: 91, baseType: !535, size: 64, offset: 3328)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !246, file: !13, line: 93, baseType: !548, size: 64, offset: 3392)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!6, !9, !9, !336, !336}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !12, file: !13, line: 204, baseType: !552, size: 6400, offset: 7936)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 6400, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 100)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !12, file: !13, line: 204, baseType: !552, size: 6400, offset: 14336)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !12, file: !13, line: 205, baseType: !552, size: 6400, offset: 20736)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !12, file: !13, line: 205, baseType: !552, size: 6400, offset: 27136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !12, file: !13, line: 206, baseType: !559, size: 64, offset: 33536)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !13, line: 141, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !13, line: 142, size: 256, elements: !562)
!562 = !{!563, !564, !565, !571}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !561, file: !13, line: 143, baseType: !273, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !561, file: !13, line: 144, baseType: !105, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !561, file: !13, line: 145, baseType: !566, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !13, line: 140, baseType: !567)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 140, baseType: !197, size: 32, elements: !568)
!568 = !{!569, !570}
!569 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!570 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !561, file: !13, line: 146, baseType: !559, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !12, file: !13, line: 207, baseType: !559, size: 64, offset: 33600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !12, file: !13, line: 208, baseType: !574, size: 64, offset: 33664)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !13, line: 149, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !13, line: 150, size: 192, elements: !577)
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !576, file: !13, line: 151, baseType: !191, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !576, file: !13, line: 152, baseType: !115, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !576, file: !13, line: 153, baseType: !574, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !12, file: !13, line: 208, baseType: !574, size: 64, offset: 33728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !12, file: !13, line: 209, baseType: !583, size: 64, offset: 33792)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !13, line: 163, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !13, line: 158, size: 192, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !585, file: !13, line: 159, baseType: !352, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !585, file: !13, line: 160, baseType: !195, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !13, line: 161, baseType: !584, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !12, file: !13, line: 210, baseType: !352, size: 64, offset: 33856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !12, file: !13, line: 211, baseType: !352, size: 64, offset: 33920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !12, file: !13, line: 212, baseType: !115, size: 64, offset: 33984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !12, file: !13, line: 213, baseType: !594, size: 64, offset: 34048)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!6, !507}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !12, file: !13, line: 214, baseType: !304, size: 32, offset: 34112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !12, file: !13, line: 215, baseType: !599, size: 64, offset: 34176)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !320, line: 1378, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !320, line: 1378, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !12, file: !13, line: 216, baseType: !603, size: 64, offset: 34240)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !274, line: 83, baseType: !55)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !12, file: !13, line: 217, baseType: !605, size: 64, offset: 34304)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !320, line: 25, baseType: !55)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !12, file: !13, line: 218, baseType: !78, size: 32, offset: 34368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !12, file: !13, line: 219, baseType: !608, size: 64, offset: 34432)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !288, line: 30, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !288, line: 30, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !12, file: !13, line: 220, baseType: !195, size: 32, offset: 34496)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !12, file: !13, line: 221, baseType: !195, size: 32, offset: 34528)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !12, file: !13, line: 222, baseType: !78, size: 32, offset: 34560)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !12, file: !13, line: 222, baseType: !78, size: 32, offset: 34592)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !12, file: !13, line: 223, baseType: !195, size: 32, offset: 34624)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !12, file: !13, line: 224, baseType: !195, size: 32, offset: 34656)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 225, baseType: !115, size: 64, offset: 34688)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !12, file: !13, line: 227, baseType: !9, size: 64, offset: 34752)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !12, file: !13, line: 228, baseType: !9, size: 64, offset: 34816)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !12, file: !13, line: 229, baseType: !621, size: 64, offset: 34880)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !13, line: 100, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !13, line: 101, size: 256, elements: !624)
!624 = !{!625, !629, !633, !634}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !623, file: !13, line: 102, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!6, !9, !9, !115}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !623, file: !13, line: 103, baseType: !630, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!6, !9, !319, !273, !319, !9, !115}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !623, file: !13, line: 104, baseType: !115, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !13, line: 105, baseType: !621, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !12, file: !13, line: 230, baseType: !636, size: 64, offset: 34944)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !13, line: 108, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !13, line: 109, size: 256, elements: !639)
!639 = !{!640, !641, !645, !646}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !638, file: !13, line: 110, baseType: !626, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !638, file: !13, line: 111, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!6, !9, !319, !9, !115}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !638, file: !13, line: 112, baseType: !115, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !13, line: 113, baseType: !636, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !12, file: !13, line: 231, baseType: !648, size: 64, offset: 35008)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !13, line: 116, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !13, line: 117, size: 256, elements: !651)
!651 = !{!652, !653, !657, !658}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !650, file: !13, line: 118, baseType: !626, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !650, file: !13, line: 119, baseType: !654, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!6, !9, !460, !460, !9, !115}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !650, file: !13, line: 120, baseType: !115, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !13, line: 121, baseType: !648, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !12, file: !13, line: 232, baseType: !660, size: 64, offset: 35072)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !13, line: 124, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !13, line: 125, size: 256, elements: !663)
!663 = !{!664, !668, !669, !670}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !662, file: !13, line: 126, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!6, !9, !273, !413, !273, !115}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !662, file: !13, line: 127, baseType: !665, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !662, file: !13, line: 128, baseType: !115, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !662, file: !13, line: 129, baseType: !660, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !12, file: !13, line: 233, baseType: !672, size: 64, offset: 35136)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !13, line: 132, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !13, line: 133, size: 256, elements: !675)
!675 = !{!676, !677, !678, !679}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !674, file: !13, line: 134, baseType: !665, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !674, file: !13, line: 135, baseType: !665, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !674, file: !13, line: 136, baseType: !115, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !13, line: 137, baseType: !672, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !12, file: !13, line: 235, baseType: !78, size: 32, offset: 35200)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !12, file: !13, line: 237, baseType: !682, size: 64, offset: 35264)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !13, line: 27, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !13, line: 27, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !13, line: 27, size: 320, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !699}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !685, file: !13, line: 27, baseType: !375, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !685, file: !13, line: 27, baseType: !375, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !685, file: !13, line: 27, baseType: !375, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !685, file: !13, line: 27, baseType: !375, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !685, file: !13, line: 27, baseType: !382, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !685, file: !13, line: 27, baseType: !693, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !13, line: 21, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !13, line: 17, size: 128, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !695, file: !13, line: 19, baseType: !352, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !695, file: !13, line: 20, baseType: !78, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !685, file: !13, line: 27, baseType: !272, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !12, file: !13, line: 239, baseType: !462, size: 64, offset: 35328)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !12, file: !13, line: 240, baseType: !462, size: 64, offset: 35392)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !12, file: !13, line: 241, baseType: !462, size: 64, offset: 35456)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !12, file: !13, line: 242, baseType: !462, size: 64, offset: 35520)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !12, file: !13, line: 243, baseType: !195, size: 32, offset: 35584)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !12, file: !13, line: 245, baseType: !706, size: 64, offset: 35616)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !155)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !12, file: !13, line: 246, baseType: !708, size: 64, offset: 35712)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !709, line: 18, baseType: !710)
!709 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !712, line: 29, size: 5760, elements: !713)
!712 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !732, !733, !734, !735, !760, !761, !762}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !711, file: !712, line: 30, baseType: !16, size: 4480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !711, file: !712, line: 30, baseType: !360, size: 32, offset: 4480)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !711, file: !712, line: 31, baseType: !78, size: 32, offset: 4512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !711, file: !712, line: 31, baseType: !78, size: 32, offset: 4544)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !711, file: !712, line: 32, baseType: !287, size: 64, offset: 4608)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !711, file: !712, line: 33, baseType: !195, size: 32, offset: 4672)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !711, file: !712, line: 34, baseType: !195, size: 32, offset: 4704)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !711, file: !712, line: 35, baseType: !124, size: 64, offset: 4736)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !711, file: !712, line: 36, baseType: !124, size: 64, offset: 4800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !711, file: !712, line: 37, baseType: !78, size: 32, offset: 4864)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !711, file: !712, line: 38, baseType: !708, size: 64, offset: 4928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !711, file: !712, line: 39, baseType: !124, size: 64, offset: 4992)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !711, file: !712, line: 40, baseType: !195, size: 32, offset: 5056)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !711, file: !712, line: 42, baseType: !78, size: 32, offset: 5088)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !711, file: !712, line: 43, baseType: !284, size: 64, offset: 5120)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !711, file: !712, line: 44, baseType: !124, size: 64, offset: 5184)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !711, file: !712, line: 45, baseType: !731, size: 64, offset: 5248)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !711, file: !712, line: 46, baseType: !195, size: 32, offset: 5312)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !711, file: !712, line: 47, baseType: !283, size: 64, offset: 5376)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !711, file: !712, line: 49, baseType: !31, size: 64, offset: 5440)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !711, file: !712, line: 50, baseType: !736, size: 64, offset: 5504)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !712, line: 27, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !712, line: 27, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !712, line: 27, size: 320, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !753}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !739, file: !712, line: 27, baseType: !375, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !739, file: !712, line: 27, baseType: !375, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !739, file: !712, line: 27, baseType: !375, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !739, file: !712, line: 27, baseType: !375, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !739, file: !712, line: 27, baseType: !382, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !739, file: !712, line: 27, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !712, line: 10, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !712, line: 8, size: 64, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !749, file: !712, line: 9, baseType: !78, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !712, line: 9, baseType: !78, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !739, file: !712, line: 27, baseType: !754, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !712, line: 14, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 12, size: 128, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !756, file: !712, line: 13, baseType: !124, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !756, file: !712, line: 13, baseType: !124, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !711, file: !712, line: 51, baseType: !708, size: 64, offset: 5568)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !711, file: !712, line: 52, baseType: !287, size: 64, offset: 5632)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !711, file: !712, line: 53, baseType: !763, size: 64, offset: 5696)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !709, line: 33, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !712, line: 72, size: 4864, elements: !766)
!766 = !{!767, !768, !786, !787, !796}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !765, file: !712, line: 73, baseType: !16, size: 4480)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !765, file: !712, line: 73, baseType: !769, size: 192, offset: 4480)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 192, elements: !74)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !712, line: 56, size: 192, elements: !771)
!771 = !{!772, !778, !782}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !770, file: !712, line: 57, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!6, !763, !708, !78, !439, !776, !777}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !770, file: !712, line: 58, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!6, !763}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !770, file: !712, line: 59, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!6, !763, !42}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !712, line: 74, baseType: !115, size: 64, offset: 4672)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !765, file: !712, line: 75, baseType: !788, size: 64, offset: 4736)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !712, line: 62, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !712, line: 64, size: 256, elements: !791)
!791 = !{!792, !793, !794, !795}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !712, line: 66, baseType: !788, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !790, file: !712, line: 67, baseType: !776, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !790, file: !712, line: 68, baseType: !777, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !790, file: !712, line: 69, baseType: !78, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !765, file: !712, line: 76, baseType: !788, size: 64, offset: 4800)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !12, file: !13, line: 247, baseType: !708, size: 64, offset: 35776)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !12, file: !13, line: 248, baseType: !799, size: 64, offset: 35840)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !288, line: 60, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !305, line: 240, size: 640, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !801, file: !305, line: 241, baseType: !34, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !801, file: !305, line: 242, baseType: !95, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !801, file: !305, line: 243, baseType: !78, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !801, file: !305, line: 243, baseType: !78, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !801, file: !305, line: 244, baseType: !78, size: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !801, file: !305, line: 244, baseType: !78, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !801, file: !305, line: 245, baseType: !124, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !801, file: !305, line: 246, baseType: !195, size: 32, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !801, file: !305, line: 247, baseType: !78, size: 32, offset: 352)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !801, file: !305, line: 251, baseType: !78, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !801, file: !305, line: 252, baseType: !608, size: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !801, file: !305, line: 253, baseType: !195, size: 32, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !801, file: !305, line: 254, baseType: !78, size: 32, offset: 544)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !801, file: !305, line: 254, baseType: !78, size: 32, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !801, file: !305, line: 255, baseType: !78, size: 32, offset: 608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !12, file: !13, line: 250, baseType: !708, size: 64, offset: 35904)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !12, file: !13, line: 251, baseType: !319, size: 64, offset: 35968)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !12, file: !13, line: 253, baseType: !9, size: 64, offset: 36032)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !12, file: !13, line: 254, baseType: !273, size: 64, offset: 36096)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !12, file: !13, line: 255, baseType: !115, size: 64, offset: 36160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !12, file: !13, line: 256, baseType: !824, size: 64, offset: 36224)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!6, !9, !115}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !12, file: !13, line: 257, baseType: !824, size: 64, offset: 36288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !12, file: !13, line: 258, baseType: !829, size: 64, offset: 36352)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!6, !9, !505, !195, !777, !115}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !12, file: !13, line: 260, baseType: !78, size: 32, offset: 36416)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !12, file: !13, line: 261, baseType: !9, size: 64, offset: 36480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !12, file: !13, line: 262, baseType: !273, size: 64, offset: 36544)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !12, file: !13, line: 263, baseType: !273, size: 64, offset: 36608)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !12, file: !13, line: 264, baseType: !195, size: 32, offset: 36672)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !12, file: !13, line: 265, baseType: !297, size: 64, offset: 36736)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !12, file: !13, line: 266, baseType: !132, size: 64, offset: 36800)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !12, file: !13, line: 266, baseType: !132, size: 64, offset: 36864)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !12, file: !13, line: 267, baseType: !841, size: 64, offset: 36928)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !10, line: 42, baseType: !843)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 42, baseType: !197, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849}
!845 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!846 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!847 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!848 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!849 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !12, file: !13, line: 269, baseType: !851, size: 640, offset: 36992)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 640, elements: !860)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !13, line: 15, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!6, !9, !78, !78, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !320, line: 1723, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !320, line: 1723, flags: DIFlagFwdDecl)
!860 = !{!861}
!861 = !DISubrange(count: 10)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !12, file: !13, line: 270, baseType: !851, size: 640, offset: 37632)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !12, file: !13, line: 272, baseType: !78, size: 32, offset: 38272)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !12, file: !13, line: 273, baseType: !865, size: 64, offset: 38336)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !13, line: 178, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !13, line: 173, size: 256, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !867, file: !13, line: 174, baseType: !31, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !867, file: !13, line: 175, baseType: !352, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !867, file: !13, line: 176, baseType: !706, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !867, file: !13, line: 177, baseType: !195, size: 32, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !12, file: !13, line: 274, baseType: !874, size: 64, offset: 38400)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !13, line: 165, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !13, line: 167, size: 192, elements: !877)
!877 = !{!878, !967, !968}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !876, file: !13, line: 168, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !880, line: 11, baseType: !881)
!880 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !880, line: 13, size: 832, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !950, !960, !961, !962, !963, !964, !965, !966}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !880, line: 14, baseType: !55, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !882, file: !880, line: 15, baseType: !352, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !882, file: !880, line: 16, baseType: !55, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !882, file: !880, line: 17, baseType: !78, size: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !882, file: !880, line: 18, baseType: !124, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !882, file: !880, line: 19, baseType: !890, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !891, line: 22, baseType: !892)
!891 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !880, line: 81, size: 4992, elements: !894)
!894 = !{!895, !896, !910, !911, !912, !921}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !893, file: !880, line: 82, baseType: !16, size: 4480)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !893, file: !880, line: 82, baseType: !897, size: 256, offset: 4480)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, elements: !74)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !880, line: 74, size: 256, elements: !899)
!899 = !{!900, !904, !905, !909}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !898, file: !880, line: 75, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!6, !890}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !898, file: !880, line: 76, baseType: !901, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !898, file: !880, line: 77, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!6, !890, !42}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !898, file: !880, line: 78, baseType: !901, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !893, file: !880, line: 83, baseType: !115, size: 64, offset: 4736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !893, file: !880, line: 85, baseType: !78, size: 32, offset: 4800)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !893, file: !880, line: 86, baseType: !913, size: 64, offset: 4864)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !880, line: 41, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 36, size: 256, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !915, file: !880, line: 37, baseType: !191, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !915, file: !880, line: 38, baseType: !191, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !915, file: !880, line: 39, baseType: !191, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !915, file: !880, line: 40, baseType: !105, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !893, file: !880, line: 87, baseType: !922, size: 64, offset: 4928)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !880, line: 54, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !880, line: 54, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !880, line: 54, size: 320, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !942}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !926, file: !880, line: 54, baseType: !375, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !926, file: !880, line: 54, baseType: !375, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !926, file: !880, line: 54, baseType: !375, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !926, file: !880, line: 54, baseType: !375, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !880, line: 54, baseType: !382, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !926, file: !880, line: 54, baseType: !934, size: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !891, line: 41, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !891, line: 35, size: 192, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !936, file: !891, line: 37, baseType: !352, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !936, file: !891, line: 38, baseType: !78, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !936, file: !891, line: 39, baseType: !78, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !936, file: !891, line: 40, baseType: !78, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !926, file: !880, line: 54, baseType: !943, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !880, line: 34, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 30, size: 96, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !945, file: !880, line: 31, baseType: !78, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !945, file: !880, line: 32, baseType: !78, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !945, file: !880, line: 33, baseType: !78, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !880, line: 20, baseType: !951, size: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !10, line: 60, baseType: !952)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 60, baseType: !197, size: 32, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959}
!954 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!955 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!956 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!957 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!958 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!959 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !882, file: !880, line: 21, baseType: !78, size: 32, offset: 416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !882, file: !880, line: 22, baseType: !78, size: 32, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !882, file: !880, line: 23, baseType: !124, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !882, file: !880, line: 24, baseType: !66, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !882, file: !880, line: 25, baseType: !66, size: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !882, file: !880, line: 26, baseType: !115, size: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !880, line: 27, baseType: !879, size: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !876, file: !13, line: 169, baseType: !352, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !13, line: 170, baseType: !874, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !12, file: !13, line: 275, baseType: !78, size: 32, offset: 38464)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !12, file: !13, line: 276, baseType: !971, size: 64, offset: 38528)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !13, line: 184, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !13, line: 180, size: 192, elements: !974)
!974 = !{!975, !1056, !1057}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !973, file: !13, line: 181, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !891, line: 13, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !880, line: 98, size: 7232, elements: !979)
!979 = !{!980, !981, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !978, file: !880, line: 99, baseType: !16, size: 4480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !978, file: !880, line: 99, baseType: !982, size: 256, offset: 4480)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 256, elements: !74)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !880, line: 91, size: 256, elements: !984)
!984 = !{!985, !989, !990, !994}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !983, file: !880, line: 92, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!6, !976}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !983, file: !880, line: 93, baseType: !986, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !983, file: !880, line: 94, baseType: !991, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!6, !976, !42}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !983, file: !880, line: 95, baseType: !986, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !978, file: !880, line: 100, baseType: !115, size: 64, offset: 4736)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !978, file: !880, line: 101, baseType: !997, size: 64, offset: 4800)
