; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/swarm/swarmpic_sort.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/swarm/swarmpic_sort.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!41 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 74, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 140, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56}
!55 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 42, baseType: !5, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 60, baseType: !5, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71}
!66 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 17, baseType: !5, size: 32, elements: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmswarm.h", directory: "/home/users/ndemeye/xSDK")
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "DMSWARM_BASIC", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "DMSWARM_PIC", value: 1, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 22, baseType: !5, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "DMSWARM_MIGRATE_BASIC", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "DMSWARM_MIGRATE_DMCELLNSCATTER", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "DMSWARM_MIGRATE_DMCELLEXACT", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "DMSWARM_MIGRATE_USER", value: 3, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 29, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "DMSWARM_COLLECT_BASIC", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "DMSWARM_COLLECT_DMDABOUNDINGBOX", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "DMSWARM_COLLECT_GENERAL", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "DMSWARM_COLLECT_USER", value: 3, isUnsigned: true)
!109 = !{!110, !119, !122, !125, !129, !130, !326, !327, !1113, !211}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwarmPoint", file: !112, line: 56, baseType: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmswarmimpl.h", directory: "/home/users/ndemeye/xSDK")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 53, size: 64, elements: !114)
!114 = !{!115, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "point_index", scope: !113, file: !112, line: 54, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !117)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cell_index", scope: !113, file: !112, line: 55, baseType: !116, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 46, baseType: !124)
!123 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!124 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !126, line: 330, baseType: !127)
!126 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !126, line: 330, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !133, line: 73, size: 4480, elements: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!134 = !{!135, !137, !183, !184, !185, !188, !189, !190, !191, !199, !200, !202, !206, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !223, !224, !225, !227, !228, !230, !232, !233, !234, !235, !236, !239, !241, !242, !243, !244, !245, !248, !250, !251, !252, !262, !264, !265, !269, !270, !316, !321, !323, !324, !325}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !132, file: !133, line: 74, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !117)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !132, file: !133, line: 75, baseType: !138, size: 448, offset: 64)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 448, elements: !181)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !133, line: 53, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 45, size: 448, elements: !141)
!141 = !{!142, !148, !156, !161, !165, !169, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !140, file: !133, line: 46, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !130, !147}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !117)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !140, file: !133, line: 47, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!146, !130, !152}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !153, line: 16, baseType: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !153, line: 16, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !140, file: !133, line: 48, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!146, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !140, file: !133, line: 49, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!146, !130, !119, !130}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !140, file: !133, line: 50, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!146, !130, !119, !160}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !140, file: !133, line: 51, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!146, !130, !119, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !140, file: !133, line: 52, baseType: !177, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!146, !130, !119, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!181 = !{!182}
!182 = !DISubrange(count: 1)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !132, file: !133, line: 76, baseType: !125, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !133, line: 77, baseType: !116, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !132, file: !133, line: 78, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !187)
!187 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !132, file: !133, line: 78, baseType: !186, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !132, file: !133, line: 78, baseType: !186, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !132, file: !133, line: 78, baseType: !186, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !133, line: 79, baseType: !192, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !195, line: 27, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !197, line: 43, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !132, file: !133, line: 80, baseType: !116, size: 32, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !132, file: !133, line: 81, baseType: !201, size: 32, offset: 992)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !117)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !132, file: !133, line: 82, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !132, file: !133, line: 83, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !132, file: !133, line: 84, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !132, file: !133, line: 85, baseType: !211, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !132, file: !133, line: 86, baseType: !211, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !132, file: !133, line: 87, baseType: !211, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !132, file: !133, line: 88, baseType: !130, size: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !132, file: !133, line: 89, baseType: !192, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !133, line: 90, baseType: !211, size: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !132, file: !133, line: 91, baseType: !211, size: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !132, file: !133, line: 92, baseType: !116, size: 32, offset: 1664)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !132, file: !133, line: 93, baseType: !129, size: 64, offset: 1728)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !132, file: !133, line: 94, baseType: !222, size: 64, offset: 1792)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !193)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !132, file: !133, line: 95, baseType: !116, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !132, file: !133, line: 95, baseType: !116, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !132, file: !133, line: 96, baseType: !226, size: 64, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !132, file: !133, line: 96, baseType: !226, size: 64, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !132, file: !133, line: 97, baseType: !229, size: 64, offset: 2048)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !132, file: !133, line: 97, baseType: !231, size: 64, offset: 2112)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !132, file: !133, line: 98, baseType: !116, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !132, file: !133, line: 98, baseType: !116, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !132, file: !133, line: 99, baseType: !226, size: 64, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !132, file: !133, line: 99, baseType: !226, size: 64, offset: 2304)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !132, file: !133, line: 100, baseType: !237, size: 64, offset: 2368)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !187)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !132, file: !133, line: 100, baseType: !240, size: 64, offset: 2432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !132, file: !133, line: 101, baseType: !116, size: 32, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !132, file: !133, line: 101, baseType: !116, size: 32, offset: 2528)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !132, file: !133, line: 102, baseType: !226, size: 64, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !132, file: !133, line: 102, baseType: !226, size: 64, offset: 2624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !132, file: !133, line: 103, baseType: !246, size: 64, offset: 2688)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !132, file: !133, line: 103, baseType: !249, size: 64, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !132, file: !133, line: 104, baseType: !180, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !132, file: !133, line: 105, baseType: !116, size: 32, offset: 2880)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !132, file: !133, line: 106, baseType: !253, size: 128, offset: 2944)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !260)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !133, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 61, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !133, line: 62, baseType: !173, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !256, file: !133, line: 63, baseType: !129, size: 64, offset: 64)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !132, file: !133, line: 107, baseType: !263, size: 64, offset: 3072)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !132, file: !133, line: 108, baseType: !129, size: 64, offset: 3136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !132, file: !133, line: 109, baseType: !266, size: 64, offset: 3200)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!146, !129}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !132, file: !133, line: 111, baseType: !116, size: 32, offset: 3264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !132, file: !133, line: 112, baseType: !271, size: 320, offset: 3328)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !314)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!146, !275, !130, !129}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !16, line: 108, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !16, line: 99, size: 640, elements: !278)
!278 = !{!279, !280, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !16, line: 100, baseType: !116, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !16, line: 101, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !16, line: 82, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !16, line: 83, size: 768, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !295, !297, !299, !300, !301}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !16, line: 84, baseType: !211, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !283, file: !16, line: 85, baseType: !211, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !16, line: 86, baseType: !129, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !283, file: !16, line: 87, baseType: !203, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !16, line: 88, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !283, file: !16, line: 89, baseType: !121, size: 8, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !283, file: !16, line: 90, baseType: !211, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !283, file: !16, line: 91, baseType: !122, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !16, line: 92, baseType: !296, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !16, line: 93, baseType: !298, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !16, line: 81, baseType: !15)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !16, line: 94, baseType: !281, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !283, file: !16, line: 95, baseType: !211, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !283, file: !16, line: 96, baseType: !129, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !16, line: 102, baseType: !211, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !277, file: !16, line: 102, baseType: !211, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !277, file: !16, line: 103, baseType: !211, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !16, line: 104, baseType: !125, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !277, file: !16, line: 105, baseType: !296, size: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !277, file: !16, line: 105, baseType: !296, size: 32, offset: 416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !277, file: !16, line: 105, baseType: !296, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !277, file: !16, line: 106, baseType: !130, size: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !16, line: 107, baseType: !311, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !16, line: 10, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !16, line: 10, flags: DIFlagFwdDecl)
!314 = !{!315}
!315 = !DISubrange(count: 5)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !132, file: !133, line: 113, baseType: !317, size: 320, offset: 3648)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 320, elements: !314)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!146, !130, !129}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !132, file: !133, line: 114, baseType: !322, size: 320, offset: 3968)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !314)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !132, file: !133, line: 115, baseType: !296, size: 32, offset: 4288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !132, file: !133, line: 120, baseType: !311, size: 64, offset: 4352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !132, file: !133, line: 121, baseType: !296, size: 32, offset: 4416)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Swarm", file: !112, line: 51, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 25, size: 33408, elements: !330)
!330 = !{!331, !335, !336, !337, !338, !342, !343, !344, !345, !346, !348, !350, !352, !1100, !1101, !1102, !1103}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !329, file: !112, line: 26, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmDataBucket", file: !112, line: 22, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSwarmDataBucket", file: !112, line: 22, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !329, file: !112, line: 27, baseType: !116, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "field_registration_initialized", scope: !329, file: !112, line: 28, baseType: !296, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "field_registration_finalized", scope: !329, file: !112, line: 29, baseType: !296, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_name", scope: !329, file: !112, line: 35, baseType: !339, size: 32768, offset: 160)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32768, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 4096)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_set", scope: !329, file: !112, line: 36, baseType: !296, size: 32, offset: 32928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_bs", scope: !329, file: !112, line: 37, baseType: !116, size: 32, offset: 32960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vec_field_nlocal", scope: !329, file: !112, line: 37, baseType: !116, size: 32, offset: 32992)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "issetup", scope: !329, file: !112, line: 39, baseType: !296, size: 32, offset: 33024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swarm_type", scope: !329, file: !112, line: 40, baseType: !347, size: 32, offset: 33056)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmType", file: !93, line: 20, baseType: !92)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "migrate_type", scope: !329, file: !112, line: 41, baseType: !349, size: 32, offset: 33088)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmMigrateType", file: !93, line: 27, baseType: !97)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "collect_type", scope: !329, file: !112, line: 42, baseType: !351, size: 32, offset: 33120)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSwarmCollectType", file: !93, line: 34, baseType: !103)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dmcell", scope: !329, file: !112, line: 44, baseType: !353, size: 64, offset: 33152)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !47, line: 14, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !53, line: 202, size: 40000, elements: !356)
!356 = !{!357, !359, !595, !599, !600, !601, !602, !612, !613, !621, !622, !630, !631, !632, !633, !637, !638, !642, !644, !646, !647, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !675, !687, !699, !711, !720, !721, !744, !745, !746, !747, !748, !749, !751, !842, !843, !863, !864, !865, !866, !867, !868, !872, !873, !877, !878, !879, !880, !881, !882, !883, !884, !885, !888, !900, !901, !902, !911, !999, !1000, !1088, !1089, !1090, !1091, !1093, !1095, !1096, !1097, !1098, !1099}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !355, file: !53, line: 203, baseType: !358, size: 4480)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !133, line: 122, baseType: !132)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !355, file: !53, line: 203, baseType: !360, size: 3456, offset: 4480)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 3456, elements: !181)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !53, line: 30, size: 3456, elements: !362)
!362 = !{!363, !367, !368, !373, !377, !381, !382, !383, !392, !393, !394, !406, !407, !415, !424, !433, !437, !441, !442, !447, !448, !452, !453, !457, !458, !466, !470, !475, !476, !477, !478, !479, !480, !481, !485, !491, !495, !500, !504, !515, !519, !524, !531, !535, !536, !542, !552, !556, !566, !570, !578, !582, !590, !591}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !361, file: !53, line: 31, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!146, !353, !152}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !361, file: !53, line: 32, baseType: !364, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !361, file: !53, line: 33, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!146, !353, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !361, file: !53, line: 34, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!146, !275, !353}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !361, file: !53, line: 35, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!146, !353}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !361, file: !53, line: 36, baseType: !378, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !361, file: !53, line: 37, baseType: !378, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !361, file: !53, line: 38, baseType: !384, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!146, !353, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !389, line: 21, baseType: !390)
!389 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !389, line: 21, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !361, file: !53, line: 39, baseType: !384, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !361, file: !53, line: 40, baseType: !378, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !361, file: !53, line: 41, baseType: !395, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!146, !353, !229, !398, !400}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !403, line: 11, baseType: !404)
!403 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !403, line: 11, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !361, file: !53, line: 42, baseType: !369, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !361, file: !53, line: 43, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!146, !353, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !47, line: 165, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !47, line: 165, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !361, file: !53, line: 45, baseType: !416, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!146, !353, !419, !420}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !31, line: 213, baseType: !30)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !403, line: 51, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !403, line: 51, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !361, file: !53, line: 46, baseType: !425, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!146, !353, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !430, line: 16, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !430, line: 16, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !361, file: !53, line: 47, baseType: !434, size: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!146, !353, !353, !428, !387}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !361, file: !53, line: 48, baseType: !438, size: 64, offset: 1024)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!146, !353, !353, !428}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !361, file: !53, line: 49, baseType: !438, size: 64, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !361, file: !53, line: 50, baseType: !443, size: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!146, !353, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !361, file: !53, line: 51, baseType: !438, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !361, file: !53, line: 53, baseType: !449, size: 64, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!146, !353, !125, !372}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !361, file: !53, line: 54, baseType: !449, size: 64, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !361, file: !53, line: 55, baseType: !454, size: 64, offset: 1408)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!146, !353, !116, !372}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !361, file: !53, line: 56, baseType: !454, size: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !361, file: !53, line: 57, baseType: !459, size: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!146, !353, !462, !372}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !463, line: 12, baseType: !464)
!463 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !463, line: 12, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !361, file: !53, line: 58, baseType: !467, size: 64, offset: 1600)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!146, !353, !388, !462, !372}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !361, file: !53, line: 60, baseType: !471, size: 64, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!146, !353, !388, !474, !388}
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !35)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !361, file: !53, line: 61, baseType: !471, size: 64, offset: 1728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !361, file: !53, line: 62, baseType: !471, size: 64, offset: 1792)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !361, file: !53, line: 63, baseType: !471, size: 64, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !361, file: !53, line: 64, baseType: !471, size: 64, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !361, file: !53, line: 65, baseType: !471, size: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !361, file: !53, line: 67, baseType: !378, size: 64, offset: 2048)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !361, file: !53, line: 69, baseType: !482, size: 64, offset: 2112)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!146, !353, !388, !388}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !361, file: !53, line: 71, baseType: !486, size: 64, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!146, !353, !116, !489, !401, !372}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !361, file: !53, line: 72, baseType: !492, size: 64, offset: 2240)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!146, !372, !116, !400, !372}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !361, file: !53, line: 73, baseType: !496, size: 64, offset: 2304)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!146, !353, !229, !398, !400, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !361, file: !53, line: 74, baseType: !501, size: 64, offset: 2368)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!146, !353, !229, !398, !400, !400, !499}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !361, file: !53, line: 75, baseType: !505, size: 64, offset: 2432)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!146, !353, !116, !372, !508, !508, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !511, line: 59, baseType: !512)
!511 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !511, line: 15, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !511, line: 15, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !361, file: !53, line: 77, baseType: !516, size: 64, offset: 2496)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!146, !353, !116, !229, !229}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !361, file: !53, line: 78, baseType: !520, size: 64, offset: 2560)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!146, !353, !388, !523, !512}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !47, line: 74, baseType: !46)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !361, file: !53, line: 79, baseType: !525, size: 64, offset: 2624)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!146, !353, !229, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !361, file: !53, line: 80, baseType: !532, size: 64, offset: 2688)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!146, !353, !237, !237}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !361, file: !53, line: 81, baseType: !532, size: 64, offset: 2752)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !361, file: !53, line: 82, baseType: !537, size: 64, offset: 2816)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!146, !353, !388, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !361, file: !53, line: 84, baseType: !543, size: 64, offset: 2880)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!146, !353, !238, !546, !326, !474, !388}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!146, !116, !238, !550, !116, !246, !129}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !361, file: !53, line: 85, baseType: !553, size: 64, offset: 2944)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!146, !353, !238, !462, !116, !489, !116, !489, !546, !326, !474, !388}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !361, file: !53, line: 86, baseType: !557, size: 64, offset: 3008)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!146, !353, !238, !388, !560, !474, !388}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !116, !116, !116, !489, !489, !564, !564, !564, !489, !489, !564, !564, !564, !238, !550, !116, !564, !246}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !361, file: !53, line: 87, baseType: !567, size: 64, offset: 3072)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!146, !353, !238, !462, !116, !489, !116, !489, !388, !560, !474, !388}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !361, file: !53, line: 88, baseType: !571, size: 64, offset: 3136)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!146, !353, !238, !462, !116, !489, !116, !489, !388, !574, !474, !388}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !116, !116, !116, !489, !489, !564, !564, !564, !489, !489, !564, !564, !564, !238, !550, !550, !116, !564, !246}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !361, file: !53, line: 89, baseType: !579, size: 64, offset: 3200)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!146, !353, !238, !546, !326, !388, !237}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !361, file: !53, line: 90, baseType: !583, size: 64, offset: 3264)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!146, !353, !238, !586, !326, !388, !550, !237}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!146, !116, !238, !550, !550, !116, !246, !129}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !361, file: !53, line: 91, baseType: !579, size: 64, offset: 3328)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !361, file: !53, line: 93, baseType: !592, size: 64, offset: 3392)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!146, !353, !353, !446, !446}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !355, file: !53, line: 204, baseType: !596, size: 6400, offset: 7936)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 6400, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 100)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !355, file: !53, line: 204, baseType: !596, size: 6400, offset: 14336)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !355, file: !53, line: 205, baseType: !596, size: 6400, offset: 20736)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !355, file: !53, line: 205, baseType: !596, size: 6400, offset: 27136)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !355, file: !53, line: 206, baseType: !603, size: 64, offset: 33536)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !53, line: 141, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !53, line: 142, size: 256, elements: !606)
!606 = !{!607, !608, !609, !611}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !605, file: !53, line: 143, baseType: !388, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !53, line: 144, baseType: !211, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !605, file: !53, line: 145, baseType: !610, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !53, line: 140, baseType: !52)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !53, line: 146, baseType: !603, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !355, file: !53, line: 207, baseType: !603, size: 64, offset: 33600)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !355, file: !53, line: 208, baseType: !614, size: 64, offset: 33664)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !53, line: 149, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !53, line: 150, size: 192, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !616, file: !53, line: 151, baseType: !122, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !616, file: !53, line: 152, baseType: !129, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !53, line: 153, baseType: !614, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !355, file: !53, line: 208, baseType: !614, size: 64, offset: 33728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !355, file: !53, line: 209, baseType: !623, size: 64, offset: 33792)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !53, line: 163, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !53, line: 158, size: 192, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !625, file: !53, line: 159, baseType: !462, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !625, file: !53, line: 160, baseType: !296, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !53, line: 161, baseType: !624, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !355, file: !53, line: 210, baseType: !462, size: 64, offset: 33856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !355, file: !53, line: 211, baseType: !462, size: 64, offset: 33920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !355, file: !53, line: 212, baseType: !129, size: 64, offset: 33984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !355, file: !53, line: 213, baseType: !634, size: 64, offset: 34048)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!146, !326}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !355, file: !53, line: 214, baseType: !419, size: 32, offset: 34112)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !355, file: !53, line: 215, baseType: !639, size: 64, offset: 34176)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !430, line: 1378, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !430, line: 1378, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !355, file: !53, line: 216, baseType: !643, size: 64, offset: 34240)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !389, line: 83, baseType: !119)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !355, file: !53, line: 217, baseType: !645, size: 64, offset: 34304)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !430, line: 25, baseType: !119)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !355, file: !53, line: 218, baseType: !116, size: 32, offset: 34368)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !355, file: !53, line: 219, baseType: !648, size: 64, offset: 34432)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !403, line: 30, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !403, line: 30, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !355, file: !53, line: 220, baseType: !296, size: 32, offset: 34496)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !355, file: !53, line: 221, baseType: !296, size: 32, offset: 34528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !355, file: !53, line: 222, baseType: !116, size: 32, offset: 34560)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !355, file: !53, line: 222, baseType: !116, size: 32, offset: 34592)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !355, file: !53, line: 223, baseType: !296, size: 32, offset: 34624)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !355, file: !53, line: 224, baseType: !296, size: 32, offset: 34656)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !53, line: 225, baseType: !129, size: 64, offset: 34688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !355, file: !53, line: 227, baseType: !353, size: 64, offset: 34752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !355, file: !53, line: 228, baseType: !353, size: 64, offset: 34816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !355, file: !53, line: 229, baseType: !661, size: 64, offset: 34880)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !53, line: 100, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !53, line: 101, size: 256, elements: !664)
!664 = !{!665, !669, !673, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !663, file: !53, line: 102, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!146, !353, !353, !129}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !663, file: !53, line: 103, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!146, !353, !429, !388, !429, !353, !129}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !663, file: !53, line: 104, baseType: !129, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !663, file: !53, line: 105, baseType: !661, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !355, file: !53, line: 230, baseType: !676, size: 64, offset: 34944)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !53, line: 108, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !53, line: 109, size: 256, elements: !679)
!679 = !{!680, !681, !685, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !678, file: !53, line: 110, baseType: !666, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !678, file: !53, line: 111, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!146, !353, !429, !353, !129}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !678, file: !53, line: 112, baseType: !129, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !678, file: !53, line: 113, baseType: !676, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !355, file: !53, line: 231, baseType: !688, size: 64, offset: 35008)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !53, line: 116, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !53, line: 117, size: 256, elements: !691)
!691 = !{!692, !693, !697, !698}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !690, file: !53, line: 118, baseType: !666, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !690, file: !53, line: 119, baseType: !694, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!146, !353, !510, !510, !353, !129}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !690, file: !53, line: 120, baseType: !129, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !53, line: 121, baseType: !688, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !355, file: !53, line: 232, baseType: !700, size: 64, offset: 35072)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !53, line: 124, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !53, line: 125, size: 256, elements: !703)
!703 = !{!704, !708, !709, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !702, file: !53, line: 126, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!146, !353, !388, !474, !388, !129}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !702, file: !53, line: 127, baseType: !705, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !702, file: !53, line: 128, baseType: !129, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !702, file: !53, line: 129, baseType: !700, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !355, file: !53, line: 233, baseType: !712, size: 64, offset: 35136)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !53, line: 132, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !53, line: 133, size: 256, elements: !715)
!715 = !{!716, !717, !718, !719}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !714, file: !53, line: 134, baseType: !705, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !714, file: !53, line: 135, baseType: !705, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !714, file: !53, line: 136, baseType: !129, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !53, line: 137, baseType: !712, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !355, file: !53, line: 235, baseType: !116, size: 32, offset: 35200)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !355, file: !53, line: 237, baseType: !722, size: 64, offset: 35264)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !53, line: 27, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !53, line: 27, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !53, line: 27, size: 320, elements: !726)
!726 = !{!727, !731, !732, !733, !734, !736, !743}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !725, file: !53, line: 27, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !729, line: 166, baseType: !730)
!729 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !729, line: 139, baseType: !5)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !53, line: 27, baseType: !728, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !725, file: !53, line: 27, baseType: !728, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !725, file: !53, line: 27, baseType: !728, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !53, line: 27, baseType: !735, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !725, file: !53, line: 27, baseType: !737, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !53, line: 21, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !53, line: 17, size: 128, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !739, file: !53, line: 19, baseType: !462, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !739, file: !53, line: 20, baseType: !116, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !725, file: !53, line: 27, baseType: !387, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !355, file: !53, line: 239, baseType: !512, size: 64, offset: 35328)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !355, file: !53, line: 240, baseType: !512, size: 64, offset: 35392)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !355, file: !53, line: 241, baseType: !512, size: 64, offset: 35456)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !355, file: !53, line: 242, baseType: !512, size: 64, offset: 35520)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !355, file: !53, line: 243, baseType: !296, size: 32, offset: 35584)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !355, file: !53, line: 245, baseType: !750, size: 64, offset: 35616)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !260)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !355, file: !53, line: 246, baseType: !752, size: 64, offset: 35712)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !753, line: 18, baseType: !754)
!753 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !756, line: 29, size: 5760, elements: !757)
!756 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!757 = !{!758, !759, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !777, !778, !779, !780, !805, !806, !807}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !755, file: !756, line: 30, baseType: !358, size: 4480)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !755, file: !756, line: 30, baseType: !760, size: 32, offset: 4480)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !181)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !755, file: !756, line: 31, baseType: !116, size: 32, offset: 4512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !755, file: !756, line: 31, baseType: !116, size: 32, offset: 4544)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !755, file: !756, line: 32, baseType: !402, size: 64, offset: 4608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !755, file: !756, line: 33, baseType: !296, size: 32, offset: 4672)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !755, file: !756, line: 34, baseType: !296, size: 32, offset: 4704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !755, file: !756, line: 35, baseType: !229, size: 64, offset: 4736)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !755, file: !756, line: 36, baseType: !229, size: 64, offset: 4800)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !755, file: !756, line: 37, baseType: !116, size: 32, offset: 4864)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !755, file: !756, line: 38, baseType: !752, size: 64, offset: 4928)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !755, file: !756, line: 39, baseType: !229, size: 64, offset: 4992)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !755, file: !756, line: 40, baseType: !296, size: 32, offset: 5056)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !755, file: !756, line: 42, baseType: !116, size: 32, offset: 5088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !755, file: !756, line: 43, baseType: !399, size: 64, offset: 5120)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !755, file: !756, line: 44, baseType: !229, size: 64, offset: 5184)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !755, file: !756, line: 45, baseType: !776, size: 64, offset: 5248)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !755, file: !756, line: 46, baseType: !296, size: 32, offset: 5312)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !755, file: !756, line: 47, baseType: !398, size: 64, offset: 5376)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !755, file: !756, line: 49, baseType: !130, size: 64, offset: 5440)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !755, file: !756, line: 50, baseType: !781, size: 64, offset: 5504)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !756, line: 27, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !756, line: 27, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !756, line: 27, size: 320, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !798}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !784, file: !756, line: 27, baseType: !728, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !784, file: !756, line: 27, baseType: !728, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !784, file: !756, line: 27, baseType: !728, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !784, file: !756, line: 27, baseType: !728, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !784, file: !756, line: 27, baseType: !735, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !784, file: !756, line: 27, baseType: !792, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !756, line: 10, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !756, line: 8, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !794, file: !756, line: 9, baseType: !116, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !756, line: 9, baseType: !116, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !784, file: !756, line: 27, baseType: !799, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !756, line: 14, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 12, size: 128, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !801, file: !756, line: 13, baseType: !229, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !801, file: !756, line: 13, baseType: !229, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !755, file: !756, line: 51, baseType: !752, size: 64, offset: 5568)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !755, file: !756, line: 52, baseType: !402, size: 64, offset: 5632)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !755, file: !756, line: 53, baseType: !808, size: 64, offset: 5696)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !753, line: 33, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !756, line: 72, size: 4864, elements: !811)
!811 = !{!812, !813, !831, !832, !841}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !810, file: !756, line: 73, baseType: !358, size: 4480)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !810, file: !756, line: 73, baseType: !814, size: 192, offset: 4480)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 192, elements: !181)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !756, line: 56, size: 192, elements: !816)
!816 = !{!817, !823, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !815, file: !756, line: 57, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!146, !808, !752, !116, !489, !821, !822}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !815, file: !756, line: 58, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!146, !808}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !815, file: !756, line: 59, baseType: !828, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!146, !808, !152}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !810, file: !756, line: 74, baseType: !129, size: 64, offset: 4672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !810, file: !756, line: 75, baseType: !833, size: 64, offset: 4736)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !756, line: 62, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !756, line: 64, size: 256, elements: !836)
!836 = !{!837, !838, !839, !840}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !756, line: 66, baseType: !833, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !835, file: !756, line: 67, baseType: !821, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !835, file: !756, line: 68, baseType: !822, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !835, file: !756, line: 69, baseType: !116, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !810, file: !756, line: 76, baseType: !833, size: 64, offset: 4800)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !355, file: !53, line: 247, baseType: !752, size: 64, offset: 35776)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !355, file: !53, line: 248, baseType: !844, size: 64, offset: 35840)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !403, line: 60, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !31, line: 240, size: 640, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !846, file: !31, line: 241, baseType: !125, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !31, line: 242, baseType: !201, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !846, file: !31, line: 243, baseType: !116, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !846, file: !31, line: 243, baseType: !116, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !846, file: !31, line: 244, baseType: !116, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !846, file: !31, line: 244, baseType: !116, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !846, file: !31, line: 245, baseType: !229, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !846, file: !31, line: 246, baseType: !296, size: 32, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !846, file: !31, line: 247, baseType: !116, size: 32, offset: 352)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !846, file: !31, line: 251, baseType: !116, size: 32, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !846, file: !31, line: 252, baseType: !648, size: 64, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !846, file: !31, line: 253, baseType: !296, size: 32, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !846, file: !31, line: 254, baseType: !116, size: 32, offset: 544)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !846, file: !31, line: 254, baseType: !116, size: 32, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !846, file: !31, line: 255, baseType: !116, size: 32, offset: 608)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !355, file: !53, line: 250, baseType: !752, size: 64, offset: 35904)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !355, file: !53, line: 251, baseType: !429, size: 64, offset: 35968)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !355, file: !53, line: 253, baseType: !353, size: 64, offset: 36032)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !355, file: !53, line: 254, baseType: !388, size: 64, offset: 36096)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !355, file: !53, line: 255, baseType: !129, size: 64, offset: 36160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !355, file: !53, line: 256, baseType: !869, size: 64, offset: 36224)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!146, !353, !129}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !355, file: !53, line: 257, baseType: !869, size: 64, offset: 36288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !355, file: !53, line: 258, baseType: !874, size: 64, offset: 36352)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!146, !353, !550, !296, !822, !129}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !355, file: !53, line: 260, baseType: !116, size: 32, offset: 36416)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !355, file: !53, line: 261, baseType: !353, size: 64, offset: 36480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !355, file: !53, line: 262, baseType: !388, size: 64, offset: 36544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !355, file: !53, line: 263, baseType: !388, size: 64, offset: 36608)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !355, file: !53, line: 264, baseType: !296, size: 32, offset: 36672)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !355, file: !53, line: 265, baseType: !412, size: 64, offset: 36736)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !355, file: !53, line: 266, baseType: !237, size: 64, offset: 36800)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !355, file: !53, line: 266, baseType: !237, size: 64, offset: 36864)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !355, file: !53, line: 267, baseType: !886, size: 64, offset: 36928)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !47, line: 42, baseType: !57)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !355, file: !53, line: 269, baseType: !889, size: 640, offset: 36992)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 640, elements: !898)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !53, line: 15, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!146, !353, !116, !116, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !430, line: 1723, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !430, line: 1723, flags: DIFlagFwdDecl)
!898 = !{!899}
!899 = !DISubrange(count: 10)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !355, file: !53, line: 270, baseType: !889, size: 640, offset: 37632)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !355, file: !53, line: 272, baseType: !116, size: 32, offset: 38272)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !355, file: !53, line: 273, baseType: !903, size: 64, offset: 38336)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !53, line: 178, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !53, line: 173, size: 256, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !905, file: !53, line: 174, baseType: !130, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !905, file: !53, line: 175, baseType: !462, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !905, file: !53, line: 176, baseType: !750, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !905, file: !53, line: 177, baseType: !296, size: 32, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !355, file: !53, line: 274, baseType: !912, size: 64, offset: 38400)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !53, line: 165, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !53, line: 167, size: 192, elements: !915)
!915 = !{!916, !997, !998}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !914, file: !53, line: 168, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !918, line: 11, baseType: !919)
!918 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !918, line: 13, size: 832, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !988, !990, !991, !992, !993, !994, !995, !996}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !918, line: 14, baseType: !119, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !920, file: !918, line: 15, baseType: !462, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !920, file: !918, line: 16, baseType: !119, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !920, file: !918, line: 17, baseType: !116, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !920, file: !918, line: 18, baseType: !229, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !920, file: !918, line: 19, baseType: !928, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !929, line: 22, baseType: !930)
!929 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !918, line: 81, size: 4992, elements: !932)
!932 = !{!933, !934, !948, !949, !950, !959}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !931, file: !918, line: 82, baseType: !358, size: 4480)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !931, file: !918, line: 82, baseType: !935, size: 256, offset: 4480)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, elements: !181)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !918, line: 74, size: 256, elements: !937)
!937 = !{!938, !942, !943, !947}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !936, file: !918, line: 75, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!146, !928}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !936, file: !918, line: 76, baseType: !939, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !936, file: !918, line: 77, baseType: !944, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!146, !928, !152}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !936, file: !918, line: 78, baseType: !939, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !931, file: !918, line: 83, baseType: !129, size: 64, offset: 4736)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !931, file: !918, line: 85, baseType: !116, size: 32, offset: 4800)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !931, file: !918, line: 86, baseType: !951, size: 64, offset: 4864)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !918, line: 41, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 36, size: 256, elements: !954)
!954 = !{!955, !956, !957, !958}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !953, file: !918, line: 37, baseType: !122, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !953, file: !918, line: 38, baseType: !122, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !953, file: !918, line: 39, baseType: !122, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !953, file: !918, line: 40, baseType: !211, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !931, file: !918, line: 87, baseType: !960, size: 64, offset: 4928)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !918, line: 54, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !918, line: 54, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !918, line: 54, size: 320, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !980}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !964, file: !918, line: 54, baseType: !728, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !964, file: !918, line: 54, baseType: !728, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !964, file: !918, line: 54, baseType: !728, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !964, file: !918, line: 54, baseType: !728, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !918, line: 54, baseType: !735, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !964, file: !918, line: 54, baseType: !972, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !929, line: 41, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !929, line: 35, size: 192, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !974, file: !929, line: 37, baseType: !462, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !974, file: !929, line: 38, baseType: !116, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !974, file: !929, line: 39, baseType: !116, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !974, file: !929, line: 40, baseType: !116, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !964, file: !918, line: 54, baseType: !981, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !918, line: 34, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 30, size: 96, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !983, file: !918, line: 31, baseType: !116, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !983, file: !918, line: 32, baseType: !116, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !983, file: !918, line: 33, baseType: !116, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !918, line: 20, baseType: !989, size: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !47, line: 60, baseType: !64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !920, file: !918, line: 21, baseType: !116, size: 32, offset: 416)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !920, file: !918, line: 22, baseType: !116, size: 32, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !920, file: !918, line: 23, baseType: !229, size: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !920, file: !918, line: 24, baseType: !173, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !920, file: !918, line: 25, baseType: !173, size: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !920, file: !918, line: 26, baseType: !129, size: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !918, line: 27, baseType: !917, size: 64, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !914, file: !53, line: 169, baseType: !462, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !914, file: !53, line: 170, baseType: !912, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !355, file: !53, line: 275, baseType: !116, size: 32, offset: 38464)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !355, file: !53, line: 276, baseType: !1001, size: 64, offset: 38528)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !53, line: 184, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !53, line: 180, size: 192, elements: !1004)
!1004 = !{!1005, !1086, !1087}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1003, file: !53, line: 181, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !929, line: 13, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !918, line: 98, size: 7232, elements: !1009)
!1009 = !{!1010, !1011, !1025, !1026, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1042, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1008, file: !918, line: 99, baseType: !358, size: 4480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1008, file: !918, line: 99, baseType: !1012, size: 256, offset: 4480)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 256, elements: !181)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !918, line: 91, size: 256, elements: !1014)
!1014 = !{!1015, !1019, !1020, !1024}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1013, file: !918, line: 92, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!146, !1006}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1013, file: !918, line: 93, baseType: !1016, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1013, file: !918, line: 94, baseType: !1021, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!146, !1006, !152}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1013, file: !918, line: 95, baseType: !1016, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1008, file: !918, line: 100, baseType: !129, size: 64, offset: 4736)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !1008, file: !918, line: 101, baseType: !1027, size: 64, offset: 4800)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1008, file: !918, line: 102, baseType: !296, size: 32, offset: 4864)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !1008, file: !918, line: 103, baseType: !296, size: 32, offset: 4896)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !1008, file: !918, line: 104, baseType: !116, size: 32, offset: 4928)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1008, file: !918, line: 105, baseType: !116, size: 32, offset: 4960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1008, file: !918, line: 106, baseType: !160, size: 64, offset: 4992)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !1008, file: !918, line: 108, baseType: !917, size: 64, offset: 5056)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !1008, file: !918, line: 109, baseType: !296, size: 32, offset: 5120)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !1008, file: !918, line: 110, baseType: !446, size: 64, offset: 5184)
