; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/simple/partsimple.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/simple/partsimple.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscPartitioner = type { %struct._p_PetscObject, [1 x %struct._PetscPartitionerOps], i8*, i32, i32, double, %struct._p_PetscViewer*, %struct._p_PetscViewer*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 663, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!32 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60}
!52 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!58 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!59 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!60 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!66 = !{!67, !71, !72, !242, !108, !276, !158, !79, !148, !288, !291, !5}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !68, line: 330, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !68, line: 330, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !75, line: 73, size: 4480, elements: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!76 = !{!77, !80, !129, !130, !132, !135, !136, !137, !138, !146, !147, !149, !153, !157, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !170, !171, !172, !174, !175, !177, !179, !180, !181, !182, !183, !186, !188, !189, !190, !191, !192, !195, !197, !198, !199, !209, !211, !212, !216, !217, !266, !271, !273, !274, !275}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !74, file: !75, line: 74, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !79)
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !74, file: !75, line: 75, baseType: !81, size: 448, offset: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 448, elements: !127)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !75, line: 53, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 45, size: 448, elements: !84)
!84 = !{!85, !91, !99, !104, !111, !115, !122}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !83, file: !75, line: 46, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !72, !90}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !79)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !83, file: !75, line: 47, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!89, !72, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !96, line: 16, baseType: !97)
!96 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !96, line: 16, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !83, file: !75, line: 48, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!89, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !83, file: !75, line: 49, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!89, !72, !108, !72}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !83, file: !75, line: 50, baseType: !112, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!89, !72, !108, !103}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !83, file: !75, line: 51, baseType: !116, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!89, !72, !108, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !83, file: !75, line: 52, baseType: !123, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!89, !72, !108, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!127 = !{!128}
!128 = !DISubrange(count: 1)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !74, file: !75, line: 76, baseType: !67, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 77, baseType: !131, size: 32, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !79)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !74, file: !75, line: 78, baseType: !133, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !134)
!134 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !74, file: !75, line: 78, baseType: !133, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !74, file: !75, line: 78, baseType: !133, size: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !74, file: !75, line: 78, baseType: !133, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 79, baseType: !139, size: 64, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !142, line: 27, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !144, line: 43, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!145 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !74, file: !75, line: 80, baseType: !131, size: 32, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !74, file: !75, line: 81, baseType: !148, size: 32, offset: 992)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !79)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !74, file: !75, line: 82, baseType: !150, size: 64, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !74, file: !75, line: 83, baseType: !154, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !74, file: !75, line: 84, baseType: !158, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !74, file: !75, line: 85, baseType: !158, size: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !74, file: !75, line: 86, baseType: !158, size: 64, offset: 1280)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !74, file: !75, line: 87, baseType: !158, size: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !75, line: 88, baseType: !72, size: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !74, file: !75, line: 89, baseType: !139, size: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 90, baseType: !158, size: 64, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !74, file: !75, line: 91, baseType: !158, size: 64, offset: 1600)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !74, file: !75, line: 92, baseType: !131, size: 32, offset: 1664)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !74, file: !75, line: 93, baseType: !71, size: 64, offset: 1728)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !74, file: !75, line: 94, baseType: !169, size: 64, offset: 1792)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !140)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !74, file: !75, line: 95, baseType: !131, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !74, file: !75, line: 95, baseType: !131, size: 32, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !74, file: !75, line: 96, baseType: !173, size: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !74, file: !75, line: 96, baseType: !173, size: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !74, file: !75, line: 97, baseType: !176, size: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !74, file: !75, line: 97, baseType: !178, size: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !74, file: !75, line: 98, baseType: !131, size: 32, offset: 2176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !74, file: !75, line: 98, baseType: !131, size: 32, offset: 2208)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !74, file: !75, line: 99, baseType: !173, size: 64, offset: 2240)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !74, file: !75, line: 99, baseType: !173, size: 64, offset: 2304)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !74, file: !75, line: 100, baseType: !184, size: 64, offset: 2368)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !134)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !74, file: !75, line: 100, baseType: !187, size: 64, offset: 2432)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !74, file: !75, line: 101, baseType: !131, size: 32, offset: 2496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !74, file: !75, line: 101, baseType: !131, size: 32, offset: 2528)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !74, file: !75, line: 102, baseType: !173, size: 64, offset: 2560)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !74, file: !75, line: 102, baseType: !173, size: 64, offset: 2624)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !74, file: !75, line: 103, baseType: !193, size: 64, offset: 2688)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !185)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !74, file: !75, line: 103, baseType: !196, size: 64, offset: 2752)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !74, file: !75, line: 104, baseType: !126, size: 64, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !74, file: !75, line: 105, baseType: !131, size: 32, offset: 2880)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !74, file: !75, line: 106, baseType: !200, size: 128, offset: 2944)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, elements: !207)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !75, line: 64, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 61, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !203, file: !75, line: 62, baseType: !119, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !203, file: !75, line: 63, baseType: !71, size: 64, offset: 64)
!207 = !{!208}
!208 = !DISubrange(count: 2)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !74, file: !75, line: 107, baseType: !210, size: 64, offset: 3072)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, elements: !207)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !74, file: !75, line: 108, baseType: !71, size: 64, offset: 3136)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !74, file: !75, line: 109, baseType: !213, size: 64, offset: 3200)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!89, !71}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !74, file: !75, line: 111, baseType: !131, size: 32, offset: 3264)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !74, file: !75, line: 112, baseType: !218, size: 320, offset: 3328)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 320, elements: !264)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!89, !222, !72, !71}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !225)
!225 = !{!226, !227, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !224, file: !10, line: 100, baseType: !131, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !10, line: 101, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !239, !240, !241, !245, !247, !249, !250, !251}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !230, file: !10, line: 84, baseType: !158, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !230, file: !10, line: 85, baseType: !158, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !10, line: 86, baseType: !71, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !230, file: !10, line: 87, baseType: !150, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !230, file: !10, line: 88, baseType: !237, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !230, file: !10, line: 89, baseType: !110, size: 8, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !230, file: !10, line: 90, baseType: !158, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !230, file: !10, line: 91, baseType: !242, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 46, baseType: !244)
!243 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!244 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !230, file: !10, line: 92, baseType: !246, size: 32, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !10, line: 93, baseType: !248, size: 32, offset: 544)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !10, line: 94, baseType: !228, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !230, file: !10, line: 95, baseType: !158, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !230, file: !10, line: 96, baseType: !71, size: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !224, file: !10, line: 102, baseType: !158, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !224, file: !10, line: 102, baseType: !158, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !224, file: !10, line: 103, baseType: !158, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !224, file: !10, line: 104, baseType: !67, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !224, file: !10, line: 105, baseType: !246, size: 32, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !224, file: !10, line: 105, baseType: !246, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !224, file: !10, line: 105, baseType: !246, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !224, file: !10, line: 106, baseType: !72, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !224, file: !10, line: 107, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!264 = !{!265}
!265 = !DISubrange(count: 5)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !74, file: !75, line: 113, baseType: !267, size: 320, offset: 3648)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !264)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!89, !72, !71}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !74, file: !75, line: 114, baseType: !272, size: 320, offset: 3968)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 320, elements: !264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !74, file: !75, line: 115, baseType: !246, size: 32, offset: 4288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !74, file: !75, line: 120, baseType: !261, size: 64, offset: 4352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !74, file: !75, line: 121, baseType: !246, size: 32, offset: 4416)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner_Simple", file: !278, line: 9, baseType: !279)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/impls/simple/partsimple.c", directory: "/home/users/ndemeye/xSDK")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 4, size: 256, elements: !280)
!280 = !{!281, !282, !283, !287}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "useGrid", scope: !279, file: !278, line: 5, baseType: !246, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gridDim", scope: !279, file: !278, line: 6, baseType: !131, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nodeGrid", scope: !279, file: !278, line: 7, baseType: !284, size: 96, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 3)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "processGrid", scope: !279, file: !278, line: 8, baseType: !284, size: 96, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !68, line: 331, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !68, line: 331, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !68, line: 338, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !68, line: 338, flags: DIFlagFwdDecl)
!294 = !{i32 7, !"Dwarf Version", i32 4}
!295 = !{i32 2, !"Debug Info Version", i32 3}
!296 = !{i32 1, !"wchar_size", i32 4}
!297 = !{i32 7, !"PIC Level", i32 2}
!298 = !{i32 7, !"uwtable", i32 1}
!299 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!300 = distinct !DISubprogram(name: "PetscPartitionerCreate_Simple", scope: !278, file: !278, line: 285, type: !301, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !349)
!301 = !DISubroutineType(types: !302)
!302 = !{!89, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !304, line: 13, baseType: !305)
!304 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !307, line: 21, size: 5312, elements: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/partitionerimpl.h", directory: "/home/users/ndemeye/xSDK")
!308 = !{!309, !311, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !306, file: !307, line: 22, baseType: !310, size: 4480)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !75, line: 122, baseType: !74)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !306, file: !307, line: 22, baseType: !312, size: 384, offset: 4480)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 384, elements: !127)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscPartitionerOps", file: !307, line: 12, size: 384, elements: !314)
!314 = !{!315, !319, !321, !322, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !313, file: !307, line: 13, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!89, !222, !303}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !313, file: !307, line: 14, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !313, file: !307, line: 15, baseType: !320, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !313, file: !307, line: 16, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!89, !303, !95}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !313, file: !307, line: 17, baseType: !320, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !313, file: !307, line: 18, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!89, !303, !131, !131, !176, !176, !331, !331, !331, !335}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !332, line: 18, baseType: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !332, line: 18, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !337, line: 11, baseType: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !337, line: 11, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !307, line: 23, baseType: !71, size: 64, offset: 4864)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !306, file: !307, line: 24, baseType: !131, size: 32, offset: 4928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "edgeCut", scope: !306, file: !307, line: 25, baseType: !131, size: 32, offset: 4960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !306, file: !307, line: 26, baseType: !185, size: 64, offset: 4992)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !306, file: !307, line: 27, baseType: !95, size: 64, offset: 5056)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "viewerGraph", scope: !306, file: !307, line: 28, baseType: !95, size: 64, offset: 5120)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "viewGraph", scope: !306, file: !307, line: 29, baseType: !246, size: 32, offset: 5184)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "noGraph", scope: !306, file: !307, line: 30, baseType: !246, size: 32, offset: 5216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "usevwgt", scope: !306, file: !307, line: 31, baseType: !246, size: 32, offset: 5248)
!349 = !{!350, !351, !352, !353, !355}
!350 = !DILocalVariable(name: "part", arg: 1, scope: !300, file: !278, line: 285, type: !303)
!351 = !DILocalVariable(name: "p", scope: !300, file: !278, line: 287, type: !276)
!352 = !DILocalVariable(name: "ierr", scope: !300, file: !278, line: 288, type: !89)
!353 = !DILocalVariable(name: "ierr__", scope: !354, file: !278, line: 292, type: !89)
!354 = distinct !DILexicalBlock(scope: !300, file: !278, line: 292, column: 38)
!355 = !DILocalVariable(name: "ierr__", scope: !356, file: !278, line: 296, type: !89)
!356 = distinct !DILexicalBlock(scope: !300, file: !278, line: 296, column: 50)
!357 = !DILocation(line: 0, scope: !300)
!358 = !DILocation(line: 287, column: 3, scope: !300)
!359 = !DILocation(line: 290, column: 3, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !278, line: 290, column: 3)
!361 = distinct !DILexicalBlock(scope: !362, file: !278, line: 290, column: 3)
!362 = distinct !DILexicalBlock(scope: !300, file: !278, line: 290, column: 3)
!363 = !{!364, !364, i64 0}
!364 = !{!"any pointer", !365, i64 0}
!365 = !{!"omnipotent char", !366, i64 0}
!366 = !{!"Simple C/C++ TBAA"}
!367 = !DILocation(line: 290, column: 3, scope: !361)
!368 = !DILocation(line: 290, column: 3, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !278, line: 290, column: 3)
!370 = distinct !DILexicalBlock(scope: !360, file: !278, line: 290, column: 3)
!371 = !{!372, !373, i64 1536}
!372 = !{!"", !365, i64 0, !365, i64 512, !365, i64 1024, !365, i64 1280, !373, i64 1536, !373, i64 1540, !365, i64 1544}
!373 = !{!"int", !365, i64 0}
!374 = !DILocation(line: 290, column: 3, scope: !370)
!375 = !DILocation(line: 290, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !369, file: !278, line: 290, column: 3)
!377 = !{!373, !373, i64 0}
!378 = !{!372, !373, i64 1540}
!379 = !DILocation(line: 291, column: 3, scope: !380)
!380 = distinct !DILexicalBlock(scope: !381, file: !278, line: 291, column: 3)
!381 = distinct !DILexicalBlock(scope: !300, file: !278, line: 291, column: 3)
!382 = !DILocation(line: 291, column: 3, scope: !381)
!383 = !DILocation(line: 291, column: 3, scope: !384)
!384 = distinct !DILexicalBlock(scope: !381, file: !278, line: 291, column: 3)
!385 = !DILocation(line: 291, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !381, file: !278, line: 291, column: 3)
!387 = !{!388, !373, i64 0}
!388 = !{!"_p_PetscObject", !373, i64 0, !365, i64 8, !364, i64 64, !373, i64 72, !389, i64 80, !389, i64 88, !389, i64 96, !389, i64 104, !390, i64 112, !373, i64 120, !373, i64 124, !364, i64 128, !364, i64 136, !364, i64 144, !364, i64 152, !364, i64 160, !364, i64 168, !364, i64 176, !390, i64 184, !364, i64 192, !364, i64 200, !373, i64 208, !364, i64 216, !390, i64 224, !373, i64 232, !373, i64 236, !364, i64 240, !364, i64 248, !364, i64 256, !364, i64 264, !373, i64 272, !373, i64 276, !364, i64 280, !364, i64 288, !364, i64 296, !364, i64 304, !373, i64 312, !373, i64 316, !364, i64 320, !364, i64 328, !364, i64 336, !364, i64 344, !364, i64 352, !373, i64 360, !365, i64 368, !365, i64 384, !364, i64 392, !364, i64 400, !373, i64 408, !365, i64 416, !365, i64 456, !365, i64 496, !365, i64 536, !364, i64 544, !365, i64 552}
!389 = !{!"double", !365, i64 0}
!390 = !{!"long", !365, i64 0}
!391 = !DILocation(line: 291, column: 3, scope: !392)
!392 = distinct !DILexicalBlock(scope: !393, file: !278, line: 291, column: 3)
!393 = distinct !DILexicalBlock(scope: !386, file: !278, line: 291, column: 3)
!394 = !DILocation(line: 291, column: 3, scope: !393)
!395 = !DILocation(line: 292, column: 16, scope: !300)
!396 = !{!"branch_weights", i32 2146410443, i32 1073205}
!397 = !DILocation(line: 0, scope: !354)
!398 = !DILocation(line: 292, column: 38, scope: !354)
!399 = !{!"branch_weights", i32 2000, i32 1}
