; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gasm/gasm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gasm/gasm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!228 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!229 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!236 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!240 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!241 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 30, baseType: !5, size: 32, elements: !244)
!243 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!246 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!247 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!248 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!249 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260}
!252 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!258 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!259 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!260 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 442, baseType: !26, size: 32, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!263 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!264 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!265 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!266 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!267 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!268 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!269 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!270 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!271 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!272 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!273 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!274 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!275 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!276 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!277 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!278 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!279 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!280 = !DIEnumerator(name: "MAT_SPD", value: 15)
!281 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!282 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!283 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!284 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!285 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!286 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!287 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!288 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!289 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!290 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 424, baseType: !5, size: 32, elements: !292)
!292 = !{!293, !294}
!293 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!298 = !{!299, !357, !375, !455, !445, !26, !396, !563, !435, !566, !569, !530, !564, !5, !391, !572, !573}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_GASM", file: !301, line: 37, baseType: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gasm/gasm.c", directory: "/home/users/ndemeye/xSDK")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 14, size: 1408, elements: !303)
!303 = !{!304, !306, !307, !308, !309, !311, !313, !314, !315, !316, !317, !318, !324, !325, !331, !336, !340, !341, !343, !344, !350, !351, !352, !353, !354, !355, !356}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !302, file: !301, line: 15, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !302, file: !301, line: 15, baseType: !305, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !302, file: !301, line: 15, baseType: !305, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !302, file: !301, line: 16, baseType: !305, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !301, line: 17, baseType: !310, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCGASMType", file: !25, line: 162, baseType: !54)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type_set", scope: !302, file: !301, line: 18, baseType: !312, size: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "same_subdomain_solvers", scope: !302, file: !301, line: 19, baseType: !312, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sort_indices", scope: !302, file: !301, line: 20, baseType: !312, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "user_subdomains", scope: !302, file: !301, line: 21, baseType: !312, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dm_subdomains", scope: !302, file: !301, line: 22, baseType: !312, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchicalpartitioning", scope: !302, file: !301, line: 23, baseType: !312, size: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ois", scope: !302, file: !301, line: 24, baseType: !319, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !321, line: 11, baseType: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !321, line: 11, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "iis", scope: !302, file: !301, line: 25, baseType: !319, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !302, file: !301, line: 26, baseType: !326, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !328, line: 22, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !328, line: 22, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !302, file: !301, line: 27, baseType: !332, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gx", scope: !302, file: !301, line: 28, baseType: !337, size: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !243, line: 21, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !243, line: 21, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gy", scope: !302, file: !301, line: 28, baseType: !337, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !302, file: !301, line: 29, baseType: !342, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !302, file: !301, line: 29, baseType: !342, size: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gorestriction", scope: !302, file: !301, line: 30, baseType: !345, size: 64, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !346, line: 59, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !346, line: 15, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !346, line: 15, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "girestriction", scope: !302, file: !301, line: 31, baseType: !345, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pctoouter", scope: !302, file: !301, line: 32, baseType: !345, size: 64, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "permutationIS", scope: !302, file: !301, line: 33, baseType: !320, size: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "permutationP", scope: !302, file: !301, line: 34, baseType: !333, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pcmat", scope: !302, file: !301, line: 35, baseType: !333, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pcx", scope: !302, file: !301, line: 36, baseType: !337, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pcy", scope: !302, file: !301, line: 36, baseType: !337, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !360, line: 73, size: 4480, elements: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!361 = !{!362, !364, !417, !418, !419, !422, !423, !424, !425, !433, !434, !436, !440, !444, !446, !447, !448, !449, !450, !451, !452, !453, !454, !456, !458, !459, !460, !462, !463, !465, !467, !468, !469, !470, !471, !474, !476, !477, !478, !479, !480, !483, !485, !486, !487, !497, !499, !500, !504, !505, !553, !558, !560, !561, !562}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !359, file: !360, line: 74, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !359, file: !360, line: 75, baseType: !365, size: 448, offset: 64)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 448, elements: !415)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !360, line: 53, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 45, size: 448, elements: !368)
!368 = !{!369, !379, !387, !392, !399, !403, !410}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !367, file: !360, line: 46, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !357, !374}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !376, line: 330, baseType: !377)
!376 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !376, line: 330, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !367, file: !360, line: 47, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!373, !357, !383}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !384, line: 16, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !384, line: 16, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !367, file: !360, line: 48, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!373, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !367, file: !360, line: 49, baseType: !393, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!373, !357, !396, !357}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !367, file: !360, line: 50, baseType: !400, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!373, !357, !396, !391}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !367, file: !360, line: 51, baseType: !404, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!373, !357, !396, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !367, file: !360, line: 52, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!373, !357, !396, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!415 = !{!416}
!416 = !DISubrange(count: 1)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !359, file: !360, line: 76, baseType: !375, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !360, line: 77, baseType: !305, size: 32, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !359, file: !360, line: 78, baseType: !420, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !421)
!421 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !359, file: !360, line: 78, baseType: !420, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !359, file: !360, line: 78, baseType: !420, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !359, file: !360, line: 78, baseType: !420, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !360, line: 79, baseType: !426, size: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !429, line: 27, baseType: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !431, line: 43, baseType: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!432 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !359, file: !360, line: 80, baseType: !305, size: 32, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !359, file: !360, line: 81, baseType: !435, size: 32, offset: 992)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !359, file: !360, line: 82, baseType: !437, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !359, file: !360, line: 83, baseType: !441, size: 64, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !359, file: !360, line: 84, baseType: !445, size: 64, offset: 1152)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !359, file: !360, line: 85, baseType: !445, size: 64, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !359, file: !360, line: 86, baseType: !445, size: 64, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !359, file: !360, line: 87, baseType: !445, size: 64, offset: 1344)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !359, file: !360, line: 88, baseType: !357, size: 64, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !359, file: !360, line: 89, baseType: !426, size: 64, offset: 1472)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !360, line: 90, baseType: !445, size: 64, offset: 1536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !359, file: !360, line: 91, baseType: !445, size: 64, offset: 1600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !359, file: !360, line: 92, baseType: !305, size: 32, offset: 1664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !359, file: !360, line: 93, baseType: !455, size: 64, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !359, file: !360, line: 94, baseType: !457, size: 64, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !427)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !359, file: !360, line: 95, baseType: !305, size: 32, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !359, file: !360, line: 95, baseType: !305, size: 32, offset: 1888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !359, file: !360, line: 96, baseType: !461, size: 64, offset: 1920)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !359, file: !360, line: 96, baseType: !461, size: 64, offset: 1984)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !359, file: !360, line: 97, baseType: !464, size: 64, offset: 2048)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !359, file: !360, line: 97, baseType: !466, size: 64, offset: 2112)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !359, file: !360, line: 98, baseType: !305, size: 32, offset: 2176)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !359, file: !360, line: 98, baseType: !305, size: 32, offset: 2208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !359, file: !360, line: 99, baseType: !461, size: 64, offset: 2240)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !359, file: !360, line: 99, baseType: !461, size: 64, offset: 2304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !359, file: !360, line: 100, baseType: !472, size: 64, offset: 2368)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !421)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !359, file: !360, line: 100, baseType: !475, size: 64, offset: 2432)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !359, file: !360, line: 101, baseType: !305, size: 32, offset: 2496)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !359, file: !360, line: 101, baseType: !305, size: 32, offset: 2528)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !359, file: !360, line: 102, baseType: !461, size: 64, offset: 2560)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !359, file: !360, line: 102, baseType: !461, size: 64, offset: 2624)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !359, file: !360, line: 103, baseType: !481, size: 64, offset: 2688)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !473)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !359, file: !360, line: 103, baseType: !484, size: 64, offset: 2752)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !359, file: !360, line: 104, baseType: !414, size: 64, offset: 2816)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !359, file: !360, line: 105, baseType: !305, size: 32, offset: 2880)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !359, file: !360, line: 106, baseType: !488, size: 128, offset: 2944)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !495)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !360, line: 64, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 61, size: 128, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !491, file: !360, line: 62, baseType: !407, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !491, file: !360, line: 63, baseType: !455, size: 64, offset: 64)
!495 = !{!496}
!496 = !DISubrange(count: 2)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !359, file: !360, line: 107, baseType: !498, size: 64, offset: 3072)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 64, elements: !495)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !359, file: !360, line: 108, baseType: !455, size: 64, offset: 3136)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !359, file: !360, line: 109, baseType: !501, size: 64, offset: 3200)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!373, !455}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !359, file: !360, line: 111, baseType: !305, size: 32, offset: 3264)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !359, file: !360, line: 112, baseType: !506, size: 320, offset: 3328)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 320, elements: !551)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!373, !510, !357, !455}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !513)
!513 = !{!514, !515, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !10, line: 100, baseType: !305, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !10, line: 101, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !527, !528, !529, !533, !534, !536, !537, !538}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !518, file: !10, line: 84, baseType: !445, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !518, file: !10, line: 85, baseType: !445, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !10, line: 86, baseType: !455, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !518, file: !10, line: 87, baseType: !437, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !518, file: !10, line: 88, baseType: !525, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !518, file: !10, line: 89, baseType: !398, size: 8, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !518, file: !10, line: 90, baseType: !445, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !518, file: !10, line: 91, baseType: !530, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 46, baseType: !532)
!531 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!532 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !518, file: !10, line: 92, baseType: !312, size: 32, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !10, line: 93, baseType: !535, size: 32, offset: 544)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !10, line: 94, baseType: !516, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !518, file: !10, line: 95, baseType: !445, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !518, file: !10, line: 96, baseType: !455, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !512, file: !10, line: 102, baseType: !445, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !512, file: !10, line: 102, baseType: !445, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !512, file: !10, line: 103, baseType: !445, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !512, file: !10, line: 104, baseType: !375, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !512, file: !10, line: 105, baseType: !312, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !512, file: !10, line: 105, baseType: !312, size: 32, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !512, file: !10, line: 105, baseType: !312, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !512, file: !10, line: 106, baseType: !357, size: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !512, file: !10, line: 107, baseType: !548, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!551 = !{!552}
!552 = !DISubrange(count: 5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !359, file: !360, line: 113, baseType: !554, size: 320, offset: 3648)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 320, elements: !551)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!373, !357, !455}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !359, file: !360, line: 114, baseType: !559, size: 320, offset: 3968)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 320, elements: !551)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !359, file: !360, line: 115, baseType: !312, size: 32, offset: 4288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !359, file: !360, line: 120, baseType: !548, size: 64, offset: 4352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !359, file: !360, line: 121, baseType: !312, size: 32, offset: 4416)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !565, line: 1451, baseType: !407)
!565 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !376, line: 331, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !376, line: 331, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !376, line: 338, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !376, line: 338, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !295)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!574 = !{i32 7, !"Dwarf Version", i32 4}
!575 = !{i32 2, !"Debug Info Version", i32 3}
!576 = !{i32 1, !"wchar_size", i32 4}
!577 = !{i32 7, !"PIC Level", i32 2}
!578 = !{i32 7, !"uwtable", i32 1}
!579 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!580 = distinct !DISubprogram(name: "PCGASMSetHierarchicalPartitioning", scope: !301, file: !301, line: 261, type: !581, scopeLine: 262, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !675)
!581 = !DISubroutineType(types: !582)
!582 = !{!373, !583}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !586, line: 37, size: 6720, elements: !587)
!586 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!587 = !{!588, !590, !643, !648, !649, !650, !651, !652, !654, !655, !656, !657, !658, !659, !660, !661, !662, !668, !669, !670, !671, !672, !674}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !585, file: !586, line: 38, baseType: !589, size: 4480)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !360, line: 122, baseType: !359)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !585, file: !586, line: 38, baseType: !591, size: 1152, offset: 4480)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 1152, elements: !415)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !586, line: 13, size: 1152, elements: !593)
!593 = !{!594, !596, !600, !604, !610, !615, !616, !620, !624, !628, !629, !633, !634, !635, !636, !637, !641, !642}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !592, file: !586, line: 14, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !592, file: !586, line: 15, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!373, !583, !337, !337}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !592, file: !586, line: 16, baseType: !601, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!373, !583, !333, !333}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !592, file: !586, line: 17, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!373, !583, !337, !337, !337, !473, !473, !473, !305, !312, !464, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !592, file: !586, line: 18, baseType: !611, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!373, !583, !614, !337, !337, !337}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !592, file: !586, line: 19, baseType: !597, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !592, file: !586, line: 20, baseType: !617, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!373, !583, !305, !337, !337, !337}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !592, file: !586, line: 21, baseType: !621, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!373, !510, !583}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !592, file: !586, line: 22, baseType: !625, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!373, !583, !327, !337, !337}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !592, file: !586, line: 23, baseType: !625, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !592, file: !586, line: 24, baseType: !630, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!373, !583, !332}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !592, file: !586, line: 25, baseType: !597, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !592, file: !586, line: 26, baseType: !597, size: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !592, file: !586, line: 27, baseType: !595, size: 64, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !592, file: !586, line: 28, baseType: !595, size: 64, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !592, file: !586, line: 29, baseType: !638, size: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!373, !583, !383}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !592, file: !586, line: 30, baseType: !595, size: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !592, file: !586, line: 31, baseType: !638, size: 64, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !585, file: !586, line: 39, baseType: !644, size: 64, offset: 5632)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !645, line: 14, baseType: !646)
!645 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !645, line: 14, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !585, file: !586, line: 40, baseType: !305, size: 32, offset: 5696)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !585, file: !586, line: 41, baseType: !457, size: 64, offset: 5760)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !585, file: !586, line: 41, baseType: !457, size: 64, offset: 5824)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !585, file: !586, line: 42, baseType: !312, size: 32, offset: 5888)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !586, line: 43, baseType: !653, size: 32, offset: 5920)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !585, file: !586, line: 45, baseType: !305, size: 32, offset: 5952)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !585, file: !586, line: 46, baseType: !312, size: 32, offset: 5984)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !585, file: !586, line: 47, baseType: !333, size: 64, offset: 6016)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !585, file: !586, line: 47, baseType: !333, size: 64, offset: 6080)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !585, file: !586, line: 48, baseType: !337, size: 64, offset: 6144)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !585, file: !586, line: 48, baseType: !337, size: 64, offset: 6208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !585, file: !586, line: 49, baseType: !312, size: 32, offset: 6272)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !585, file: !586, line: 50, baseType: !312, size: 32, offset: 6304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !585, file: !586, line: 51, baseType: !663, size: 64, offset: 6336)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!373, !583, !305, !666, !666, !332, !455}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !585, file: !586, line: 52, baseType: !455, size: 64, offset: 6400)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !586, line: 53, baseType: !455, size: 64, offset: 6464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !585, file: !586, line: 54, baseType: !305, size: 32, offset: 6528)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !585, file: !586, line: 55, baseType: !455, size: 64, offset: 6592)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !585, file: !586, line: 56, baseType: !673, size: 32, offset: 6656)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !585, file: !586, line: 57, baseType: !673, size: 32, offset: 6688)
!675 = !{!676, !677, !678, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !693, !695, !701, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744}
!676 = !DILocalVariable(name: "pc", arg: 1, scope: !580, file: !301, line: 261, type: !583)
!677 = !DILocalVariable(name: "osm", scope: !580, file: !301, line: 263, type: !299)
!678 = !DILocalVariable(name: "part", scope: !580, file: !301, line: 264, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !39, line: 1427, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !39, line: 1427, flags: DIFlagFwdDecl)
!682 = !DILocalVariable(name: "comm", scope: !580, file: !301, line: 265, type: !375)
!683 = !DILocalVariable(name: "size", scope: !580, file: !301, line: 266, type: !435)
!684 = !DILocalVariable(name: "nlocalsubdomains", scope: !580, file: !301, line: 267, type: !305)
!685 = !DILocalVariable(name: "fromrows_localsize", scope: !580, file: !301, line: 267, type: !305)
!686 = !DILocalVariable(name: "partitioning", scope: !580, file: !301, line: 268, type: !320)
!687 = !DILocalVariable(name: "fromrows", scope: !580, file: !301, line: 268, type: !320)
!688 = !DILocalVariable(name: "isn", scope: !580, file: !301, line: 268, type: !320)
!689 = !DILocalVariable(name: "outervec", scope: !580, file: !301, line: 269, type: !337)
!690 = !DILocalVariable(name: "ierr", scope: !580, file: !301, line: 270, type: !373)
!691 = !DILocalVariable(name: "ierr__", scope: !692, file: !301, line: 273, type: !373)
!692 = distinct !DILexicalBlock(scope: !580, file: !301, line: 273, column: 53)
!693 = !DILocalVariable(name: "_7_errorcode", scope: !694, file: !301, line: 274, type: !373)
!694 = distinct !DILexicalBlock(scope: !580, file: !301, line: 274, column: 37)
!695 = !DILocalVariable(name: "_7_errorstring", scope: !696, file: !301, line: 274, type: !698)
!696 = distinct !DILexicalBlock(scope: !697, file: !301, line: 274, column: 37)
!697 = distinct !DILexicalBlock(scope: !694, file: !301, line: 274, column: 37)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 2048, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 256)
!701 = !DILocalVariable(name: "_7_resultlen", scope: !696, file: !301, line: 274, type: !435)
!702 = !DILocalVariable(name: "ierr__", scope: !703, file: !301, line: 284, type: !373)
!703 = distinct !DILexicalBlock(scope: !580, file: !301, line: 284, column: 45)
!704 = !DILocalVariable(name: "ierr__", scope: !705, file: !301, line: 285, type: !373)
!705 = distinct !DILexicalBlock(scope: !580, file: !301, line: 285, column: 54)
!706 = !DILocalVariable(name: "ierr__", scope: !707, file: !301, line: 286, type: !373)
!707 = distinct !DILexicalBlock(scope: !580, file: !301, line: 286, column: 64)
!708 = !DILocalVariable(name: "ierr__", scope: !709, file: !301, line: 287, type: !373)
!709 = distinct !DILexicalBlock(scope: !580, file: !301, line: 287, column: 67)
!710 = !DILocalVariable(name: "ierr__", scope: !711, file: !301, line: 288, type: !373)
!711 = distinct !DILexicalBlock(scope: !580, file: !301, line: 288, column: 75)
!712 = !DILocalVariable(name: "ierr__", scope: !713, file: !301, line: 289, type: !373)
!713 = distinct !DILexicalBlock(scope: !580, file: !301, line: 289, column: 47)
!714 = !DILocalVariable(name: "ierr__", scope: !715, file: !301, line: 291, type: !373)
!715 = distinct !DILexicalBlock(scope: !580, file: !301, line: 291, column: 52)
!716 = !DILocalVariable(name: "ierr__", scope: !717, file: !301, line: 292, type: !373)
!717 = distinct !DILexicalBlock(scope: !580, file: !301, line: 292, column: 56)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !301, line: 293, type: !373)
