; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baij2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baij2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!307 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!325 = !{!326, !406, !485, !556, !427, !403, !1400, !1402, !429, !475, !1027, !1413}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqBAIJ", file: !328, line: 31, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/baij/seq/baij.h", directory: "/home/users/ndemeye/xSDK")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 28, size: 2240, elements: !330)
!330 = !{!331, !333, !335, !336, !337, !338, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !358, !359, !360, !361, !362, !363, !364, !371, !373, !378, !379, !380, !381, !1349, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !329, file: !328, line: 29, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 416)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 480)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 544)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !329, file: !328, line: 29, baseType: !350, size: 192, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !351, line: 407, baseType: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 402, size: 192, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !352, file: !351, line: 403, baseType: !332, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !352, file: !351, line: 404, baseType: !334, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !352, file: !351, line: 405, baseType: !339, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !352, file: !351, line: 406, baseType: !339, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !329, file: !328, line: 29, baseType: !339, size: 64, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !329, file: !328, line: 29, baseType: !334, size: 32, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 1120)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !329, file: !328, line: 29, baseType: !365, size: 64, offset: 1152)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !367, line: 799, baseType: !368)
!367 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !370)
!370 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !329, file: !328, line: 29, baseType: !372, size: 64, offset: 1216)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !329, file: !328, line: 29, baseType: !374, size: 64, offset: 1280)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !375, line: 11, baseType: !376)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !375, line: 11, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !329, file: !328, line: 29, baseType: !374, size: 64, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !329, file: !328, line: 29, baseType: !374, size: 64, offset: 1408)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !329, file: !328, line: 29, baseType: !332, size: 32, offset: 1472)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !328, line: 29, baseType: !382, size: 64, offset: 1536)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !351, line: 436, size: 23424, elements: !385)
!385 = !{!386, !589, !1092, !1112, !1113, !1114, !1116, !1117, !1118, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1245, !1246, !1262, !1263, !1264, !1265, !1266, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1301, !1321, !1322, !1324, !1325, !1326, !1327, !1328, !1329, !1347, !1348}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !384, file: !351, line: 437, baseType: !387, size: 4480)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !388, line: 122, baseType: !389)
!388 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !388, line: 73, size: 4480, elements: !390)
!390 = !{!391, !393, !448, !449, !450, !452, !453, !454, !455, !463, !464, !466, !470, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !488, !489, !490, !492, !493, !494, !496, !497, !498, !499, !500, !502, !504, !505, !506, !507, !508, !509, !511, !512, !513, !523, !525, !526, !530, !531, !579, !584, !586, !587, !588}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !389, file: !388, line: 74, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !389, file: !388, line: 75, baseType: !394, size: 448, offset: 64)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 448, elements: !446)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !388, line: 53, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 45, size: 448, elements: !397)
!397 = !{!398, !410, !418, !423, !430, !434, !441}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !396, file: !388, line: 46, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !403, !405}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !407, line: 330, baseType: !408)
!407 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !407, line: 330, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !396, file: !388, line: 47, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!402, !403, !414}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !415, line: 16, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !415, line: 16, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !396, file: !388, line: 48, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!402, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !396, file: !388, line: 49, baseType: !424, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!402, !403, !427, !403}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !396, file: !388, line: 50, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!402, !403, !427, !422}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !396, file: !388, line: 51, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!402, !403, !427, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !396, file: !388, line: 52, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!402, !403, !427, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!446 = !{!447}
!447 = !DISubrange(count: 1)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !389, file: !388, line: 76, baseType: !406, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !388, line: 77, baseType: !334, size: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !389, file: !388, line: 78, baseType: !451, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !370)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !389, file: !388, line: 78, baseType: !451, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !389, file: !388, line: 78, baseType: !451, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !389, file: !388, line: 78, baseType: !451, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !389, file: !388, line: 79, baseType: !456, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !459, line: 27, baseType: !460)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !461, line: 43, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!462 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !389, file: !388, line: 80, baseType: !334, size: 32, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !389, file: !388, line: 81, baseType: !465, size: 32, offset: 992)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !389, file: !388, line: 82, baseType: !467, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !389, file: !388, line: 83, baseType: !471, size: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !389, file: !388, line: 84, baseType: !475, size: 64, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !389, file: !388, line: 85, baseType: !475, size: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !389, file: !388, line: 86, baseType: !475, size: 64, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !389, file: !388, line: 87, baseType: !475, size: 64, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !389, file: !388, line: 88, baseType: !403, size: 64, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !389, file: !388, line: 89, baseType: !456, size: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !388, line: 90, baseType: !475, size: 64, offset: 1536)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !389, file: !388, line: 91, baseType: !475, size: 64, offset: 1600)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !389, file: !388, line: 92, baseType: !334, size: 32, offset: 1664)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !389, file: !388, line: 93, baseType: !485, size: 64, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !388, line: 94, baseType: !487, size: 64, offset: 1792)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !457)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !389, file: !388, line: 95, baseType: !334, size: 32, offset: 1856)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !389, file: !388, line: 95, baseType: !334, size: 32, offset: 1888)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !389, file: !388, line: 96, baseType: !491, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !389, file: !388, line: 96, baseType: !491, size: 64, offset: 1984)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !389, file: !388, line: 97, baseType: !339, size: 64, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !389, file: !388, line: 97, baseType: !495, size: 64, offset: 2112)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !389, file: !388, line: 98, baseType: !334, size: 32, offset: 2176)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !389, file: !388, line: 98, baseType: !334, size: 32, offset: 2208)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !389, file: !388, line: 99, baseType: !491, size: 64, offset: 2240)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !389, file: !388, line: 99, baseType: !491, size: 64, offset: 2304)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !389, file: !388, line: 100, baseType: !501, size: 64, offset: 2368)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !389, file: !388, line: 100, baseType: !503, size: 64, offset: 2432)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !389, file: !388, line: 101, baseType: !334, size: 32, offset: 2496)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !389, file: !388, line: 101, baseType: !334, size: 32, offset: 2528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !389, file: !388, line: 102, baseType: !491, size: 64, offset: 2560)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !389, file: !388, line: 102, baseType: !491, size: 64, offset: 2624)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !389, file: !388, line: 103, baseType: !372, size: 64, offset: 2688)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !389, file: !388, line: 103, baseType: !510, size: 64, offset: 2752)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !389, file: !388, line: 104, baseType: !445, size: 64, offset: 2816)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !389, file: !388, line: 105, baseType: !334, size: 32, offset: 2880)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !389, file: !388, line: 106, baseType: !514, size: 128, offset: 2944)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 128, elements: !521)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !388, line: 64, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 61, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !517, file: !388, line: 62, baseType: !438, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !517, file: !388, line: 63, baseType: !485, size: 64, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 2)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !389, file: !388, line: 107, baseType: !524, size: 64, offset: 3072)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 64, elements: !521)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !389, file: !388, line: 108, baseType: !485, size: 64, offset: 3136)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !389, file: !388, line: 109, baseType: !527, size: 64, offset: 3200)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!402, !485}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !389, file: !388, line: 111, baseType: !334, size: 32, offset: 3264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !389, file: !388, line: 112, baseType: !532, size: 320, offset: 3328)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !577)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!402, !536, !403, !485}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !539)
!539 = !{!540, !541, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !538, file: !10, line: 100, baseType: !334, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !10, line: 101, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !553, !554, !555, !559, !560, !562, !563, !564}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !544, file: !10, line: 84, baseType: !475, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !544, file: !10, line: 85, baseType: !475, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !10, line: 86, baseType: !485, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !544, file: !10, line: 87, baseType: !467, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !544, file: !10, line: 88, baseType: !551, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !544, file: !10, line: 89, baseType: !429, size: 8, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !544, file: !10, line: 90, baseType: !475, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !544, file: !10, line: 91, baseType: !556, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !557, line: 46, baseType: !558)
!557 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!558 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !544, file: !10, line: 92, baseType: !332, size: 32, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !10, line: 93, baseType: !561, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !10, line: 94, baseType: !542, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !544, file: !10, line: 95, baseType: !475, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !544, file: !10, line: 96, baseType: !485, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !538, file: !10, line: 102, baseType: !475, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !538, file: !10, line: 102, baseType: !475, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !538, file: !10, line: 103, baseType: !475, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !538, file: !10, line: 104, baseType: !406, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !538, file: !10, line: 105, baseType: !332, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !538, file: !10, line: 105, baseType: !332, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !538, file: !10, line: 105, baseType: !332, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !538, file: !10, line: 106, baseType: !403, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !538, file: !10, line: 107, baseType: !574, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!577 = !{!578}
!578 = !DISubrange(count: 5)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !389, file: !388, line: 113, baseType: !580, size: 320, offset: 3648)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 320, elements: !577)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!402, !403, !485}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !389, file: !388, line: 114, baseType: !585, size: 320, offset: 3968)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 320, elements: !577)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !389, file: !388, line: 115, baseType: !332, size: 32, offset: 4288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !389, file: !388, line: 120, baseType: !574, size: 64, offset: 4352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !389, file: !388, line: 121, baseType: !332, size: 32, offset: 4416)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !384, file: !351, line: 437, baseType: !590, size: 9472, offset: 4480)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 9472, elements: !446)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !351, line: 32, size: 9472, elements: !592)
!592 = !{!593, !602, !606, !607, !614, !618, !619, !620, !621, !622, !623, !624, !644, !648, !653, !659, !678, !683, !687, !688, !693, !698, !699, !704, !708, !712, !716, !720, !724, !725, !726, !727, !728, !732, !733, !738, !739, !740, !741, !742, !747, !754, !759, !763, !767, !771, !775, !776, !780, !781, !788, !793, !794, !795, !796, !858, !866, !867, !871, !872, !876, !877, !881, !886, !887, !891, !895, !902, !903, !904, !905, !906, !907, !912, !913, !917, !921, !925, !926, !927, !931, !941, !942, !946, !947, !951, !952, !956, !957, !962, !963, !967, !971, !972, !973, !974, !975, !976, !977, !981, !982, !983, !984, !985, !986, !990, !991, !992, !993, !994, !995, !996, !997, !1001, !1005, !1006, !1007, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1021, !1022, !1023, !1028, !1032, !1033, !1037, !1038, !1039, !1040, !1066, !1070, !1071, !1072, !1073, !1074, !1078, !1079, !1080, !1081, !1082, !1086, !1090, !1091}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !591, file: !351, line: 34, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!402, !382, !334, !597, !334, !597, !599, !601}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !591, file: !351, line: 35, baseType: !603, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!402, !382, !334, !339, !495, !510}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !591, file: !351, line: 36, baseType: !603, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !591, file: !351, line: 37, baseType: !608, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!402, !382, !611, !611}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !591, file: !351, line: 38, baseType: !615, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!402, !382, !611, !611, !611}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !591, file: !351, line: 40, baseType: !608, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !591, file: !351, line: 41, baseType: !615, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !591, file: !351, line: 42, baseType: !608, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !591, file: !351, line: 43, baseType: !615, size: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !591, file: !351, line: 44, baseType: !608, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !591, file: !351, line: 46, baseType: !615, size: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !591, file: !351, line: 47, baseType: !625, size: 64, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!402, !382, !374, !374, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !631, file: !36, line: 1227, baseType: !369, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !631, file: !36, line: 1228, baseType: !369, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !631, file: !36, line: 1229, baseType: !369, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !631, file: !36, line: 1230, baseType: !369, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !631, file: !36, line: 1231, baseType: !369, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !631, file: !36, line: 1232, baseType: !369, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !631, file: !36, line: 1233, baseType: !369, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !631, file: !36, line: 1234, baseType: !369, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !631, file: !36, line: 1236, baseType: !369, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !631, file: !36, line: 1237, baseType: !369, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !631, file: !36, line: 1238, baseType: !369, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !591, file: !351, line: 48, baseType: !645, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!402, !382, !374, !628}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !591, file: !351, line: 49, baseType: !649, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!402, !382, !611, !369, !652, !369, !334, !334, !611}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !591, file: !351, line: 50, baseType: !654, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!402, !382, !657, !658}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !591, file: !351, line: 52, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!402, !382, !663, !664}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !666, file: !36, line: 593, baseType: !451, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !666, file: !36, line: 594, baseType: !451, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !666, file: !36, line: 594, baseType: !451, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !666, file: !36, line: 594, baseType: !451, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !666, file: !36, line: 595, baseType: !451, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !666, file: !36, line: 596, baseType: !451, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !666, file: !36, line: 597, baseType: !451, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !666, file: !36, line: 598, baseType: !451, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !666, file: !36, line: 598, baseType: !451, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !666, file: !36, line: 599, baseType: !451, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !591, file: !351, line: 53, baseType: !679, size: 64, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!402, !382, !382, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !591, file: !351, line: 54, baseType: !684, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!402, !382, !611}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !591, file: !351, line: 55, baseType: !608, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !591, file: !351, line: 56, baseType: !689, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!402, !382, !692, !501}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !591, file: !351, line: 58, baseType: !694, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!402, !382, !697}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !591, file: !351, line: 59, baseType: !694, size: 64, offset: 1344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !591, file: !351, line: 60, baseType: !700, size: 64, offset: 1408)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!402, !382, !703, !332}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !591, file: !351, line: 61, baseType: !705, size: 64, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!402, !382}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !591, file: !351, line: 63, baseType: !709, size: 64, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!402, !382, !334, !597, !368, !611, !611}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !591, file: !351, line: 64, baseType: !713, size: 64, offset: 1600)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!402, !382, !382, !374, !374, !628}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !591, file: !351, line: 65, baseType: !717, size: 64, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!402, !382, !382, !628}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !591, file: !351, line: 66, baseType: !721, size: 64, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!402, !382, !382, !374, !628}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !591, file: !351, line: 67, baseType: !717, size: 64, offset: 1792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !591, file: !351, line: 69, baseType: !705, size: 64, offset: 1856)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !591, file: !351, line: 70, baseType: !713, size: 64, offset: 1920)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !591, file: !351, line: 71, baseType: !721, size: 64, offset: 1984)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !591, file: !351, line: 72, baseType: !729, size: 64, offset: 2048)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!402, !382, !658}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !591, file: !351, line: 73, baseType: !705, size: 64, offset: 2112)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !591, file: !351, line: 75, baseType: !734, size: 64, offset: 2176)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!402, !382, !737, !658}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !591, file: !351, line: 76, baseType: !608, size: 64, offset: 2240)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !591, file: !351, line: 77, baseType: !608, size: 64, offset: 2304)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !591, file: !351, line: 78, baseType: !625, size: 64, offset: 2368)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !591, file: !351, line: 79, baseType: !645, size: 64, offset: 2432)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !591, file: !351, line: 81, baseType: !743, size: 64, offset: 2496)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!402, !382, !368, !382, !746}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !591, file: !351, line: 82, baseType: !748, size: 64, offset: 2560)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!402, !382, !334, !751, !751, !657, !753}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !591, file: !351, line: 83, baseType: !755, size: 64, offset: 2624)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!402, !382, !334, !758, !334}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !591, file: !351, line: 84, baseType: !760, size: 64, offset: 2688)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!402, !382, !334, !597, !334, !597, !372}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !591, file: !351, line: 85, baseType: !764, size: 64, offset: 2752)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!402, !382, !382, !746}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !591, file: !351, line: 87, baseType: !768, size: 64, offset: 2816)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!402, !382, !611, !339}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !591, file: !351, line: 88, baseType: !772, size: 64, offset: 2880)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!402, !382, !368}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !591, file: !351, line: 89, baseType: !772, size: 64, offset: 2944)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !591, file: !351, line: 90, baseType: !777, size: 64, offset: 3008)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!402, !382, !611, !601}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !591, file: !351, line: 91, baseType: !709, size: 64, offset: 3072)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !591, file: !351, line: 93, baseType: !782, size: 64, offset: 3136)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!402, !382, !785}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !591, file: !351, line: 94, baseType: !789, size: 64, offset: 3200)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!402, !382, !334, !332, !332, !339, !792, !792, !682}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !591, file: !351, line: 95, baseType: !789, size: 64, offset: 3264)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !591, file: !351, line: 96, baseType: !789, size: 64, offset: 3328)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !591, file: !351, line: 97, baseType: !789, size: 64, offset: 3392)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !591, file: !351, line: 99, baseType: !797, size: 64, offset: 3456)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!402, !382, !800, !803}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !375, line: 51, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !375, line: 51, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !351, line: 609, size: 6208, elements: !806)
!806 = !{!807, !808, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !827, !834, !835, !836, !837, !838, !839, !840, !841, !845, !846, !847, !848, !849, !851, !852, !853, !854, !855, !856, !857}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !805, file: !351, line: 610, baseType: !387, size: 4480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !805, file: !351, line: 610, baseType: !809, size: 32, offset: 4480)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !446)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !805, file: !351, line: 611, baseType: !334, size: 32, offset: 4512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !805, file: !351, line: 611, baseType: !334, size: 32, offset: 4544)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !805, file: !351, line: 611, baseType: !334, size: 32, offset: 4576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !805, file: !351, line: 612, baseType: !334, size: 32, offset: 4608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !805, file: !351, line: 613, baseType: !334, size: 32, offset: 4640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !805, file: !351, line: 614, baseType: !339, size: 64, offset: 4672)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !805, file: !351, line: 615, baseType: !495, size: 64, offset: 4736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !805, file: !351, line: 616, baseType: !758, size: 64, offset: 4800)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !805, file: !351, line: 617, baseType: !339, size: 64, offset: 4864)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !805, file: !351, line: 618, baseType: !820, size: 64, offset: 4928)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !351, line: 602, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 598, size: 128, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !822, file: !351, line: 599, baseType: !334, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !822, file: !351, line: 600, baseType: !334, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !822, file: !351, line: 601, baseType: !372, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !805, file: !351, line: 619, baseType: !828, size: 64, offset: 4992)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !351, line: 607, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 604, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !830, file: !351, line: 605, baseType: !334, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !830, file: !351, line: 606, baseType: !372, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !805, file: !351, line: 620, baseType: !372, size: 64, offset: 5056)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !805, file: !351, line: 621, baseType: !369, size: 64, offset: 5120)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !805, file: !351, line: 622, baseType: !369, size: 64, offset: 5184)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !805, file: !351, line: 623, baseType: !611, size: 64, offset: 5248)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !805, file: !351, line: 623, baseType: !611, size: 64, offset: 5312)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !805, file: !351, line: 623, baseType: !611, size: 64, offset: 5376)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !805, file: !351, line: 624, baseType: !332, size: 32, offset: 5440)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !805, file: !351, line: 625, baseType: !842, size: 64, offset: 5504)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!402}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !805, file: !351, line: 626, baseType: !485, size: 64, offset: 5568)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !805, file: !351, line: 627, baseType: !611, size: 64, offset: 5632)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !805, file: !351, line: 628, baseType: !334, size: 32, offset: 5696)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !805, file: !351, line: 629, baseType: !427, size: 64, offset: 5760)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !805, file: !351, line: 630, baseType: !850, size: 32, offset: 5824)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !805, file: !351, line: 631, baseType: !334, size: 32, offset: 5856)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !805, file: !351, line: 631, baseType: !334, size: 32, offset: 5888)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !805, file: !351, line: 632, baseType: !332, size: 32, offset: 5920)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !805, file: !351, line: 633, baseType: !332, size: 32, offset: 5952)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !805, file: !351, line: 634, baseType: !438, size: 64, offset: 6016)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !805, file: !351, line: 634, baseType: !485, size: 64, offset: 6080)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !805, file: !351, line: 635, baseType: !456, size: 64, offset: 6144)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !591, file: !351, line: 100, baseType: !859, size: 64, offset: 3520)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!402, !382, !334, !334, !862, !865}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !864)
!864 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !591, file: !351, line: 101, baseType: !705, size: 64, offset: 3584)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !591, file: !351, line: 102, baseType: !868, size: 64, offset: 3648)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!402, !382, !374, !374, !658}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !591, file: !351, line: 103, baseType: !594, size: 64, offset: 3712)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !591, file: !351, line: 105, baseType: !873, size: 64, offset: 3776)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!402, !382, !374, !374, !657, !658}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !591, file: !351, line: 106, baseType: !705, size: 64, offset: 3840)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !591, file: !351, line: 107, baseType: !878, size: 64, offset: 3904)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!402, !382, !414}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !591, file: !351, line: 108, baseType: !882, size: 64, offset: 3968)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!402, !382, !885, !657, !658}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !427)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !591, file: !351, line: 109, baseType: !842, size: 64, offset: 4032)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !591, file: !351, line: 111, baseType: !888, size: 64, offset: 4096)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!402, !382, !382, !382, !369, !382}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !591, file: !351, line: 112, baseType: !892, size: 64, offset: 4160)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!402, !382, !382, !382, !382}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !591, file: !351, line: 113, baseType: !896, size: 64, offset: 4224)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!402, !382, !899, !899}
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !375, line: 30, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !375, line: 30, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !591, file: !351, line: 114, baseType: !594, size: 64, offset: 4288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !591, file: !351, line: 115, baseType: !709, size: 64, offset: 4352)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !591, file: !351, line: 117, baseType: !768, size: 64, offset: 4416)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !591, file: !351, line: 118, baseType: !768, size: 64, offset: 4480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !591, file: !351, line: 119, baseType: !882, size: 64, offset: 4544)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !591, file: !351, line: 120, baseType: !908, size: 64, offset: 4608)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!402, !382, !911, !682}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !591, file: !351, line: 121, baseType: !842, size: 64, offset: 4672)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !591, file: !351, line: 123, baseType: !914, size: 64, offset: 4736)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!402, !382, !334, !485}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !591, file: !351, line: 124, baseType: !918, size: 64, offset: 4800)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!402, !382, !803, !611, !485}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !591, file: !351, line: 125, baseType: !922, size: 64, offset: 4864)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!402, !536, !382}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !591, file: !351, line: 126, baseType: !608, size: 64, offset: 4928)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !591, file: !351, line: 127, baseType: !608, size: 64, offset: 4992)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !591, file: !351, line: 129, baseType: !928, size: 64, offset: 5056)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!402, !382, !758}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !591, file: !351, line: 130, baseType: !932, size: 64, offset: 5120)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!402, !382, !935, !935}
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !937, file: !60, line: 653, baseType: !334, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !937, file: !60, line: 653, baseType: !611, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !591, file: !351, line: 131, baseType: !932, size: 64, offset: 5184)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !591, file: !351, line: 132, baseType: !943, size: 64, offset: 5248)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!402, !382, !339, !339, !339}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !591, file: !351, line: 133, baseType: !878, size: 64, offset: 5312)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !591, file: !351, line: 135, baseType: !948, size: 64, offset: 5376)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!402, !382, !369, !682}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !591, file: !351, line: 136, baseType: !948, size: 64, offset: 5440)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !591, file: !351, line: 137, baseType: !953, size: 64, offset: 5504)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!402, !382, !682}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !591, file: !351, line: 138, baseType: !594, size: 64, offset: 5568)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !591, file: !351, line: 139, baseType: !958, size: 64, offset: 5632)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!402, !382, !961, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !591, file: !351, line: 141, baseType: !842, size: 64, offset: 5696)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !591, file: !351, line: 142, baseType: !964, size: 64, offset: 5760)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!402, !382, !382, !369, !382}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !591, file: !351, line: 143, baseType: !968, size: 64, offset: 5824)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!402, !382, !382, !382}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !591, file: !351, line: 144, baseType: !842, size: 64, offset: 5888)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !591, file: !351, line: 145, baseType: !964, size: 64, offset: 5952)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !591, file: !351, line: 147, baseType: !968, size: 64, offset: 6016)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !591, file: !351, line: 148, baseType: !842, size: 64, offset: 6080)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !591, file: !351, line: 149, baseType: !964, size: 64, offset: 6144)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !591, file: !351, line: 150, baseType: !968, size: 64, offset: 6208)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !591, file: !351, line: 151, baseType: !978, size: 64, offset: 6272)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!402, !382, !332}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !591, file: !351, line: 153, baseType: !705, size: 64, offset: 6336)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !591, file: !351, line: 154, baseType: !705, size: 64, offset: 6400)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !591, file: !351, line: 155, baseType: !705, size: 64, offset: 6464)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !591, file: !351, line: 156, baseType: !705, size: 64, offset: 6528)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !591, file: !351, line: 157, baseType: !878, size: 64, offset: 6592)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !591, file: !351, line: 159, baseType: !987, size: 64, offset: 6656)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!402, !382, !334, !599}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !591, file: !351, line: 160, baseType: !705, size: 64, offset: 6720)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !591, file: !351, line: 161, baseType: !705, size: 64, offset: 6784)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !591, file: !351, line: 162, baseType: !705, size: 64, offset: 6848)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !591, file: !351, line: 163, baseType: !705, size: 64, offset: 6912)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !591, file: !351, line: 165, baseType: !968, size: 64, offset: 6976)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !591, file: !351, line: 166, baseType: !968, size: 64, offset: 7040)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !591, file: !351, line: 167, baseType: !768, size: 64, offset: 7104)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !591, file: !351, line: 168, baseType: !998, size: 64, offset: 7168)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!402, !382, !611, !334}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !591, file: !351, line: 169, baseType: !1002, size: 64, offset: 7232)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!402, !382, !682, !339}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !591, file: !351, line: 171, baseType: !729, size: 64, offset: 7296)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !591, file: !351, line: 172, baseType: !705, size: 64, offset: 7360)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !591, file: !351, line: 173, baseType: !1008, size: 64, offset: 7424)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!402, !382, !339, !792}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !591, file: !351, line: 174, baseType: !868, size: 64, offset: 7488)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !591, file: !351, line: 175, baseType: !868, size: 64, offset: 7552)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !591, file: !351, line: 177, baseType: !608, size: 64, offset: 7616)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !591, file: !351, line: 178, baseType: !654, size: 64, offset: 7680)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !591, file: !351, line: 179, baseType: !608, size: 64, offset: 7744)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !591, file: !351, line: 180, baseType: !615, size: 64, offset: 7808)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !591, file: !351, line: 181, baseType: !1018, size: 64, offset: 7872)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!402, !382, !406, !657, !658}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !591, file: !351, line: 183, baseType: !928, size: 64, offset: 7936)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !591, file: !351, line: 184, baseType: !689, size: 64, offset: 8000)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !591, file: !351, line: 185, baseType: !1024, size: 64, offset: 8064)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!402, !382, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !591, file: !351, line: 186, baseType: !1029, size: 64, offset: 8128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!402, !382, !334, !597, !372}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !591, file: !351, line: 187, baseType: !748, size: 64, offset: 8192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !591, file: !351, line: 189, baseType: !1034, size: 64, offset: 8256)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!402, !382, !334, !334, !339, !599}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !591, file: !351, line: 190, baseType: !842, size: 64, offset: 8320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !591, file: !351, line: 191, baseType: !964, size: 64, offset: 8384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !591, file: !351, line: 192, baseType: !968, size: 64, offset: 8448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !591, file: !351, line: 193, baseType: !1041, size: 64, offset: 8512)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!402, !382, !800, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !351, line: 660, size: 5312, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1046, file: !351, line: 661, baseType: !387, size: 4480)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1046, file: !351, line: 661, baseType: !809, size: 32, offset: 4480)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1046, file: !351, line: 662, baseType: !334, size: 32, offset: 4512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1046, file: !351, line: 662, baseType: !334, size: 32, offset: 4544)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1046, file: !351, line: 662, baseType: !334, size: 32, offset: 4576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1046, file: !351, line: 663, baseType: !334, size: 32, offset: 4608)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1046, file: !351, line: 664, baseType: !334, size: 32, offset: 4640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1046, file: !351, line: 665, baseType: !339, size: 64, offset: 4672)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1046, file: !351, line: 666, baseType: !339, size: 64, offset: 4736)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1046, file: !351, line: 667, baseType: !334, size: 32, offset: 4800)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1046, file: !351, line: 668, baseType: !850, size: 32, offset: 4832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1046, file: !351, line: 670, baseType: !339, size: 64, offset: 4864)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1046, file: !351, line: 670, baseType: !339, size: 64, offset: 4928)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1046, file: !351, line: 671, baseType: !339, size: 64, offset: 4992)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1046, file: !351, line: 672, baseType: !339, size: 64, offset: 5056)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1046, file: !351, line: 673, baseType: !339, size: 64, offset: 5120)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1046, file: !351, line: 674, baseType: !334, size: 32, offset: 5184)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1046, file: !351, line: 675, baseType: !339, size: 64, offset: 5248)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !591, file: !351, line: 195, baseType: !1067, size: 64, offset: 8576)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!402, !1044, !382, !382}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !591, file: !351, line: 196, baseType: !1067, size: 64, offset: 8640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !591, file: !351, line: 197, baseType: !842, size: 64, offset: 8704)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !591, file: !351, line: 198, baseType: !964, size: 64, offset: 8768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !591, file: !351, line: 199, baseType: !968, size: 64, offset: 8832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !591, file: !351, line: 201, baseType: !1075, size: 64, offset: 8896)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!402, !382, !334, !334}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !591, file: !351, line: 202, baseType: !743, size: 64, offset: 8960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !591, file: !351, line: 203, baseType: !615, size: 64, offset: 9024)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !591, file: !351, line: 204, baseType: !797, size: 64, offset: 9088)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !591, file: !351, line: 205, baseType: !928, size: 64, offset: 9152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !591, file: !351, line: 206, baseType: !1083, size: 64, offset: 9216)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!402, !406, !382, !334, !657, !658}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !591, file: !351, line: 208, baseType: !1087, size: 64, offset: 9280)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!402, !334, !753}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !591, file: !351, line: 209, baseType: !968, size: 64, offset: 9344)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !591, file: !351, line: 210, baseType: !760, size: 64, offset: 9408)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !384, file: !351, line: 438, baseType: !1093, size: 64, offset: 13952)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !375, line: 60, baseType: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1095, file: !114, line: 241, baseType: !406, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !114, line: 242, baseType: !465, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1095, file: !114, line: 243, baseType: !334, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1095, file: !114, line: 243, baseType: !334, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1095, file: !114, line: 244, baseType: !334, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1095, file: !114, line: 244, baseType: !334, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1095, file: !114, line: 245, baseType: !339, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1095, file: !114, line: 246, baseType: !332, size: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1095, file: !114, line: 247, baseType: !334, size: 32, offset: 352)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1095, file: !114, line: 251, baseType: !334, size: 32, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1095, file: !114, line: 252, baseType: !899, size: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1095, file: !114, line: 253, baseType: !332, size: 32, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1095, file: !114, line: 254, baseType: !334, size: 32, offset: 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1095, file: !114, line: 254, baseType: !334, size: 32, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1095, file: !114, line: 255, baseType: !334, size: 32, offset: 608)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !384, file: !351, line: 438, baseType: !1093, size: 64, offset: 14016)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !384, file: !351, line: 439, baseType: !485, size: 64, offset: 14080)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !384, file: !351, line: 440, baseType: !1115, size: 32, offset: 14144)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !384, file: !351, line: 441, baseType: !332, size: 32, offset: 14176)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !384, file: !351, line: 442, baseType: !332, size: 32, offset: 14208)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !384, file: !351, line: 443, baseType: !1119, size: 448, offset: 14272)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 448, elements: !1121)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !427)
!1121 = !{!1122}
!1122 = !DISubrange(count: 7)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !384, file: !351, line: 444, baseType: !332, size: 32, offset: 14720)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !384, file: !351, line: 445, baseType: !332, size: 32, offset: 14752)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !384, file: !351, line: 446, baseType: !334, size: 32, offset: 14784)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !384, file: !351, line: 447, baseType: !487, size: 64, offset: 14848)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !384, file: !351, line: 448, baseType: !487, size: 64, offset: 14912)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !384, file: !351, line: 449, baseType: !665, size: 640, offset: 14976)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !384, file: !351, line: 450, baseType: !601, size: 32, offset: 15616)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !384, file: !351, line: 451, baseType: !1131, size: 2880, offset: 15680)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !351, line: 318, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !351, line: 319, size: 2880, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1153, !1154, !1159, !1164, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1179, !1180, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1212, !1213, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1236, !1237, !1238, !1242, !1243}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1132, file: !351, line: 320, baseType: !334, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1132, file: !351, line: 321, baseType: !334, size: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1132, file: !351, line: 322, baseType: !334, size: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1132, file: !351, line: 323, baseType: !334, size: 32, offset: 96)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1132, file: !351, line: 324, baseType: !334, size: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1132, file: !351, line: 325, baseType: !334, size: 32, offset: 160)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1132, file: !351, line: 326, baseType: !1141, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !351, line: 293, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !351, line: 295, size: 448, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1143, file: !351, line: 296, baseType: !1141, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1143, file: !351, line: 297, baseType: !372, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1143, file: !351, line: 297, baseType: !372, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1143, file: !351, line: 298, baseType: !339, size: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1143, file: !351, line: 298, baseType: !339, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1143, file: !351, line: 299, baseType: !334, size: 32, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1143, file: !351, line: 300, baseType: !334, size: 32, offset: 352)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1143, file: !351, line: 301, baseType: !334, size: 32, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1132, file: !351, line: 326, baseType: !1141, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1132, file: !351, line: 328, baseType: !1155, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!402, !382, !1158, !339}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1132, file: !351, line: 329, baseType: !1160, size: 64, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!402, !1158, !1163, !495, !495, !510, !339}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1132, file: !351, line: 330, baseType: !1165, size: 64, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!402, !1158}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1132, file: !351, line: 331, baseType: !1165, size: 64, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1132, file: !351, line: 334, baseType: !406, size: 64, offset: 576)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !351, line: 335, baseType: !465, size: 32, offset: 640)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1132, file: !351, line: 335, baseType: !465, size: 32, offset: 672)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1132, file: !351, line: 336, baseType: !465, size: 32, offset: 704)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1132, file: !351, line: 336, baseType: !465, size: 32, offset: 736)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1132, file: !351, line: 337, baseType: !1175, size: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !407, line: 339, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !407, line: 339, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1132, file: !351, line: 338, baseType: !1175, size: 64, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1132, file: !351, line: 339, baseType: !1181, size: 64, offset: 896)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !407, line: 341, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !407, line: 351, size: 192, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1183, file: !407, line: 354, baseType: !72, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1183, file: !407, line: 355, baseType: !72, size: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1183, file: !407, line: 356, baseType: !72, size: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1183, file: !407, line: 361, baseType: !72, size: 32, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1183, file: !407, line: 362, baseType: !556, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1132, file: !351, line: 340, baseType: !334, size: 32, offset: 960)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1132, file: !351, line: 340, baseType: !334, size: 32, offset: 992)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1132, file: !351, line: 341, baseType: !372, size: 64, offset: 1024)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1132, file: !351, line: 342, baseType: !339, size: 64, offset: 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1132, file: !351, line: 343, baseType: !510, size: 64, offset: 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1132, file: !351, line: 344, baseType: !495, size: 64, offset: 1216)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1132, file: !351, line: 345, baseType: !334, size: 32, offset: 1280)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1132, file: !351, line: 346, baseType: !1163, size: 64, offset: 1344)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1132, file: !351, line: 347, baseType: !332, size: 32, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1132, file: !351, line: 348, baseType: !334, size: 32, offset: 1440)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1132, file: !351, line: 351, baseType: !332, size: 32, offset: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1132, file: !351, line: 352, baseType: !332, size: 32, offset: 1504)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1132, file: !351, line: 353, baseType: !465, size: 32, offset: 1536)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1132, file: !351, line: 354, baseType: !465, size: 32, offset: 1568)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1132, file: !351, line: 355, baseType: !1163, size: 64, offset: 1600)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1132, file: !351, line: 356, baseType: !1163, size: 64, offset: 1664)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1132, file: !351, line: 357, baseType: !1207, size: 64, offset: 1728)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !351, line: 310, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 308, size: 32, elements: !1210)
!1210 = !{!1211}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1209, file: !351, line: 309, baseType: !334, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1132, file: !351, line: 357, baseType: !1207, size: 64, offset: 1792)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1132, file: !351, line: 358, baseType: !1214, size: 64, offset: 1856)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !351, line: 316, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 312, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1216, file: !351, line: 313, baseType: !485, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1216, file: !351, line: 314, baseType: !334, size: 32, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1216, file: !351, line: 315, baseType: !429, size: 8, offset: 96)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1132, file: !351, line: 359, baseType: !1214, size: 64, offset: 1920)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1132, file: !351, line: 360, baseType: !1214, size: 64, offset: 1984)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1132, file: !351, line: 361, baseType: !334, size: 32, offset: 2048)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1132, file: !351, line: 362, baseType: !465, size: 32, offset: 2080)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1132, file: !351, line: 363, baseType: !334, size: 32, offset: 2112)
