; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/wp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/wp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !1358, !367, !346, !427, !343, !1365, !502, !1366}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatMFFD", file: !36, line: 1798, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatMFFD", file: !324, line: 30, size: 5888, elements: !325)
!324 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/mffd/mffdimpl.h", directory: "/home/users/ndemeye/xSDK")
!325 = !{!326, !536, !560, !561, !562, !563, !564, !565, !566, !567, !1334, !1335, !1336, !1340, !1341, !1345, !1346, !1347, !1348, !1349, !1353, !1357}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !323, file: !324, line: 31, baseType: !327, size: 4480)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !328, line: 122, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !328, line: 73, size: 4480, elements: !330)
!330 = !{!331, !333, !388, !389, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !428, !430, !431, !432, !434, !435, !437, !439, !440, !441, !442, !443, !446, !448, !449, !450, !451, !452, !455, !457, !458, !459, !469, !471, !472, !476, !477, !526, !531, !533, !534, !535}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !329, file: !328, line: 74, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !329, file: !328, line: 75, baseType: !334, size: 448, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 448, elements: !386)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !328, line: 53, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 45, size: 448, elements: !337)
!337 = !{!338, !350, !358, !363, !370, !374, !381}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !336, file: !328, line: 46, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !343, !345}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !347, line: 330, baseType: !348)
!347 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !347, line: 330, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !328, line: 47, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!342, !343, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !355, line: 16, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !355, line: 16, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !328, line: 48, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!342, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !336, file: !328, line: 49, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!342, !343, !367, !343}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !336, file: !328, line: 50, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!342, !343, !367, !362}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !336, file: !328, line: 51, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!342, !343, !367, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !336, file: !328, line: 52, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!342, !343, !367, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !329, file: !328, line: 76, baseType: !346, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !328, line: 77, baseType: !390, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !329, file: !328, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !329, file: !328, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !329, file: !328, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !329, file: !328, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !328, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !329, file: !328, line: 80, baseType: !390, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !329, file: !328, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !329, file: !328, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !329, file: !328, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !329, file: !328, line: 84, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !329, file: !328, line: 85, baseType: !417, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !329, file: !328, line: 86, baseType: !417, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !329, file: !328, line: 87, baseType: !417, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !328, line: 88, baseType: !343, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !329, file: !328, line: 89, baseType: !398, size: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !328, line: 90, baseType: !417, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !329, file: !328, line: 91, baseType: !417, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !329, file: !328, line: 92, baseType: !390, size: 32, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !329, file: !328, line: 93, baseType: !427, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !329, file: !328, line: 94, baseType: !429, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !399)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !329, file: !328, line: 95, baseType: !390, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !329, file: !328, line: 95, baseType: !390, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !329, file: !328, line: 96, baseType: !433, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !329, file: !328, line: 96, baseType: !433, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !329, file: !328, line: 97, baseType: !436, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !329, file: !328, line: 97, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !329, file: !328, line: 98, baseType: !390, size: 32, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !329, file: !328, line: 98, baseType: !390, size: 32, offset: 2208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !329, file: !328, line: 99, baseType: !433, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !329, file: !328, line: 99, baseType: !433, size: 64, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !329, file: !328, line: 100, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !329, file: !328, line: 100, baseType: !447, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !329, file: !328, line: 101, baseType: !390, size: 32, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !329, file: !328, line: 101, baseType: !390, size: 32, offset: 2528)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !329, file: !328, line: 102, baseType: !433, size: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !329, file: !328, line: 102, baseType: !433, size: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !329, file: !328, line: 103, baseType: !453, size: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !445)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !329, file: !328, line: 103, baseType: !456, size: 64, offset: 2752)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !329, file: !328, line: 104, baseType: !385, size: 64, offset: 2816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !329, file: !328, line: 105, baseType: !390, size: 32, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !329, file: !328, line: 106, baseType: !460, size: 128, offset: 2944)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !467)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !328, line: 64, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 61, size: 128, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !463, file: !328, line: 62, baseType: !378, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !463, file: !328, line: 63, baseType: !427, size: 64, offset: 64)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !329, file: !328, line: 107, baseType: !470, size: 64, offset: 3072)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !467)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !329, file: !328, line: 108, baseType: !427, size: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !329, file: !328, line: 109, baseType: !473, size: 64, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!342, !427}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !329, file: !328, line: 111, baseType: !390, size: 32, offset: 3264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !329, file: !328, line: 112, baseType: !478, size: 320, offset: 3328)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !524)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!342, !482, !343, !427}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !485)
!485 = !{!486, !487, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !484, file: !10, line: 100, baseType: !390, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !10, line: 101, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !499, !500, !501, !505, !507, !509, !510, !511}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !490, file: !10, line: 84, baseType: !417, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !490, file: !10, line: 85, baseType: !417, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !10, line: 86, baseType: !427, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !490, file: !10, line: 87, baseType: !409, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !490, file: !10, line: 88, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !490, file: !10, line: 89, baseType: !369, size: 8, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !490, file: !10, line: 90, baseType: !417, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !490, file: !10, line: 91, baseType: !502, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !503, line: 46, baseType: !504)
!503 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!504 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !10, line: 92, baseType: !506, size: 32, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !10, line: 93, baseType: !508, size: 32, offset: 544)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !10, line: 94, baseType: !488, size: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !490, file: !10, line: 95, baseType: !417, size: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !490, file: !10, line: 96, baseType: !427, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !484, file: !10, line: 102, baseType: !417, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !484, file: !10, line: 102, baseType: !417, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !484, file: !10, line: 103, baseType: !417, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !484, file: !10, line: 104, baseType: !346, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !484, file: !10, line: 105, baseType: !506, size: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !484, file: !10, line: 106, baseType: !343, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !484, file: !10, line: 107, baseType: !521, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!524 = !{!525}
!525 = !DISubrange(count: 5)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !329, file: !328, line: 113, baseType: !527, size: 320, offset: 3648)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !524)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!342, !343, !427}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !329, file: !328, line: 114, baseType: !532, size: 320, offset: 3968)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 320, elements: !524)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !329, file: !328, line: 115, baseType: !506, size: 32, offset: 4288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !329, file: !328, line: 120, baseType: !521, size: 64, offset: 4352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !329, file: !328, line: 121, baseType: !506, size: 32, offset: 4416)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !323, file: !324, line: 31, baseType: !537, size: 256, offset: 4480)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 256, elements: !386)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MFOps", file: !324, line: 22, size: 256, elements: !539)
!539 = !{!540, !548, !552, !556}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "compute", scope: !538, file: !324, line: 23, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!342, !321, !544, !544, !453, !547}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !538, file: !324, line: 24, baseType: !549, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!342, !321, !354}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !538, file: !324, line: 25, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!342, !321}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !538, file: !324, line: 26, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!342, !482, !321}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !323, file: !324, line: 32, baseType: !544, size: 64, offset: 4736)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !323, file: !324, line: 33, baseType: !445, size: 64, offset: 4800)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "currenth", scope: !323, file: !324, line: 34, baseType: !454, size: 64, offset: 4864)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "historyh", scope: !323, file: !324, line: 35, baseType: !453, size: 64, offset: 4928)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ncurrenth", scope: !323, file: !324, line: 36, baseType: !390, size: 32, offset: 4992)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "maxcurrenth", scope: !323, file: !324, line: 36, baseType: !390, size: 32, offset: 5024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hctx", scope: !323, file: !324, line: 37, baseType: !427, size: 64, offset: 5056)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !323, file: !324, line: 38, baseType: !568, size: 64, offset: 5120)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !571, line: 436, size: 23424, elements: !572)
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!572 = !{!573, !574, !1077, !1097, !1098, !1099, !1101, !1102, !1103, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1230, !1231, !1247, !1248, !1249, !1250, !1251, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1286, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1332, !1333}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !570, file: !571, line: 437, baseType: !327, size: 4480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !570, file: !571, line: 437, baseType: !575, size: 9472, offset: 4480)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 9472, elements: !386)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !571, line: 32, size: 9472, elements: !577)
!577 = !{!578, !587, !591, !592, !596, !600, !601, !602, !603, !604, !605, !606, !630, !634, !639, !645, !664, !668, !672, !673, !678, !683, !684, !689, !693, !697, !701, !705, !709, !710, !711, !712, !713, !717, !718, !723, !724, !725, !726, !727, !732, !739, !744, !748, !752, !756, !760, !761, !765, !766, !773, !778, !779, !780, !781, !843, !851, !852, !856, !857, !861, !862, !866, !871, !872, !876, !880, !887, !888, !889, !890, !891, !892, !897, !898, !902, !906, !910, !911, !912, !916, !926, !927, !931, !932, !936, !937, !941, !942, !947, !948, !952, !956, !957, !958, !959, !960, !961, !962, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !980, !981, !982, !986, !990, !991, !992, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1013, !1017, !1018, !1022, !1023, !1024, !1025, !1051, !1055, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1071, !1075, !1076}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !576, file: !571, line: 34, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!342, !568, !390, !582, !390, !582, !584, !586}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !576, file: !571, line: 35, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!342, !568, !390, !436, !438, !456}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !576, file: !571, line: 36, baseType: !588, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !576, file: !571, line: 37, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!342, !568, !544, !544}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !576, file: !571, line: 38, baseType: !597, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!342, !568, !544, !544, !544}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !576, file: !571, line: 40, baseType: !593, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !576, file: !571, line: 41, baseType: !597, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !576, file: !571, line: 42, baseType: !593, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !576, file: !571, line: 43, baseType: !597, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !576, file: !571, line: 44, baseType: !593, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !576, file: !571, line: 46, baseType: !597, size: 64, offset: 640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !576, file: !571, line: 47, baseType: !607, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!342, !568, !610, !610, !614}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !611, line: 11, baseType: !612)
!611 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !611, line: 11, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !617, file: !36, line: 1227, baseType: !445, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !617, file: !36, line: 1228, baseType: !445, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !617, file: !36, line: 1229, baseType: !445, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !617, file: !36, line: 1230, baseType: !445, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !617, file: !36, line: 1231, baseType: !445, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !617, file: !36, line: 1232, baseType: !445, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !617, file: !36, line: 1233, baseType: !445, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !617, file: !36, line: 1234, baseType: !445, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !617, file: !36, line: 1236, baseType: !445, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !617, file: !36, line: 1237, baseType: !445, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !617, file: !36, line: 1238, baseType: !445, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !576, file: !571, line: 48, baseType: !631, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!342, !568, !610, !614}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !576, file: !571, line: 49, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!342, !568, !544, !445, !638, !445, !390, !390, !544}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !576, file: !571, line: 50, baseType: !640, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!342, !568, !643, !644}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !576, file: !571, line: 52, baseType: !646, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!342, !568, !649, !650}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !652, file: !36, line: 593, baseType: !392, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !652, file: !36, line: 594, baseType: !392, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !652, file: !36, line: 594, baseType: !392, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !652, file: !36, line: 594, baseType: !392, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !652, file: !36, line: 595, baseType: !392, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !652, file: !36, line: 596, baseType: !392, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !652, file: !36, line: 597, baseType: !392, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !652, file: !36, line: 598, baseType: !392, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !652, file: !36, line: 598, baseType: !392, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !652, file: !36, line: 599, baseType: !392, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !576, file: !571, line: 53, baseType: !665, size: 64, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!342, !568, !568, !547}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !576, file: !571, line: 54, baseType: !669, size: 64, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!342, !568, !544}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !576, file: !571, line: 55, baseType: !593, size: 64, offset: 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !576, file: !571, line: 56, baseType: !674, size: 64, offset: 1216)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!342, !568, !677, !444}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !576, file: !571, line: 58, baseType: !679, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!342, !568, !682}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !576, file: !571, line: 59, baseType: !679, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !576, file: !571, line: 60, baseType: !685, size: 64, offset: 1408)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!342, !568, !688, !506}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !576, file: !571, line: 61, baseType: !690, size: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!342, !568}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !576, file: !571, line: 63, baseType: !694, size: 64, offset: 1536)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!342, !568, !390, !582, !454, !544, !544}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !576, file: !571, line: 64, baseType: !698, size: 64, offset: 1600)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!342, !568, !568, !610, !610, !614}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !576, file: !571, line: 65, baseType: !702, size: 64, offset: 1664)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!342, !568, !568, !614}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !576, file: !571, line: 66, baseType: !706, size: 64, offset: 1728)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!342, !568, !568, !610, !614}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !576, file: !571, line: 67, baseType: !702, size: 64, offset: 1792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !576, file: !571, line: 69, baseType: !690, size: 64, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !576, file: !571, line: 70, baseType: !698, size: 64, offset: 1920)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !576, file: !571, line: 71, baseType: !706, size: 64, offset: 1984)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !576, file: !571, line: 72, baseType: !714, size: 64, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!342, !568, !644}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !576, file: !571, line: 73, baseType: !690, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !576, file: !571, line: 75, baseType: !719, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!342, !568, !722, !644}
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !576, file: !571, line: 76, baseType: !593, size: 64, offset: 2240)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !576, file: !571, line: 77, baseType: !593, size: 64, offset: 2304)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !576, file: !571, line: 78, baseType: !607, size: 64, offset: 2368)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !576, file: !571, line: 79, baseType: !631, size: 64, offset: 2432)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !576, file: !571, line: 81, baseType: !728, size: 64, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!342, !568, !454, !568, !731}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !576, file: !571, line: 82, baseType: !733, size: 64, offset: 2560)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!342, !568, !390, !736, !736, !643, !738}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !576, file: !571, line: 83, baseType: !740, size: 64, offset: 2624)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!342, !568, !390, !743, !390}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !576, file: !571, line: 84, baseType: !745, size: 64, offset: 2688)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!342, !568, !390, !582, !390, !582, !453}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !576, file: !571, line: 85, baseType: !749, size: 64, offset: 2752)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!342, !568, !568, !731}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !576, file: !571, line: 87, baseType: !753, size: 64, offset: 2816)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!342, !568, !544, !436}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !576, file: !571, line: 88, baseType: !757, size: 64, offset: 2880)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!342, !568, !454}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !576, file: !571, line: 89, baseType: !757, size: 64, offset: 2944)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !576, file: !571, line: 90, baseType: !762, size: 64, offset: 3008)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!342, !568, !544, !586}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !576, file: !571, line: 91, baseType: !694, size: 64, offset: 3072)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !576, file: !571, line: 93, baseType: !767, size: 64, offset: 3136)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!342, !568, !770}
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !576, file: !571, line: 94, baseType: !774, size: 64, offset: 3200)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!342, !568, !390, !506, !506, !436, !777, !777, !547}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !576, file: !571, line: 95, baseType: !774, size: 64, offset: 3264)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !576, file: !571, line: 96, baseType: !774, size: 64, offset: 3328)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !576, file: !571, line: 97, baseType: !774, size: 64, offset: 3392)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !576, file: !571, line: 99, baseType: !782, size: 64, offset: 3456)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!342, !568, !785, !788}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !611, line: 51, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !611, line: 51, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !571, line: 609, size: 6208, elements: !791)
!791 = !{!792, !793, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !812, !819, !820, !821, !822, !823, !824, !825, !826, !830, !831, !832, !833, !834, !836, !837, !838, !839, !840, !841, !842}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !790, file: !571, line: 610, baseType: !327, size: 4480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !790, file: !571, line: 610, baseType: !794, size: 32, offset: 4480)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !386)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !790, file: !571, line: 611, baseType: !390, size: 32, offset: 4512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !790, file: !571, line: 611, baseType: !390, size: 32, offset: 4544)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !790, file: !571, line: 611, baseType: !390, size: 32, offset: 4576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !790, file: !571, line: 612, baseType: !390, size: 32, offset: 4608)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !790, file: !571, line: 613, baseType: !390, size: 32, offset: 4640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !790, file: !571, line: 614, baseType: !436, size: 64, offset: 4672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !790, file: !571, line: 615, baseType: !438, size: 64, offset: 4736)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !790, file: !571, line: 616, baseType: !743, size: 64, offset: 4800)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !790, file: !571, line: 617, baseType: !436, size: 64, offset: 4864)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !790, file: !571, line: 618, baseType: !805, size: 64, offset: 4928)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !571, line: 602, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 598, size: 128, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !807, file: !571, line: 599, baseType: !390, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !807, file: !571, line: 600, baseType: !390, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !807, file: !571, line: 601, baseType: !453, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !790, file: !571, line: 619, baseType: !813, size: 64, offset: 4992)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !571, line: 607, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 604, size: 128, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !815, file: !571, line: 605, baseType: !390, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !815, file: !571, line: 606, baseType: !453, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !790, file: !571, line: 620, baseType: !453, size: 64, offset: 5056)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !790, file: !571, line: 621, baseType: !445, size: 64, offset: 5120)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !790, file: !571, line: 622, baseType: !445, size: 64, offset: 5184)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !790, file: !571, line: 623, baseType: !544, size: 64, offset: 5248)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !790, file: !571, line: 623, baseType: !544, size: 64, offset: 5312)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !790, file: !571, line: 623, baseType: !544, size: 64, offset: 5376)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !790, file: !571, line: 624, baseType: !506, size: 32, offset: 5440)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !790, file: !571, line: 625, baseType: !827, size: 64, offset: 5504)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!342}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !790, file: !571, line: 626, baseType: !427, size: 64, offset: 5568)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !790, file: !571, line: 627, baseType: !544, size: 64, offset: 5632)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !790, file: !571, line: 628, baseType: !390, size: 32, offset: 5696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !790, file: !571, line: 629, baseType: !367, size: 64, offset: 5760)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !790, file: !571, line: 630, baseType: !835, size: 32, offset: 5824)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !790, file: !571, line: 631, baseType: !390, size: 32, offset: 5856)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !790, file: !571, line: 631, baseType: !390, size: 32, offset: 5888)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !790, file: !571, line: 632, baseType: !506, size: 32, offset: 5920)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !790, file: !571, line: 633, baseType: !506, size: 32, offset: 5952)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !790, file: !571, line: 634, baseType: !378, size: 64, offset: 6016)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !790, file: !571, line: 634, baseType: !427, size: 64, offset: 6080)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !790, file: !571, line: 635, baseType: !398, size: 64, offset: 6144)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !576, file: !571, line: 100, baseType: !844, size: 64, offset: 3520)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!342, !568, !390, !390, !847, !850}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !849)
!849 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !576, file: !571, line: 101, baseType: !690, size: 64, offset: 3584)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !576, file: !571, line: 102, baseType: !853, size: 64, offset: 3648)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!342, !568, !610, !610, !644}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !576, file: !571, line: 103, baseType: !579, size: 64, offset: 3712)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !576, file: !571, line: 105, baseType: !858, size: 64, offset: 3776)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!342, !568, !610, !610, !643, !644}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !576, file: !571, line: 106, baseType: !690, size: 64, offset: 3840)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !576, file: !571, line: 107, baseType: !863, size: 64, offset: 3904)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!342, !568, !354}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !576, file: !571, line: 108, baseType: !867, size: 64, offset: 3968)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!342, !568, !870, !643, !644}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !367)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !576, file: !571, line: 109, baseType: !827, size: 64, offset: 4032)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !576, file: !571, line: 111, baseType: !873, size: 64, offset: 4096)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!342, !568, !568, !568, !445, !568}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !576, file: !571, line: 112, baseType: !877, size: 64, offset: 4160)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!342, !568, !568, !568, !568}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !576, file: !571, line: 113, baseType: !881, size: 64, offset: 4224)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!342, !568, !884, !884}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !611, line: 30, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !611, line: 30, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !576, file: !571, line: 114, baseType: !579, size: 64, offset: 4288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !576, file: !571, line: 115, baseType: !694, size: 64, offset: 4352)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !576, file: !571, line: 117, baseType: !753, size: 64, offset: 4416)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !576, file: !571, line: 118, baseType: !753, size: 64, offset: 4480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !576, file: !571, line: 119, baseType: !867, size: 64, offset: 4544)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !576, file: !571, line: 120, baseType: !893, size: 64, offset: 4608)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!342, !568, !896, !547}
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !576, file: !571, line: 121, baseType: !827, size: 64, offset: 4672)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !576, file: !571, line: 123, baseType: !899, size: 64, offset: 4736)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!342, !568, !390, !427}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !576, file: !571, line: 124, baseType: !903, size: 64, offset: 4800)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!342, !568, !788, !544, !427}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !576, file: !571, line: 125, baseType: !907, size: 64, offset: 4864)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!342, !482, !568}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !576, file: !571, line: 126, baseType: !593, size: 64, offset: 4928)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !576, file: !571, line: 127, baseType: !593, size: 64, offset: 4992)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !576, file: !571, line: 129, baseType: !913, size: 64, offset: 5056)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!342, !568, !743}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !576, file: !571, line: 130, baseType: !917, size: 64, offset: 5120)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!342, !568, !920, !920}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !922, file: !60, line: 653, baseType: !390, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !922, file: !60, line: 653, baseType: !544, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !576, file: !571, line: 131, baseType: !917, size: 64, offset: 5184)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !576, file: !571, line: 132, baseType: !928, size: 64, offset: 5248)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!342, !568, !436, !436, !436}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !576, file: !571, line: 133, baseType: !863, size: 64, offset: 5312)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !576, file: !571, line: 135, baseType: !933, size: 64, offset: 5376)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!342, !568, !445, !547}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !576, file: !571, line: 136, baseType: !933, size: 64, offset: 5440)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !576, file: !571, line: 137, baseType: !938, size: 64, offset: 5504)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!342, !568, !547}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !576, file: !571, line: 138, baseType: !579, size: 64, offset: 5568)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !576, file: !571, line: 139, baseType: !943, size: 64, offset: 5632)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!342, !568, !946, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !576, file: !571, line: 141, baseType: !827, size: 64, offset: 5696)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !576, file: !571, line: 142, baseType: !949, size: 64, offset: 5760)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!342, !568, !568, !445, !568}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !576, file: !571, line: 143, baseType: !953, size: 64, offset: 5824)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!342, !568, !568, !568}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !576, file: !571, line: 144, baseType: !827, size: 64, offset: 5888)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !576, file: !571, line: 145, baseType: !949, size: 64, offset: 5952)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !576, file: !571, line: 147, baseType: !953, size: 64, offset: 6016)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !576, file: !571, line: 148, baseType: !827, size: 64, offset: 6080)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !576, file: !571, line: 149, baseType: !949, size: 64, offset: 6144)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !576, file: !571, line: 150, baseType: !953, size: 64, offset: 6208)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !576, file: !571, line: 151, baseType: !963, size: 64, offset: 6272)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!342, !568, !506}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !576, file: !571, line: 153, baseType: !690, size: 64, offset: 6336)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !576, file: !571, line: 154, baseType: !690, size: 64, offset: 6400)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !576, file: !571, line: 155, baseType: !690, size: 64, offset: 6464)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !576, file: !571, line: 156, baseType: !690, size: 64, offset: 6528)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !576, file: !571, line: 157, baseType: !863, size: 64, offset: 6592)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !576, file: !571, line: 159, baseType: !972, size: 64, offset: 6656)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!342, !568, !390, !584}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !576, file: !571, line: 160, baseType: !690, size: 64, offset: 6720)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !576, file: !571, line: 161, baseType: !690, size: 64, offset: 6784)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !576, file: !571, line: 162, baseType: !690, size: 64, offset: 6848)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !576, file: !571, line: 163, baseType: !690, size: 64, offset: 6912)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !576, file: !571, line: 165, baseType: !953, size: 64, offset: 6976)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !576, file: !571, line: 166, baseType: !953, size: 64, offset: 7040)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !576, file: !571, line: 167, baseType: !753, size: 64, offset: 7104)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !576, file: !571, line: 168, baseType: !983, size: 64, offset: 7168)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!342, !568, !544, !390}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !576, file: !571, line: 169, baseType: !987, size: 64, offset: 7232)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!342, !568, !547, !436}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !576, file: !571, line: 171, baseType: !714, size: 64, offset: 7296)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !576, file: !571, line: 172, baseType: !690, size: 64, offset: 7360)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !576, file: !571, line: 173, baseType: !993, size: 64, offset: 7424)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!342, !568, !436, !777}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !576, file: !571, line: 174, baseType: !853, size: 64, offset: 7488)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !576, file: !571, line: 175, baseType: !853, size: 64, offset: 7552)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !576, file: !571, line: 177, baseType: !593, size: 64, offset: 7616)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !576, file: !571, line: 178, baseType: !640, size: 64, offset: 7680)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !576, file: !571, line: 179, baseType: !593, size: 64, offset: 7744)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !576, file: !571, line: 180, baseType: !597, size: 64, offset: 7808)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !576, file: !571, line: 181, baseType: !1003, size: 64, offset: 7872)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!342, !568, !346, !643, !644}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !576, file: !571, line: 183, baseType: !913, size: 64, offset: 7936)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !576, file: !571, line: 184, baseType: !674, size: 64, offset: 8000)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !576, file: !571, line: 185, baseType: !1009, size: 64, offset: 8064)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!342, !568, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !576, file: !571, line: 186, baseType: !1014, size: 64, offset: 8128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!342, !568, !390, !582, !453}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !576, file: !571, line: 187, baseType: !733, size: 64, offset: 8192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !576, file: !571, line: 189, baseType: !1019, size: 64, offset: 8256)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!342, !568, !390, !390, !436, !584}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !576, file: !571, line: 190, baseType: !827, size: 64, offset: 8320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !576, file: !571, line: 191, baseType: !949, size: 64, offset: 8384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !576, file: !571, line: 192, baseType: !953, size: 64, offset: 8448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !576, file: !571, line: 193, baseType: !1026, size: 64, offset: 8512)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!342, !568, !785, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !571, line: 660, size: 5312, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1031, file: !571, line: 661, baseType: !327, size: 4480)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1031, file: !571, line: 661, baseType: !794, size: 32, offset: 4480)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1031, file: !571, line: 662, baseType: !390, size: 32, offset: 4512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1031, file: !571, line: 662, baseType: !390, size: 32, offset: 4544)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1031, file: !571, line: 662, baseType: !390, size: 32, offset: 4576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1031, file: !571, line: 663, baseType: !390, size: 32, offset: 4608)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1031, file: !571, line: 664, baseType: !390, size: 32, offset: 4640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1031, file: !571, line: 665, baseType: !436, size: 64, offset: 4672)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1031, file: !571, line: 666, baseType: !436, size: 64, offset: 4736)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1031, file: !571, line: 667, baseType: !390, size: 32, offset: 4800)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1031, file: !571, line: 668, baseType: !835, size: 32, offset: 4832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1031, file: !571, line: 670, baseType: !436, size: 64, offset: 4864)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1031, file: !571, line: 670, baseType: !436, size: 64, offset: 4928)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1031, file: !571, line: 671, baseType: !436, size: 64, offset: 4992)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1031, file: !571, line: 672, baseType: !436, size: 64, offset: 5056)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1031, file: !571, line: 673, baseType: !436, size: 64, offset: 5120)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1031, file: !571, line: 674, baseType: !390, size: 32, offset: 5184)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1031, file: !571, line: 675, baseType: !436, size: 64, offset: 5248)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !576, file: !571, line: 195, baseType: !1052, size: 64, offset: 8576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!342, !1029, !568, !568}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !576, file: !571, line: 196, baseType: !1052, size: 64, offset: 8640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !576, file: !571, line: 197, baseType: !827, size: 64, offset: 8704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !576, file: !571, line: 198, baseType: !949, size: 64, offset: 8768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !576, file: !571, line: 199, baseType: !953, size: 64, offset: 8832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !576, file: !571, line: 201, baseType: !1060, size: 64, offset: 8896)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!342, !568, !390, !390}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !576, file: !571, line: 202, baseType: !728, size: 64, offset: 8960)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !576, file: !571, line: 203, baseType: !597, size: 64, offset: 9024)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !576, file: !571, line: 204, baseType: !782, size: 64, offset: 9088)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !576, file: !571, line: 205, baseType: !913, size: 64, offset: 9152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !576, file: !571, line: 206, baseType: !1068, size: 64, offset: 9216)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!342, !346, !568, !390, !643, !644}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !576, file: !571, line: 208, baseType: !1072, size: 64, offset: 9280)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!342, !390, !738}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !576, file: !571, line: 209, baseType: !953, size: 64, offset: 9344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !576, file: !571, line: 210, baseType: !745, size: 64, offset: 9408)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !570, file: !571, line: 438, baseType: !1078, size: 64, offset: 13952)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !611, line: 60, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1080, file: !114, line: 241, baseType: !346, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !114, line: 242, baseType: !407, size: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1080, file: !114, line: 243, baseType: !390, size: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1080, file: !114, line: 243, baseType: !390, size: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1080, file: !114, line: 244, baseType: !390, size: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1080, file: !114, line: 244, baseType: !390, size: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1080, file: !114, line: 245, baseType: !436, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1080, file: !114, line: 246, baseType: !506, size: 32, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1080, file: !114, line: 247, baseType: !390, size: 32, offset: 352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1080, file: !114, line: 251, baseType: !390, size: 32, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1080, file: !114, line: 252, baseType: !884, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1080, file: !114, line: 253, baseType: !506, size: 32, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1080, file: !114, line: 254, baseType: !390, size: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1080, file: !114, line: 254, baseType: !390, size: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1080, file: !114, line: 255, baseType: !390, size: 32, offset: 608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !570, file: !571, line: 438, baseType: !1078, size: 64, offset: 14016)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !571, line: 439, baseType: !427, size: 64, offset: 14080)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !570, file: !571, line: 440, baseType: !1100, size: 32, offset: 14144)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !570, file: !571, line: 441, baseType: !506, size: 32, offset: 14176)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !570, file: !571, line: 442, baseType: !506, size: 32, offset: 14208)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !570, file: !571, line: 443, baseType: !1104, size: 448, offset: 14272)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 448, elements: !1106)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !367)
!1106 = !{!1107}
!1107 = !DISubrange(count: 7)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !570, file: !571, line: 444, baseType: !506, size: 32, offset: 14720)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !570, file: !571, line: 445, baseType: !506, size: 32, offset: 14752)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !570, file: !571, line: 446, baseType: !390, size: 32, offset: 14784)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !570, file: !571, line: 447, baseType: !429, size: 64, offset: 14848)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !570, file: !571, line: 448, baseType: !429, size: 64, offset: 14912)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !570, file: !571, line: 449, baseType: !651, size: 640, offset: 14976)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !570, file: !571, line: 450, baseType: !586, size: 32, offset: 15616)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !570, file: !571, line: 451, baseType: !1116, size: 2880, offset: 15680)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !571, line: 318, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !571, line: 319, size: 2880, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1138, !1139, !1144, !1149, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1164, !1165, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1197, !1198, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221, !1222, !1223, !1227, !1228}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1117, file: !571, line: 320, baseType: !390, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1117, file: !571, line: 321, baseType: !390, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1117, file: !571, line: 322, baseType: !390, size: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1117, file: !571, line: 323, baseType: !390, size: 32, offset: 96)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1117, file: !571, line: 324, baseType: !390, size: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1117, file: !571, line: 325, baseType: !390, size: 32, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1117, file: !571, line: 326, baseType: !1126, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !571, line: 293, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !571, line: 295, size: 448, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !571, line: 296, baseType: !1126, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1128, file: !571, line: 297, baseType: !453, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1128, file: !571, line: 297, baseType: !453, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1128, file: !571, line: 298, baseType: !436, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1128, file: !571, line: 298, baseType: !436, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1128, file: !571, line: 299, baseType: !390, size: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1128, file: !571, line: 300, baseType: !390, size: 32, offset: 352)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1128, file: !571, line: 301, baseType: !390, size: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1117, file: !571, line: 326, baseType: !1126, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1117, file: !571, line: 328, baseType: !1140, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!342, !568, !1143, !436}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1117, file: !571, line: 329, baseType: !1145, size: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!342, !1143, !1148, !438, !438, !456, !436}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1117, file: !571, line: 330, baseType: !1150, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!342, !1143}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1117, file: !571, line: 331, baseType: !1150, size: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1117, file: !571, line: 334, baseType: !346, size: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !571, line: 335, baseType: !407, size: 32, offset: 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1117, file: !571, line: 335, baseType: !407, size: 32, offset: 672)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1117, file: !571, line: 336, baseType: !407, size: 32, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1117, file: !571, line: 336, baseType: !407, size: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1117, file: !571, line: 337, baseType: !1160, size: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !347, line: 339, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !347, line: 339, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1117, file: !571, line: 338, baseType: !1160, size: 64, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1117, file: !571, line: 339, baseType: !1166, size: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !347, line: 341, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !347, line: 351, size: 192, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1168, file: !347, line: 354, baseType: !72, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1168, file: !347, line: 355, baseType: !72, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1168, file: !347, line: 356, baseType: !72, size: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1168, file: !347, line: 361, baseType: !72, size: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1168, file: !347, line: 362, baseType: !502, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1117, file: !571, line: 340, baseType: !390, size: 32, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1117, file: !571, line: 340, baseType: !390, size: 32, offset: 992)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1117, file: !571, line: 341, baseType: !453, size: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1117, file: !571, line: 342, baseType: !436, size: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1117, file: !571, line: 343, baseType: !456, size: 64, offset: 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1117, file: !571, line: 344, baseType: !438, size: 64, offset: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1117, file: !571, line: 345, baseType: !390, size: 32, offset: 1280)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1117, file: !571, line: 346, baseType: !1148, size: 64, offset: 1344)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1117, file: !571, line: 347, baseType: !506, size: 32, offset: 1408)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1117, file: !571, line: 348, baseType: !390, size: 32, offset: 1440)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1117, file: !571, line: 351, baseType: !506, size: 32, offset: 1472)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1117, file: !571, line: 352, baseType: !506, size: 32, offset: 1504)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1117, file: !571, line: 353, baseType: !407, size: 32, offset: 1536)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1117, file: !571, line: 354, baseType: !407, size: 32, offset: 1568)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1117, file: !571, line: 355, baseType: !1148, size: 64, offset: 1600)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1117, file: !571, line: 356, baseType: !1148, size: 64, offset: 1664)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1117, file: !571, line: 357, baseType: !1192, size: 64, offset: 1728)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !571, line: 310, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 308, size: 32, elements: !1195)
!1195 = !{!1196}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1194, file: !571, line: 309, baseType: !390, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1117, file: !571, line: 357, baseType: !1192, size: 64, offset: 1792)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1117, file: !571, line: 358, baseType: !1199, size: 64, offset: 1856)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !571, line: 316, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 312, size: 128, elements: !1202)
!1202 = !{!1203, !1204, !1205}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1201, file: !571, line: 313, baseType: !427, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1201, file: !571, line: 314, baseType: !390, size: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1201, file: !571, line: 315, baseType: !369, size: 8, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1117, file: !571, line: 359, baseType: !1199, size: 64, offset: 1920)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1117, file: !571, line: 360, baseType: !1199, size: 64, offset: 1984)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1117, file: !571, line: 361, baseType: !390, size: 32, offset: 2048)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1117, file: !571, line: 362, baseType: !407, size: 32, offset: 2080)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1117, file: !571, line: 363, baseType: !390, size: 32, offset: 2112)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1117, file: !571, line: 364, baseType: !1148, size: 64, offset: 2176)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1117, file: !571, line: 365, baseType: !1166, size: 64, offset: 2240)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1117, file: !571, line: 366, baseType: !407, size: 32, offset: 2304)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1117, file: !571, line: 367, baseType: !407, size: 32, offset: 2336)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1117, file: !571, line: 368, baseType: !1160, size: 64, offset: 2368)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1117, file: !571, line: 369, baseType: !1160, size: 64, offset: 2432)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1117, file: !571, line: 370, baseType: !1218, size: 64, offset: 2496)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1117, file: !571, line: 371, baseType: !1218, size: 64, offset: 2560)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1117, file: !571, line: 372, baseType: !1218, size: 64, offset: 2624)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1117, file: !571, line: 373, baseType: !1224, size: 64, offset: 2688)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !347, line: 331, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !347, line: 331, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1117, file: !571, line: 374, baseType: !502, size: 64, offset: 2752)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1117, file: !571, line: 375, baseType: !1229, size: 64, offset: 2816)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !570, file: !571, line: 451, baseType: !1116, size: 2880, offset: 18560)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !570, file: !571, line: 452, baseType: !1232, size: 64, offset: 21440)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !571, line: 681, size: 4864, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1234, file: !571, line: 682, baseType: !327, size: 4480)
