; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ncg/snesncg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ncg/snesncg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!72 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!73 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 616, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 663, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 772, baseType: !7, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIEnumerator(name: "SNES_NCG_FR", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "SNES_NCG_PRP", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "SNES_NCG_HS", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "SNES_NCG_DY", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "SNES_NCG_CD", value: 4, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 155, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!117 = !{!118, !119, !120, !121, !122}
!118 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!122 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !124)
!124 = !{!125}
!125 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!126 = !{!127, !130, !134, !135, !335, !301, !336, !338, !346, !347, !207, !348, !351, !217, !28, !193, !7}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !131, line: 330, baseType: !132)
!131 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !131, line: 330, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !138, line: 73, size: 4480, elements: !139)
!138 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!139 = !{!140, !142, !188, !189, !191, !194, !195, !196, !197, !205, !206, !208, !212, !216, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !229, !230, !231, !233, !234, !236, !238, !239, !240, !241, !242, !245, !247, !248, !249, !250, !251, !254, !256, !257, !258, !268, !270, !271, !275, !276, !325, !330, !332, !333, !334}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !137, file: !138, line: 74, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !137, file: !138, line: 75, baseType: !143, size: 448, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 448, elements: !186)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !138, line: 53, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 45, size: 448, elements: !146)
!146 = !{!147, !153, !161, !166, !170, !174, !181}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !145, file: !138, line: 46, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !135, !152}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !145, file: !138, line: 47, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!151, !135, !157}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !158, line: 16, baseType: !159)
!158 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !158, line: 16, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !145, file: !138, line: 48, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!151, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !145, file: !138, line: 49, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!151, !135, !127, !135}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !145, file: !138, line: 50, baseType: !171, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!151, !135, !127, !165}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !145, file: !138, line: 51, baseType: !175, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!151, !135, !127, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !145, file: !138, line: 52, baseType: !182, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!151, !135, !127, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!186 = !{!187}
!187 = !DISubrange(count: 1)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !137, file: !138, line: 76, baseType: !130, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !138, line: 77, baseType: !190, size: 32, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !137, file: !138, line: 78, baseType: !192, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !193)
!193 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !137, file: !138, line: 78, baseType: !192, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !137, file: !138, line: 78, baseType: !192, size: 64, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !137, file: !138, line: 78, baseType: !192, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !138, line: 79, baseType: !198, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !201, line: 27, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !203, line: 43, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!204 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !137, file: !138, line: 80, baseType: !190, size: 32, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !137, file: !138, line: 81, baseType: !207, size: 32, offset: 992)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !137, file: !138, line: 82, baseType: !209, size: 64, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !137, file: !138, line: 83, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !137, file: !138, line: 84, baseType: !217, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !137, file: !138, line: 85, baseType: !217, size: 64, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !137, file: !138, line: 86, baseType: !217, size: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !137, file: !138, line: 87, baseType: !217, size: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !137, file: !138, line: 88, baseType: !135, size: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !137, file: !138, line: 89, baseType: !198, size: 64, offset: 1472)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !138, line: 90, baseType: !217, size: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !137, file: !138, line: 91, baseType: !217, size: 64, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !137, file: !138, line: 92, baseType: !190, size: 32, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !137, file: !138, line: 93, baseType: !134, size: 64, offset: 1728)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !137, file: !138, line: 94, baseType: !228, size: 64, offset: 1792)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !199)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !137, file: !138, line: 95, baseType: !190, size: 32, offset: 1856)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !137, file: !138, line: 95, baseType: !190, size: 32, offset: 1888)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !137, file: !138, line: 96, baseType: !232, size: 64, offset: 1920)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !137, file: !138, line: 96, baseType: !232, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !137, file: !138, line: 97, baseType: !235, size: 64, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !137, file: !138, line: 97, baseType: !237, size: 64, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !137, file: !138, line: 98, baseType: !190, size: 32, offset: 2176)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !137, file: !138, line: 98, baseType: !190, size: 32, offset: 2208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !137, file: !138, line: 99, baseType: !232, size: 64, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !137, file: !138, line: 99, baseType: !232, size: 64, offset: 2304)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !137, file: !138, line: 100, baseType: !243, size: 64, offset: 2368)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !193)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !137, file: !138, line: 100, baseType: !246, size: 64, offset: 2432)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !137, file: !138, line: 101, baseType: !190, size: 32, offset: 2496)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !137, file: !138, line: 101, baseType: !190, size: 32, offset: 2528)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !137, file: !138, line: 102, baseType: !232, size: 64, offset: 2560)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !137, file: !138, line: 102, baseType: !232, size: 64, offset: 2624)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !137, file: !138, line: 103, baseType: !252, size: 64, offset: 2688)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !244)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !137, file: !138, line: 103, baseType: !255, size: 64, offset: 2752)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !137, file: !138, line: 104, baseType: !185, size: 64, offset: 2816)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !137, file: !138, line: 105, baseType: !190, size: 32, offset: 2880)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !137, file: !138, line: 106, baseType: !259, size: 128, offset: 2944)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, elements: !266)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !138, line: 64, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 61, size: 128, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !262, file: !138, line: 62, baseType: !178, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !262, file: !138, line: 63, baseType: !134, size: 64, offset: 64)
!266 = !{!267}
!267 = !DISubrange(count: 2)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !137, file: !138, line: 107, baseType: !269, size: 64, offset: 3072)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !266)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !137, file: !138, line: 108, baseType: !134, size: 64, offset: 3136)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !137, file: !138, line: 109, baseType: !272, size: 64, offset: 3200)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!151, !134}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !137, file: !138, line: 111, baseType: !190, size: 32, offset: 3264)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !137, file: !138, line: 112, baseType: !277, size: 320, offset: 3328)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 320, elements: !323)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!151, !281, !135, !134}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !284)
!284 = !{!285, !286, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !283, file: !12, line: 100, baseType: !190, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !12, line: 101, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !298, !299, !300, !304, !306, !308, !309, !310}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !289, file: !12, line: 84, baseType: !217, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !289, file: !12, line: 85, baseType: !217, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !12, line: 86, baseType: !134, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !289, file: !12, line: 87, baseType: !209, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !289, file: !12, line: 88, baseType: !296, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !289, file: !12, line: 89, baseType: !129, size: 8, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !289, file: !12, line: 90, baseType: !217, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !289, file: !12, line: 91, baseType: !301, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !302, line: 46, baseType: !303)
!302 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!303 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !289, file: !12, line: 92, baseType: !305, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !12, line: 93, baseType: !307, size: 32, offset: 544)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !12, line: 94, baseType: !287, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !289, file: !12, line: 95, baseType: !217, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !289, file: !12, line: 96, baseType: !134, size: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !283, file: !12, line: 102, baseType: !217, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !283, file: !12, line: 102, baseType: !217, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !283, file: !12, line: 103, baseType: !217, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !283, file: !12, line: 104, baseType: !130, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 416)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !283, file: !12, line: 105, baseType: !305, size: 32, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !283, file: !12, line: 106, baseType: !135, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !283, file: !12, line: 107, baseType: !320, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!323 = !{!324}
!324 = !DISubrange(count: 5)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !137, file: !138, line: 113, baseType: !326, size: 320, offset: 3648)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 320, elements: !323)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!151, !135, !134}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !137, file: !138, line: 114, baseType: !331, size: 320, offset: 3968)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 320, elements: !323)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !137, file: !138, line: 115, baseType: !305, size: 32, offset: 4288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !137, file: !138, line: 120, baseType: !320, size: 64, offset: 4352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !137, file: !138, line: 121, baseType: !305, size: 32, offset: 4416)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !337, line: 1451, baseType: !178)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NCG", file: !340, line: 13, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/ncg/snesncgimpl.h", directory: "/home/users/ndemeye/xSDK")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 10, size: 128, elements: !342)
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !340, line: 11, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNCGType", file: !27, line: 777, baseType: !88)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !341, file: !340, line: 12, baseType: !157, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !123)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !131, line: 331, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !131, line: 331, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !131, line: 338, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !131, line: 338, flags: DIFlagFwdDecl)
!354 = !{!0}
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ncg/snesncg.c", directory: "/home/users/ndemeye/xSDK")
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 512, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 8)
!359 = !{i32 7, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{i32 7, !"PIC Level", i32 2}
!363 = !{i32 7, !"uwtable", i32 1}
!364 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!365 = distinct !DISubprogram(name: "SNESLineSearchCreate_NCGLinear", scope: !355, file: !355, line: 105, type: !366, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !636)
!366 = !DISubroutineType(types: !367)
!367 = !{!151, !368}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !371, line: 29, size: 8000, elements: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = !{!373, !375, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !633, !634, !635}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !371, line: 30, baseType: !374, size: 4480)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !138, line: 122, baseType: !137)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !371, line: 30, baseType: !376, size: 704, offset: 4480)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 704, elements: !186)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !371, line: 13, size: 704, elements: !378)
!378 = !{!379, !383, !386, !394, !581, !586, !590, !594, !595, !596, !597}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !377, file: !371, line: 14, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!151, !368, !157}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !377, file: !371, line: 15, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !27, line: 554, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !377, file: !371, line: 16, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!151, !368, !390, !390, !393, !134}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !116, line: 21, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !116, line: 21, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !377, file: !371, line: 17, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !27, line: 552, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!151, !399, !390}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !402, line: 38, size: 11648, elements: !403)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!403 = !{!404, !405, !468, !473, !474, !475, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !491, !492, !493, !495, !496, !497, !498, !499, !504, !506, !507, !508, !509, !510, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !546, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !401, file: !402, line: 39, baseType: !374, size: 4480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !401, file: !402, line: 39, baseType: !406, size: 1088, offset: 4480)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 1088, elements: !186)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !402, line: 12, size: 1088, elements: !408)
!408 = !{!409, !413, !417, !421, !427, !428, !432, !433, !437, !441, !442, !443, !448, !452, !456, !460, !467}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !407, file: !402, line: 13, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!151, !399, !390, !134}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !407, file: !402, line: 14, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!151, !390, !390, !134}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !407, file: !402, line: 15, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!151, !399, !190}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !407, file: !402, line: 16, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!151, !399, !190, !244, !244, !244, !425, !134}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !407, file: !402, line: 17, baseType: !272, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !407, file: !402, line: 18, baseType: !429, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!151, !399}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !407, file: !402, line: 19, baseType: !429, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !407, file: !402, line: 20, baseType: !434, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!151, !399, !157}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !407, file: !402, line: 21, baseType: !438, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!151, !281, !399}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !407, file: !402, line: 22, baseType: !429, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !407, file: !402, line: 23, baseType: !429, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !407, file: !402, line: 24, baseType: !444, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!151, !399, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !407, file: !402, line: 25, baseType: !449, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!151, !447}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !407, file: !402, line: 26, baseType: !453, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!151, !399, !390, !390}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !407, file: !402, line: 27, baseType: !457, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!151, !399, !390, !390, !134}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !407, file: !402, line: 28, baseType: !461, size: 64, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!151, !399, !390, !464, !464, !134}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !407, file: !402, line: 29, baseType: !434, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !401, file: !402, line: 40, baseType: !469, size: 64, offset: 5568)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !470, line: 14, baseType: !471)
!470 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !470, line: 14, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !401, file: !402, line: 41, baseType: !305, size: 32, offset: 5632)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !401, file: !402, line: 42, baseType: !399, size: 64, offset: 5696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !401, file: !402, line: 43, baseType: !476, size: 32, offset: 5760)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !401, file: !402, line: 44, baseType: !305, size: 32, offset: 5792)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !401, file: !402, line: 47, baseType: !134, size: 64, offset: 5824)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !401, file: !402, line: 49, baseType: !390, size: 64, offset: 5888)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !401, file: !402, line: 50, baseType: !390, size: 64, offset: 5952)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !401, file: !402, line: 52, baseType: !390, size: 64, offset: 6016)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !401, file: !402, line: 54, baseType: !464, size: 64, offset: 6080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !401, file: !402, line: 55, baseType: !464, size: 64, offset: 6144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !401, file: !402, line: 56, baseType: !464, size: 64, offset: 6208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !401, file: !402, line: 57, baseType: !134, size: 64, offset: 6272)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !401, file: !402, line: 58, baseType: !487, size: 64, offset: 6336)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !488, line: 22, baseType: !489)
!488 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !488, line: 22, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !401, file: !402, line: 59, baseType: !368, size: 64, offset: 6400)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !401, file: !402, line: 60, baseType: !305, size: 32, offset: 6464)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !401, file: !402, line: 61, baseType: !494, size: 32, offset: 6496)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !401, file: !402, line: 63, baseType: !390, size: 64, offset: 6528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !401, file: !402, line: 65, baseType: !390, size: 64, offset: 6592)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !401, file: !402, line: 66, baseType: !134, size: 64, offset: 6656)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !401, file: !402, line: 68, baseType: !244, size: 64, offset: 6720)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !401, file: !402, line: 74, baseType: !500, size: 320, offset: 6784)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !323)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!151, !399, !190, !244, !134}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !401, file: !402, line: 75, baseType: !505, size: 320, offset: 7104)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 320, elements: !323)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !401, file: !402, line: 76, baseType: !331, size: 320, offset: 7424)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !401, file: !402, line: 77, baseType: !190, size: 32, offset: 7744)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !401, file: !402, line: 78, baseType: !134, size: 64, offset: 7808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !401, file: !402, line: 79, baseType: !426, size: 32, offset: 7872)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !401, file: !402, line: 80, baseType: !511, size: 320, offset: 7936)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !323)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!151, !399, !134}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !401, file: !402, line: 81, baseType: !505, size: 320, offset: 8256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !401, file: !402, line: 82, baseType: !331, size: 320, offset: 8576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !401, file: !402, line: 83, baseType: !190, size: 32, offset: 8896)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !401, file: !402, line: 84, baseType: !305, size: 32, offset: 8928)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !401, file: !402, line: 88, baseType: !305, size: 32, offset: 8960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !401, file: !402, line: 89, baseType: !134, size: 64, offset: 9024)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !401, file: !402, line: 93, baseType: !190, size: 32, offset: 9088)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !401, file: !402, line: 94, baseType: !190, size: 32, offset: 9120)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !401, file: !402, line: 95, baseType: !190, size: 32, offset: 9152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !401, file: !402, line: 96, baseType: !190, size: 32, offset: 9184)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !401, file: !402, line: 97, baseType: !190, size: 32, offset: 9216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !401, file: !402, line: 98, baseType: !244, size: 64, offset: 9280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !401, file: !402, line: 99, baseType: !244, size: 64, offset: 9344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !401, file: !402, line: 100, baseType: !244, size: 64, offset: 9408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !401, file: !402, line: 101, baseType: !244, size: 64, offset: 9472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !401, file: !402, line: 102, baseType: !244, size: 64, offset: 9536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !401, file: !402, line: 103, baseType: !244, size: 64, offset: 9600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !401, file: !402, line: 104, baseType: !244, size: 64, offset: 9664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !401, file: !402, line: 105, baseType: !244, size: 64, offset: 9728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !401, file: !402, line: 106, baseType: !305, size: 32, offset: 9792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !401, file: !402, line: 107, baseType: !190, size: 32, offset: 9824)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !401, file: !402, line: 108, baseType: !190, size: 32, offset: 9856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !401, file: !402, line: 109, baseType: !190, size: 32, offset: 9888)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !401, file: !402, line: 110, baseType: !305, size: 32, offset: 9920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !401, file: !402, line: 111, baseType: !190, size: 32, offset: 9952)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !401, file: !402, line: 112, baseType: !305, size: 32, offset: 9984)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !401, file: !402, line: 113, baseType: !190, size: 32, offset: 10016)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !401, file: !402, line: 115, baseType: !305, size: 32, offset: 10048)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !401, file: !402, line: 117, baseType: !305, size: 32, offset: 10080)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !401, file: !402, line: 119, baseType: !545, size: 32, offset: 10112)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !401, file: !402, line: 120, baseType: !547, size: 32, offset: 10144)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !401, file: !402, line: 124, baseType: !190, size: 32, offset: 10176)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !401, file: !402, line: 125, baseType: !550, size: 64, offset: 10240)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !401, file: !402, line: 129, baseType: !190, size: 32, offset: 10304)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !401, file: !402, line: 130, baseType: !243, size: 64, offset: 10368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !401, file: !402, line: 132, baseType: !235, size: 64, offset: 10432)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !401, file: !402, line: 133, baseType: !190, size: 32, offset: 10496)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !401, file: !402, line: 134, baseType: !190, size: 32, offset: 10528)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !401, file: !402, line: 135, baseType: !305, size: 32, offset: 10560)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !401, file: !402, line: 136, baseType: !305, size: 32, offset: 10592)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !401, file: !402, line: 137, baseType: !305, size: 32, offset: 10624)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !401, file: !402, line: 140, baseType: !190, size: 32, offset: 10656)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !401, file: !402, line: 141, baseType: !190, size: 32, offset: 10688)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !401, file: !402, line: 143, baseType: !190, size: 32, offset: 10720)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !401, file: !402, line: 144, baseType: !190, size: 32, offset: 10752)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !401, file: !402, line: 146, baseType: !305, size: 32, offset: 10784)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !401, file: !402, line: 147, baseType: !305, size: 32, offset: 10816)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !401, file: !402, line: 148, baseType: !305, size: 32, offset: 10848)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !401, file: !402, line: 150, baseType: !305, size: 32, offset: 10880)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !401, file: !402, line: 151, baseType: !134, size: 64, offset: 10944)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !401, file: !402, line: 154, baseType: !244, size: 64, offset: 11008)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !401, file: !402, line: 155, baseType: !244, size: 64, offset: 11072)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !401, file: !402, line: 157, baseType: !550, size: 64, offset: 11136)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !401, file: !402, line: 158, baseType: !190, size: 32, offset: 11200)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !401, file: !402, line: 160, baseType: !305, size: 32, offset: 11232)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !401, file: !402, line: 161, baseType: !305, size: 32, offset: 11264)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !401, file: !402, line: 162, baseType: !190, size: 32, offset: 11296)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !401, file: !402, line: 164, baseType: !244, size: 64, offset: 11328)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !401, file: !402, line: 165, baseType: !390, size: 64, offset: 11392)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !401, file: !402, line: 165, baseType: !390, size: 64, offset: 11456)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !401, file: !402, line: 166, baseType: !190, size: 32, offset: 11520)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !401, file: !402, line: 167, baseType: !305, size: 32, offset: 11552)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !401, file: !402, line: 169, baseType: !305, size: 32, offset: 11584)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !377, file: !371, line: 18, baseType: !582, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !27, line: 553, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!151, !399, !390, !390, !243}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !377, file: !371, line: 19, baseType: !587, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!151, !368, !390, !390, !390, !393, !393, !134}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !377, file: !371, line: 20, baseType: !591, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!151, !281, !368}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !377, file: !371, line: 21, baseType: !385, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !377, file: !371, line: 22, baseType: !385, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !377, file: !371, line: 23, baseType: !385, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !377, file: !371, line: 24, baseType: !453, size: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !370, file: !371, line: 32, baseType: !399, size: 64, offset: 5184)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !371, line: 34, baseType: !134, size: 64, offset: 5248)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !370, file: !371, line: 36, baseType: !305, size: 32, offset: 5312)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !370, file: !371, line: 38, baseType: !390, size: 64, offset: 5376)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !370, file: !371, line: 39, baseType: !390, size: 64, offset: 5440)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !370, file: !371, line: 40, baseType: !390, size: 64, offset: 5504)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !370, file: !371, line: 41, baseType: !390, size: 64, offset: 5568)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !370, file: !371, line: 42, baseType: !390, size: 64, offset: 5632)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !370, file: !371, line: 44, baseType: !190, size: 32, offset: 5696)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !370, file: !371, line: 45, baseType: !550, size: 64, offset: 5760)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !370, file: !371, line: 47, baseType: !244, size: 64, offset: 5824)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !370, file: !371, line: 49, baseType: !305, size: 32, offset: 5888)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !370, file: !371, line: 50, baseType: !244, size: 64, offset: 5952)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !370, file: !371, line: 51, baseType: !244, size: 64, offset: 6016)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !370, file: !371, line: 52, baseType: !244, size: 64, offset: 6080)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !370, file: !371, line: 53, baseType: !614, size: 32, offset: 6144)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !27, line: 621, baseType: !74)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !370, file: !371, line: 54, baseType: !305, size: 32, offset: 6176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !370, file: !371, line: 56, baseType: !244, size: 64, offset: 6208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !370, file: !371, line: 57, baseType: !244, size: 64, offset: 6272)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !370, file: !371, line: 58, baseType: !244, size: 64, offset: 6336)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !370, file: !371, line: 59, baseType: !190, size: 32, offset: 6400)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !370, file: !371, line: 60, baseType: !244, size: 64, offset: 6464)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !370, file: !371, line: 61, baseType: !244, size: 64, offset: 6528)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !370, file: !371, line: 62, baseType: !244, size: 64, offset: 6592)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !370, file: !371, line: 63, baseType: !190, size: 32, offset: 6656)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !370, file: !371, line: 65, baseType: !244, size: 64, offset: 6720)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !370, file: !371, line: 67, baseType: !134, size: 64, offset: 6784)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !370, file: !371, line: 68, baseType: !134, size: 64, offset: 6848)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !370, file: !371, line: 70, baseType: !157, size: 64, offset: 6912)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !370, file: !371, line: 71, baseType: !629, size: 320, offset: 6976)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 320, elements: !323)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!151, !368, !134}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !370, file: !371, line: 72, baseType: !505, size: 320, offset: 7296)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !370, file: !371, line: 73, baseType: !331, size: 320, offset: 7616)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !370, file: !371, line: 74, baseType: !190, size: 32, offset: 7936)
!636 = !{!637}
!637 = !DILocalVariable(name: "linesearch", arg: 1, scope: !365, file: !355, line: 105, type: !368)
!638 = !DILocation(line: 0, scope: !365)
!639 = !DILocation(line: 107, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !355, line: 107, column: 3)
!641 = distinct !DILexicalBlock(scope: !642, file: !355, line: 107, column: 3)
!642 = distinct !DILexicalBlock(scope: !365, file: !355, line: 107, column: 3)
!643 = !{!644, !644, i64 0}
!644 = !{!"any pointer", !645, i64 0}
!645 = !{!"omnipotent char", !646, i64 0}
!646 = !{!"Simple C/C++ TBAA"}
!647 = !DILocation(line: 107, column: 3, scope: !641)
!648 = !DILocation(line: 107, column: 3, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !355, line: 107, column: 3)
!650 = distinct !DILexicalBlock(scope: !640, file: !355, line: 107, column: 3)
!651 = !{!652, !653, i64 1536}
!652 = !{!"", !645, i64 0, !645, i64 512, !645, i64 1024, !645, i64 1280, !653, i64 1536, !653, i64 1540, !645, i64 1544}
!653 = !{!"int", !645, i64 0}
!654 = !DILocation(line: 107, column: 3, scope: !650)
!655 = !DILocation(line: 107, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !649, file: !355, line: 107, column: 3)
!657 = !{!653, !653, i64 0}
!658 = !{!652, !653, i64 1540}
!659 = !DILocation(line: 114, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !661, file: !355, line: 114, column: 3)
!661 = distinct !DILexicalBlock(scope: !662, file: !355, line: 114, column: 3)
!662 = distinct !DILexicalBlock(scope: !365, file: !355, line: 114, column: 3)
!663 = !DILocation(line: 108, column: 20, scope: !365)
!664 = !DILocation(line: 108, column: 35, scope: !365)
!665 = !{!666, !644, i64 8}
!666 = !{!"_LineSearchOps", !644, i64 0, !644, i64 8, !644, i64 16, !644, i64 24, !644, i64 32, !644, i64 40, !644, i64 48, !644, i64 56, !644, i64 64, !644, i64 72, !644, i64 80}
!667 = !DILocation(line: 110, column: 20, scope: !365)
!668 = !DILocation(line: 112, column: 20, scope: !365)
!669 = !DILocation(line: 112, column: 35, scope: !365)
!670 = !{!666, !644, i64 0}
!671 = !DILocation(line: 114, column: 3, scope: !661)
!672 = !DILocation(line: 110, column: 35, scope: !365)
!673 = !DILocation(line: 114, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !355, line: 114, column: 3)
!675 = distinct !DILexicalBlock(scope: !660, file: !355, line: 114, column: 3)
!676 = !DILocation(line: 114, column: 3, scope: !675)
!677 = !DILocation(line: 114, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !355, line: 114, column: 3)
!679 = distinct !DILexicalBlock(scope: !674, file: !355, line: 114, column: 3)
!680 = !{!652, !645, i64 1544}
!681 = !DILocation(line: 114, column: 3, scope: !679)
!682 = !DILocation(line: 114, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !678, file: !355, line: 114, column: 3)
!684 = !DILocation(line: 114, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !674, file: !355, line: 114, column: 3)
!686 = !DILocation(line: 114, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !685, file: !355, line: 114, column: 3)
!688 = !DILocation(line: 114, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !355, line: 114, column: 3)
!690 = distinct !DILexicalBlock(scope: !687, file: !355, line: 114, column: 3)
!691 = !DILocation(line: 114, column: 3, scope: !690)
!692 = !DILocation(line: 114, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !689, file: !355, line: 114, column: 3)
!694 = !DILocation(line: 114, column: 3, scope: !662)
