; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/precon.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/precon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!271 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!272 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!274 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!275 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!276 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!277 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!278 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!279 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!280 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!281 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!282 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!283 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!284 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!285 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!286 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!287 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!288 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!289 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!290 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!291 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!292 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!293 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!294 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!295 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!296 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!297 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!302 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 70, baseType: !7, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318}
!316 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 451, baseType: !28, size: 32, elements: !320)
!320 = !{!321, !322, !323, !324, !325}
!321 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!322 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!323 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!324 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!325 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!326 = !{!327, !415, !345, !425, !28, !365, !405, !534, !537, !500, !540, !541, !542, !543, !544, !376, !7}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !330, line: 73, size: 4480, elements: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!331 = !{!332, !334, !386, !387, !389, !392, !393, !394, !395, !403, !404, !406, !410, !414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !428, !429, !430, !432, !433, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !449, !450, !453, !455, !456, !457, !467, !469, !470, !474, !475, !524, !529, !531, !532, !533}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !329, file: !330, line: 74, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !329, file: !330, line: 75, baseType: !335, size: 448, offset: 64)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 448, elements: !384)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !330, line: 53, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 45, size: 448, elements: !338)
!338 = !{!339, !348, !356, !361, !368, !372, !379}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !337, file: !330, line: 46, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !327, !344}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !238, line: 330, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !238, line: 330, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !337, file: !330, line: 47, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!343, !327, !352}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !353, line: 16, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !353, line: 16, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !337, file: !330, line: 48, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!343, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !337, file: !330, line: 49, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!343, !327, !365, !327}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !337, file: !330, line: 50, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!343, !327, !365, !360}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !337, file: !330, line: 51, baseType: !373, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!343, !327, !365, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !337, file: !330, line: 52, baseType: !380, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!343, !327, !365, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !329, file: !330, line: 76, baseType: !345, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !330, line: 77, baseType: !388, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !329, file: !330, line: 78, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !391)
!391 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !329, file: !330, line: 78, baseType: !390, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !329, file: !330, line: 78, baseType: !390, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !329, file: !330, line: 78, baseType: !390, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !330, line: 79, baseType: !396, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !399, line: 27, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !401, line: 43, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!402 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !329, file: !330, line: 80, baseType: !388, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !329, file: !330, line: 81, baseType: !405, size: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !329, file: !330, line: 82, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !329, file: !330, line: 83, baseType: !411, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !329, file: !330, line: 84, baseType: !415, size: 64, offset: 1152)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !329, file: !330, line: 85, baseType: !415, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !329, file: !330, line: 86, baseType: !415, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !329, file: !330, line: 87, baseType: !415, size: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !330, line: 88, baseType: !327, size: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !329, file: !330, line: 89, baseType: !396, size: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !330, line: 90, baseType: !415, size: 64, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !329, file: !330, line: 91, baseType: !415, size: 64, offset: 1600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !329, file: !330, line: 92, baseType: !388, size: 32, offset: 1664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !329, file: !330, line: 93, baseType: !425, size: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !329, file: !330, line: 94, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !397)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !329, file: !330, line: 95, baseType: !388, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !329, file: !330, line: 95, baseType: !388, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !329, file: !330, line: 96, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !329, file: !330, line: 96, baseType: !431, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !329, file: !330, line: 97, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !329, file: !330, line: 97, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !329, file: !330, line: 98, baseType: !388, size: 32, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !329, file: !330, line: 98, baseType: !388, size: 32, offset: 2208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !329, file: !330, line: 99, baseType: !431, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !329, file: !330, line: 99, baseType: !431, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !329, file: !330, line: 100, baseType: !442, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !391)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !329, file: !330, line: 100, baseType: !445, size: 64, offset: 2432)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !329, file: !330, line: 101, baseType: !388, size: 32, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !329, file: !330, line: 101, baseType: !388, size: 32, offset: 2528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !329, file: !330, line: 102, baseType: !431, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !329, file: !330, line: 102, baseType: !431, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !329, file: !330, line: 103, baseType: !451, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !443)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !329, file: !330, line: 103, baseType: !454, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !329, file: !330, line: 104, baseType: !383, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !329, file: !330, line: 105, baseType: !388, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !329, file: !330, line: 106, baseType: !458, size: 128, offset: 2944)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !465)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !330, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 61, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !330, line: 62, baseType: !376, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !461, file: !330, line: 63, baseType: !425, size: 64, offset: 64)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !329, file: !330, line: 107, baseType: !468, size: 64, offset: 3072)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 64, elements: !465)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !329, file: !330, line: 108, baseType: !425, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !329, file: !330, line: 109, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!343, !425}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !329, file: !330, line: 111, baseType: !388, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !329, file: !330, line: 112, baseType: !476, size: 320, offset: 3328)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !522)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!343, !480, !327, !425}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !483)
!483 = !{!484, !485, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !12, line: 100, baseType: !388, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !12, line: 101, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !497, !498, !499, !503, !505, !507, !508, !509}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !488, file: !12, line: 84, baseType: !415, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !488, file: !12, line: 85, baseType: !415, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !12, line: 86, baseType: !425, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !488, file: !12, line: 87, baseType: !407, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !488, file: !12, line: 88, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !488, file: !12, line: 89, baseType: !367, size: 8, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !488, file: !12, line: 90, baseType: !415, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !488, file: !12, line: 91, baseType: !500, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !501, line: 46, baseType: !502)
!501 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!502 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !12, line: 92, baseType: !504, size: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !12, line: 93, baseType: !506, size: 32, offset: 544)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !12, line: 94, baseType: !486, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !488, file: !12, line: 95, baseType: !415, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !488, file: !12, line: 96, baseType: !425, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !482, file: !12, line: 102, baseType: !415, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !482, file: !12, line: 102, baseType: !415, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !482, file: !12, line: 103, baseType: !415, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !482, file: !12, line: 104, baseType: !345, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !482, file: !12, line: 105, baseType: !504, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !482, file: !12, line: 105, baseType: !504, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !482, file: !12, line: 105, baseType: !504, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !482, file: !12, line: 106, baseType: !327, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !482, file: !12, line: 107, baseType: !519, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!522 = !{!523}
!523 = !DISubrange(count: 5)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !329, file: !330, line: 113, baseType: !525, size: 320, offset: 3648)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !522)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!343, !327, !425}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !329, file: !330, line: 114, baseType: !530, size: 320, offset: 3968)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 320, elements: !522)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !329, file: !330, line: 115, baseType: !504, size: 32, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !329, file: !330, line: 120, baseType: !519, size: 64, offset: 4352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !329, file: !330, line: 121, baseType: !504, size: 32, offset: 4416)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !238, line: 331, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !238, line: 331, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !238, line: 338, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !238, line: 338, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !330, line: 130, baseType: !357)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !330, line: 131, baseType: !349)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !545, line: 1451, baseType: !376)
!545 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!546 = !{!0, !547, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572}
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "PC_SetUp", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!549 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/interface/precon.c", directory: "/home/users/ndemeye/xSDK")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !551, line: 80, baseType: !28)
!551 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "PC_SetUpOnBlocks", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "PC_Apply", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "PC_MatApply", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "PC_ApplyCoarse", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "PC_ApplyMultiple", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "PC_ApplySymmetricLeft", scope: !2, file: !549, line: 10, type: !550, isLocal: false, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "PC_ApplySymmetricRight", scope: !2, file: !549, line: 11, type: !550, isLocal: false, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "PC_ModifySubMatrices", scope: !2, file: !549, line: 11, type: !550, isLocal: false, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "PC_ApplyOnBlocks", scope: !2, file: !549, line: 11, type: !550, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "PC_ApplyTransposeOnBlocks", scope: !2, file: !549, line: 11, type: !550, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "PetscMGLevelId", scope: !2, file: !549, line: 12, type: !388, isLocal: false, isDefinition: true)
!574 = !{i32 7, !"Dwarf Version", i32 4}
!575 = !{i32 2, !"Debug Info Version", i32 3}
!576 = !{i32 1, !"wchar_size", i32 4}
!577 = !{i32 7, !"PIC Level", i32 2}
!578 = !{i32 7, !"uwtable", i32 1}
!579 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!580 = distinct !DISubprogram(name: "PCGetDefaultType_Private", scope: !549, file: !549, line: 14, type: !581, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!581 = !DISubroutineType(types: !582)
!582 = !{!343, !583, !916}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !586, line: 37, size: 6720, elements: !587)
!586 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!587 = !{!588, !590, !885, !886, !887, !888, !889, !890, !892, !893, !894, !895, !896, !897, !898, !899, !900, !910, !911, !912, !913, !914, !915}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !585, file: !586, line: 38, baseType: !589, size: 4480)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !330, line: 122, baseType: !329)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !585, file: !586, line: 38, baseType: !591, size: 1152, offset: 4480)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 1152, elements: !384)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !586, line: 13, size: 1152, elements: !593)
!593 = !{!594, !598, !606, !613, !619, !624, !625, !629, !633, !869, !870, !875, !876, !877, !878, !879, !883, !884}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !592, file: !586, line: 14, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!343, !583}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !592, file: !586, line: 15, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!343, !583, !602, !602}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !603, line: 21, baseType: !604)
!603 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !603, line: 21, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !592, file: !586, line: 16, baseType: !607, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!343, !583, !610, !610}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !592, file: !586, line: 17, baseType: !614, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!343, !583, !602, !602, !602, !443, !443, !443, !388, !504, !434, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !592, file: !586, line: 18, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!343, !583, !623, !602, !602, !602}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !592, file: !586, line: 19, baseType: !599, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !592, file: !586, line: 20, baseType: !626, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!343, !583, !388, !602, !602, !602}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !592, file: !586, line: 21, baseType: !630, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!343, !480, !583}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !592, file: !586, line: 22, baseType: !634, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!343, !583, !637, !602, !602}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !245, line: 22, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !314, line: 75, size: 12800, elements: !640)
!640 = !{!641, !642, !688, !693, !694, !695, !696, !726, !727, !728, !729, !730, !731, !736, !737, !738, !739, !740, !741, !742, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !765, !771, !772, !773, !774, !779, !780, !781, !782, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !842, !843, !850, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !866, !867, !868}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !639, file: !314, line: 76, baseType: !589, size: 4480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !639, file: !314, line: 76, baseType: !643, size: 896, offset: 4480)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 896, elements: !384)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !314, line: 18, size: 896, elements: !645)
!645 = !{!646, !651, !655, !659, !663, !664, !668, !669, !673, !677, !681, !682, !686, !687}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !644, file: !314, line: 19, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!343, !637, !602, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !644, file: !314, line: 22, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!343, !637, !602, !602, !650}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !644, file: !314, line: 25, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!343, !637}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !644, file: !314, line: 26, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!343, !637, !610, !610}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !644, file: !314, line: 27, baseType: !656, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !644, file: !314, line: 28, baseType: !665, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!343, !480, !637}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !644, file: !314, line: 29, baseType: !656, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !644, file: !314, line: 30, baseType: !670, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!343, !637, !442, !442}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !644, file: !314, line: 31, baseType: !674, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!343, !637, !388, !442, !442, !434}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !644, file: !314, line: 32, baseType: !678, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!343, !637, !504, !504, !434, !650, !442, !442}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !644, file: !314, line: 33, baseType: !656, size: 64, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !644, file: !314, line: 34, baseType: !683, size: 64, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!343, !637, !352}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !644, file: !314, line: 35, baseType: !656, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !644, file: !314, line: 36, baseType: !683, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !639, file: !314, line: 77, baseType: !689, size: 64, offset: 5376)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !690, line: 14, baseType: !691)
!690 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !690, line: 14, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !639, file: !314, line: 78, baseType: !504, size: 32, offset: 5440)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !639, file: !314, line: 79, baseType: !504, size: 32, offset: 5472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !639, file: !314, line: 81, baseType: !388, size: 32, offset: 5504)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !639, file: !314, line: 82, baseType: !697, size: 64, offset: 5568)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !245, line: 752, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !314, line: 54, size: 5184, elements: !700)
!700 = !{!701, !702, !722, !723, !724, !725}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !699, file: !314, line: 55, baseType: !589, size: 4480)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !699, file: !314, line: 55, baseType: !703, size: 448, offset: 4480)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 448, elements: !384)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !314, line: 41, size: 448, elements: !705)
!705 = !{!706, !710, !711, !715, !716, !717, !721}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !704, file: !314, line: 42, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!343, !697, !602, !602}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !704, file: !314, line: 43, baseType: !707, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !704, file: !314, line: 44, baseType: !712, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!343, !697}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !704, file: !314, line: 45, baseType: !712, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !704, file: !314, line: 46, baseType: !712, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !704, file: !314, line: 47, baseType: !718, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!343, !697, !352}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !704, file: !314, line: 48, baseType: !712, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !699, file: !314, line: 56, baseType: !637, size: 64, offset: 4928)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !699, file: !314, line: 57, baseType: !610, size: 64, offset: 4992)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !699, file: !314, line: 58, baseType: !427, size: 64, offset: 5056)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !314, line: 59, baseType: !425, size: 64, offset: 5120)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !639, file: !314, line: 83, baseType: !504, size: 32, offset: 5632)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !639, file: !314, line: 84, baseType: !504, size: 32, offset: 5664)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !639, file: !314, line: 85, baseType: !504, size: 32, offset: 5696)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !639, file: !314, line: 86, baseType: !504, size: 32, offset: 5728)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !639, file: !314, line: 87, baseType: !623, size: 32, offset: 5760)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !639, file: !314, line: 88, baseType: !732, size: 384, offset: 5792)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 384, elements: !733)
!733 = !{!734, !735}
!734 = !DISubrange(count: 4)
!735 = !DISubrange(count: 3)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !639, file: !314, line: 89, baseType: !443, size: 64, offset: 6208)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !639, file: !314, line: 90, baseType: !443, size: 64, offset: 6272)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !639, file: !314, line: 91, baseType: !443, size: 64, offset: 6336)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !639, file: !314, line: 92, baseType: !443, size: 64, offset: 6400)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !639, file: !314, line: 93, baseType: !443, size: 64, offset: 6464)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !639, file: !314, line: 94, baseType: !443, size: 64, offset: 6528)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !639, file: !314, line: 95, baseType: !743, size: 32, offset: 6592)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !245, line: 540, baseType: !244)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !639, file: !314, line: 96, baseType: !504, size: 32, offset: 6624)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !639, file: !314, line: 98, baseType: !602, size: 64, offset: 6656)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !639, file: !314, line: 98, baseType: !602, size: 64, offset: 6720)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !639, file: !314, line: 102, baseType: !442, size: 64, offset: 6784)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !639, file: !314, line: 103, baseType: !442, size: 64, offset: 6848)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !639, file: !314, line: 104, baseType: !388, size: 32, offset: 6912)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !639, file: !314, line: 105, baseType: !388, size: 32, offset: 6944)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !639, file: !314, line: 106, baseType: !504, size: 32, offset: 6976)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !639, file: !314, line: 107, baseType: !442, size: 64, offset: 7040)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !639, file: !314, line: 108, baseType: !442, size: 64, offset: 7104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !639, file: !314, line: 109, baseType: !388, size: 32, offset: 7168)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !639, file: !314, line: 110, baseType: !388, size: 32, offset: 7200)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !639, file: !314, line: 111, baseType: !504, size: 32, offset: 7232)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !639, file: !314, line: 113, baseType: !388, size: 32, offset: 7264)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !639, file: !314, line: 114, baseType: !504, size: 32, offset: 7296)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !639, file: !314, line: 117, baseType: !388, size: 32, offset: 7328)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !639, file: !314, line: 120, baseType: !761, size: 320, offset: 7360)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 320, elements: !522)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!343, !637, !388, !443, !425}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !639, file: !314, line: 121, baseType: !766, size: 320, offset: 7680)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 320, elements: !522)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!343, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !639, file: !314, line: 122, baseType: !530, size: 320, offset: 8000)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !639, file: !314, line: 123, baseType: !388, size: 32, offset: 8320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !639, file: !314, line: 124, baseType: !504, size: 32, offset: 8352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !639, file: !314, line: 126, baseType: !775, size: 320, offset: 8384)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 320, elements: !522)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!343, !637, !425}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !639, file: !314, line: 127, baseType: !766, size: 320, offset: 8704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !639, file: !314, line: 128, baseType: !530, size: 320, offset: 9024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !639, file: !314, line: 129, baseType: !388, size: 32, offset: 9344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !639, file: !314, line: 131, baseType: !783, size: 64, offset: 9408)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!343, !637, !388, !443, !786, !425}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !639, file: !314, line: 132, baseType: !471, size: 64, offset: 9472)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !639, file: !314, line: 133, baseType: !425, size: 64, offset: 9536)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !639, file: !314, line: 135, baseType: !425, size: 64, offset: 9600)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !639, file: !314, line: 137, baseType: !583, size: 64, offset: 9664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !639, file: !314, line: 139, baseType: !425, size: 64, offset: 9728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9792)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9824)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9856)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9888)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9920)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9952)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 9984)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10016)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10048)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10080)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10112)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10176)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !639, file: !314, line: 142, baseType: !504, size: 32, offset: 10208)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10240)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10304)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10432)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10496)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10560)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10624)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10688)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10752)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10816)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10880)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 10944)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 11008)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !639, file: !314, line: 143, baseType: !352, size: 64, offset: 11072)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11136)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !269, line: 162, baseType: !268)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11168)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11200)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11232)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11264)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11296)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11328)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11360)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11392)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11424)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11456)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11488)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11520)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !639, file: !314, line: 144, baseType: !821, size: 32, offset: 11552)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !639, file: !314, line: 147, baseType: !388, size: 32, offset: 11584)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !639, file: !314, line: 148, baseType: !650, size: 64, offset: 11648)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !639, file: !314, line: 150, baseType: !838, size: 32, offset: 11712)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !314, line: 70, baseType: !313)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !639, file: !314, line: 151, baseType: !504, size: 32, offset: 11744)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !639, file: !314, line: 153, baseType: !388, size: 32, offset: 11776)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !639, file: !314, line: 154, baseType: !388, size: 32, offset: 11808)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !639, file: !314, line: 156, baseType: !504, size: 32, offset: 11840)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !639, file: !314, line: 161, baseType: !844, size: 192, offset: 11904)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !314, line: 157, size: 192, elements: !845)
!845 = !{!846, !847, !848, !849}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !844, file: !314, line: 158, baseType: !610, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !844, file: !314, line: 158, baseType: !610, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !844, file: !314, line: 159, baseType: !504, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !844, file: !314, line: 160, baseType: !504, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !639, file: !314, line: 163, baseType: !851, size: 32, offset: 12096)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !245, line: 451, baseType: !319)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !639, file: !314, line: 165, baseType: !623, size: 32, offset: 12128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !639, file: !314, line: 166, baseType: !851, size: 32, offset: 12160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !639, file: !314, line: 171, baseType: !504, size: 32, offset: 12192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !639, file: !314, line: 172, baseType: !504, size: 32, offset: 12224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !639, file: !314, line: 173, baseType: !504, size: 32, offset: 12256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !639, file: !314, line: 174, baseType: !602, size: 64, offset: 12288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !639, file: !314, line: 175, baseType: !602, size: 64, offset: 12352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !639, file: !314, line: 177, baseType: !388, size: 32, offset: 12416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !639, file: !314, line: 178, baseType: !504, size: 32, offset: 12448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !639, file: !314, line: 180, baseType: !352, size: 64, offset: 12480)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !639, file: !314, line: 182, baseType: !863, size: 64, offset: 12544)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!343, !637, !602, !602, !425}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !639, file: !314, line: 183, baseType: !863, size: 64, offset: 12608)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !639, file: !314, line: 184, baseType: !425, size: 64, offset: 12672)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !639, file: !314, line: 184, baseType: !425, size: 64, offset: 12736)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !592, file: !586, line: 23, baseType: !634, size: 64, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !592, file: !586, line: 24, baseType: !871, size: 64, offset: 640)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!343, !583, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !592, file: !586, line: 25, baseType: !599, size: 64, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !592, file: !586, line: 26, baseType: !599, size: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !592, file: !586, line: 27, baseType: !595, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !592, file: !586, line: 28, baseType: !595, size: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !592, file: !586, line: 29, baseType: !880, size: 64, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!343, !583, !352}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !592, file: !586, line: 30, baseType: !595, size: 64, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !592, file: !586, line: 31, baseType: !880, size: 64, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !585, file: !586, line: 39, baseType: !689, size: 64, offset: 5632)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !585, file: !586, line: 40, baseType: !388, size: 32, offset: 5696)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !585, file: !586, line: 41, baseType: !427, size: 64, offset: 5760)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !585, file: !586, line: 41, baseType: !427, size: 64, offset: 5824)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !585, file: !586, line: 42, baseType: !504, size: 32, offset: 5888)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !586, line: 43, baseType: !891, size: 32, offset: 5920)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !585, file: !586, line: 45, baseType: !388, size: 32, offset: 5952)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !585, file: !586, line: 46, baseType: !504, size: 32, offset: 5984)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !585, file: !586, line: 47, baseType: !610, size: 64, offset: 6016)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !585, file: !586, line: 47, baseType: !610, size: 64, offset: 6080)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !585, file: !586, line: 48, baseType: !602, size: 64, offset: 6144)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !585, file: !586, line: 48, baseType: !602, size: 64, offset: 6208)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !585, file: !586, line: 49, baseType: !504, size: 32, offset: 6272)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !585, file: !586, line: 50, baseType: !504, size: 32, offset: 6304)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !585, file: !586, line: 51, baseType: !901, size: 64, offset: 6336)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!343, !583, !388, !904, !904, !874, !425}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !907, line: 11, baseType: !908)
!907 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !907, line: 11, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !585, file: !586, line: 52, baseType: !425, size: 64, offset: 6400)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !586, line: 53, baseType: !425, size: 64, offset: 6464)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !585, file: !586, line: 54, baseType: !388, size: 32, offset: 6528)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !585, file: !586, line: 55, baseType: !425, size: 64, offset: 6592)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !585, file: !586, line: 56, baseType: !542, size: 32, offset: 6656)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !585, file: !586, line: 57, baseType: !542, size: 32, offset: 6688)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !929, !935, !936, !940, !944, !946}
!918 = !DILocalVariable(name: "pc", arg: 1, scope: !580, file: !549, line: 14, type: !583)
!919 = !DILocalVariable(name: "type", arg: 2, scope: !580, file: !549, line: 14, type: !916)
!920 = !DILocalVariable(name: "ierr", scope: !580, file: !549, line: 16, type: !343)
!921 = !DILocalVariable(name: "size", scope: !580, file: !549, line: 17, type: !405)
!922 = !DILocalVariable(name: "hasop", scope: !580, file: !549, line: 18, type: !504)
!923 = !DILocalVariable(name: "flg1", scope: !580, file: !549, line: 18, type: !504)
!924 = !DILocalVariable(name: "flg2", scope: !580, file: !549, line: 18, type: !504)
!925 = !DILocalVariable(name: "set", scope: !580, file: !549, line: 18, type: !504)
!926 = !DILocalVariable(name: "flg3", scope: !580, file: !549, line: 18, type: !504)
!927 = !DILocalVariable(name: "_7_errorcode", scope: !928, file: !549, line: 21, type: !343)
!928 = distinct !DILexicalBlock(scope: !580, file: !549, line: 21, column: 64)
!929 = !DILocalVariable(name: "_7_errorstring", scope: !930, file: !549, line: 21, type: !932)
!930 = distinct !DILexicalBlock(scope: !931, file: !549, line: 21, column: 64)
!931 = distinct !DILexicalBlock(scope: !928, file: !549, line: 21, column: 64)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 2048, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 256)
!935 = !DILocalVariable(name: "_7_resultlen", scope: !930, file: !549, line: 21, type: !405)
!936 = !DILocalVariable(name: "ierr__", scope: !937, file: !549, line: 23, type: !343)
!937 = distinct !DILexicalBlock(scope: !938, file: !549, line: 23, column: 70)
!938 = distinct !DILexicalBlock(scope: !939, file: !549, line: 22, column: 17)
!939 = distinct !DILexicalBlock(scope: !580, file: !549, line: 22, column: 7)
!940 = !DILocalVariable(name: "ierr__", scope: !941, file: !549, line: 25, type: !343)
!941 = distinct !DILexicalBlock(scope: !942, file: !549, line: 25, column: 75)
!942 = distinct !DILexicalBlock(scope: !943, file: !549, line: 24, column: 20)
!943 = distinct !DILexicalBlock(scope: !938, file: !549, line: 24, column: 9)
!944 = !DILocalVariable(name: "ierr__", scope: !945, file: !549, line: 26, type: !343)
!945 = distinct !DILexicalBlock(scope: !942, file: !549, line: 26, column: 75)
!946 = !DILocalVariable(name: "ierr__", scope: !947, file: !549, line: 27, type: !343)
!947 = distinct !DILexicalBlock(scope: !942, file: !549, line: 27, column: 55)
!948 = !DILocation(line: 0, scope: !580)
!949 = !DILocation(line: 17, column: 3, scope: !580)
!950 = !DILocation(line: 18, column: 3, scope: !580)
!951 = !DILocation(line: 20, column: 3, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !549, line: 20, column: 3)
!953 = distinct !DILexicalBlock(scope: !954, file: !549, line: 20, column: 3)
!954 = distinct !DILexicalBlock(scope: !580, file: !549, line: 20, column: 3)
!955 = !{!956, !956, i64 0}
!956 = !{!"any pointer", !957, i64 0}
!957 = !{!"omnipotent char", !958, i64 0}
!958 = !{!"Simple C/C++ TBAA"}
!959 = !DILocation(line: 20, column: 3, scope: !953)
!960 = !DILocation(line: 20, column: 3, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !549, line: 20, column: 3)
!962 = distinct !DILexicalBlock(scope: !952, file: !549, line: 20, column: 3)
!963 = !{!964, !965, i64 1536}
!964 = !{!"", !957, i64 0, !957, i64 512, !957, i64 1024, !957, i64 1280, !965, i64 1536, !965, i64 1540, !957, i64 1544}
!965 = !{!"int", !957, i64 0}
!966 = !DILocation(line: 20, column: 3, scope: !962)
!967 = !DILocation(line: 20, column: 3, scope: !968)
!968 = distinct !DILexicalBlock(scope: !961, file: !549, line: 20, column: 3)
!969 = !{!965, !965, i64 0}
!970 = !{!964, !965, i64 1540}
