; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcschurs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcschurs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._PCBDDCReuseSolvers = type { %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_PC*, %struct._p_PC*, %struct._p_IS*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_IS*, %struct._p_PetscSF*, i32, %struct._p_IS**, double*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec* }
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 657, baseType: !5, size: 32, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIEnumerator(name: "PETSC_SUBCOMM_GENERAL", value: 0, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_SUBCOMM_CONTIGUOUS", value: 1, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_SUBCOMM_INTERLACED", value: 2, isUnsigned: true)
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 149, baseType: !5, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIEnumerator(name: "IS_GTOLM_MASK", value: 0, isUnsigned: true)
!380 = !DIEnumerator(name: "IS_GTOLM_DROP", value: 1, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 726, baseType: !5, size: 32, elements: !382)
!382 = !{!383, !384}
!383 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !386)
!386 = !{!387, !388, !389, !390, !391}
!387 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!390 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!391 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!392 = !{!393, !396, !400, !401, !407, !410, !574, !491, !72, !465, !604, !395, !606, !607}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !397, line: 330, baseType: !398)
!397 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !397, line: 330, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !406)
!406 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !408, line: 46, baseType: !409)
!408 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!409 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !413, line: 73, size: 4480, elements: !414)
!413 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!414 = !{!415, !417, !463, !464, !466, !468, !469, !470, !471, !479, !480, !482, !486, !490, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !503, !504, !505, !507, !508, !510, !512, !513, !514, !515, !516, !518, !520, !521, !522, !523, !524, !526, !528, !529, !530, !540, !542, !543, !547, !548, !594, !599, !601, !602, !603}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !412, file: !413, line: 74, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !412, file: !413, line: 75, baseType: !418, size: 448, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 448, elements: !461)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !413, line: 53, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 45, size: 448, elements: !421)
!421 = !{!422, !428, !436, !441, !445, !449, !456}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !420, file: !413, line: 46, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !410, !427}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !420, file: !413, line: 47, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!426, !410, !432}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !433, line: 16, baseType: !434)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !433, line: 16, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !420, file: !413, line: 48, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!426, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !420, file: !413, line: 49, baseType: !442, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!426, !410, !393, !410}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !420, file: !413, line: 50, baseType: !446, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!426, !410, !393, !440}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !420, file: !413, line: 51, baseType: !450, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!426, !410, !393, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !420, file: !413, line: 52, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!426, !410, !393, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!461 = !{!462}
!462 = !DISubrange(count: 1)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !412, file: !413, line: 76, baseType: !396, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !413, line: 77, baseType: !465, size: 32, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !412, file: !413, line: 78, baseType: !467, size: 64, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !406)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !412, file: !413, line: 78, baseType: !467, size: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !412, file: !413, line: 78, baseType: !467, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !412, file: !413, line: 78, baseType: !467, size: 64, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !412, file: !413, line: 79, baseType: !472, size: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !475, line: 27, baseType: !476)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !477, line: 43, baseType: !478)
!477 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!478 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !412, file: !413, line: 80, baseType: !465, size: 32, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !412, file: !413, line: 81, baseType: !481, size: 32, offset: 992)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !412, file: !413, line: 82, baseType: !483, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !412, file: !413, line: 83, baseType: !487, size: 64, offset: 1088)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !412, file: !413, line: 84, baseType: !491, size: 64, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !412, file: !413, line: 85, baseType: !491, size: 64, offset: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !412, file: !413, line: 86, baseType: !491, size: 64, offset: 1280)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !412, file: !413, line: 87, baseType: !491, size: 64, offset: 1344)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !412, file: !413, line: 88, baseType: !410, size: 64, offset: 1408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !412, file: !413, line: 89, baseType: !472, size: 64, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !413, line: 90, baseType: !491, size: 64, offset: 1536)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !412, file: !413, line: 91, baseType: !491, size: 64, offset: 1600)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !412, file: !413, line: 92, baseType: !465, size: 32, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !412, file: !413, line: 93, baseType: !400, size: 64, offset: 1728)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !412, file: !413, line: 94, baseType: !502, size: 64, offset: 1792)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !473)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !412, file: !413, line: 95, baseType: !465, size: 32, offset: 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !412, file: !413, line: 95, baseType: !465, size: 32, offset: 1888)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !412, file: !413, line: 96, baseType: !506, size: 64, offset: 1920)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !412, file: !413, line: 96, baseType: !506, size: 64, offset: 1984)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !412, file: !413, line: 97, baseType: !509, size: 64, offset: 2048)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !412, file: !413, line: 97, baseType: !511, size: 64, offset: 2112)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !412, file: !413, line: 98, baseType: !465, size: 32, offset: 2176)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !412, file: !413, line: 98, baseType: !465, size: 32, offset: 2208)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !412, file: !413, line: 99, baseType: !506, size: 64, offset: 2240)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !412, file: !413, line: 99, baseType: !506, size: 64, offset: 2304)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !412, file: !413, line: 100, baseType: !517, size: 64, offset: 2368)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !412, file: !413, line: 100, baseType: !519, size: 64, offset: 2432)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !412, file: !413, line: 101, baseType: !465, size: 32, offset: 2496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !412, file: !413, line: 101, baseType: !465, size: 32, offset: 2528)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !412, file: !413, line: 102, baseType: !506, size: 64, offset: 2560)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !412, file: !413, line: 102, baseType: !506, size: 64, offset: 2624)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !412, file: !413, line: 103, baseType: !525, size: 64, offset: 2688)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !412, file: !413, line: 103, baseType: !527, size: 64, offset: 2752)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !412, file: !413, line: 104, baseType: !460, size: 64, offset: 2816)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !412, file: !413, line: 105, baseType: !465, size: 32, offset: 2880)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !412, file: !413, line: 106, baseType: !531, size: 128, offset: 2944)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 128, elements: !538)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !413, line: 64, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 61, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !534, file: !413, line: 62, baseType: !453, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !534, file: !413, line: 63, baseType: !400, size: 64, offset: 64)
!538 = !{!539}
!539 = !DISubrange(count: 2)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !412, file: !413, line: 107, baseType: !541, size: 64, offset: 3072)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 64, elements: !538)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !412, file: !413, line: 108, baseType: !400, size: 64, offset: 3136)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !412, file: !413, line: 109, baseType: !544, size: 64, offset: 3200)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!426, !400}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !412, file: !413, line: 111, baseType: !465, size: 32, offset: 3264)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !412, file: !413, line: 112, baseType: !549, size: 320, offset: 3328)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 320, elements: !592)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!426, !553, !410, !400}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !556)
!556 = !{!557, !558, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !555, file: !10, line: 100, baseType: !465, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !555, file: !10, line: 101, baseType: !559, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !570, !571, !572, !573, !575, !577, !578, !579}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !561, file: !10, line: 84, baseType: !491, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !561, file: !10, line: 85, baseType: !491, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !561, file: !10, line: 86, baseType: !400, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !561, file: !10, line: 87, baseType: !483, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !561, file: !10, line: 88, baseType: !568, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !561, file: !10, line: 89, baseType: !395, size: 8, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !561, file: !10, line: 90, baseType: !491, size: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !561, file: !10, line: 91, baseType: !407, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !561, file: !10, line: 92, baseType: !574, size: 32, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !561, file: !10, line: 93, baseType: !576, size: 32, offset: 544)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !561, file: !10, line: 94, baseType: !559, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !561, file: !10, line: 95, baseType: !491, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !561, file: !10, line: 96, baseType: !400, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !555, file: !10, line: 102, baseType: !491, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !555, file: !10, line: 102, baseType: !491, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !555, file: !10, line: 103, baseType: !491, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !555, file: !10, line: 104, baseType: !396, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !555, file: !10, line: 105, baseType: !574, size: 32, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !555, file: !10, line: 105, baseType: !574, size: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !555, file: !10, line: 105, baseType: !574, size: 32, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !555, file: !10, line: 106, baseType: !410, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !555, file: !10, line: 107, baseType: !589, size: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!592 = !{!593}
!593 = !DISubrange(count: 5)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !412, file: !413, line: 113, baseType: !595, size: 320, offset: 3648)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 320, elements: !592)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!426, !410, !400}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !412, file: !413, line: 114, baseType: !600, size: 320, offset: 3968)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 320, elements: !592)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !412, file: !413, line: 115, baseType: !574, size: 32, offset: 4288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !412, file: !413, line: 120, baseType: !589, size: 64, offset: 4352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !412, file: !413, line: 121, baseType: !574, size: 32, offset: 4416)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSolverType", file: !36, line: 126, baseType: !393)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !4, line: 140, baseType: !72)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!608 = !{i32 7, !"Dwarf Version", i32 4}
!609 = !{i32 2, !"Debug Info Version", i32 3}
!610 = !{i32 1, !"wchar_size", i32 4}
!611 = !{i32 7, !"PIC Level", i32 2}
!612 = !{i32 7, !"uwtable", i32 1}
!613 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!614 = distinct !DISubprogram(name: "PCBDDCReuseSolversBenignAdapt", scope: !615, file: !615, line: 12, type: !616, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1508)
!615 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bddc/bddcschurs.c", directory: "/home/users/ndemeye/xSDK")
!616 = !DISubroutineType(types: !617)
!617 = !{!426, !618, !651, !651, !574, !574}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCBDDCReuseSolvers", file: !619, line: 97, baseType: !620)
!619 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bddc/bddcstructs.h", directory: "/home/users/ndemeye/xSDK")
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCBDDCReuseSolvers", file: !619, line: 71, size: 1152, elements: !622)
!622 = !{!623, !1392, !1393, !1394, !1395, !1490, !1491, !1492, !1493, !1494, !1495, !1501, !1502, !1503, !1504, !1505, !1506, !1507}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !621, file: !619, line: 73, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !627, line: 436, size: 23424, elements: !628)
!627 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!628 = !{!629, !631, !1135, !1155, !1156, !1157, !1159, !1160, !1161, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1288, !1289, !1305, !1306, !1307, !1308, !1309, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1344, !1364, !1365, !1367, !1368, !1369, !1370, !1371, !1372, !1390, !1391}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !626, file: !627, line: 437, baseType: !630, size: 4480)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !413, line: 122, baseType: !412)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !626, file: !627, line: 437, baseType: !632, size: 9472, offset: 4480)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 9472, elements: !461)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !627, line: 32, size: 9472, elements: !634)
!634 = !{!635, !642, !646, !647, !654, !658, !659, !660, !661, !662, !663, !664, !688, !692, !697, !703, !722, !727, !731, !732, !737, !742, !743, !748, !752, !756, !760, !764, !768, !769, !770, !771, !772, !776, !777, !782, !783, !784, !785, !786, !791, !798, !803, !807, !811, !815, !819, !820, !824, !825, !832, !837, !838, !839, !840, !902, !910, !911, !915, !916, !920, !921, !925, !930, !931, !935, !939, !946, !947, !948, !949, !950, !951, !956, !957, !961, !965, !969, !970, !971, !975, !985, !986, !990, !991, !995, !996, !1000, !1001, !1006, !1007, !1011, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1045, !1049, !1050, !1051, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1065, !1066, !1067, !1071, !1075, !1076, !1080, !1081, !1082, !1083, !1109, !1113, !1114, !1115, !1116, !1117, !1121, !1122, !1123, !1124, !1125, !1129, !1133, !1134}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !633, file: !627, line: 34, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!426, !624, !465, !639, !465, !639, !402, !641}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !633, file: !627, line: 35, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!426, !624, !465, !509, !511, !527}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !633, file: !627, line: 36, baseType: !643, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !633, file: !627, line: 37, baseType: !648, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!426, !624, !651, !651}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !633, file: !627, line: 38, baseType: !655, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!426, !624, !651, !651, !651}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !633, file: !627, line: 40, baseType: !648, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !633, file: !627, line: 41, baseType: !655, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !633, file: !627, line: 42, baseType: !648, size: 64, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !633, file: !627, line: 43, baseType: !655, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !633, file: !627, line: 44, baseType: !648, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !633, file: !627, line: 46, baseType: !655, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !633, file: !627, line: 47, baseType: !665, size: 64, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!426, !624, !668, !668, !672}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !669, line: 11, baseType: !670)
!669 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !669, line: 11, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !675, file: !36, line: 1227, baseType: !405, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !675, file: !36, line: 1228, baseType: !405, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !675, file: !36, line: 1229, baseType: !405, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !675, file: !36, line: 1230, baseType: !405, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !675, file: !36, line: 1231, baseType: !405, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !675, file: !36, line: 1232, baseType: !405, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !675, file: !36, line: 1233, baseType: !405, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !675, file: !36, line: 1234, baseType: !405, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !675, file: !36, line: 1236, baseType: !405, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !675, file: !36, line: 1237, baseType: !405, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !675, file: !36, line: 1238, baseType: !405, size: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !633, file: !627, line: 48, baseType: !689, size: 64, offset: 768)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!426, !624, !668, !672}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !633, file: !627, line: 49, baseType: !693, size: 64, offset: 832)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!426, !624, !651, !405, !696, !405, !465, !465, !651}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !633, file: !627, line: 50, baseType: !698, size: 64, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!426, !624, !701, !702}
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !633, file: !627, line: 52, baseType: !704, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!426, !624, !707, !708}
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !710, file: !36, line: 593, baseType: !467, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !710, file: !36, line: 594, baseType: !467, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !710, file: !36, line: 594, baseType: !467, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !710, file: !36, line: 594, baseType: !467, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !710, file: !36, line: 595, baseType: !467, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !710, file: !36, line: 596, baseType: !467, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !710, file: !36, line: 597, baseType: !467, size: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !710, file: !36, line: 598, baseType: !467, size: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !710, file: !36, line: 598, baseType: !467, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !710, file: !36, line: 599, baseType: !467, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !633, file: !627, line: 53, baseType: !723, size: 64, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!426, !624, !624, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !633, file: !627, line: 54, baseType: !728, size: 64, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!426, !624, !651}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !633, file: !627, line: 55, baseType: !648, size: 64, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !633, file: !627, line: 56, baseType: !733, size: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!426, !624, !736, !517}
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !633, file: !627, line: 58, baseType: !738, size: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!426, !624, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !633, file: !627, line: 59, baseType: !738, size: 64, offset: 1344)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !633, file: !627, line: 60, baseType: !744, size: 64, offset: 1408)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!426, !624, !747, !574}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !633, file: !627, line: 61, baseType: !749, size: 64, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!426, !624}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !633, file: !627, line: 63, baseType: !753, size: 64, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!426, !624, !465, !639, !404, !651, !651}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !633, file: !627, line: 64, baseType: !757, size: 64, offset: 1600)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!426, !624, !624, !668, !668, !672}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !633, file: !627, line: 65, baseType: !761, size: 64, offset: 1664)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!426, !624, !624, !672}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !633, file: !627, line: 66, baseType: !765, size: 64, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!426, !624, !624, !668, !672}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !633, file: !627, line: 67, baseType: !761, size: 64, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !633, file: !627, line: 69, baseType: !749, size: 64, offset: 1856)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !633, file: !627, line: 70, baseType: !757, size: 64, offset: 1920)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !633, file: !627, line: 71, baseType: !765, size: 64, offset: 1984)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !633, file: !627, line: 72, baseType: !773, size: 64, offset: 2048)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!426, !624, !702}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !633, file: !627, line: 73, baseType: !749, size: 64, offset: 2112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !633, file: !627, line: 75, baseType: !778, size: 64, offset: 2176)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!426, !624, !781, !702}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !633, file: !627, line: 76, baseType: !648, size: 64, offset: 2240)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !633, file: !627, line: 77, baseType: !648, size: 64, offset: 2304)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !633, file: !627, line: 78, baseType: !665, size: 64, offset: 2368)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !633, file: !627, line: 79, baseType: !689, size: 64, offset: 2432)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !633, file: !627, line: 81, baseType: !787, size: 64, offset: 2496)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!426, !624, !404, !624, !790}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !633, file: !627, line: 82, baseType: !792, size: 64, offset: 2560)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!426, !624, !465, !795, !795, !701, !797}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !633, file: !627, line: 83, baseType: !799, size: 64, offset: 2624)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!426, !624, !465, !802, !465}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !633, file: !627, line: 84, baseType: !804, size: 64, offset: 2688)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!426, !624, !465, !639, !465, !639, !525}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !633, file: !627, line: 85, baseType: !808, size: 64, offset: 2752)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!426, !624, !624, !790}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !633, file: !627, line: 87, baseType: !812, size: 64, offset: 2816)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!426, !624, !651, !509}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !633, file: !627, line: 88, baseType: !816, size: 64, offset: 2880)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!426, !624, !404}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !633, file: !627, line: 89, baseType: !816, size: 64, offset: 2944)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !633, file: !627, line: 90, baseType: !821, size: 64, offset: 3008)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!426, !624, !651, !641}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !633, file: !627, line: 91, baseType: !753, size: 64, offset: 3072)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !633, file: !627, line: 93, baseType: !826, size: 64, offset: 3136)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!426, !624, !829}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !633, file: !627, line: 94, baseType: !833, size: 64, offset: 3200)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!426, !624, !465, !574, !574, !509, !836, !836, !726}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !633, file: !627, line: 95, baseType: !833, size: 64, offset: 3264)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !633, file: !627, line: 96, baseType: !833, size: 64, offset: 3328)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !633, file: !627, line: 97, baseType: !833, size: 64, offset: 3392)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !633, file: !627, line: 99, baseType: !841, size: 64, offset: 3456)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!426, !624, !844, !847}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !669, line: 51, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !669, line: 51, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !627, line: 609, size: 6208, elements: !850)
!850 = !{!851, !852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !871, !878, !879, !880, !881, !882, !883, !884, !885, !889, !890, !891, !892, !893, !895, !896, !897, !898, !899, !900, !901}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !849, file: !627, line: 610, baseType: !630, size: 4480)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !849, file: !627, line: 610, baseType: !853, size: 32, offset: 4480)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !461)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !849, file: !627, line: 611, baseType: !465, size: 32, offset: 4512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !849, file: !627, line: 611, baseType: !465, size: 32, offset: 4544)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !849, file: !627, line: 611, baseType: !465, size: 32, offset: 4576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !849, file: !627, line: 612, baseType: !465, size: 32, offset: 4608)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !849, file: !627, line: 613, baseType: !465, size: 32, offset: 4640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !849, file: !627, line: 614, baseType: !509, size: 64, offset: 4672)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !849, file: !627, line: 615, baseType: !511, size: 64, offset: 4736)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !849, file: !627, line: 616, baseType: !802, size: 64, offset: 4800)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !849, file: !627, line: 617, baseType: !509, size: 64, offset: 4864)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !849, file: !627, line: 618, baseType: !864, size: 64, offset: 4928)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !627, line: 602, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 598, size: 128, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !866, file: !627, line: 599, baseType: !465, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !866, file: !627, line: 600, baseType: !465, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !866, file: !627, line: 601, baseType: !525, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !849, file: !627, line: 619, baseType: !872, size: 64, offset: 4992)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !627, line: 607, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 604, size: 128, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !874, file: !627, line: 605, baseType: !465, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !874, file: !627, line: 606, baseType: !525, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !849, file: !627, line: 620, baseType: !525, size: 64, offset: 5056)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !849, file: !627, line: 621, baseType: !405, size: 64, offset: 5120)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !849, file: !627, line: 622, baseType: !405, size: 64, offset: 5184)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !849, file: !627, line: 623, baseType: !651, size: 64, offset: 5248)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !849, file: !627, line: 623, baseType: !651, size: 64, offset: 5312)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !849, file: !627, line: 623, baseType: !651, size: 64, offset: 5376)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !849, file: !627, line: 624, baseType: !574, size: 32, offset: 5440)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !849, file: !627, line: 625, baseType: !886, size: 64, offset: 5504)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!426}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !849, file: !627, line: 626, baseType: !400, size: 64, offset: 5568)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !849, file: !627, line: 627, baseType: !651, size: 64, offset: 5632)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !849, file: !627, line: 628, baseType: !465, size: 32, offset: 5696)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !849, file: !627, line: 629, baseType: !393, size: 64, offset: 5760)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !849, file: !627, line: 630, baseType: !894, size: 32, offset: 5824)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !849, file: !627, line: 631, baseType: !465, size: 32, offset: 5856)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !849, file: !627, line: 631, baseType: !465, size: 32, offset: 5888)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !849, file: !627, line: 632, baseType: !574, size: 32, offset: 5920)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !849, file: !627, line: 633, baseType: !574, size: 32, offset: 5952)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !849, file: !627, line: 634, baseType: !453, size: 64, offset: 6016)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !849, file: !627, line: 634, baseType: !400, size: 64, offset: 6080)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !849, file: !627, line: 635, baseType: !472, size: 64, offset: 6144)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !633, file: !627, line: 100, baseType: !903, size: 64, offset: 3520)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!426, !624, !465, !465, !906, !909}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !908)
!908 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !633, file: !627, line: 101, baseType: !749, size: 64, offset: 3584)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !633, file: !627, line: 102, baseType: !912, size: 64, offset: 3648)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!426, !624, !668, !668, !702}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !633, file: !627, line: 103, baseType: !636, size: 64, offset: 3712)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !633, file: !627, line: 105, baseType: !917, size: 64, offset: 3776)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!426, !624, !668, !668, !701, !702}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !633, file: !627, line: 106, baseType: !749, size: 64, offset: 3840)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !633, file: !627, line: 107, baseType: !922, size: 64, offset: 3904)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!426, !624, !432}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !633, file: !627, line: 108, baseType: !926, size: 64, offset: 3968)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!426, !624, !929, !701, !702}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !393)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !633, file: !627, line: 109, baseType: !886, size: 64, offset: 4032)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !633, file: !627, line: 111, baseType: !932, size: 64, offset: 4096)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!426, !624, !624, !624, !405, !624}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !633, file: !627, line: 112, baseType: !936, size: 64, offset: 4160)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!426, !624, !624, !624, !624}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !633, file: !627, line: 113, baseType: !940, size: 64, offset: 4224)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!426, !624, !943, !943}
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !669, line: 30, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !669, line: 30, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !633, file: !627, line: 114, baseType: !636, size: 64, offset: 4288)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !633, file: !627, line: 115, baseType: !753, size: 64, offset: 4352)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !633, file: !627, line: 117, baseType: !812, size: 64, offset: 4416)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !633, file: !627, line: 118, baseType: !812, size: 64, offset: 4480)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !633, file: !627, line: 119, baseType: !926, size: 64, offset: 4544)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !633, file: !627, line: 120, baseType: !952, size: 64, offset: 4608)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!426, !624, !955, !726}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !633, file: !627, line: 121, baseType: !886, size: 64, offset: 4672)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !633, file: !627, line: 123, baseType: !958, size: 64, offset: 4736)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!426, !624, !465, !400}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !633, file: !627, line: 124, baseType: !962, size: 64, offset: 4800)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!426, !624, !847, !651, !400}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !633, file: !627, line: 125, baseType: !966, size: 64, offset: 4864)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!426, !553, !624}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !633, file: !627, line: 126, baseType: !648, size: 64, offset: 4928)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !633, file: !627, line: 127, baseType: !648, size: 64, offset: 4992)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !633, file: !627, line: 129, baseType: !972, size: 64, offset: 5056)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!426, !624, !802}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !633, file: !627, line: 130, baseType: !976, size: 64, offset: 5120)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!426, !624, !979, !979}
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !981, file: !60, line: 653, baseType: !465, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !981, file: !60, line: 653, baseType: !651, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !633, file: !627, line: 131, baseType: !976, size: 64, offset: 5184)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !633, file: !627, line: 132, baseType: !987, size: 64, offset: 5248)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!426, !624, !509, !509, !509}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !633, file: !627, line: 133, baseType: !922, size: 64, offset: 5312)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !633, file: !627, line: 135, baseType: !992, size: 64, offset: 5376)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!426, !624, !405, !726}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !633, file: !627, line: 136, baseType: !992, size: 64, offset: 5440)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !633, file: !627, line: 137, baseType: !997, size: 64, offset: 5504)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!426, !624, !726}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !633, file: !627, line: 138, baseType: !636, size: 64, offset: 5568)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !633, file: !627, line: 139, baseType: !1002, size: 64, offset: 5632)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!426, !624, !1005, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !633, file: !627, line: 141, baseType: !886, size: 64, offset: 5696)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !633, file: !627, line: 142, baseType: !1008, size: 64, offset: 5760)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!426, !624, !624, !405, !624}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !633, file: !627, line: 143, baseType: !1012, size: 64, offset: 5824)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!426, !624, !624, !624}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !633, file: !627, line: 144, baseType: !886, size: 64, offset: 5888)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !633, file: !627, line: 145, baseType: !1008, size: 64, offset: 5952)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !633, file: !627, line: 147, baseType: !1012, size: 64, offset: 6016)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !633, file: !627, line: 148, baseType: !886, size: 64, offset: 6080)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !633, file: !627, line: 149, baseType: !1008, size: 64, offset: 6144)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !633, file: !627, line: 150, baseType: !1012, size: 64, offset: 6208)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !633, file: !627, line: 151, baseType: !1022, size: 64, offset: 6272)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!426, !624, !574}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !633, file: !627, line: 153, baseType: !749, size: 64, offset: 6336)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !633, file: !627, line: 154, baseType: !749, size: 64, offset: 6400)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !633, file: !627, line: 155, baseType: !749, size: 64, offset: 6464)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !633, file: !627, line: 156, baseType: !749, size: 64, offset: 6528)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !633, file: !627, line: 157, baseType: !922, size: 64, offset: 6592)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !633, file: !627, line: 159, baseType: !1031, size: 64, offset: 6656)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!426, !624, !465, !402}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !633, file: !627, line: 160, baseType: !749, size: 64, offset: 6720)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !633, file: !627, line: 161, baseType: !749, size: 64, offset: 6784)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !633, file: !627, line: 162, baseType: !749, size: 64, offset: 6848)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !633, file: !627, line: 163, baseType: !749, size: 64, offset: 6912)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !633, file: !627, line: 165, baseType: !1012, size: 64, offset: 6976)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !633, file: !627, line: 166, baseType: !1012, size: 64, offset: 7040)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !633, file: !627, line: 167, baseType: !812, size: 64, offset: 7104)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !633, file: !627, line: 168, baseType: !1042, size: 64, offset: 7168)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!426, !624, !651, !465}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !633, file: !627, line: 169, baseType: !1046, size: 64, offset: 7232)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!426, !624, !726, !509}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !633, file: !627, line: 171, baseType: !773, size: 64, offset: 7296)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !633, file: !627, line: 172, baseType: !749, size: 64, offset: 7360)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !633, file: !627, line: 173, baseType: !1052, size: 64, offset: 7424)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!426, !624, !509, !836}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !633, file: !627, line: 174, baseType: !912, size: 64, offset: 7488)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !633, file: !627, line: 175, baseType: !912, size: 64, offset: 7552)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !633, file: !627, line: 177, baseType: !648, size: 64, offset: 7616)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !633, file: !627, line: 178, baseType: !698, size: 64, offset: 7680)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !633, file: !627, line: 179, baseType: !648, size: 64, offset: 7744)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !633, file: !627, line: 180, baseType: !655, size: 64, offset: 7808)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !633, file: !627, line: 181, baseType: !1062, size: 64, offset: 7872)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!426, !624, !396, !701, !702}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !633, file: !627, line: 183, baseType: !972, size: 64, offset: 7936)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !633, file: !627, line: 184, baseType: !733, size: 64, offset: 8000)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !633, file: !627, line: 185, baseType: !1068, size: 64, offset: 8064)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!426, !624, !401}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !633, file: !627, line: 186, baseType: !1072, size: 64, offset: 8128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!426, !624, !465, !639, !525}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !633, file: !627, line: 187, baseType: !792, size: 64, offset: 8192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !633, file: !627, line: 189, baseType: !1077, size: 64, offset: 8256)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!426, !624, !465, !465, !509, !402}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !633, file: !627, line: 190, baseType: !886, size: 64, offset: 8320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !633, file: !627, line: 191, baseType: !1008, size: 64, offset: 8384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !633, file: !627, line: 192, baseType: !1012, size: 64, offset: 8448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !633, file: !627, line: 193, baseType: !1084, size: 64, offset: 8512)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!426, !624, !844, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !627, line: 660, size: 5312, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1089, file: !627, line: 661, baseType: !630, size: 4480)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1089, file: !627, line: 661, baseType: !853, size: 32, offset: 4480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1089, file: !627, line: 662, baseType: !465, size: 32, offset: 4512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1089, file: !627, line: 662, baseType: !465, size: 32, offset: 4544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1089, file: !627, line: 662, baseType: !465, size: 32, offset: 4576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1089, file: !627, line: 663, baseType: !465, size: 32, offset: 4608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1089, file: !627, line: 664, baseType: !465, size: 32, offset: 4640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1089, file: !627, line: 665, baseType: !509, size: 64, offset: 4672)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1089, file: !627, line: 666, baseType: !509, size: 64, offset: 4736)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1089, file: !627, line: 667, baseType: !465, size: 32, offset: 4800)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1089, file: !627, line: 668, baseType: !894, size: 32, offset: 4832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1089, file: !627, line: 670, baseType: !509, size: 64, offset: 4864)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1089, file: !627, line: 670, baseType: !509, size: 64, offset: 4928)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1089, file: !627, line: 671, baseType: !509, size: 64, offset: 4992)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1089, file: !627, line: 672, baseType: !509, size: 64, offset: 5056)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1089, file: !627, line: 673, baseType: !509, size: 64, offset: 5120)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1089, file: !627, line: 674, baseType: !465, size: 32, offset: 5184)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1089, file: !627, line: 675, baseType: !509, size: 64, offset: 5248)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !633, file: !627, line: 195, baseType: !1110, size: 64, offset: 8576)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!426, !1087, !624, !624}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !633, file: !627, line: 196, baseType: !1110, size: 64, offset: 8640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !633, file: !627, line: 197, baseType: !886, size: 64, offset: 8704)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !633, file: !627, line: 198, baseType: !1008, size: 64, offset: 8768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !633, file: !627, line: 199, baseType: !1012, size: 64, offset: 8832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !633, file: !627, line: 201, baseType: !1118, size: 64, offset: 8896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!426, !624, !465, !465}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !633, file: !627, line: 202, baseType: !787, size: 64, offset: 8960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !633, file: !627, line: 203, baseType: !655, size: 64, offset: 9024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !633, file: !627, line: 204, baseType: !841, size: 64, offset: 9088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !633, file: !627, line: 205, baseType: !972, size: 64, offset: 9152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !633, file: !627, line: 206, baseType: !1126, size: 64, offset: 9216)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!426, !396, !624, !465, !701, !702}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !633, file: !627, line: 208, baseType: !1130, size: 64, offset: 9280)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!426, !465, !797}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !633, file: !627, line: 209, baseType: !1012, size: 64, offset: 9344)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !633, file: !627, line: 210, baseType: !804, size: 64, offset: 9408)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !626, file: !627, line: 438, baseType: !1136, size: 64, offset: 13952)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !669, line: 60, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1138, file: !114, line: 241, baseType: !396, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !114, line: 242, baseType: !481, size: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1138, file: !114, line: 243, baseType: !465, size: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1138, file: !114, line: 243, baseType: !465, size: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1138, file: !114, line: 244, baseType: !465, size: 32, offset: 160)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1138, file: !114, line: 244, baseType: !465, size: 32, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1138, file: !114, line: 245, baseType: !509, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1138, file: !114, line: 246, baseType: !574, size: 32, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1138, file: !114, line: 247, baseType: !465, size: 32, offset: 352)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1138, file: !114, line: 251, baseType: !465, size: 32, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1138, file: !114, line: 252, baseType: !943, size: 64, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1138, file: !114, line: 253, baseType: !574, size: 32, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1138, file: !114, line: 254, baseType: !465, size: 32, offset: 544)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1138, file: !114, line: 254, baseType: !465, size: 32, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1138, file: !114, line: 255, baseType: !465, size: 32, offset: 608)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !626, file: !627, line: 438, baseType: !1136, size: 64, offset: 14016)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !626, file: !627, line: 439, baseType: !400, size: 64, offset: 14080)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !626, file: !627, line: 440, baseType: !1158, size: 32, offset: 14144)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !626, file: !627, line: 441, baseType: !574, size: 32, offset: 14176)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !626, file: !627, line: 442, baseType: !574, size: 32, offset: 14208)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !626, file: !627, line: 443, baseType: !1162, size: 448, offset: 14272)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 448, elements: !1164)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !393)
!1164 = !{!1165}
!1165 = !DISubrange(count: 7)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !626, file: !627, line: 444, baseType: !574, size: 32, offset: 14720)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !626, file: !627, line: 445, baseType: !574, size: 32, offset: 14752)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !626, file: !627, line: 446, baseType: !465, size: 32, offset: 14784)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !626, file: !627, line: 447, baseType: !502, size: 64, offset: 14848)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !626, file: !627, line: 448, baseType: !502, size: 64, offset: 14912)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !626, file: !627, line: 449, baseType: !709, size: 640, offset: 14976)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !626, file: !627, line: 450, baseType: !641, size: 32, offset: 15616)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !626, file: !627, line: 451, baseType: !1174, size: 2880, offset: 15680)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !627, line: 318, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !627, line: 319, size: 2880, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1196, !1197, !1202, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1222, !1223, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1255, !1256, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1279, !1280, !1281, !1285, !1286}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1175, file: !627, line: 320, baseType: !465, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1175, file: !627, line: 321, baseType: !465, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1175, file: !627, line: 322, baseType: !465, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1175, file: !627, line: 323, baseType: !465, size: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1175, file: !627, line: 324, baseType: !465, size: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1175, file: !627, line: 325, baseType: !465, size: 32, offset: 160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1175, file: !627, line: 326, baseType: !1184, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !627, line: 293, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !627, line: 295, size: 448, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1186, file: !627, line: 296, baseType: !1184, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1186, file: !627, line: 297, baseType: !525, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1186, file: !627, line: 297, baseType: !525, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1186, file: !627, line: 298, baseType: !509, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1186, file: !627, line: 298, baseType: !509, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1186, file: !627, line: 299, baseType: !465, size: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1186, file: !627, line: 300, baseType: !465, size: 32, offset: 352)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1186, file: !627, line: 301, baseType: !465, size: 32, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1175, file: !627, line: 326, baseType: !1184, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1175, file: !627, line: 328, baseType: !1198, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!426, !624, !1201, !509}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1175, file: !627, line: 329, baseType: !1203, size: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!426, !1201, !1206, !511, !511, !527, !509}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1175, file: !627, line: 330, baseType: !1208, size: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!426, !1201}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1175, file: !627, line: 331, baseType: !1208, size: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1175, file: !627, line: 334, baseType: !396, size: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !627, line: 335, baseType: !481, size: 32, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1175, file: !627, line: 335, baseType: !481, size: 32, offset: 672)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1175, file: !627, line: 336, baseType: !481, size: 32, offset: 704)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1175, file: !627, line: 336, baseType: !481, size: 32, offset: 736)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1175, file: !627, line: 337, baseType: !1218, size: 64, offset: 768)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !397, line: 339, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !397, line: 339, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1175, file: !627, line: 338, baseType: !1218, size: 64, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1175, file: !627, line: 339, baseType: !1224, size: 64, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !397, line: 341, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !397, line: 351, size: 192, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1226, file: !397, line: 354, baseType: !72, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1226, file: !397, line: 355, baseType: !72, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1226, file: !397, line: 356, baseType: !72, size: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1226, file: !397, line: 361, baseType: !72, size: 32, offset: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1226, file: !397, line: 362, baseType: !407, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1175, file: !627, line: 340, baseType: !465, size: 32, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1175, file: !627, line: 340, baseType: !465, size: 32, offset: 992)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1175, file: !627, line: 341, baseType: !525, size: 64, offset: 1024)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1175, file: !627, line: 342, baseType: !509, size: 64, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1175, file: !627, line: 343, baseType: !527, size: 64, offset: 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1175, file: !627, line: 344, baseType: !511, size: 64, offset: 1216)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1175, file: !627, line: 345, baseType: !465, size: 32, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1175, file: !627, line: 346, baseType: !1206, size: 64, offset: 1344)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1175, file: !627, line: 347, baseType: !574, size: 32, offset: 1408)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1175, file: !627, line: 348, baseType: !465, size: 32, offset: 1440)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1175, file: !627, line: 351, baseType: !574, size: 32, offset: 1472)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1175, file: !627, line: 352, baseType: !574, size: 32, offset: 1504)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1175, file: !627, line: 353, baseType: !481, size: 32, offset: 1536)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1175, file: !627, line: 354, baseType: !481, size: 32, offset: 1568)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1175, file: !627, line: 355, baseType: !1206, size: 64, offset: 1600)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1175, file: !627, line: 356, baseType: !1206, size: 64, offset: 1664)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1175, file: !627, line: 357, baseType: !1250, size: 64, offset: 1728)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !627, line: 310, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 308, size: 32, elements: !1253)
!1253 = !{!1254}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1252, file: !627, line: 309, baseType: !465, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1175, file: !627, line: 357, baseType: !1250, size: 64, offset: 1792)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1175, file: !627, line: 358, baseType: !1257, size: 64, offset: 1856)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !627, line: 316, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 312, size: 128, elements: !1260)
!1260 = !{!1261, !1262, !1263}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1259, file: !627, line: 313, baseType: !400, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1259, file: !627, line: 314, baseType: !465, size: 32, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1259, file: !627, line: 315, baseType: !395, size: 8, offset: 96)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1175, file: !627, line: 359, baseType: !1257, size: 64, offset: 1920)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1175, file: !627, line: 360, baseType: !1257, size: 64, offset: 1984)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1175, file: !627, line: 361, baseType: !465, size: 32, offset: 2048)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1175, file: !627, line: 362, baseType: !481, size: 32, offset: 2080)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1175, file: !627, line: 363, baseType: !465, size: 32, offset: 2112)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1175, file: !627, line: 364, baseType: !1206, size: 64, offset: 2176)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1175, file: !627, line: 365, baseType: !1224, size: 64, offset: 2240)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1175, file: !627, line: 366, baseType: !481, size: 32, offset: 2304)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1175, file: !627, line: 367, baseType: !481, size: 32, offset: 2336)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1175, file: !627, line: 368, baseType: !1218, size: 64, offset: 2368)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1175, file: !627, line: 369, baseType: !1218, size: 64, offset: 2432)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1175, file: !627, line: 370, baseType: !1276, size: 64, offset: 2496)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1175, file: !627, line: 371, baseType: !1276, size: 64, offset: 2560)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1175, file: !627, line: 372, baseType: !1276, size: 64, offset: 2624)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1175, file: !627, line: 373, baseType: !1282, size: 64, offset: 2688)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !397, line: 331, baseType: !1283)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !397, line: 331, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1175, file: !627, line: 374, baseType: !407, size: 64, offset: 2752)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1175, file: !627, line: 375, baseType: !1287, size: 64, offset: 2816)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !626, file: !627, line: 451, baseType: !1174, size: 2880, offset: 18560)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !626, file: !627, line: 452, baseType: !1290, size: 64, offset: 21440)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1291)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !627, line: 681, size: 4864, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1292, file: !627, line: 682, baseType: !630, size: 4480)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1292, file: !627, line: 682, baseType: !853, size: 32, offset: 4480)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1292, file: !627, line: 683, baseType: !574, size: 32, offset: 4512)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1292, file: !627, line: 684, baseType: !465, size: 32, offset: 4544)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1292, file: !627, line: 685, baseType: !1005, size: 64, offset: 4608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1292, file: !627, line: 686, baseType: !525, size: 64, offset: 4672)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1292, file: !627, line: 687, baseType: !1301, size: 64, offset: 4736)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!426, !1290, !651, !400}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1292, file: !627, line: 688, baseType: !400, size: 64, offset: 4800)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !626, file: !627, line: 453, baseType: !1290, size: 64, offset: 21504)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !626, file: !627, line: 454, baseType: !1290, size: 64, offset: 21568)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !626, file: !627, line: 455, baseType: !465, size: 32, offset: 21632)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !626, file: !627, line: 456, baseType: !574, size: 32, offset: 21664)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !626, file: !627, line: 457, baseType: !1310, size: 320, offset: 21696)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !627, line: 399, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 394, size: 320, elements: !1312)
