; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bjacobi/bjacobi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bjacobi/bjacobi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!254 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!255 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!256 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!257 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!258 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!259 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !261, line: 119, baseType: !5, size: 32, elements: !262)
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!263 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!264 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!265 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!266 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!267 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!268 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!269 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!270 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!271 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!272 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!273 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!274 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!275 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!276 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!277 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!278 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!279 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!280 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!281 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!282 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!283 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!284 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!285 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!286 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!287 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!288 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!289 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!290 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!291 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!292 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!293 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!294 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!295 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!296 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!297 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!302 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!305 = !{!306, !310, !311, !514, !346, !480, !396, !26, !515, !517, !386, !549, !552, !555, !431, !5, !670, !676}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !307, line: 330, baseType: !308)
!307 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !307, line: 330, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !314, line: 73, size: 4480, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !318, !367, !368, !370, !373, !374, !375, !376, !384, !385, !387, !391, !395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !412, !413, !415, !417, !418, !419, !420, !421, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !447, !449, !450, !454, !455, !504, !509, !511, !512, !513}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !313, file: !314, line: 74, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !313, file: !314, line: 75, baseType: !319, size: 448, offset: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 448, elements: !365)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !314, line: 53, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 45, size: 448, elements: !322)
!322 = !{!323, !329, !337, !342, !349, !353, !360}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !321, file: !314, line: 46, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !311, !328}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !321, file: !314, line: 47, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!327, !311, !333}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !334, line: 16, baseType: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !334, line: 16, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !321, file: !314, line: 48, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!327, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !321, file: !314, line: 49, baseType: !343, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!327, !311, !346, !311}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !321, file: !314, line: 50, baseType: !350, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!327, !311, !346, !341}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !321, file: !314, line: 51, baseType: !354, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!327, !311, !346, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !321, file: !314, line: 52, baseType: !361, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!327, !311, !346, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!365 = !{!366}
!366 = !DISubrange(count: 1)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !313, file: !314, line: 76, baseType: !306, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !314, line: 77, baseType: !369, size: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !313, file: !314, line: 78, baseType: !371, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !372)
!372 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !313, file: !314, line: 78, baseType: !371, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !313, file: !314, line: 78, baseType: !371, size: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !313, file: !314, line: 78, baseType: !371, size: 64, offset: 832)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !313, file: !314, line: 79, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !380, line: 27, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !382, line: 43, baseType: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!383 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !313, file: !314, line: 80, baseType: !369, size: 32, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !313, file: !314, line: 81, baseType: !386, size: 32, offset: 992)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !313, file: !314, line: 82, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !313, file: !314, line: 83, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !313, file: !314, line: 84, baseType: !396, size: 64, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !313, file: !314, line: 85, baseType: !396, size: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !313, file: !314, line: 86, baseType: !396, size: 64, offset: 1280)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !313, file: !314, line: 87, baseType: !396, size: 64, offset: 1344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !313, file: !314, line: 88, baseType: !311, size: 64, offset: 1408)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !313, file: !314, line: 89, baseType: !377, size: 64, offset: 1472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 90, baseType: !396, size: 64, offset: 1536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !313, file: !314, line: 91, baseType: !396, size: 64, offset: 1600)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !313, file: !314, line: 92, baseType: !369, size: 32, offset: 1664)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !313, file: !314, line: 93, baseType: !310, size: 64, offset: 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !314, line: 94, baseType: !407, size: 64, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !378)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !313, file: !314, line: 95, baseType: !369, size: 32, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !313, file: !314, line: 95, baseType: !369, size: 32, offset: 1888)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !313, file: !314, line: 96, baseType: !411, size: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !313, file: !314, line: 96, baseType: !411, size: 64, offset: 1984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !313, file: !314, line: 97, baseType: !414, size: 64, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !313, file: !314, line: 97, baseType: !416, size: 64, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !313, file: !314, line: 98, baseType: !369, size: 32, offset: 2176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !313, file: !314, line: 98, baseType: !369, size: 32, offset: 2208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !313, file: !314, line: 99, baseType: !411, size: 64, offset: 2240)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !313, file: !314, line: 99, baseType: !411, size: 64, offset: 2304)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !313, file: !314, line: 100, baseType: !422, size: 64, offset: 2368)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !372)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !313, file: !314, line: 100, baseType: !425, size: 64, offset: 2432)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !313, file: !314, line: 101, baseType: !369, size: 32, offset: 2496)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !313, file: !314, line: 101, baseType: !369, size: 32, offset: 2528)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !313, file: !314, line: 102, baseType: !411, size: 64, offset: 2560)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !313, file: !314, line: 102, baseType: !411, size: 64, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !313, file: !314, line: 103, baseType: !431, size: 64, offset: 2688)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !423)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !313, file: !314, line: 103, baseType: !434, size: 64, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !313, file: !314, line: 104, baseType: !364, size: 64, offset: 2816)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !313, file: !314, line: 105, baseType: !369, size: 32, offset: 2880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !313, file: !314, line: 106, baseType: !438, size: 128, offset: 2944)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 128, elements: !445)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !314, line: 64, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 61, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !441, file: !314, line: 62, baseType: !357, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !441, file: !314, line: 63, baseType: !310, size: 64, offset: 64)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !313, file: !314, line: 107, baseType: !448, size: 64, offset: 3072)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 64, elements: !445)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !313, file: !314, line: 108, baseType: !310, size: 64, offset: 3136)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !313, file: !314, line: 109, baseType: !451, size: 64, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!327, !310}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !313, file: !314, line: 111, baseType: !369, size: 32, offset: 3264)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !313, file: !314, line: 112, baseType: !456, size: 320, offset: 3328)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !502)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!327, !460, !311, !310}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !463)
!463 = !{!464, !465, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !462, file: !10, line: 100, baseType: !369, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !10, line: 101, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !477, !478, !479, !483, !485, !487, !488, !489}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !468, file: !10, line: 84, baseType: !396, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !10, line: 85, baseType: !396, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !468, file: !10, line: 86, baseType: !310, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !468, file: !10, line: 87, baseType: !388, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !468, file: !10, line: 88, baseType: !475, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !468, file: !10, line: 89, baseType: !348, size: 8, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !468, file: !10, line: 90, baseType: !396, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !468, file: !10, line: 91, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !481, line: 46, baseType: !482)
!481 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!482 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !468, file: !10, line: 92, baseType: !484, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !10, line: 93, baseType: !486, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !10, line: 94, baseType: !466, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !468, file: !10, line: 95, baseType: !396, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !468, file: !10, line: 96, baseType: !310, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !462, file: !10, line: 102, baseType: !396, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !462, file: !10, line: 102, baseType: !396, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !462, file: !10, line: 103, baseType: !396, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !462, file: !10, line: 104, baseType: !306, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !462, file: !10, line: 105, baseType: !484, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !462, file: !10, line: 106, baseType: !311, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !462, file: !10, line: 107, baseType: !499, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!502 = !{!503}
!503 = !DISubrange(count: 5)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !313, file: !314, line: 113, baseType: !505, size: 320, offset: 3648)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !502)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!327, !311, !310}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !313, file: !314, line: 114, baseType: !510, size: 320, offset: 3968)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 320, elements: !502)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !313, file: !314, line: 115, baseType: !484, size: 32, offset: 4288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !313, file: !314, line: 120, baseType: !499, size: 64, offset: 4352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !313, file: !314, line: 121, baseType: !484, size: 32, offset: 4416)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !516, line: 1451, baseType: !357)
!516 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BJacobi", file: !519, line: 21, baseType: !520)
!519 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bjacobi/bjacobi.h", directory: "/home/users/ndemeye/xSDK")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 11, size: 448, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !531, !532, !533, !534}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !520, file: !519, line: 12, baseType: !369, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "n_local", scope: !520, file: !519, line: 13, baseType: !369, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "first_local", scope: !520, file: !519, line: 14, baseType: !369, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "use_true_local", scope: !520, file: !519, line: 15, baseType: !484, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !520, file: !519, line: 16, baseType: !527, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !237, line: 22, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !237, line: 22, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !520, file: !519, line: 17, baseType: !310, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "l_lens", scope: !520, file: !519, line: 18, baseType: !414, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "g_lens", scope: !520, file: !519, line: 19, baseType: !414, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "psubcomm", scope: !520, file: !519, line: 20, baseType: !535, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcomm", file: !4, line: 656, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSubcomm", file: !516, line: 2653, size: 448, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !546, !548}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !537, file: !516, line: 2654, baseType: !306, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dupparent", scope: !537, file: !516, line: 2655, baseType: !306, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !537, file: !516, line: 2656, baseType: !306, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !537, file: !516, line: 2657, baseType: !386, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !537, file: !516, line: 2658, baseType: !386, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !537, file: !516, line: 2659, baseType: !545, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !516, line: 2660, baseType: !547, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcommType", file: !4, line: 657, baseType: !80)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "subcommprefix", scope: !537, file: !516, line: 2661, baseType: !396, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !307, line: 331, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !307, line: 331, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !307, line: 338, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !307, line: 338, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BJacobi_Multiproc", file: !519, line: 46, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 41, size: 320, elements: !558)
!558 = !{!559, !666, !667, !668, !669}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !557, file: !519, line: 42, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !563, line: 37, size: 6720, elements: !564)
!563 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!564 = !{!565, !567, !630, !635, !636, !637, !638, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !659, !660, !661, !662, !663, !665}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !562, file: !563, line: 38, baseType: !566, size: 4480)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !314, line: 122, baseType: !313)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !562, file: !563, line: 38, baseType: !568, size: 1152, offset: 4480)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1152, elements: !365)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !563, line: 13, size: 1152, elements: !570)
!570 = !{!571, !575, !583, !590, !596, !601, !602, !606, !610, !614, !615, !620, !621, !622, !623, !624, !628, !629}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !569, file: !563, line: 14, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!327, !560}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !569, file: !563, line: 15, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!327, !560, !579, !579}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !580, line: 21, baseType: !581)
!580 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !580, line: 21, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !569, file: !563, line: 16, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!327, !560, !587, !587}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !569, file: !563, line: 17, baseType: !591, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!327, !560, !579, !579, !579, !423, !423, !423, !369, !484, !414, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !569, file: !563, line: 18, baseType: !597, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!327, !560, !600, !579, !579, !579}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !569, file: !563, line: 19, baseType: !576, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !569, file: !563, line: 20, baseType: !603, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!327, !560, !369, !579, !579, !579}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !569, file: !563, line: 21, baseType: !607, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!327, !460, !560}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !569, file: !563, line: 22, baseType: !611, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!327, !560, !528, !579, !579}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !569, file: !563, line: 23, baseType: !611, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !569, file: !563, line: 24, baseType: !616, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!327, !560, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !569, file: !563, line: 25, baseType: !576, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !569, file: !563, line: 26, baseType: !576, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !569, file: !563, line: 27, baseType: !572, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !569, file: !563, line: 28, baseType: !572, size: 64, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !569, file: !563, line: 29, baseType: !625, size: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!327, !560, !333}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !569, file: !563, line: 30, baseType: !572, size: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !569, file: !563, line: 31, baseType: !625, size: 64, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !562, file: !563, line: 39, baseType: !631, size: 64, offset: 5632)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !632, line: 14, baseType: !633)
!632 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !632, line: 14, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !562, file: !563, line: 40, baseType: !369, size: 32, offset: 5696)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !562, file: !563, line: 41, baseType: !407, size: 64, offset: 5760)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !562, file: !563, line: 41, baseType: !407, size: 64, offset: 5824)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !562, file: !563, line: 42, baseType: !484, size: 32, offset: 5888)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !563, line: 43, baseType: !640, size: 32, offset: 5920)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !562, file: !563, line: 45, baseType: !369, size: 32, offset: 5952)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !562, file: !563, line: 46, baseType: !484, size: 32, offset: 5984)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !562, file: !563, line: 47, baseType: !587, size: 64, offset: 6016)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !562, file: !563, line: 47, baseType: !587, size: 64, offset: 6080)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !562, file: !563, line: 48, baseType: !579, size: 64, offset: 6144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !562, file: !563, line: 48, baseType: !579, size: 64, offset: 6208)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !562, file: !563, line: 49, baseType: !484, size: 32, offset: 6272)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !562, file: !563, line: 50, baseType: !484, size: 32, offset: 6304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !562, file: !563, line: 51, baseType: !650, size: 64, offset: 6336)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!327, !560, !369, !653, !653, !619, !310}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !656, line: 11, baseType: !657)
!656 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !656, line: 11, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !562, file: !563, line: 52, baseType: !310, size: 64, offset: 6400)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !563, line: 53, baseType: !310, size: 64, offset: 6464)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !562, file: !563, line: 54, baseType: !369, size: 32, offset: 6528)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !562, file: !563, line: 55, baseType: !310, size: 64, offset: 6592)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !562, file: !563, line: 56, baseType: !664, size: 32, offset: 6656)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !562, file: !563, line: 57, baseType: !664, size: 32, offset: 6688)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "xsub", scope: !557, file: !519, line: 43, baseType: !579, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ysub", scope: !557, file: !519, line: 43, baseType: !579, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "submats", scope: !557, file: !519, line: 44, baseType: !587, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "psubcomm", scope: !557, file: !519, line: 45, baseType: !535, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BJacobi_Singleblock", file: !519, line: 38, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 36, size: 128, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !672, file: !519, line: 37, baseType: !579, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !672, file: !519, line: 37, baseType: !579, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BJacobi_Multiblock", file: !519, line: 33, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 28, size: 384, elements: !679)
!679 = !{!680, !682, !683, !684, !685, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !678, file: !519, line: 29, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !678, file: !519, line: 29, baseType: !681, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !678, file: !519, line: 30, baseType: !414, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !678, file: !519, line: 31, baseType: !619, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !678, file: !519, line: 31, baseType: !619, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !678, file: !519, line: 32, baseType: !687, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!688 = !{i32 7, !"Dwarf Version", i32 4}
!689 = !{i32 2, !"Debug Info Version", i32 3}
!690 = !{i32 1, !"wchar_size", i32 4}
!691 = !{i32 7, !"PIC Level", i32 2}
!692 = !{i32 7, !"uwtable", i32 1}
!693 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!694 = distinct !DISubprogram(name: "PCBJacobiGetSubKSP", scope: !695, file: !695, line: 372, type: !696, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !699)
!695 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/bjacobi/bjacobi.c", directory: "/home/users/ndemeye/xSDK")
!696 = !DISubroutineType(types: !697)
!697 = !{!327, !560, !414, !414, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!699 = !{!700, !701, !702, !703, !704, !705, !708, !709, !711, !715}
!700 = !DILocalVariable(name: "pc", arg: 1, scope: !694, file: !695, line: 372, type: !560)
!701 = !DILocalVariable(name: "n_local", arg: 2, scope: !694, file: !695, line: 372, type: !414)
!702 = !DILocalVariable(name: "first_local", arg: 3, scope: !694, file: !695, line: 372, type: !414)
!703 = !DILocalVariable(name: "ksp", arg: 4, scope: !694, file: !695, line: 372, type: !698)
!704 = !DILocalVariable(name: "ierr", scope: !694, file: !695, line: 374, type: !327)
!705 = !DILocalVariable(name: "_7_f", scope: !706, file: !695, line: 378, type: !707)
!706 = distinct !DILexicalBlock(scope: !694, file: !695, line: 378, column: 10)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!708 = !DILocalVariable(name: "_7_ierr", scope: !706, file: !695, line: 378, type: !327)
!709 = !DILocalVariable(name: "ierr__", scope: !710, file: !695, line: 378, type: !327)
!710 = distinct !DILexicalBlock(scope: !706, file: !695, line: 378, column: 10)
!711 = !DILocalVariable(name: "ierr__", scope: !712, file: !695, line: 378, type: !327)
!712 = distinct !DILexicalBlock(scope: !713, file: !695, line: 378, column: 10)
!713 = distinct !DILexicalBlock(scope: !714, file: !695, line: 378, column: 10)
!714 = distinct !DILexicalBlock(scope: !706, file: !695, line: 378, column: 10)
!715 = !DILocalVariable(name: "ierr__", scope: !716, file: !695, line: 378, type: !327)
!716 = distinct !DILexicalBlock(scope: !694, file: !695, line: 378, column: 113)
!717 = !DILocation(line: 0, scope: !694)
!718 = !DILocation(line: 376, column: 3, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !695, line: 376, column: 3)
!720 = distinct !DILexicalBlock(scope: !721, file: !695, line: 376, column: 3)
!721 = distinct !DILexicalBlock(scope: !694, file: !695, line: 376, column: 3)
!722 = !{!723, !723, i64 0}
!723 = !{!"any pointer", !724, i64 0}
!724 = !{!"omnipotent char", !725, i64 0}
!725 = !{!"Simple C/C++ TBAA"}
!726 = !DILocation(line: 376, column: 3, scope: !720)
!727 = !DILocation(line: 376, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !695, line: 376, column: 3)
!729 = distinct !DILexicalBlock(scope: !719, file: !695, line: 376, column: 3)
!730 = !{!731, !732, i64 1536}
!731 = !{!"", !724, i64 0, !724, i64 512, !724, i64 1024, !724, i64 1280, !732, i64 1536, !732, i64 1540, !724, i64 1544}
!732 = !{!"int", !724, i64 0}
!733 = !DILocation(line: 376, column: 3, scope: !729)
!734 = !DILocation(line: 376, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !728, file: !695, line: 376, column: 3)
!736 = !{!732, !732, i64 0}
!737 = !{!731, !732, i64 1540}
!738 = !DILocation(line: 377, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !695, line: 377, column: 3)
!740 = distinct !DILexicalBlock(scope: !694, file: !695, line: 377, column: 3)
!741 = !DILocation(line: 377, column: 3, scope: !740)
