; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/pipefcg/pipefcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/pipefcg/pipefcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 719, baseType: !7, size: 32, elements: !117)
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "KSP_CG_SYMMETRIC", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "KSP_CG_HERMITIAN", value: 1, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 203, baseType: !7, size: 32, elements: !121)
!121 = !{!122, !123}
!122 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_STANDARD", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "KSP_FCD_TRUNC_TYPE_NOTAY", value: 1, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 663, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!132 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 155, baseType: !7, size: 32, elements: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!157 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !159)
!159 = !{!160}
!160 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!161 = !{!162, !209, !213, !214, !287, !409, !412, !297, !28, !249, !376, !7, !202, !415, !416}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_PIPEFCG", file: !164, line: 21, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/fcg/pipefcg/pipefcgimpl.h", directory: "/home/users/ndemeye/xSDK")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 6, size: 1536, elements: !166)
!166 = !{!167, !169, !171, !172, !173, !174, !179, !180, !181, !182, !183, !185, !186, !187, !188, !189, !190, !191, !192, !193, !195, !196, !198, !199, !204, !206, !207}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !164, line: 7, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCGType", file: !35, line: 719, baseType: !116)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mmax", scope: !165, file: !164, line: 8, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nprealloc", scope: !165, file: !164, line: 9, baseType: !170, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nvecs", scope: !165, file: !164, line: 10, baseType: !170, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !165, file: !164, line: 11, baseType: !170, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Qvecs", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !151, line: 21, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !151, line: 21, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ZETAvecs", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Pvecs", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Cvecs", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Svecs", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pQvecs", scope: !165, file: !164, line: 12, baseType: !184, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pZETAvecs", scope: !165, file: !164, line: 12, baseType: !184, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pPvecs", scope: !165, file: !164, line: 12, baseType: !184, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pCvecs", scope: !165, file: !164, line: 12, baseType: !184, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pSvecs", scope: !165, file: !164, line: 12, baseType: !184, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Qold", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ZETAold", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Pold", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Sold", scope: !165, file: !164, line: 12, baseType: !175, size: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "chunksizes", scope: !165, file: !164, line: 13, baseType: !194, size: 64, offset: 1088)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nchunks", scope: !165, file: !164, line: 14, baseType: !170, size: 32, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "truncstrat", scope: !165, file: !164, line: 15, baseType: !197, size: 32, offset: 1184)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPFCDTruncationType", file: !35, line: 203, baseType: !120)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "n_restarts", scope: !165, file: !164, line: 16, baseType: !170, size: 32, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dots", scope: !165, file: !164, line: 17, baseType: !200, size: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !203)
!203 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "etas", scope: !165, file: !164, line: 18, baseType: !205, size: 64, offset: 1344)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "redux", scope: !165, file: !164, line: 19, baseType: !175, size: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "norm_breakdown", scope: !165, file: !164, line: 20, baseType: !208, size: 32, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !210, line: 330, baseType: !211)
!210 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !210, line: 330, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !217, line: 73, size: 4480, elements: !218)
!217 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!218 = !{!219, !221, !270, !271, !272, !274, !275, !276, !277, !285, !286, !288, !292, !296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !309, !310, !311, !313, !314, !315, !317, !318, !319, !320, !321, !322, !324, !325, !326, !327, !328, !329, !331, !332, !333, !343, !345, !346, !350, !351, !399, !404, !406, !407, !408}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !216, file: !217, line: 74, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !216, file: !217, line: 75, baseType: !222, size: 448, offset: 64)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 448, elements: !268)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !217, line: 53, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 45, size: 448, elements: !225)
!225 = !{!226, !232, !240, !245, !252, !256, !263}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !224, file: !217, line: 46, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !214, !231}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !224, file: !217, line: 47, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!230, !214, !236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !237, line: 16, baseType: !238)
!237 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !237, line: 16, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !224, file: !217, line: 48, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!230, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !224, file: !217, line: 49, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!230, !214, !249, !214}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !224, file: !217, line: 50, baseType: !253, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!230, !214, !249, !244}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !224, file: !217, line: 51, baseType: !257, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!230, !214, !249, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !224, file: !217, line: 52, baseType: !264, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!230, !214, !249, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!268 = !{!269}
!269 = !DISubrange(count: 1)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !216, file: !217, line: 76, baseType: !209, size: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !217, line: 77, baseType: !170, size: 32, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !216, file: !217, line: 78, baseType: !273, size: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !203)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !216, file: !217, line: 78, baseType: !273, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !216, file: !217, line: 78, baseType: !273, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !216, file: !217, line: 78, baseType: !273, size: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !217, line: 79, baseType: !278, size: 64, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !281, line: 27, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !283, line: 43, baseType: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!284 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !216, file: !217, line: 80, baseType: !170, size: 32, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !216, file: !217, line: 81, baseType: !287, size: 32, offset: 992)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !216, file: !217, line: 82, baseType: !289, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !216, file: !217, line: 83, baseType: !293, size: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !216, file: !217, line: 84, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !216, file: !217, line: 85, baseType: !297, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !216, file: !217, line: 86, baseType: !297, size: 64, offset: 1280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !216, file: !217, line: 87, baseType: !297, size: 64, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !217, line: 88, baseType: !214, size: 64, offset: 1408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !216, file: !217, line: 89, baseType: !278, size: 64, offset: 1472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !217, line: 90, baseType: !297, size: 64, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !216, file: !217, line: 91, baseType: !297, size: 64, offset: 1600)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !216, file: !217, line: 92, baseType: !170, size: 32, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !216, file: !217, line: 93, baseType: !213, size: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !216, file: !217, line: 94, baseType: !308, size: 64, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !279)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !216, file: !217, line: 95, baseType: !170, size: 32, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !216, file: !217, line: 95, baseType: !170, size: 32, offset: 1888)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !216, file: !217, line: 96, baseType: !312, size: 64, offset: 1920)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !216, file: !217, line: 96, baseType: !312, size: 64, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !216, file: !217, line: 97, baseType: !194, size: 64, offset: 2048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !216, file: !217, line: 97, baseType: !316, size: 64, offset: 2112)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !216, file: !217, line: 98, baseType: !170, size: 32, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !216, file: !217, line: 98, baseType: !170, size: 32, offset: 2208)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !216, file: !217, line: 99, baseType: !312, size: 64, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !216, file: !217, line: 99, baseType: !312, size: 64, offset: 2304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !216, file: !217, line: 100, baseType: !205, size: 64, offset: 2368)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !216, file: !217, line: 100, baseType: !323, size: 64, offset: 2432)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !216, file: !217, line: 101, baseType: !170, size: 32, offset: 2496)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !216, file: !217, line: 101, baseType: !170, size: 32, offset: 2528)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !216, file: !217, line: 102, baseType: !312, size: 64, offset: 2560)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !216, file: !217, line: 102, baseType: !312, size: 64, offset: 2624)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !216, file: !217, line: 103, baseType: !200, size: 64, offset: 2688)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !216, file: !217, line: 103, baseType: !330, size: 64, offset: 2752)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !216, file: !217, line: 104, baseType: !267, size: 64, offset: 2816)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !216, file: !217, line: 105, baseType: !170, size: 32, offset: 2880)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !216, file: !217, line: 106, baseType: !334, size: 128, offset: 2944)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 128, elements: !341)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !217, line: 64, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 61, size: 128, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !337, file: !217, line: 62, baseType: !260, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !337, file: !217, line: 63, baseType: !213, size: 64, offset: 64)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !216, file: !217, line: 107, baseType: !344, size: 64, offset: 3072)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !341)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !216, file: !217, line: 108, baseType: !213, size: 64, offset: 3136)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !216, file: !217, line: 109, baseType: !347, size: 64, offset: 3200)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!230, !213}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !216, file: !217, line: 111, baseType: !170, size: 32, offset: 3264)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !216, file: !217, line: 112, baseType: !352, size: 320, offset: 3328)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 320, elements: !397)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!230, !356, !214, !213}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !359)
!359 = !{!360, !361, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !358, file: !12, line: 100, baseType: !170, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !12, line: 101, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !373, !374, !375, !379, !380, !382, !383, !384}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !364, file: !12, line: 84, baseType: !297, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !364, file: !12, line: 85, baseType: !297, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !12, line: 86, baseType: !213, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !364, file: !12, line: 87, baseType: !289, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !364, file: !12, line: 88, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !364, file: !12, line: 89, baseType: !251, size: 8, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !364, file: !12, line: 90, baseType: !297, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !364, file: !12, line: 91, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !377, line: 46, baseType: !378)
!377 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!378 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !364, file: !12, line: 92, baseType: !208, size: 32, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !12, line: 93, baseType: !381, size: 32, offset: 544)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !12, line: 94, baseType: !362, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !364, file: !12, line: 95, baseType: !297, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !364, file: !12, line: 96, baseType: !213, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !358, file: !12, line: 102, baseType: !297, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !358, file: !12, line: 102, baseType: !297, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !358, file: !12, line: 103, baseType: !297, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !358, file: !12, line: 104, baseType: !209, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !358, file: !12, line: 105, baseType: !208, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !358, file: !12, line: 105, baseType: !208, size: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !358, file: !12, line: 105, baseType: !208, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !358, file: !12, line: 106, baseType: !214, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !358, file: !12, line: 107, baseType: !394, size: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!397 = !{!398}
!398 = !DISubrange(count: 5)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !216, file: !217, line: 113, baseType: !400, size: 320, offset: 3648)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 320, elements: !397)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!230, !214, !213}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !216, file: !217, line: 114, baseType: !405, size: 320, offset: 3968)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 320, elements: !397)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !216, file: !217, line: 115, baseType: !208, size: 32, offset: 4288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !216, file: !217, line: 120, baseType: !394, size: 64, offset: 4352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !216, file: !217, line: 121, baseType: !208, size: 32, offset: 4416)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !210, line: 331, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !210, line: 331, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !210, line: 338, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !210, line: 338, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !158)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!417 = !{!0, !418}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "cited", scope: !2, file: !420, line: 7, type: !208, isLocal: true, isDefinition: true)
!420 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fcg/pipefcg/pipefcg.c", directory: "/home/users/ndemeye/xSDK")
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 3072, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 384)
!424 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!425 = !{i32 7, !"Dwarf Version", i32 4}
!426 = !{i32 2, !"Debug Info Version", i32 3}
!427 = !{i32 1, !"wchar_size", i32 4}
!428 = !{i32 7, !"PIC Level", i32 2}
!429 = !{i32 7, !"uwtable", i32 1}
!430 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!431 = distinct !DISubprogram(name: "KSPPIPEFCGSetMmax", scope: !420, file: !420, line: 430, type: !432, scopeLine: 431, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !674)
!432 = !DISubroutineType(types: !433)
!433 = !{!230, !434, !170}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !437)
!437 = !{!438, !440, !489, !494, !495, !496, !497, !527, !528, !529, !530, !531, !533, !538, !539, !540, !541, !542, !543, !544, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !567, !573, !574, !575, !576, !581, !582, !583, !584, !589, !590, !591, !592, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !644, !645, !646, !647, !648, !655, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !671, !672, !673}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !436, file: !104, line: 76, baseType: !439, size: 4480)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !217, line: 122, baseType: !216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !436, file: !104, line: 76, baseType: !441, size: 896, offset: 4480)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 896, elements: !268)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !443)
!443 = !{!444, !448, !452, !456, !464, !465, !469, !470, !474, !478, !482, !483, !487, !488}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !442, file: !104, line: 19, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!230, !434, !176, !175}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !442, file: !104, line: 22, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!230, !434, !176, !176, !175}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !442, file: !104, line: 25, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!230, !434}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !442, file: !104, line: 26, baseType: !457, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!230, !434, !460, !460}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !461, line: 16, baseType: !462)
!461 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !461, line: 16, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !442, file: !104, line: 27, baseType: !453, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !442, file: !104, line: 28, baseType: !466, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!230, !356, !434}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !442, file: !104, line: 29, baseType: !453, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !442, file: !104, line: 30, baseType: !471, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!230, !434, !205, !205}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !442, file: !104, line: 31, baseType: !475, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!230, !434, !170, !205, !205, !194}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !442, file: !104, line: 32, baseType: !479, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!230, !434, !208, !208, !194, !175, !205, !205}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !442, file: !104, line: 33, baseType: !453, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !442, file: !104, line: 34, baseType: !484, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!230, !434, !236}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !442, file: !104, line: 35, baseType: !453, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !442, file: !104, line: 36, baseType: !484, size: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !436, file: !104, line: 77, baseType: !490, size: 64, offset: 5376)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !491, line: 14, baseType: !492)
!491 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !491, line: 14, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !436, file: !104, line: 78, baseType: !208, size: 32, offset: 5440)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !436, file: !104, line: 79, baseType: !208, size: 32, offset: 5472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !436, file: !104, line: 81, baseType: !170, size: 32, offset: 5504)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !436, file: !104, line: 82, baseType: !498, size: 64, offset: 5568)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !501)
!501 = !{!502, !503, !523, !524, !525, !526}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !500, file: !104, line: 55, baseType: !439, size: 4480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !500, file: !104, line: 55, baseType: !504, size: 448, offset: 4480)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 448, elements: !268)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !506)
!506 = !{!507, !511, !512, !516, !517, !518, !522}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !505, file: !104, line: 42, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!230, !498, !176, !176}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !505, file: !104, line: 43, baseType: !508, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !505, file: !104, line: 44, baseType: !513, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!230, !498}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !505, file: !104, line: 45, baseType: !513, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !505, file: !104, line: 46, baseType: !513, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !505, file: !104, line: 47, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!230, !498, !236}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !505, file: !104, line: 48, baseType: !513, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !500, file: !104, line: 56, baseType: !434, size: 64, offset: 4928)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !500, file: !104, line: 57, baseType: !460, size: 64, offset: 4992)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !500, file: !104, line: 58, baseType: !308, size: 64, offset: 5056)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !104, line: 59, baseType: !213, size: 64, offset: 5120)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !436, file: !104, line: 83, baseType: !208, size: 32, offset: 5632)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !436, file: !104, line: 84, baseType: !208, size: 32, offset: 5664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !436, file: !104, line: 85, baseType: !208, size: 32, offset: 5696)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !436, file: !104, line: 86, baseType: !208, size: 32, offset: 5728)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !436, file: !104, line: 87, baseType: !532, size: 32, offset: 5760)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !436, file: !104, line: 88, baseType: !534, size: 384, offset: 5792)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 384, elements: !535)
!535 = !{!536, !537}
!536 = !DISubrange(count: 4)
!537 = !DISubrange(count: 3)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !436, file: !104, line: 89, baseType: !202, size: 64, offset: 6208)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !436, file: !104, line: 90, baseType: !202, size: 64, offset: 6272)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !436, file: !104, line: 91, baseType: !202, size: 64, offset: 6336)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !436, file: !104, line: 92, baseType: !202, size: 64, offset: 6400)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !436, file: !104, line: 93, baseType: !202, size: 64, offset: 6464)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !436, file: !104, line: 94, baseType: !202, size: 64, offset: 6528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !436, file: !104, line: 95, baseType: !545, size: 32, offset: 6592)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !436, file: !104, line: 96, baseType: !208, size: 32, offset: 6624)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !436, file: !104, line: 98, baseType: !176, size: 64, offset: 6656)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !436, file: !104, line: 98, baseType: !176, size: 64, offset: 6720)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !436, file: !104, line: 102, baseType: !205, size: 64, offset: 6784)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !436, file: !104, line: 103, baseType: !205, size: 64, offset: 6848)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !436, file: !104, line: 104, baseType: !170, size: 32, offset: 6912)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !436, file: !104, line: 105, baseType: !170, size: 32, offset: 6944)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !436, file: !104, line: 106, baseType: !208, size: 32, offset: 6976)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !436, file: !104, line: 107, baseType: !205, size: 64, offset: 7040)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !436, file: !104, line: 108, baseType: !205, size: 64, offset: 7104)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !436, file: !104, line: 109, baseType: !170, size: 32, offset: 7168)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !436, file: !104, line: 110, baseType: !170, size: 32, offset: 7200)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !436, file: !104, line: 111, baseType: !208, size: 32, offset: 7232)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !436, file: !104, line: 113, baseType: !170, size: 32, offset: 7264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !436, file: !104, line: 114, baseType: !208, size: 32, offset: 7296)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !436, file: !104, line: 117, baseType: !170, size: 32, offset: 7328)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !436, file: !104, line: 120, baseType: !563, size: 320, offset: 7360)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 320, elements: !397)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!230, !434, !170, !202, !213}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !436, file: !104, line: 121, baseType: !568, size: 320, offset: 7680)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 320, elements: !397)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!230, !572}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !436, file: !104, line: 122, baseType: !405, size: 320, offset: 8000)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !436, file: !104, line: 123, baseType: !170, size: 32, offset: 8320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !436, file: !104, line: 124, baseType: !208, size: 32, offset: 8352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !436, file: !104, line: 126, baseType: !577, size: 320, offset: 8384)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 320, elements: !397)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!230, !434, !213}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !436, file: !104, line: 127, baseType: !568, size: 320, offset: 8704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !436, file: !104, line: 128, baseType: !405, size: 320, offset: 9024)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !436, file: !104, line: 129, baseType: !170, size: 32, offset: 9344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !436, file: !104, line: 131, baseType: !585, size: 64, offset: 9408)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!230, !434, !170, !202, !588, !213}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !436, file: !104, line: 132, baseType: !347, size: 64, offset: 9472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !436, file: !104, line: 133, baseType: !213, size: 64, offset: 9536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !436, file: !104, line: 135, baseType: !213, size: 64, offset: 9600)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !436, file: !104, line: 137, baseType: !593, size: 64, offset: 9664)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !104, line: 139, baseType: !213, size: 64, offset: 9728)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9792)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9824)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9888)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9952)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 9984)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10016)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10048)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10080)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10144)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10176)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !436, file: !104, line: 142, baseType: !208, size: 32, offset: 10208)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10240)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10304)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10368)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10432)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10496)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10560)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10624)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10688)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10752)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10816)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10880)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 10944)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 11008)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !436, file: !104, line: 143, baseType: !236, size: 64, offset: 11072)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11136)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11168)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11200)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11232)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11264)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11296)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11328)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11360)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11392)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11424)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11456)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11488)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11520)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !436, file: !104, line: 144, baseType: !626, size: 32, offset: 11552)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !436, file: !104, line: 147, baseType: !170, size: 32, offset: 11584)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !436, file: !104, line: 148, baseType: !175, size: 64, offset: 11648)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !436, file: !104, line: 150, baseType: !643, size: 32, offset: 11712)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !436, file: !104, line: 151, baseType: !208, size: 32, offset: 11744)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !436, file: !104, line: 153, baseType: !170, size: 32, offset: 11776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !436, file: !104, line: 154, baseType: !170, size: 32, offset: 11808)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !436, file: !104, line: 156, baseType: !208, size: 32, offset: 11840)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !436, file: !104, line: 161, baseType: !649, size: 192, offset: 11904)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !104, line: 157, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !649, file: !104, line: 158, baseType: !460, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !649, file: !104, line: 158, baseType: !460, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !649, file: !104, line: 159, baseType: !208, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !649, file: !104, line: 160, baseType: !208, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !436, file: !104, line: 163, baseType: !656, size: 32, offset: 12096)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !436, file: !104, line: 165, baseType: !532, size: 32, offset: 12128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !436, file: !104, line: 166, baseType: !656, size: 32, offset: 12160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !436, file: !104, line: 171, baseType: !208, size: 32, offset: 12192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !436, file: !104, line: 172, baseType: !208, size: 32, offset: 12224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !436, file: !104, line: 173, baseType: !208, size: 32, offset: 12256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !436, file: !104, line: 174, baseType: !176, size: 64, offset: 12288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !436, file: !104, line: 175, baseType: !176, size: 64, offset: 12352)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !436, file: !104, line: 177, baseType: !170, size: 32, offset: 12416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !436, file: !104, line: 178, baseType: !208, size: 32, offset: 12448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !436, file: !104, line: 180, baseType: !236, size: 64, offset: 12480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !436, file: !104, line: 182, baseType: !668, size: 64, offset: 12544)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!230, !434, !176, !176, !213}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !436, file: !104, line: 183, baseType: !668, size: 64, offset: 12608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !436, file: !104, line: 184, baseType: !213, size: 64, offset: 12672)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !436, file: !104, line: 184, baseType: !213, size: 64, offset: 12736)
!674 = !{!675, !676, !677, !678, !680, !681, !682, !683, !685, !689, !690, !692, !698, !699, !701, !704, !705, !707, !710}
!675 = !DILocalVariable(name: "ksp", arg: 1, scope: !431, file: !420, line: 430, type: !434)
!676 = !DILocalVariable(name: "mmax", arg: 2, scope: !431, file: !420, line: 430, type: !170)
!677 = !DILocalVariable(name: "pipefcg", scope: !431, file: !420, line: 432, type: !162)
!678 = !DILocalVariable(name: "_7_ierr", scope: !679, file: !420, line: 436, type: !230)
!679 = distinct !DILexicalBlock(scope: !431, file: !420, line: 436, column: 3)
!680 = !DILocalVariable(name: "b0", scope: !679, file: !420, line: 436, type: !170)
!681 = !DILocalVariable(name: "b1", scope: !679, file: !420, line: 436, type: !344)
!682 = !DILocalVariable(name: "b2", scope: !679, file: !420, line: 436, type: !344)
!683 = !DILocalVariable(name: "_4_ierr", scope: !684, file: !420, line: 436, type: !230)
!684 = distinct !DILexicalBlock(scope: !679, file: !420, line: 436, column: 3)
!685 = !DILocalVariable(name: "a_b1", scope: !684, file: !420, line: 436, type: !686)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 6)
!689 = !DILocalVariable(name: "a_b2", scope: !684, file: !420, line: 436, type: !686)
!690 = !DILocalVariable(name: "_7_errorcode", scope: !691, file: !420, line: 436, type: !230)
!691 = distinct !DILexicalBlock(scope: !684, file: !420, line: 436, column: 3)
!692 = !DILocalVariable(name: "_7_errorstring", scope: !693, file: !420, line: 436, type: !695)
!693 = distinct !DILexicalBlock(scope: !694, file: !420, line: 436, column: 3)
!694 = distinct !DILexicalBlock(scope: !691, file: !420, line: 436, column: 3)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 2048, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 256)
!698 = !DILocalVariable(name: "_7_resultlen", scope: !693, file: !420, line: 436, type: !287)
!699 = !DILocalVariable(name: "_7_errorcode", scope: !700, file: !420, line: 436, type: !230)
!700 = distinct !DILexicalBlock(scope: !684, file: !420, line: 436, column: 3)
!701 = !DILocalVariable(name: "_7_errorstring", scope: !702, file: !420, line: 436, type: !695)
!702 = distinct !DILexicalBlock(scope: !703, file: !420, line: 436, column: 3)
!703 = distinct !DILexicalBlock(scope: !700, file: !420, line: 436, column: 3)
!704 = !DILocalVariable(name: "_7_resultlen", scope: !702, file: !420, line: 436, type: !287)
!705 = !DILocalVariable(name: "_7_errorcode", scope: !706, file: !420, line: 436, type: !230)
!706 = distinct !DILexicalBlock(scope: !679, file: !420, line: 436, column: 3)
!707 = !DILocalVariable(name: "_7_errorstring", scope: !708, file: !420, line: 436, type: !695)
!708 = distinct !DILexicalBlock(scope: !709, file: !420, line: 436, column: 3)
!709 = distinct !DILexicalBlock(scope: !706, file: !420, line: 436, column: 3)
!710 = !DILocalVariable(name: "_7_resultlen", scope: !708, file: !420, line: 436, type: !287)
!711 = !DILocation(line: 0, scope: !431)
!712 = !DILocation(line: 432, column: 43, scope: !431)
!713 = !{!714, !719, i64 1216}
