; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/fas/fasgalerkin.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/fas/fasgalerkin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59}
!54 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 285, baseType: !5, size: 32, elements: !62)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!71 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!72 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!73 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!74 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!78 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!79 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 843, baseType: !5, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "SNES_FAS_MULTIPLICATIVE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "SNES_FAS_ADDITIVE", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "SNES_FAS_FULL", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "SNES_FAS_KASKADE", value: 3, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 663, baseType: !5, size: 32, elements: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!88 = !{!89, !90, !91}
!89 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!94 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!112 = !{!113, !117, !118, !321, !153, !329}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !114, line: 330, baseType: !115)
!114 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !114, line: 330, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !121, line: 73, size: 4480, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !125, !174, !175, !177, !180, !181, !182, !183, !191, !192, !194, !198, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !215, !216, !217, !219, !220, !222, !224, !225, !226, !227, !228, !231, !233, !234, !235, !236, !237, !240, !242, !243, !244, !254, !256, !257, !261, !262, !311, !316, !318, !319, !320}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !120, file: !121, line: 74, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !120, file: !121, line: 75, baseType: !126, size: 448, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 448, elements: !172)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !121, line: 53, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 45, size: 448, elements: !129)
!129 = !{!130, !136, !144, !149, !156, !160, !167}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !128, file: !121, line: 46, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !118, !135}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !128, file: !121, line: 47, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!134, !118, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !141, line: 16, baseType: !142)
!141 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !141, line: 16, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !128, file: !121, line: 48, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!134, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !128, file: !121, line: 49, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!134, !118, !153, !118}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !128, file: !121, line: 50, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!134, !118, !153, !148}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !128, file: !121, line: 51, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!134, !118, !153, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !128, file: !121, line: 52, baseType: !168, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!134, !118, !153, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !120, file: !121, line: 76, baseType: !113, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !121, line: 77, baseType: !176, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !179)
!179 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !120, file: !121, line: 78, baseType: !178, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !121, line: 79, baseType: !184, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !187, line: 27, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !189, line: 43, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!190 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !120, file: !121, line: 80, baseType: !176, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !120, file: !121, line: 81, baseType: !193, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !120, file: !121, line: 82, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !120, file: !121, line: 83, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !120, file: !121, line: 84, baseType: !203, size: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !120, file: !121, line: 85, baseType: !203, size: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !120, file: !121, line: 86, baseType: !203, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !120, file: !121, line: 87, baseType: !203, size: 64, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !120, file: !121, line: 88, baseType: !118, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !120, file: !121, line: 89, baseType: !184, size: 64, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !121, line: 90, baseType: !203, size: 64, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !120, file: !121, line: 91, baseType: !203, size: 64, offset: 1600)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !120, file: !121, line: 92, baseType: !176, size: 32, offset: 1664)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !120, file: !121, line: 93, baseType: !117, size: 64, offset: 1728)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !121, line: 94, baseType: !214, size: 64, offset: 1792)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !185)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !120, file: !121, line: 95, baseType: !176, size: 32, offset: 1856)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !120, file: !121, line: 95, baseType: !176, size: 32, offset: 1888)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !120, file: !121, line: 96, baseType: !218, size: 64, offset: 1920)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !120, file: !121, line: 96, baseType: !218, size: 64, offset: 1984)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !120, file: !121, line: 97, baseType: !221, size: 64, offset: 2048)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !120, file: !121, line: 97, baseType: !223, size: 64, offset: 2112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !120, file: !121, line: 98, baseType: !176, size: 32, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !120, file: !121, line: 98, baseType: !176, size: 32, offset: 2208)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !120, file: !121, line: 99, baseType: !218, size: 64, offset: 2240)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !120, file: !121, line: 99, baseType: !218, size: 64, offset: 2304)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !120, file: !121, line: 100, baseType: !229, size: 64, offset: 2368)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !179)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !120, file: !121, line: 100, baseType: !232, size: 64, offset: 2432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !120, file: !121, line: 101, baseType: !176, size: 32, offset: 2496)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !120, file: !121, line: 101, baseType: !176, size: 32, offset: 2528)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !120, file: !121, line: 102, baseType: !218, size: 64, offset: 2560)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !120, file: !121, line: 102, baseType: !218, size: 64, offset: 2624)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !120, file: !121, line: 103, baseType: !238, size: 64, offset: 2688)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !230)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !120, file: !121, line: 103, baseType: !241, size: 64, offset: 2752)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !120, file: !121, line: 104, baseType: !171, size: 64, offset: 2816)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !120, file: !121, line: 105, baseType: !176, size: 32, offset: 2880)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !120, file: !121, line: 106, baseType: !245, size: 128, offset: 2944)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, elements: !252)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !121, line: 64, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 61, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !248, file: !121, line: 62, baseType: !164, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !248, file: !121, line: 63, baseType: !117, size: 64, offset: 64)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !120, file: !121, line: 107, baseType: !255, size: 64, offset: 3072)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !252)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !120, file: !121, line: 108, baseType: !117, size: 64, offset: 3136)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !120, file: !121, line: 109, baseType: !258, size: 64, offset: 3200)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!134, !117}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !120, file: !121, line: 111, baseType: !176, size: 32, offset: 3264)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !120, file: !121, line: 112, baseType: !263, size: 320, offset: 3328)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !309)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!134, !267, !118, !117}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !270)
!270 = !{!271, !272, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !269, file: !10, line: 100, baseType: !176, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !10, line: 101, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !284, !285, !286, !290, !292, !294, !295, !296}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !275, file: !10, line: 84, baseType: !203, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !275, file: !10, line: 85, baseType: !203, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !10, line: 86, baseType: !117, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !275, file: !10, line: 87, baseType: !195, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !275, file: !10, line: 88, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !275, file: !10, line: 89, baseType: !155, size: 8, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !275, file: !10, line: 90, baseType: !203, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !275, file: !10, line: 91, baseType: !287, size: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !288, line: 46, baseType: !289)
!288 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!289 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !275, file: !10, line: 92, baseType: !291, size: 32, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !10, line: 93, baseType: !293, size: 32, offset: 544)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !10, line: 94, baseType: !273, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !275, file: !10, line: 95, baseType: !203, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !275, file: !10, line: 96, baseType: !117, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !269, file: !10, line: 102, baseType: !203, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !269, file: !10, line: 102, baseType: !203, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !269, file: !10, line: 103, baseType: !203, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !269, file: !10, line: 104, baseType: !113, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !269, file: !10, line: 105, baseType: !291, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !269, file: !10, line: 106, baseType: !118, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !269, file: !10, line: 107, baseType: !306, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!309 = !{!310}
!310 = !DISubrange(count: 5)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !120, file: !121, line: 113, baseType: !312, size: 320, offset: 3648)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !309)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!134, !118, !117}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !120, file: !121, line: 114, baseType: !317, size: 320, offset: 3968)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 320, elements: !309)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !120, file: !121, line: 115, baseType: !291, size: 32, offset: 4288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !120, file: !121, line: 120, baseType: !306, size: 64, offset: 4352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !120, file: !121, line: 121, baseType: !291, size: 32, offset: 4416)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_FAS", file: !323, line: 48, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/fas/fasimpls.h", directory: "/home/users/ndemeye/xSDK")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 8, size: 1216, elements: !325)
!325 = !{!326, !327, !328, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !624, !625, !626}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !324, file: !323, line: 11, baseType: !176, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !324, file: !323, line: 12, baseType: !176, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "smoothu", scope: !324, file: !323, line: 15, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !332, line: 38, size: 11648, elements: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!333 = !{!334, !336, !403, !408, !409, !410, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !426, !513, !514, !516, !517, !518, !519, !520, !525, !526, !527, !528, !529, !530, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !331, file: !332, line: 39, baseType: !335, size: 4480)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !121, line: 122, baseType: !120)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !331, file: !332, line: 39, baseType: !337, size: 1088, offset: 4480)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 1088, elements: !172)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !332, line: 12, size: 1088, elements: !339)
!339 = !{!340, !348, !352, !356, !362, !363, !367, !368, !372, !376, !377, !378, !383, !387, !391, !395, !402}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !338, file: !332, line: 13, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!134, !329, !344, !117}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !345, line: 21, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !345, line: 21, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !338, file: !332, line: 14, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!134, !344, !344, !117}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !338, file: !332, line: 15, baseType: !353, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!134, !329, !176}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !338, file: !332, line: 16, baseType: !357, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!134, !329, !176, !230, !230, !230, !360, !117}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !338, file: !332, line: 17, baseType: !258, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !338, file: !332, line: 18, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!134, !329}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !338, file: !332, line: 19, baseType: !364, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !338, file: !332, line: 20, baseType: !369, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!134, !329, !140}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !338, file: !332, line: 21, baseType: !373, size: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!134, !267, !329}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !338, file: !332, line: 22, baseType: !364, size: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !338, file: !332, line: 23, baseType: !364, size: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !338, file: !332, line: 24, baseType: !379, size: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!134, !329, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !338, file: !332, line: 25, baseType: !384, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!134, !382}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !338, file: !332, line: 26, baseType: !388, size: 64, offset: 832)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!134, !329, !344, !344}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !338, file: !332, line: 27, baseType: !392, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!134, !329, !344, !344, !117}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !338, file: !332, line: 28, baseType: !396, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!134, !329, !344, !399, !399, !117}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !61, line: 16, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !61, line: 16, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !338, file: !332, line: 29, baseType: !369, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !331, file: !332, line: 40, baseType: !404, size: 64, offset: 5568)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !405, line: 14, baseType: !406)
!405 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !405, line: 14, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !331, file: !332, line: 41, baseType: !291, size: 32, offset: 5632)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !331, file: !332, line: 42, baseType: !329, size: 64, offset: 5696)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !331, file: !332, line: 43, baseType: !411, size: 32, offset: 5760)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !331, file: !332, line: 44, baseType: !291, size: 32, offset: 5792)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !331, file: !332, line: 47, baseType: !117, size: 64, offset: 5824)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !331, file: !332, line: 49, baseType: !344, size: 64, offset: 5888)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !331, file: !332, line: 50, baseType: !344, size: 64, offset: 5952)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !331, file: !332, line: 52, baseType: !344, size: 64, offset: 6016)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !331, file: !332, line: 54, baseType: !399, size: 64, offset: 6080)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !331, file: !332, line: 55, baseType: !399, size: 64, offset: 6144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !331, file: !332, line: 56, baseType: !399, size: 64, offset: 6208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !331, file: !332, line: 57, baseType: !117, size: 64, offset: 6272)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !331, file: !332, line: 58, baseType: !422, size: 64, offset: 6336)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !423, line: 22, baseType: !424)
!423 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !423, line: 22, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !331, file: !332, line: 59, baseType: !427, size: 64, offset: 6400)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !430, line: 29, size: 8000, elements: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!431 = !{!432, !433, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485, !486, !487, !488, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !509, !511, !512}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !429, file: !430, line: 30, baseType: !335, size: 4480)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !429, file: !430, line: 30, baseType: !434, size: 704, offset: 4480)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 704, elements: !172)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !430, line: 13, size: 704, elements: !436)
!436 = !{!437, !441, !446, !451, !456, !461, !465, !469, !470, !471, !472}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !435, file: !430, line: 14, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!134, !427, !140}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !435, file: !430, line: 15, baseType: !442, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!134, !427}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !435, file: !430, line: 16, baseType: !447, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!134, !427, !344, !344, !450, !117}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !435, file: !430, line: 17, baseType: !452, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!134, !329, !344}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !435, file: !430, line: 18, baseType: !457, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!134, !329, !344, !344, !229}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !435, file: !430, line: 19, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!134, !427, !344, !344, !344, !450, !450, !117}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !435, file: !430, line: 20, baseType: !466, size: 64, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!134, !267, !427}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !435, file: !430, line: 21, baseType: !443, size: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !435, file: !430, line: 22, baseType: !443, size: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !435, file: !430, line: 23, baseType: !443, size: 64, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !435, file: !430, line: 24, baseType: !388, size: 64, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !429, file: !430, line: 32, baseType: !329, size: 64, offset: 5184)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !430, line: 34, baseType: !117, size: 64, offset: 5248)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !429, file: !430, line: 36, baseType: !291, size: 32, offset: 5312)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !429, file: !430, line: 38, baseType: !344, size: 64, offset: 5376)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !429, file: !430, line: 39, baseType: !344, size: 64, offset: 5440)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !429, file: !430, line: 40, baseType: !344, size: 64, offset: 5504)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !429, file: !430, line: 41, baseType: !344, size: 64, offset: 5568)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !429, file: !430, line: 42, baseType: !344, size: 64, offset: 5632)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !429, file: !430, line: 44, baseType: !176, size: 32, offset: 5696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !429, file: !430, line: 45, baseType: !483, size: 64, offset: 5760)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !429, file: !430, line: 47, baseType: !230, size: 64, offset: 5824)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !429, file: !430, line: 49, baseType: !291, size: 32, offset: 5888)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !429, file: !430, line: 50, baseType: !230, size: 64, offset: 5952)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !429, file: !430, line: 51, baseType: !230, size: 64, offset: 6016)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !429, file: !430, line: 52, baseType: !230, size: 64, offset: 6080)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !429, file: !430, line: 53, baseType: !490, size: 32, offset: 6144)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !52)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !429, file: !430, line: 54, baseType: !291, size: 32, offset: 6176)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !429, file: !430, line: 56, baseType: !230, size: 64, offset: 6208)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !429, file: !430, line: 57, baseType: !230, size: 64, offset: 6272)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !429, file: !430, line: 58, baseType: !230, size: 64, offset: 6336)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !429, file: !430, line: 59, baseType: !176, size: 32, offset: 6400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !429, file: !430, line: 60, baseType: !230, size: 64, offset: 6464)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !429, file: !430, line: 61, baseType: !230, size: 64, offset: 6528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !429, file: !430, line: 62, baseType: !230, size: 64, offset: 6592)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !429, file: !430, line: 63, baseType: !176, size: 32, offset: 6656)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !429, file: !430, line: 65, baseType: !230, size: 64, offset: 6720)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !429, file: !430, line: 67, baseType: !117, size: 64, offset: 6784)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !429, file: !430, line: 68, baseType: !117, size: 64, offset: 6848)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !429, file: !430, line: 70, baseType: !140, size: 64, offset: 6912)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !429, file: !430, line: 71, baseType: !505, size: 320, offset: 6976)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !309)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!134, !427, !117}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !429, file: !430, line: 72, baseType: !510, size: 320, offset: 7296)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 320, elements: !309)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !429, file: !430, line: 73, baseType: !317, size: 320, offset: 7616)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !429, file: !430, line: 74, baseType: !176, size: 32, offset: 7936)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !331, file: !332, line: 60, baseType: !291, size: 32, offset: 6464)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !331, file: !332, line: 61, baseType: !515, size: 32, offset: 6496)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !61, line: 285, baseType: !60)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !331, file: !332, line: 63, baseType: !344, size: 64, offset: 6528)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !331, file: !332, line: 65, baseType: !344, size: 64, offset: 6592)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !331, file: !332, line: 66, baseType: !117, size: 64, offset: 6656)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !331, file: !332, line: 68, baseType: !230, size: 64, offset: 6720)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !331, file: !332, line: 74, baseType: !521, size: 320, offset: 6784)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !309)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!134, !329, !176, !230, !117}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !331, file: !332, line: 75, baseType: !510, size: 320, offset: 7104)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !331, file: !332, line: 76, baseType: !317, size: 320, offset: 7424)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !331, file: !332, line: 77, baseType: !176, size: 32, offset: 7744)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !331, file: !332, line: 78, baseType: !117, size: 64, offset: 7808)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !331, file: !332, line: 79, baseType: !361, size: 32, offset: 7872)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !331, file: !332, line: 80, baseType: !531, size: 320, offset: 7936)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 320, elements: !309)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!134, !329, !117}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !331, file: !332, line: 81, baseType: !510, size: 320, offset: 8256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !331, file: !332, line: 82, baseType: !317, size: 320, offset: 8576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !331, file: !332, line: 83, baseType: !176, size: 32, offset: 8896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !331, file: !332, line: 84, baseType: !291, size: 32, offset: 8928)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !331, file: !332, line: 88, baseType: !291, size: 32, offset: 8960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !332, line: 89, baseType: !117, size: 64, offset: 9024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !331, file: !332, line: 93, baseType: !176, size: 32, offset: 9088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !331, file: !332, line: 94, baseType: !176, size: 32, offset: 9120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !331, file: !332, line: 95, baseType: !176, size: 32, offset: 9152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !331, file: !332, line: 96, baseType: !176, size: 32, offset: 9184)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !331, file: !332, line: 97, baseType: !176, size: 32, offset: 9216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !331, file: !332, line: 98, baseType: !230, size: 64, offset: 9280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !331, file: !332, line: 99, baseType: !230, size: 64, offset: 9344)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !331, file: !332, line: 100, baseType: !230, size: 64, offset: 9408)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !331, file: !332, line: 101, baseType: !230, size: 64, offset: 9472)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !331, file: !332, line: 102, baseType: !230, size: 64, offset: 9536)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !331, file: !332, line: 103, baseType: !230, size: 64, offset: 9600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !331, file: !332, line: 104, baseType: !230, size: 64, offset: 9664)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !331, file: !332, line: 105, baseType: !230, size: 64, offset: 9728)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !331, file: !332, line: 106, baseType: !291, size: 32, offset: 9792)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !331, file: !332, line: 107, baseType: !176, size: 32, offset: 9824)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !331, file: !332, line: 108, baseType: !176, size: 32, offset: 9856)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !331, file: !332, line: 109, baseType: !176, size: 32, offset: 9888)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !331, file: !332, line: 110, baseType: !291, size: 32, offset: 9920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !331, file: !332, line: 111, baseType: !176, size: 32, offset: 9952)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !331, file: !332, line: 112, baseType: !291, size: 32, offset: 9984)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !331, file: !332, line: 113, baseType: !176, size: 32, offset: 10016)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !331, file: !332, line: 115, baseType: !291, size: 32, offset: 10048)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !331, file: !332, line: 117, baseType: !291, size: 32, offset: 10080)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !331, file: !332, line: 119, baseType: !565, size: 32, offset: 10112)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !67)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !331, file: !332, line: 120, baseType: !567, size: 32, offset: 10144)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !75)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !331, file: !332, line: 124, baseType: !176, size: 32, offset: 10176)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !331, file: !332, line: 125, baseType: !483, size: 64, offset: 10240)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !331, file: !332, line: 129, baseType: !176, size: 32, offset: 10304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !331, file: !332, line: 130, baseType: !229, size: 64, offset: 10368)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !331, file: !332, line: 132, baseType: !221, size: 64, offset: 10432)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !331, file: !332, line: 133, baseType: !176, size: 32, offset: 10496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !331, file: !332, line: 134, baseType: !176, size: 32, offset: 10528)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !331, file: !332, line: 135, baseType: !291, size: 32, offset: 10560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !331, file: !332, line: 136, baseType: !291, size: 32, offset: 10592)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !331, file: !332, line: 137, baseType: !291, size: 32, offset: 10624)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !331, file: !332, line: 140, baseType: !176, size: 32, offset: 10656)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !331, file: !332, line: 141, baseType: !176, size: 32, offset: 10688)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !331, file: !332, line: 143, baseType: !176, size: 32, offset: 10720)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !331, file: !332, line: 144, baseType: !176, size: 32, offset: 10752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !331, file: !332, line: 146, baseType: !291, size: 32, offset: 10784)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !331, file: !332, line: 147, baseType: !291, size: 32, offset: 10816)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !331, file: !332, line: 148, baseType: !291, size: 32, offset: 10848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !331, file: !332, line: 150, baseType: !291, size: 32, offset: 10880)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !331, file: !332, line: 151, baseType: !117, size: 64, offset: 10944)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !331, file: !332, line: 154, baseType: !230, size: 64, offset: 11008)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !331, file: !332, line: 155, baseType: !230, size: 64, offset: 11072)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !331, file: !332, line: 157, baseType: !483, size: 64, offset: 11136)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !331, file: !332, line: 158, baseType: !176, size: 32, offset: 11200)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !331, file: !332, line: 160, baseType: !291, size: 32, offset: 11232)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !331, file: !332, line: 161, baseType: !291, size: 32, offset: 11264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !331, file: !332, line: 162, baseType: !176, size: 32, offset: 11296)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !331, file: !332, line: 164, baseType: !230, size: 64, offset: 11328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !331, file: !332, line: 165, baseType: !344, size: 64, offset: 11392)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !331, file: !332, line: 165, baseType: !344, size: 64, offset: 11456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !331, file: !332, line: 166, baseType: !176, size: 32, offset: 11520)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !331, file: !332, line: 167, baseType: !291, size: 32, offset: 11552)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !331, file: !332, line: 169, baseType: !291, size: 32, offset: 11584)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "smoothd", scope: !324, file: !323, line: 16, baseType: !329, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !323, line: 19, baseType: !329, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fine", scope: !324, file: !323, line: 20, baseType: !329, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !324, file: !323, line: 21, baseType: !329, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !324, file: !323, line: 22, baseType: !399, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "inject", scope: !324, file: !323, line: 23, baseType: !399, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "restrct", scope: !324, file: !323, line: 24, baseType: !399, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rscale", scope: !324, file: !323, line: 25, baseType: !344, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "n_cycles", scope: !324, file: !323, line: 28, baseType: !176, size: 32, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fastype", scope: !324, file: !323, line: 29, baseType: !610, size: 32, offset: 672)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFASType", file: !25, line: 843, baseType: !80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_up_it", scope: !324, file: !323, line: 30, baseType: !176, size: 32, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_down_it", scope: !324, file: !323, line: 31, baseType: !176, size: 32, offset: 736)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !324, file: !323, line: 32, baseType: !291, size: 32, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "full_downsweep", scope: !324, file: !323, line: 33, baseType: !291, size: 32, offset: 800)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "full_total", scope: !324, file: !323, line: 34, baseType: !291, size: 32, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "continuation", scope: !324, file: !323, line: 35, baseType: !291, size: 32, offset: 864)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "full_stage", scope: !324, file: !323, line: 36, baseType: !176, size: 32, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !324, file: !323, line: 39, baseType: !291, size: 32, offset: 928)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Xg", scope: !324, file: !323, line: 40, baseType: !344, size: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Fg", scope: !324, file: !323, line: 41, baseType: !344, size: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsetup", scope: !324, file: !323, line: 44, baseType: !622, size: 32, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !623, line: 80, baseType: !26)
!623 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!624 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsolve", scope: !324, file: !323, line: 45, baseType: !622, size: 32, offset: 1120)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "eventresidual", scope: !324, file: !323, line: 46, baseType: !622, size: 32, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "eventinterprestrict", scope: !324, file: !323, line: 47, baseType: !622, size: 32, offset: 1184)
!627 = !{i32 7, !"Dwarf Version", i32 4}
!628 = !{i32 2, !"Debug Info Version", i32 3}
!629 = !{i32 1, !"wchar_size", i32 4}
!630 = !{i32 7, !"PIC Level", i32 2}
!631 = !{i32 7, !"uwtable", i32 1}
!632 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!633 = distinct !DISubprogram(name: "SNESFASGetGalerkin", scope: !634, file: !634, line: 16, type: !635, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !637)
!634 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/fas/fasgalerkin.c", directory: "/home/users/ndemeye/xSDK")
!635 = !DISubroutineType(types: !636)
!636 = !{!134, !329, !450}
!637 = !{!638, !639, !640, !641, !643, !644}
!638 = !DILocalVariable(name: "snes", arg: 1, scope: !633, file: !634, line: 16, type: !329)
!639 = !DILocalVariable(name: "flg", arg: 2, scope: !633, file: !634, line: 16, type: !450)
!640 = !DILocalVariable(name: "fas", scope: !633, file: !634, line: 18, type: !321)
!641 = !DILocalVariable(name: "_7_ierr", scope: !642, file: !634, line: 21, type: !134)
!642 = distinct !DILexicalBlock(scope: !633, file: !634, line: 21, column: 3)
!643 = !DILocalVariable(name: "_7_same", scope: !642, file: !634, line: 21, type: !291)
!644 = !DILocalVariable(name: "ierr__", scope: !645, file: !634, line: 21, type: !134)
!645 = distinct !DILexicalBlock(scope: !642, file: !634, line: 21, column: 3)
!646 = !DILocation(line: 0, scope: !633)
!647 = !DILocation(line: 20, column: 3, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !634, line: 20, column: 3)
!649 = distinct !DILexicalBlock(scope: !650, file: !634, line: 20, column: 3)
!650 = distinct !DILexicalBlock(scope: !633, file: !634, line: 20, column: 3)
!651 = !{!652, !652, i64 0}
!652 = !{!"any pointer", !653, i64 0}
!653 = !{!"omnipotent char", !654, i64 0}
!654 = !{!"Simple C/C++ TBAA"}
!655 = !DILocation(line: 20, column: 3, scope: !649)
!656 = !DILocation(line: 20, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !634, line: 20, column: 3)
!658 = distinct !DILexicalBlock(scope: !648, file: !634, line: 20, column: 3)
!659 = !{!660, !661, i64 1536}
!660 = !{!"", !653, i64 0, !653, i64 512, !653, i64 1024, !653, i64 1280, !661, i64 1536, !661, i64 1540, !653, i64 1544}
!661 = !{!"int", !653, i64 0}
!662 = !DILocation(line: 20, column: 3, scope: !658)
!663 = !DILocation(line: 20, column: 3, scope: !664)
!664 = distinct !DILexicalBlock(scope: !657, file: !634, line: 20, column: 3)
!665 = !{!661, !661, i64 0}
!666 = !{!660, !661, i64 1540}
!667 = !DILocation(line: 21, column: 3, scope: !642)
!668 = !DILocation(line: 21, column: 3, scope: !669)
!669 = distinct !DILexicalBlock(scope: !670, file: !634, line: 21, column: 3)
!670 = distinct !DILexicalBlock(scope: !642, file: !634, line: 21, column: 3)
!671 = !DILocation(line: 21, column: 3, scope: !670)
!672 = !DILocation(line: 21, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !634, line: 21, column: 3)
!674 = !DILocation(line: 21, column: 3, scope: !675)
!675 = distinct !DILexicalBlock(scope: !670, file: !634, line: 21, column: 3)
!676 = !{!677, !661, i64 0}
