; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/lmvmimpl.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/lmvmimpl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!322 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 624, baseType: !5, size: 32, elements: !366)
!365 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!366 = !{!367, !368, !369, !370}
!367 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!370 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!371 = !{!372, !397, !477, !417, !394, !467, !91, !552}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !374, line: 52, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 27, size: 6208, elements: !376)
!376 = !{!377, !586, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1637, !1642, !1643, !1644, !1645}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !375, file: !374, line: 29, baseType: !378, size: 4480)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !379, line: 122, baseType: !380)
!379 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !379, line: 73, size: 4480, elements: !381)
!381 = !{!382, !384, !438, !439, !441, !444, !445, !446, !447, !455, !456, !458, !462, !466, !468, !469, !470, !471, !472, !473, !474, !475, !476, !478, !480, !481, !482, !484, !485, !487, !489, !490, !491, !492, !493, !496, !498, !499, !500, !501, !502, !505, !507, !508, !509, !519, !521, !522, !526, !527, !576, !581, !583, !584, !585}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !380, file: !379, line: 74, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !380, file: !379, line: 75, baseType: !385, size: 448, offset: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 448, elements: !436)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !379, line: 53, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 45, size: 448, elements: !388)
!388 = !{!389, !400, !408, !413, !420, !424, !431}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !387, file: !379, line: 46, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !394, !396}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !365, line: 330, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !365, line: 330, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !387, file: !379, line: 47, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!393, !394, !404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !405, line: 16, baseType: !406)
!405 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !405, line: 16, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !387, file: !379, line: 48, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!393, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !387, file: !379, line: 49, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!393, !394, !417, !394}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !387, file: !379, line: 50, baseType: !421, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!393, !394, !417, !412}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !387, file: !379, line: 51, baseType: !425, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!393, !394, !417, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !387, file: !379, line: 52, baseType: !432, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!393, !394, !417, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!436 = !{!437}
!437 = !DISubrange(count: 1)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !380, file: !379, line: 76, baseType: !397, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !379, line: 77, baseType: !440, size: 32, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !380, file: !379, line: 78, baseType: !442, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !443)
!443 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !380, file: !379, line: 78, baseType: !442, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !380, file: !379, line: 78, baseType: !442, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !380, file: !379, line: 78, baseType: !442, size: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !379, line: 79, baseType: !448, size: 64, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !451, line: 27, baseType: !452)
!451 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !453, line: 43, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!454 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !380, file: !379, line: 80, baseType: !440, size: 32, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !380, file: !379, line: 81, baseType: !457, size: 32, offset: 992)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !380, file: !379, line: 82, baseType: !459, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !380, file: !379, line: 83, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !380, file: !379, line: 84, baseType: !467, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !380, file: !379, line: 85, baseType: !467, size: 64, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !380, file: !379, line: 86, baseType: !467, size: 64, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !380, file: !379, line: 87, baseType: !467, size: 64, offset: 1344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !379, line: 88, baseType: !394, size: 64, offset: 1408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !380, file: !379, line: 89, baseType: !448, size: 64, offset: 1472)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !379, line: 90, baseType: !467, size: 64, offset: 1536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !380, file: !379, line: 91, baseType: !467, size: 64, offset: 1600)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !380, file: !379, line: 92, baseType: !440, size: 32, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !380, file: !379, line: 93, baseType: !477, size: 64, offset: 1728)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !379, line: 94, baseType: !479, size: 64, offset: 1792)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !449)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !380, file: !379, line: 95, baseType: !440, size: 32, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !380, file: !379, line: 95, baseType: !440, size: 32, offset: 1888)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !380, file: !379, line: 96, baseType: !483, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !380, file: !379, line: 96, baseType: !483, size: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !380, file: !379, line: 97, baseType: !486, size: 64, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !380, file: !379, line: 97, baseType: !488, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !380, file: !379, line: 98, baseType: !440, size: 32, offset: 2176)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !380, file: !379, line: 98, baseType: !440, size: 32, offset: 2208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !380, file: !379, line: 99, baseType: !483, size: 64, offset: 2240)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !380, file: !379, line: 99, baseType: !483, size: 64, offset: 2304)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !380, file: !379, line: 100, baseType: !494, size: 64, offset: 2368)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !443)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !380, file: !379, line: 100, baseType: !497, size: 64, offset: 2432)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !380, file: !379, line: 101, baseType: !440, size: 32, offset: 2496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !380, file: !379, line: 101, baseType: !440, size: 32, offset: 2528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !380, file: !379, line: 102, baseType: !483, size: 64, offset: 2560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !380, file: !379, line: 102, baseType: !483, size: 64, offset: 2624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !380, file: !379, line: 103, baseType: !503, size: 64, offset: 2688)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !495)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !380, file: !379, line: 103, baseType: !506, size: 64, offset: 2752)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !380, file: !379, line: 104, baseType: !435, size: 64, offset: 2816)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !380, file: !379, line: 105, baseType: !440, size: 32, offset: 2880)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !380, file: !379, line: 106, baseType: !510, size: 128, offset: 2944)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 128, elements: !517)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !379, line: 64, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 61, size: 128, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !513, file: !379, line: 62, baseType: !428, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !513, file: !379, line: 63, baseType: !477, size: 64, offset: 64)
!517 = !{!518}
!518 = !DISubrange(count: 2)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !380, file: !379, line: 107, baseType: !520, size: 64, offset: 3072)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !517)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !380, file: !379, line: 108, baseType: !477, size: 64, offset: 3136)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !380, file: !379, line: 109, baseType: !523, size: 64, offset: 3200)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!393, !477}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !380, file: !379, line: 111, baseType: !440, size: 32, offset: 3264)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !380, file: !379, line: 112, baseType: !528, size: 320, offset: 3328)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !574)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!393, !532, !394, !477}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !535)
!535 = !{!536, !537, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !534, file: !10, line: 100, baseType: !440, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !10, line: 101, baseType: !538, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !549, !550, !551, !555, !557, !559, !560, !561}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !540, file: !10, line: 84, baseType: !467, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !540, file: !10, line: 85, baseType: !467, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !10, line: 86, baseType: !477, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !540, file: !10, line: 87, baseType: !459, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !540, file: !10, line: 88, baseType: !547, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !540, file: !10, line: 89, baseType: !419, size: 8, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !540, file: !10, line: 90, baseType: !467, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !540, file: !10, line: 91, baseType: !552, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !553, line: 46, baseType: !554)
!553 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!554 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !540, file: !10, line: 92, baseType: !556, size: 32, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !10, line: 93, baseType: !558, size: 32, offset: 544)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !10, line: 94, baseType: !538, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !540, file: !10, line: 95, baseType: !467, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !540, file: !10, line: 96, baseType: !477, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !534, file: !10, line: 102, baseType: !467, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !534, file: !10, line: 102, baseType: !467, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !534, file: !10, line: 103, baseType: !467, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !534, file: !10, line: 104, baseType: !397, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !534, file: !10, line: 105, baseType: !556, size: 32, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !534, file: !10, line: 105, baseType: !556, size: 32, offset: 416)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !534, file: !10, line: 105, baseType: !556, size: 32, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !534, file: !10, line: 106, baseType: !394, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !534, file: !10, line: 107, baseType: !571, size: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!574 = !{!575}
!575 = !DISubrange(count: 5)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !380, file: !379, line: 113, baseType: !577, size: 320, offset: 3648)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 320, elements: !574)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!393, !394, !477}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !380, file: !379, line: 114, baseType: !582, size: 320, offset: 3968)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !574)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !380, file: !379, line: 115, baseType: !556, size: 32, offset: 4288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !380, file: !379, line: 120, baseType: !571, size: 64, offset: 4352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !380, file: !379, line: 121, baseType: !556, size: 32, offset: 4416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !375, file: !374, line: 29, baseType: !587, size: 320, offset: 4480)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !436)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !374, line: 19, size: 320, elements: !589)
!589 = !{!590, !1607, !1608, !1609, !1610}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !588, file: !374, line: 20, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!393, !594, !623, !623}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !597, line: 436, size: 23424, elements: !598)
!597 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!598 = !{!599, !600, !1382, !1383, !1384, !1385, !1387, !1388, !1389, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1503, !1504, !1520, !1521, !1522, !1523, !1524, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1559, !1579, !1580, !1582, !1583, !1584, !1585, !1586, !1587, !1605, !1606}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !596, file: !597, line: 437, baseType: !378, size: 4480)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !596, file: !597, line: 437, baseType: !601, size: 9472, offset: 4480)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 9472, elements: !436)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !597, line: 32, size: 9472, elements: !603)
!603 = !{!604, !613, !617, !618, !619, !918, !919, !920, !921, !922, !923, !924, !944, !948, !953, !959, !978, !983, !987, !988, !992, !997, !998, !1003, !1007, !1011, !1015, !1019, !1023, !1024, !1025, !1026, !1027, !1031, !1032, !1037, !1038, !1039, !1040, !1041, !1046, !1053, !1057, !1061, !1065, !1069, !1073, !1074, !1078, !1079, !1083, !1088, !1089, !1090, !1091, !1153, !1161, !1162, !1166, !1167, !1171, !1172, !1176, !1181, !1182, !1186, !1190, !1194, !1195, !1196, !1197, !1198, !1199, !1204, !1205, !1209, !1213, !1217, !1218, !1219, !1223, !1233, !1234, !1238, !1239, !1243, !1244, !1248, !1249, !1253, !1254, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1296, !1297, !1298, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1314, !1318, !1322, !1323, !1327, !1328, !1329, !1330, !1356, !1360, !1361, !1362, !1363, !1364, !1368, !1369, !1370, !1371, !1372, !1376, !1380, !1381}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !602, file: !597, line: 34, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!393, !594, !440, !608, !440, !608, !610, !612}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !602, file: !597, line: 35, baseType: !614, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!393, !594, !440, !486, !488, !506}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !602, file: !597, line: 36, baseType: !614, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !602, file: !597, line: 37, baseType: !591, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !602, file: !597, line: 38, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!393, !594, !623, !623, !623}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !626, line: 142, size: 12800, elements: !627)
!626 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!627 = !{!628, !629, !844, !864, !865, !866, !912, !913, !914, !915, !917}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !625, file: !626, line: 143, baseType: !378, size: 4480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !625, file: !626, line: 143, baseType: !630, size: 5248, offset: 4480)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 5248, elements: !436)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !626, line: 23, size: 5248, elements: !632)
!632 = !{!633, !638, !643, !647, !651, !657, !662, !663, !664, !668, !672, !673, !674, !678, !682, !686, !687, !691, !695, !699, !700, !704, !708, !709, !713, !717, !718, !719, !723, !724, !731, !736, !737, !738, !742, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !763, !764, !765, !769, !773, !774, !775, !776, !780, !781, !782, !783, !784, !785, !786, !790, !791, !795, !802, !803, !808, !809, !813, !814, !815, !816, !817, !818, !819, !820, !824, !825, !826, !832, !836, !837, !838}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !631, file: !626, line: 24, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!393, !623, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !631, file: !626, line: 25, baseType: !639, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!393, !623, !440, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !631, file: !626, line: 26, baseType: !644, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!393, !440, !637}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !631, file: !626, line: 27, baseType: !648, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!393, !623, !623, !503}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !631, file: !626, line: 28, baseType: !652, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!393, !623, !440, !655, !503}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !631, file: !626, line: 29, baseType: !658, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!393, !623, !661, !494}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !631, file: !626, line: 30, baseType: !648, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !631, file: !626, line: 31, baseType: !652, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !631, file: !626, line: 32, baseType: !665, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!393, !623, !504}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !631, file: !626, line: 33, baseType: !669, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!393, !623, !623}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !631, file: !626, line: 34, baseType: !665, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !631, file: !626, line: 35, baseType: !669, size: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !631, file: !626, line: 36, baseType: !675, size: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!393, !623, !504, !623}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !631, file: !626, line: 37, baseType: !679, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!393, !623, !504, !504, !623}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !631, file: !626, line: 38, baseType: !683, size: 64, offset: 896)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!393, !623, !440, !610, !637}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !631, file: !626, line: 39, baseType: !675, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !631, file: !626, line: 40, baseType: !688, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!393, !623, !504, !623, !623}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !631, file: !626, line: 41, baseType: !692, size: 64, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!393, !623, !504, !504, !504, !623, !623}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !631, file: !626, line: 42, baseType: !696, size: 64, offset: 1152)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!393, !623, !623, !623}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !631, file: !626, line: 43, baseType: !696, size: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !631, file: !626, line: 44, baseType: !701, size: 64, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!393, !623, !440, !608, !610, !612}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !631, file: !626, line: 45, baseType: !705, size: 64, offset: 1344)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!393, !623}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !631, file: !626, line: 46, baseType: !705, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !631, file: !626, line: 47, baseType: !710, size: 64, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!393, !623, !506}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !631, file: !626, line: 48, baseType: !714, size: 64, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!393, !623, !486}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !631, file: !626, line: 49, baseType: !714, size: 64, offset: 1600)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !631, file: !626, line: 50, baseType: !710, size: 64, offset: 1664)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !631, file: !626, line: 51, baseType: !720, size: 64, offset: 1728)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!393, !623, !486, !494}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !631, file: !626, line: 52, baseType: !720, size: 64, offset: 1792)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !631, file: !626, line: 53, baseType: !725, size: 64, offset: 1856)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!393, !623, !728}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !631, file: !626, line: 54, baseType: !732, size: 64, offset: 1920)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!393, !623, !735, !556}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !631, file: !626, line: 55, baseType: !701, size: 64, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !631, file: !626, line: 56, baseType: !705, size: 64, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !631, file: !626, line: 57, baseType: !739, size: 64, offset: 2112)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!393, !623, !404}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !631, file: !626, line: 58, baseType: !743, size: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!393, !623, !610}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !631, file: !626, line: 59, baseType: !743, size: 64, offset: 2240)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !631, file: !626, line: 60, baseType: !648, size: 64, offset: 2304)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !631, file: !626, line: 61, baseType: !648, size: 64, offset: 2368)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !631, file: !626, line: 62, baseType: !658, size: 64, offset: 2432)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !631, file: !626, line: 63, baseType: !652, size: 64, offset: 2496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !631, file: !626, line: 64, baseType: !652, size: 64, offset: 2560)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !631, file: !626, line: 65, baseType: !739, size: 64, offset: 2624)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !631, file: !626, line: 66, baseType: !705, size: 64, offset: 2688)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !631, file: !626, line: 67, baseType: !705, size: 64, offset: 2752)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !631, file: !626, line: 68, baseType: !756, size: 64, offset: 2816)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!393, !623, !759}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !760, line: 30, baseType: !761)
!760 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !760, line: 30, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !631, file: !626, line: 69, baseType: !701, size: 64, offset: 2880)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !631, file: !626, line: 70, baseType: !705, size: 64, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !631, file: !626, line: 71, baseType: !766, size: 64, offset: 3008)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!393, !532, !623}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !631, file: !626, line: 72, baseType: !770, size: 64, offset: 3072)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!393, !623, !623, !494}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !631, file: !626, line: 73, baseType: !696, size: 64, offset: 3136)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !631, file: !626, line: 74, baseType: !696, size: 64, offset: 3200)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !631, file: !626, line: 75, baseType: !696, size: 64, offset: 3264)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !631, file: !626, line: 76, baseType: !777, size: 64, offset: 3328)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!393, !623, !440, !608, !503}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !631, file: !626, line: 77, baseType: !705, size: 64, offset: 3392)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !631, file: !626, line: 78, baseType: !705, size: 64, offset: 3456)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !631, file: !626, line: 79, baseType: !705, size: 64, offset: 3520)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !631, file: !626, line: 80, baseType: !705, size: 64, offset: 3584)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !631, file: !626, line: 81, baseType: !665, size: 64, offset: 3648)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !631, file: !626, line: 82, baseType: !705, size: 64, offset: 3712)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !631, file: !626, line: 83, baseType: !787, size: 64, offset: 3776)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!393, !623, !440, !623, !612}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !631, file: !626, line: 84, baseType: !787, size: 64, offset: 3840)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !631, file: !626, line: 85, baseType: !792, size: 64, offset: 3904)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!393, !623, !623, !503, !503}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !631, file: !626, line: 86, baseType: !796, size: 64, offset: 3968)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!393, !623, !799, !637}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !760, line: 11, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !760, line: 11, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !631, file: !626, line: 87, baseType: !796, size: 64, offset: 4032)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !631, file: !626, line: 88, baseType: !804, size: 64, offset: 4096)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!393, !623, !807}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !631, file: !626, line: 89, baseType: !804, size: 64, offset: 4160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !631, file: !626, line: 90, baseType: !810, size: 64, offset: 4224)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!393, !623, !440, !608, !608, !623, !612}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !631, file: !626, line: 91, baseType: !810, size: 64, offset: 4288)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !631, file: !626, line: 92, baseType: !739, size: 64, offset: 4352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !631, file: !626, line: 93, baseType: !739, size: 64, offset: 4416)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !631, file: !626, line: 94, baseType: !669, size: 64, offset: 4480)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !631, file: !626, line: 95, baseType: !669, size: 64, offset: 4544)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !631, file: !626, line: 96, baseType: !669, size: 64, offset: 4608)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !631, file: !626, line: 97, baseType: !669, size: 64, offset: 4672)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !631, file: !626, line: 98, baseType: !821, size: 64, offset: 4736)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!393, !623, !556}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !631, file: !626, line: 99, baseType: !710, size: 64, offset: 4800)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !631, file: !626, line: 100, baseType: !710, size: 64, offset: 4864)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !631, file: !626, line: 101, baseType: !827, size: 64, offset: 4928)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!393, !623, !506, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !631, file: !626, line: 102, baseType: !833, size: 64, offset: 4992)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!393, !623, !807, !830}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !631, file: !626, line: 103, baseType: !710, size: 64, offset: 5056)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !631, file: !626, line: 104, baseType: !804, size: 64, offset: 5120)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !631, file: !626, line: 105, baseType: !839, size: 64, offset: 5184)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!393, !440, !655, !637, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !625, file: !626, line: 144, baseType: !845, size: 64, offset: 9728)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !760, line: 60, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !847, file: !133, line: 241, baseType: !397, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !133, line: 242, baseType: !457, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !847, file: !133, line: 243, baseType: !440, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !847, file: !133, line: 243, baseType: !440, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !847, file: !133, line: 244, baseType: !440, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !847, file: !133, line: 244, baseType: !440, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !847, file: !133, line: 245, baseType: !486, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !847, file: !133, line: 246, baseType: !556, size: 32, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !847, file: !133, line: 247, baseType: !440, size: 32, offset: 352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !847, file: !133, line: 251, baseType: !440, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !847, file: !133, line: 252, baseType: !759, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !847, file: !133, line: 253, baseType: !556, size: 32, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !847, file: !133, line: 254, baseType: !440, size: 32, offset: 544)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !847, file: !133, line: 254, baseType: !440, size: 32, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !847, file: !133, line: 255, baseType: !440, size: 32, offset: 608)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !625, file: !626, line: 145, baseType: !477, size: 64, offset: 9792)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !625, file: !626, line: 146, baseType: !556, size: 32, offset: 9856)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !625, file: !626, line: 147, baseType: !867, size: 1344, offset: 9920)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !626, line: 140, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 114, size: 1344, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !888, !889, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !868, file: !626, line: 115, baseType: !440, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !868, file: !626, line: 116, baseType: !440, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !868, file: !626, line: 117, baseType: !440, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !868, file: !626, line: 118, baseType: !440, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !868, file: !626, line: 119, baseType: !440, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !868, file: !626, line: 120, baseType: !440, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !868, file: !626, line: 121, baseType: !486, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !868, file: !626, line: 122, baseType: !503, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !868, file: !626, line: 124, baseType: !397, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !868, file: !626, line: 125, baseType: !457, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !868, file: !626, line: 125, baseType: !457, size: 32, offset: 416)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !868, file: !626, line: 126, baseType: !457, size: 32, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !868, file: !626, line: 126, baseType: !457, size: 32, offset: 480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !868, file: !626, line: 127, baseType: !884, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !365, line: 339, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !365, line: 339, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !868, file: !626, line: 128, baseType: !884, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !868, file: !626, line: 129, baseType: !890, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !365, line: 341, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !365, line: 351, size: 192, elements: !893)
!893 = !{!894, !895, !896, !897, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !892, file: !365, line: 354, baseType: !91, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !892, file: !365, line: 355, baseType: !91, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !892, file: !365, line: 356, baseType: !91, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !892, file: !365, line: 361, baseType: !91, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !892, file: !365, line: 362, baseType: !552, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !868, file: !626, line: 130, baseType: !440, size: 32, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !868, file: !626, line: 130, baseType: !440, size: 32, offset: 736)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !868, file: !626, line: 131, baseType: !503, size: 64, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !868, file: !626, line: 131, baseType: !503, size: 64, offset: 832)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !868, file: !626, line: 132, baseType: !486, size: 64, offset: 896)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !868, file: !626, line: 132, baseType: !486, size: 64, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !868, file: !626, line: 133, baseType: !440, size: 32, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !868, file: !626, line: 134, baseType: !486, size: 64, offset: 1088)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !868, file: !626, line: 135, baseType: !440, size: 32, offset: 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !868, file: !626, line: 136, baseType: !556, size: 32, offset: 1184)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !868, file: !626, line: 137, baseType: !556, size: 32, offset: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !868, file: !626, line: 138, baseType: !612, size: 32, offset: 1248)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !868, file: !626, line: 139, baseType: !486, size: 64, offset: 1280)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !625, file: !626, line: 147, baseType: !867, size: 1344, offset: 11264)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !625, file: !626, line: 148, baseType: !556, size: 32, offset: 12608)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !625, file: !626, line: 149, baseType: !440, size: 32, offset: 12640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !625, file: !626, line: 150, baseType: !916, size: 32, offset: 12672)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !625, file: !626, line: 157, baseType: !467, size: 64, offset: 12736)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !602, file: !597, line: 40, baseType: !591, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !602, file: !597, line: 41, baseType: !620, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !602, file: !597, line: 42, baseType: !591, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !602, file: !597, line: 43, baseType: !620, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !602, file: !597, line: 44, baseType: !591, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !602, file: !597, line: 46, baseType: !620, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !602, file: !597, line: 47, baseType: !925, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!393, !594, !799, !799, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !931, file: !63, line: 1227, baseType: !495, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !931, file: !63, line: 1228, baseType: !495, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !931, file: !63, line: 1229, baseType: !495, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !931, file: !63, line: 1230, baseType: !495, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !931, file: !63, line: 1231, baseType: !495, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !931, file: !63, line: 1232, baseType: !495, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !931, file: !63, line: 1233, baseType: !495, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !931, file: !63, line: 1234, baseType: !495, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !931, file: !63, line: 1236, baseType: !495, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !931, file: !63, line: 1237, baseType: !495, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !931, file: !63, line: 1238, baseType: !495, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !602, file: !597, line: 48, baseType: !945, size: 64, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!393, !594, !799, !928}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !602, file: !597, line: 49, baseType: !949, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!393, !594, !623, !495, !952, !495, !440, !440, !623}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !602, file: !597, line: 50, baseType: !954, size: 64, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!393, !594, !957, !958}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !602, file: !597, line: 52, baseType: !960, size: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!393, !594, !963, !964}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !966, file: !63, line: 593, baseType: !442, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !966, file: !63, line: 594, baseType: !442, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !966, file: !63, line: 594, baseType: !442, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !966, file: !63, line: 594, baseType: !442, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !966, file: !63, line: 595, baseType: !442, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !966, file: !63, line: 596, baseType: !442, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !966, file: !63, line: 597, baseType: !442, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !966, file: !63, line: 598, baseType: !442, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !966, file: !63, line: 598, baseType: !442, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !966, file: !63, line: 599, baseType: !442, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !602, file: !597, line: 53, baseType: !979, size: 64, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!393, !594, !594, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !602, file: !597, line: 54, baseType: !984, size: 64, offset: 1088)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!393, !594, !623}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !602, file: !597, line: 55, baseType: !591, size: 64, offset: 1152)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !602, file: !597, line: 56, baseType: !989, size: 64, offset: 1216)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!393, !594, !661, !494}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !602, file: !597, line: 58, baseType: !993, size: 64, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!393, !594, !996}
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !602, file: !597, line: 59, baseType: !993, size: 64, offset: 1344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !602, file: !597, line: 60, baseType: !999, size: 64, offset: 1408)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!393, !594, !1002, !556}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !602, file: !597, line: 61, baseType: !1004, size: 64, offset: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!393, !594}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !602, file: !597, line: 63, baseType: !1008, size: 64, offset: 1536)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!393, !594, !440, !608, !504, !623, !623}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !602, file: !597, line: 64, baseType: !1012, size: 64, offset: 1600)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!393, !594, !594, !799, !799, !928}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !602, file: !597, line: 65, baseType: !1016, size: 64, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!393, !594, !594, !928}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !602, file: !597, line: 66, baseType: !1020, size: 64, offset: 1728)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!393, !594, !594, !799, !928}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !602, file: !597, line: 67, baseType: !1016, size: 64, offset: 1792)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !602, file: !597, line: 69, baseType: !1004, size: 64, offset: 1856)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !602, file: !597, line: 70, baseType: !1012, size: 64, offset: 1920)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !602, file: !597, line: 71, baseType: !1020, size: 64, offset: 1984)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !602, file: !597, line: 72, baseType: !1028, size: 64, offset: 2048)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!393, !594, !958}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !602, file: !597, line: 73, baseType: !1004, size: 64, offset: 2112)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !602, file: !597, line: 75, baseType: !1033, size: 64, offset: 2176)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!393, !594, !1036, !958}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !602, file: !597, line: 76, baseType: !591, size: 64, offset: 2240)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !602, file: !597, line: 77, baseType: !591, size: 64, offset: 2304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !602, file: !597, line: 78, baseType: !925, size: 64, offset: 2368)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !602, file: !597, line: 79, baseType: !945, size: 64, offset: 2432)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !602, file: !597, line: 81, baseType: !1042, size: 64, offset: 2496)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!393, !594, !504, !594, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !602, file: !597, line: 82, baseType: !1047, size: 64, offset: 2560)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!393, !594, !440, !1050, !1050, !957, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !602, file: !597, line: 83, baseType: !1054, size: 64, offset: 2624)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!393, !594, !440, !843, !440}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !602, file: !597, line: 84, baseType: !1058, size: 64, offset: 2688)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!393, !594, !440, !608, !440, !608, !503}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !602, file: !597, line: 85, baseType: !1062, size: 64, offset: 2752)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!393, !594, !594, !1045}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !602, file: !597, line: 87, baseType: !1066, size: 64, offset: 2816)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!393, !594, !623, !486}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !602, file: !597, line: 88, baseType: !1070, size: 64, offset: 2880)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!393, !594, !504}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !602, file: !597, line: 89, baseType: !1070, size: 64, offset: 2944)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !602, file: !597, line: 90, baseType: !1075, size: 64, offset: 3008)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!393, !594, !623, !612}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !602, file: !597, line: 91, baseType: !1008, size: 64, offset: 3072)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !602, file: !597, line: 93, baseType: !1080, size: 64, offset: 3136)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!393, !594, !728}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !602, file: !597, line: 94, baseType: !1084, size: 64, offset: 3200)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!393, !594, !440, !556, !556, !486, !1087, !1087, !982}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !602, file: !597, line: 95, baseType: !1084, size: 64, offset: 3264)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !602, file: !597, line: 96, baseType: !1084, size: 64, offset: 3328)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !602, file: !597, line: 97, baseType: !1084, size: 64, offset: 3392)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !602, file: !597, line: 99, baseType: !1092, size: 64, offset: 3456)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!393, !594, !1095, !1098}
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !760, line: 51, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !760, line: 51, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !597, line: 609, size: 6208, elements: !1101)
!1101 = !{!1102, !1103, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1122, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1140, !1141, !1142, !1143, !1144, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1100, file: !597, line: 610, baseType: !378, size: 4480)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1100, file: !597, line: 610, baseType: !1104, size: 32, offset: 4480)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !436)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1100, file: !597, line: 611, baseType: !440, size: 32, offset: 4512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1100, file: !597, line: 611, baseType: !440, size: 32, offset: 4544)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1100, file: !597, line: 611, baseType: !440, size: 32, offset: 4576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1100, file: !597, line: 612, baseType: !440, size: 32, offset: 4608)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1100, file: !597, line: 613, baseType: !440, size: 32, offset: 4640)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1100, file: !597, line: 614, baseType: !486, size: 64, offset: 4672)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1100, file: !597, line: 615, baseType: !488, size: 64, offset: 4736)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1100, file: !597, line: 616, baseType: !843, size: 64, offset: 4800)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1100, file: !597, line: 617, baseType: !486, size: 64, offset: 4864)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1100, file: !597, line: 618, baseType: !1115, size: 64, offset: 4928)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !597, line: 602, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 598, size: 128, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1117, file: !597, line: 599, baseType: !440, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1117, file: !597, line: 600, baseType: !440, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1117, file: !597, line: 601, baseType: !503, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1100, file: !597, line: 619, baseType: !1123, size: 64, offset: 4992)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !597, line: 607, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 604, size: 128, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1125, file: !597, line: 605, baseType: !440, size: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1125, file: !597, line: 606, baseType: !503, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1100, file: !597, line: 620, baseType: !503, size: 64, offset: 5056)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1100, file: !597, line: 621, baseType: !495, size: 64, offset: 5120)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1100, file: !597, line: 622, baseType: !495, size: 64, offset: 5184)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1100, file: !597, line: 623, baseType: !623, size: 64, offset: 5248)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1100, file: !597, line: 623, baseType: !623, size: 64, offset: 5312)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1100, file: !597, line: 623, baseType: !623, size: 64, offset: 5376)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1100, file: !597, line: 624, baseType: !556, size: 32, offset: 5440)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1100, file: !597, line: 625, baseType: !1137, size: 64, offset: 5504)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!393}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1100, file: !597, line: 626, baseType: !477, size: 64, offset: 5568)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1100, file: !597, line: 627, baseType: !623, size: 64, offset: 5632)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1100, file: !597, line: 628, baseType: !440, size: 32, offset: 5696)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1100, file: !597, line: 629, baseType: !417, size: 64, offset: 5760)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1100, file: !597, line: 630, baseType: !1145, size: 32, offset: 5824)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1100, file: !597, line: 631, baseType: !440, size: 32, offset: 5856)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1100, file: !597, line: 631, baseType: !440, size: 32, offset: 5888)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1100, file: !597, line: 632, baseType: !556, size: 32, offset: 5920)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1100, file: !597, line: 633, baseType: !556, size: 32, offset: 5952)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1100, file: !597, line: 634, baseType: !428, size: 64, offset: 6016)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1100, file: !597, line: 634, baseType: !477, size: 64, offset: 6080)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1100, file: !597, line: 635, baseType: !448, size: 64, offset: 6144)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !602, file: !597, line: 100, baseType: !1154, size: 64, offset: 3520)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!393, !594, !440, !440, !1157, !1160}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1159)
!1159 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !602, file: !597, line: 101, baseType: !1004, size: 64, offset: 3584)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !602, file: !597, line: 102, baseType: !1163, size: 64, offset: 3648)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!393, !594, !799, !799, !958}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !602, file: !597, line: 103, baseType: !605, size: 64, offset: 3712)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !602, file: !597, line: 105, baseType: !1168, size: 64, offset: 3776)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!393, !594, !799, !799, !957, !958}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !602, file: !597, line: 106, baseType: !1004, size: 64, offset: 3840)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !602, file: !597, line: 107, baseType: !1173, size: 64, offset: 3904)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!393, !594, !404}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !602, file: !597, line: 108, baseType: !1177, size: 64, offset: 3968)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!393, !594, !1180, !957, !958}
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !417)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !602, file: !597, line: 109, baseType: !1137, size: 64, offset: 4032)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !602, file: !597, line: 111, baseType: !1183, size: 64, offset: 4096)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!393, !594, !594, !594, !495, !594}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !602, file: !597, line: 112, baseType: !1187, size: 64, offset: 4160)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!393, !594, !594, !594, !594}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !602, file: !597, line: 113, baseType: !1191, size: 64, offset: 4224)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!393, !594, !759, !759}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !602, file: !597, line: 114, baseType: !605, size: 64, offset: 4288)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !602, file: !597, line: 115, baseType: !1008, size: 64, offset: 4352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !602, file: !597, line: 117, baseType: !1066, size: 64, offset: 4416)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !602, file: !597, line: 118, baseType: !1066, size: 64, offset: 4480)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !602, file: !597, line: 119, baseType: !1177, size: 64, offset: 4544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !602, file: !597, line: 120, baseType: !1200, size: 64, offset: 4608)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!393, !594, !1203, !982}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !602, file: !597, line: 121, baseType: !1137, size: 64, offset: 4672)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !602, file: !597, line: 123, baseType: !1206, size: 64, offset: 4736)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!393, !594, !440, !477}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !602, file: !597, line: 124, baseType: !1210, size: 64, offset: 4800)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!393, !594, !1098, !623, !477}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !602, file: !597, line: 125, baseType: !1214, size: 64, offset: 4864)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!393, !532, !594}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !602, file: !597, line: 126, baseType: !591, size: 64, offset: 4928)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !602, file: !597, line: 127, baseType: !591, size: 64, offset: 4992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !602, file: !597, line: 129, baseType: !1220, size: 64, offset: 5056)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!393, !594, !843}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !602, file: !597, line: 130, baseType: !1224, size: 64, offset: 5120)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!393, !594, !1227, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1229, file: !36, line: 653, baseType: !440, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1229, file: !36, line: 653, baseType: !623, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !602, file: !597, line: 131, baseType: !1224, size: 64, offset: 5184)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !602, file: !597, line: 132, baseType: !1235, size: 64, offset: 5248)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!393, !594, !486, !486, !486}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !602, file: !597, line: 133, baseType: !1173, size: 64, offset: 5312)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !602, file: !597, line: 135, baseType: !1240, size: 64, offset: 5376)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!393, !594, !495, !982}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !602, file: !597, line: 136, baseType: !1240, size: 64, offset: 5440)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !602, file: !597, line: 137, baseType: !1245, size: 64, offset: 5504)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!393, !594, !982}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !602, file: !597, line: 138, baseType: !605, size: 64, offset: 5568)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !602, file: !597, line: 139, baseType: !1250, size: 64, offset: 5632)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!393, !594, !637, !637}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !602, file: !597, line: 141, baseType: !1137, size: 64, offset: 5696)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !602, file: !597, line: 142, baseType: !1255, size: 64, offset: 5760)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!393, !594, !594, !495, !594}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !602, file: !597, line: 143, baseType: !1259, size: 64, offset: 5824)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!393, !594, !594, !594}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !602, file: !597, line: 144, baseType: !1137, size: 64, offset: 5888)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !602, file: !597, line: 145, baseType: !1255, size: 64, offset: 5952)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !602, file: !597, line: 147, baseType: !1259, size: 64, offset: 6016)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !602, file: !597, line: 148, baseType: !1137, size: 64, offset: 6080)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !602, file: !597, line: 149, baseType: !1255, size: 64, offset: 6144)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !602, file: !597, line: 150, baseType: !1259, size: 64, offset: 6208)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !602, file: !597, line: 151, baseType: !1269, size: 64, offset: 6272)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!393, !594, !556}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !602, file: !597, line: 153, baseType: !1004, size: 64, offset: 6336)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !602, file: !597, line: 154, baseType: !1004, size: 64, offset: 6400)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !602, file: !597, line: 155, baseType: !1004, size: 64, offset: 6464)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !602, file: !597, line: 156, baseType: !1004, size: 64, offset: 6528)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !602, file: !597, line: 157, baseType: !1173, size: 64, offset: 6592)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !602, file: !597, line: 159, baseType: !1278, size: 64, offset: 6656)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!393, !594, !440, !610}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !602, file: !597, line: 160, baseType: !1004, size: 64, offset: 6720)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !602, file: !597, line: 161, baseType: !1004, size: 64, offset: 6784)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !602, file: !597, line: 162, baseType: !1004, size: 64, offset: 6848)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !602, file: !597, line: 163, baseType: !1004, size: 64, offset: 6912)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !602, file: !597, line: 165, baseType: !1259, size: 64, offset: 6976)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !602, file: !597, line: 166, baseType: !1259, size: 64, offset: 7040)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !602, file: !597, line: 167, baseType: !1066, size: 64, offset: 7104)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !602, file: !597, line: 168, baseType: !1289, size: 64, offset: 7168)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!393, !594, !623, !440}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !602, file: !597, line: 169, baseType: !1293, size: 64, offset: 7232)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!393, !594, !982, !486}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !602, file: !597, line: 171, baseType: !1028, size: 64, offset: 7296)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !602, file: !597, line: 172, baseType: !1004, size: 64, offset: 7360)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !602, file: !597, line: 173, baseType: !1299, size: 64, offset: 7424)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!393, !594, !486, !1087}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !602, file: !597, line: 174, baseType: !1163, size: 64, offset: 7488)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !602, file: !597, line: 175, baseType: !1163, size: 64, offset: 7552)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !602, file: !597, line: 177, baseType: !591, size: 64, offset: 7616)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !602, file: !597, line: 178, baseType: !954, size: 64, offset: 7680)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !602, file: !597, line: 179, baseType: !591, size: 64, offset: 7744)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !602, file: !597, line: 180, baseType: !620, size: 64, offset: 7808)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !602, file: !597, line: 181, baseType: !1309, size: 64, offset: 7872)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!393, !594, !397, !957, !958}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !602, file: !597, line: 183, baseType: !1220, size: 64, offset: 7936)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !602, file: !597, line: 184, baseType: !989, size: 64, offset: 8000)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !602, file: !597, line: 185, baseType: !1315, size: 64, offset: 8064)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!393, !594, !807}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !602, file: !597, line: 186, baseType: !1319, size: 64, offset: 8128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!393, !594, !440, !608, !503}
