; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/interface/linesearchregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/interface/linesearchregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!120 = distinct !DILexicalBlock(scope: !117, file: !55, line: 25, column: 40)
!121 = !DILocation(line: 25, column: 40, scope: !120)
!122 = !DILocation(line: 25, column: 40, scope: !123)
!123 = distinct !DILexicalBlock(scope: !119, file: !55, line: 25, column: 40)
!124 = !DILocation(line: 26, column: 35, scope: !54)
!125 = !DILocation(line: 27, column: 10, scope: !54)
!126 = !DILocation(line: 0, scope: !54)
!127 = !DILocation(line: 0, scope: !63)
!128 = !DILocation(line: 27, column: 86, scope: !129)
!129 = distinct !DILexicalBlock(scope: !63, file: !55, line: 27, column: 86)
!130 = !DILocation(line: 27, column: 86, scope: !63)
!131 = !{!"branch_weights", i32 2000, i32 1}
!132 = !DILocation(line: 28, column: 10, scope: !54)
!133 = !DILocation(line: 0, scope: !65)
!134 = !DILocation(line: 28, column: 86, scope: !135)
!135 = distinct !DILexicalBlock(scope: !65, file: !55, line: 28, column: 86)
!136 = !DILocation(line: 28, column: 86, scope: !65)
!137 = !DILocation(line: 29, column: 10, scope: !54)
!138 = !DILocation(line: 0, scope: !67)
!139 = !DILocation(line: 29, column: 83, scope: !140)
!140 = distinct !DILexicalBlock(scope: !67, file: !55, line: 29, column: 83)
!141 = !DILocation(line: 29, column: 83, scope: !67)
!142 = !DILocation(line: 30, column: 10, scope: !54)
!143 = !DILocation(line: 0, scope: !69)
!144 = !DILocation(line: 30, column: 83, scope: !145)
!145 = distinct !DILexicalBlock(scope: !69, file: !55, line: 30, column: 83)
!146 = !DILocation(line: 30, column: 83, scope: !69)
!147 = !DILocation(line: 31, column: 10, scope: !54)
!148 = !DILocation(line: 0, scope: !71)
!149 = !DILocation(line: 31, column: 88, scope: !150)
!150 = distinct !DILexicalBlock(scope: !71, file: !55, line: 31, column: 88)
!151 = !DILocation(line: 31, column: 88, scope: !71)
!152 = !DILocation(line: 32, column: 10, scope: !54)
!153 = !DILocation(line: 0, scope: !73)
!154 = !DILocation(line: 32, column: 83, scope: !155)
!155 = distinct !DILexicalBlock(scope: !73, file: !55, line: 32, column: 83)
!156 = !DILocation(line: 32, column: 83, scope: !73)
!157 = !DILocation(line: 33, column: 10, scope: !54)
!158 = !DILocation(line: 0, scope: !75)
!159 = !DILocation(line: 33, column: 90, scope: !160)
!160 = distinct !DILexicalBlock(scope: !75, file: !55, line: 33, column: 90)
!161 = !DILocation(line: 33, column: 90, scope: !75)
!162 = !DILocation(line: 34, column: 3, scope: !163)
!163 = distinct !DILexicalBlock(scope: !164, file: !55, line: 34, column: 3)
!164 = distinct !DILexicalBlock(scope: !165, file: !55, line: 34, column: 3)
!165 = distinct !DILexicalBlock(scope: !54, file: !55, line: 34, column: 3)
!166 = !DILocation(line: 34, column: 3, scope: !164)
!167 = !DILocation(line: 34, column: 3, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !55, line: 34, column: 3)
!169 = distinct !DILexicalBlock(scope: !163, file: !55, line: 34, column: 3)
!170 = !DILocation(line: 34, column: 3, scope: !169)
!171 = !DILocation(line: 34, column: 3, scope: !172)
!172 = distinct !DILexicalBlock(scope: !173, file: !55, line: 34, column: 3)
!173 = distinct !DILexicalBlock(scope: !168, file: !55, line: 34, column: 3)
!174 = !DILocation(line: 34, column: 3, scope: !173)
!175 = !DILocation(line: 34, column: 3, scope: !176)
!176 = distinct !DILexicalBlock(scope: !172, file: !55, line: 34, column: 3)
!177 = !DILocation(line: 34, column: 3, scope: !178)
!178 = distinct !DILexicalBlock(scope: !168, file: !55, line: 34, column: 3)
!179 = !DILocation(line: 34, column: 3, scope: !180)
!180 = distinct !DILexicalBlock(scope: !178, file: !55, line: 34, column: 3)
!181 = !DILocation(line: 34, column: 3, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !55, line: 34, column: 3)
!183 = distinct !DILexicalBlock(scope: !180, file: !55, line: 34, column: 3)
!184 = !DILocation(line: 34, column: 3, scope: !183)
!185 = !DILocation(line: 34, column: 3, scope: !186)
!186 = distinct !DILexicalBlock(scope: !182, file: !55, line: 34, column: 3)
!187 = !DILocation(line: 35, column: 1, scope: !54)
!188 = !DISubprogram(name: "SNESLineSearchRegister", scope: !25, file: !25, line: 655, type: !189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !494)
!189 = !DISubroutineType(types: !190)
!190 = !{!59, !40, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!59, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !196, line: 29, size: 8000, elements: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!197 = !{!198, !399, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !465, !466, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !486, !492, !493}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !195, file: !196, line: 30, baseType: !199, size: 4480)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !200, line: 122, baseType: !201)
!200 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !200, line: 73, size: 4480, elements: !202)
!202 = !{!203, !205, !252, !253, !255, !258, !259, !260, !261, !269, !270, !272, !276, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !293, !294, !295, !297, !298, !300, !302, !303, !304, !305, !306, !309, !311, !312, !313, !314, !315, !318, !320, !321, !322, !332, !334, !335, !339, !340, !389, !394, !396, !397, !398}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !201, file: !200, line: 74, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !59)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !201, file: !200, line: 75, baseType: !206, size: 448, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 448, elements: !250)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !200, line: 53, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 45, size: 448, elements: !209)
!209 = !{!210, !217, !225, !230, !234, !238, !245}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !208, file: !200, line: 46, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!58, !214, !216}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !208, file: !200, line: 47, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!58, !214, !221}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !222, line: 16, baseType: !223)
!222 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !222, line: 16, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !208, file: !200, line: 48, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!58, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !208, file: !200, line: 49, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!58, !214, !40, !214}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !208, file: !200, line: 50, baseType: !235, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!58, !214, !40, !229}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !208, file: !200, line: 51, baseType: !239, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!58, !214, !40, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !208, file: !200, line: 52, baseType: !246, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!58, !214, !40, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!250 = !{!251}
!251 = !DISubrange(count: 1)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !201, file: !200, line: 76, baseType: !43, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !200, line: 77, baseType: !254, size: 32, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !59)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !201, file: !200, line: 78, baseType: !256, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !257)
!257 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !201, file: !200, line: 78, baseType: !256, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !201, file: !200, line: 78, baseType: !256, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !201, file: !200, line: 78, baseType: !256, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !200, line: 79, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !265, line: 27, baseType: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !267, line: 43, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !201, file: !200, line: 80, baseType: !254, size: 32, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !201, file: !200, line: 81, baseType: !271, size: 32, offset: 992)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !59)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !201, file: !200, line: 82, baseType: !273, size: 64, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !201, file: !200, line: 83, baseType: !277, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !201, file: !200, line: 84, baseType: !281, size: 64, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !201, file: !200, line: 85, baseType: !281, size: 64, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !201, file: !200, line: 86, baseType: !281, size: 64, offset: 1280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !201, file: !200, line: 87, baseType: !281, size: 64, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !201, file: !200, line: 88, baseType: !214, size: 64, offset: 1408)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !201, file: !200, line: 89, baseType: !262, size: 64, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !200, line: 90, baseType: !281, size: 64, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !201, file: !200, line: 91, baseType: !281, size: 64, offset: 1600)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !201, file: !200, line: 92, baseType: !254, size: 32, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !201, file: !200, line: 93, baseType: !47, size: 64, offset: 1728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !201, file: !200, line: 94, baseType: !292, size: 64, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !263)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !201, file: !200, line: 95, baseType: !254, size: 32, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !201, file: !200, line: 95, baseType: !254, size: 32, offset: 1888)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !201, file: !200, line: 96, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !201, file: !200, line: 96, baseType: !296, size: 64, offset: 1984)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !201, file: !200, line: 97, baseType: !299, size: 64, offset: 2048)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !201, file: !200, line: 97, baseType: !301, size: 64, offset: 2112)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !201, file: !200, line: 98, baseType: !254, size: 32, offset: 2176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !201, file: !200, line: 98, baseType: !254, size: 32, offset: 2208)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !201, file: !200, line: 99, baseType: !296, size: 64, offset: 2240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !201, file: !200, line: 99, baseType: !296, size: 64, offset: 2304)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !201, file: !200, line: 100, baseType: !307, size: 64, offset: 2368)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !257)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !201, file: !200, line: 100, baseType: !310, size: 64, offset: 2432)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !201, file: !200, line: 101, baseType: !254, size: 32, offset: 2496)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !201, file: !200, line: 101, baseType: !254, size: 32, offset: 2528)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !201, file: !200, line: 102, baseType: !296, size: 64, offset: 2560)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !201, file: !200, line: 102, baseType: !296, size: 64, offset: 2624)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !201, file: !200, line: 103, baseType: !316, size: 64, offset: 2688)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !308)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !201, file: !200, line: 103, baseType: !319, size: 64, offset: 2752)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !201, file: !200, line: 104, baseType: !249, size: 64, offset: 2816)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !201, file: !200, line: 105, baseType: !254, size: 32, offset: 2880)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !201, file: !200, line: 106, baseType: !323, size: 128, offset: 2944)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 128, elements: !330)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !200, line: 64, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 61, size: 128, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !326, file: !200, line: 62, baseType: !242, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !326, file: !200, line: 63, baseType: !47, size: 64, offset: 64)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !201, file: !200, line: 107, baseType: !333, size: 64, offset: 3072)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !330)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !201, file: !200, line: 108, baseType: !47, size: 64, offset: 3136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !201, file: !200, line: 109, baseType: !336, size: 64, offset: 3200)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!58, !47}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !201, file: !200, line: 111, baseType: !254, size: 32, offset: 3264)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !201, file: !200, line: 112, baseType: !341, size: 320, offset: 3328)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, elements: !387)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!58, !345, !214, !47}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !348)
!348 = !{!349, !350, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !347, file: !10, line: 100, baseType: !254, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !10, line: 101, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !362, !363, !364, !368, !370, !372, !373, !374}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !353, file: !10, line: 84, baseType: !281, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !353, file: !10, line: 85, baseType: !281, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !10, line: 86, baseType: !47, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !353, file: !10, line: 87, baseType: !273, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !353, file: !10, line: 88, baseType: !360, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !353, file: !10, line: 89, baseType: !42, size: 8, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !353, file: !10, line: 90, baseType: !281, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !353, file: !10, line: 91, baseType: !365, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !366, line: 46, baseType: !367)
!366 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!367 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !353, file: !10, line: 92, baseType: !369, size: 32, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !10, line: 93, baseType: !371, size: 32, offset: 544)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !10, line: 94, baseType: !351, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !353, file: !10, line: 95, baseType: !281, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !353, file: !10, line: 96, baseType: !47, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !347, file: !10, line: 102, baseType: !281, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !347, file: !10, line: 102, baseType: !281, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !347, file: !10, line: 103, baseType: !281, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !347, file: !10, line: 104, baseType: !43, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !347, file: !10, line: 105, baseType: !369, size: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !347, file: !10, line: 105, baseType: !369, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !347, file: !10, line: 105, baseType: !369, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !347, file: !10, line: 106, baseType: !214, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !347, file: !10, line: 107, baseType: !384, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!387 = !{!388}
!388 = !DISubrange(count: 5)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !201, file: !200, line: 113, baseType: !390, size: 320, offset: 3648)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 320, elements: !387)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!58, !214, !47}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !201, file: !200, line: 114, baseType: !395, size: 320, offset: 3968)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 320, elements: !387)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !201, file: !200, line: 115, baseType: !369, size: 32, offset: 4288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !200, line: 120, baseType: !384, size: 64, offset: 4352)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !201, file: !200, line: 121, baseType: !369, size: 32, offset: 4416)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !195, file: !196, line: 30, baseType: !400, size: 704, offset: 4480)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 704, elements: !250)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !196, line: 13, size: 704, elements: !402)
!402 = !{!403, !408, !413, !422, !430, !435, !439, !443, !444, !445, !446}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !401, file: !196, line: 14, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!58, !407, !221}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !194)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !401, file: !196, line: 15, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!58, !407}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !401, file: !196, line: 16, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!58, !407, !417, !417, !421, !47}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !418, line: 21, baseType: !419)
!418 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !418, line: 21, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !401, file: !196, line: 17, baseType: !423, size: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!58, !427, !417}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !25, line: 18, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !401, file: !196, line: 18, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!58, !427, !417, !417, !307}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !401, file: !196, line: 19, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!58, !407, !417, !417, !417, !421, !421, !47}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !401, file: !196, line: 20, baseType: !440, size: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!58, !345, !407}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !401, file: !196, line: 21, baseType: !410, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !401, file: !196, line: 22, baseType: !410, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !401, file: !196, line: 23, baseType: !410, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !401, file: !196, line: 24, baseType: !447, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!58, !427, !417, !417}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !195, file: !196, line: 32, baseType: !427, size: 64, offset: 5184)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 34, baseType: !47, size: 64, offset: 5248)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !195, file: !196, line: 36, baseType: !369, size: 32, offset: 5312)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !195, file: !196, line: 38, baseType: !417, size: 64, offset: 5376)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !195, file: !196, line: 39, baseType: !417, size: 64, offset: 5440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !195, file: !196, line: 40, baseType: !417, size: 64, offset: 5504)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !195, file: !196, line: 41, baseType: !417, size: 64, offset: 5568)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !195, file: !196, line: 42, baseType: !417, size: 64, offset: 5632)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !195, file: !196, line: 44, baseType: !254, size: 32, offset: 5696)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !195, file: !196, line: 45, baseType: !460, size: 64, offset: 5760)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !195, file: !196, line: 47, baseType: !308, size: 64, offset: 5824)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !195, file: !196, line: 49, baseType: !369, size: 32, offset: 5888)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !195, file: !196, line: 50, baseType: !308, size: 64, offset: 5952)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !195, file: !196, line: 51, baseType: !308, size: 64, offset: 6016)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !195, file: !196, line: 52, baseType: !308, size: 64, offset: 6080)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !195, file: !196, line: 53, baseType: !467, size: 32, offset: 6144)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !24)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !195, file: !196, line: 54, baseType: !369, size: 32, offset: 6176)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !195, file: !196, line: 56, baseType: !308, size: 64, offset: 6208)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !195, file: !196, line: 57, baseType: !308, size: 64, offset: 6272)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !195, file: !196, line: 58, baseType: !308, size: 64, offset: 6336)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !195, file: !196, line: 59, baseType: !254, size: 32, offset: 6400)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !195, file: !196, line: 60, baseType: !308, size: 64, offset: 6464)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !195, file: !196, line: 61, baseType: !308, size: 64, offset: 6528)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !195, file: !196, line: 62, baseType: !308, size: 64, offset: 6592)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !195, file: !196, line: 63, baseType: !254, size: 32, offset: 6656)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !195, file: !196, line: 65, baseType: !308, size: 64, offset: 6720)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !195, file: !196, line: 67, baseType: !47, size: 64, offset: 6784)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !195, file: !196, line: 68, baseType: !47, size: 64, offset: 6848)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !195, file: !196, line: 70, baseType: !221, size: 64, offset: 6912)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !195, file: !196, line: 71, baseType: !482, size: 320, offset: 6976)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 320, elements: !387)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!58, !407, !47}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !195, file: !196, line: 72, baseType: !487, size: 320, offset: 7296)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 320, elements: !387)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!58, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !195, file: !196, line: 73, baseType: !395, size: 320, offset: 7616)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !195, file: !196, line: 74, baseType: !254, size: 32, offset: 7936)
!494 = !{}
!495 = !DISubprogram(name: "PetscError", scope: !34, file: !34, line: 668, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !494)
!496 = !DISubroutineType(types: !497)
!497 = !{!58, !45, !59, !40, !40, !59, !33, !40, null}
