; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/ipm/pdipm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/ipm/pdipm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!326 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!327 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!328 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!329 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!330 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!331 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 26, baseType: !5, size: 32, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!335 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!336 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 663, baseType: !5, size: 32, elements: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!339 = !{!340, !341, !342}
!340 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !344, line: 238, baseType: !72, size: 32, elements: !345)
!344 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!346 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!347 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!348 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!349 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!350 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!351 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!352 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!353 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!354 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!355 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!356 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!357 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!358 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!359 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!360 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!361 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!362 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 180, baseType: !5, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375}
!370 = !DIEnumerator(name: "PC_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "PC_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "PC_COMPOSITE_SYMMETRIC_MULTIPLICATIVE", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "PC_COMPOSITE_SPECIAL", value: 3, isUnsigned: true)
!374 = !DIEnumerator(name: "PC_COMPOSITE_SCHUR", value: 4, isUnsigned: true)
!375 = !DIEnumerator(name: "PC_COMPOSITE_GKB", value: 5, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !344, line: 616, baseType: !5, size: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383}
!378 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!382 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!384 = !{!385, !389, !390, !480, !460, !435, !528, !72, !611, !1296, !1434, !1437}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !386, line: 330, baseType: !387)
!386 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !386, line: 330, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_PDIPM", file: !392, line: 85, baseType: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/constrained/impls/ipm/pdipm.h", directory: "/home/users/ndemeye/xSDK")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 11, size: 3136, elements: !394)
!394 = !{!395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !436, !437, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1430, !1431, !1432, !1433}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !393, file: !392, line: 13, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Nx", scope: !393, file: !392, line: 13, baseType: !396, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nxfixed", scope: !393, file: !392, line: 14, baseType: !396, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Nxfixed", scope: !393, file: !392, line: 14, baseType: !396, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nxlb", scope: !393, file: !392, line: 15, baseType: !396, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Nxlb", scope: !393, file: !392, line: 15, baseType: !396, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nxub", scope: !393, file: !392, line: 16, baseType: !396, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Nxub", scope: !393, file: !392, line: 16, baseType: !396, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nxbox", scope: !393, file: !392, line: 17, baseType: !396, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Nxbox", scope: !393, file: !392, line: 17, baseType: !396, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nxfree", scope: !393, file: !392, line: 18, baseType: !396, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Nxfree", scope: !393, file: !392, line: 18, baseType: !396, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ng", scope: !393, file: !392, line: 19, baseType: !396, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Ng", scope: !393, file: !392, line: 19, baseType: !396, size: 32, offset: 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !393, file: !392, line: 20, baseType: !396, size: 32, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !393, file: !392, line: 20, baseType: !396, size: 32, offset: 480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nce", scope: !393, file: !392, line: 21, baseType: !396, size: 32, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Nce", scope: !393, file: !392, line: 21, baseType: !396, size: 32, offset: 544)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nci", scope: !393, file: !392, line: 22, baseType: !396, size: 32, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Nci", scope: !393, file: !392, line: 22, baseType: !396, size: 32, offset: 608)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !393, file: !392, line: 23, baseType: !396, size: 32, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !393, file: !392, line: 23, baseType: !396, size: 32, offset: 672)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !393, file: !392, line: 26, baseType: !419, size: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !393, file: !392, line: 27, baseType: !419, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lambdae", scope: !393, file: !392, line: 28, baseType: !419, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lambdai", scope: !393, file: !392, line: 29, baseType: !419, size: 64, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !393, file: !392, line: 30, baseType: !419, size: 64, offset: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lambdae_xfixed", scope: !393, file: !392, line: 33, baseType: !419, size: 64, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lambdai_xb", scope: !393, file: !392, line: 34, baseType: !419, size: 64, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ce", scope: !393, file: !392, line: 37, baseType: !419, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !393, file: !392, line: 37, baseType: !419, size: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "off_lambdae", scope: !393, file: !392, line: 40, baseType: !396, size: 32, offset: 1280)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "off_lambdai", scope: !393, file: !392, line: 40, baseType: !396, size: 32, offset: 1312)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "off_z", scope: !393, file: !392, line: 40, baseType: !396, size: 32, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !393, file: !392, line: 43, baseType: !434, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !435)
!435 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gradL", scope: !393, file: !392, line: 44, baseType: !434, size: 64, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Jce_xfixed", scope: !393, file: !392, line: 47, baseType: !438, size: 64, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !441, line: 436, size: 23424, elements: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!442 = !{!443, !645, !1149, !1169, !1170, !1171, !1173, !1174, !1175, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1302, !1303, !1319, !1320, !1321, !1322, !1323, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1358, !1378, !1379, !1381, !1382, !1383, !1384, !1385, !1386, !1404, !1405}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !440, file: !441, line: 437, baseType: !444, size: 4480)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !445, line: 122, baseType: !446)
!445 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !445, line: 73, size: 4480, elements: !447)
!447 = !{!448, !450, !501, !502, !503, !505, !506, !507, !508, !516, !517, !519, !523, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !540, !541, !542, !544, !545, !547, !549, !550, !551, !552, !553, !555, !557, !558, !559, !560, !561, !564, !566, !567, !568, !578, !580, !581, !585, !586, !635, !640, !642, !643, !644}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !446, file: !445, line: 74, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !446, file: !445, line: 75, baseType: !451, size: 448, offset: 64)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 448, elements: !499)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !445, line: 53, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 45, size: 448, elements: !454)
!454 = !{!455, !463, !471, !476, !483, !487, !494}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !453, file: !445, line: 46, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !460, !462}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !453, file: !445, line: 47, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!459, !460, !467}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !468, line: 16, baseType: !469)
!468 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !468, line: 16, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !453, file: !445, line: 48, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!459, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !453, file: !445, line: 49, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!459, !460, !480, !460}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !453, file: !445, line: 50, baseType: !484, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!459, !460, !480, !475}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !453, file: !445, line: 51, baseType: !488, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!459, !460, !480, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !453, file: !445, line: 52, baseType: !495, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!459, !460, !480, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!499 = !{!500}
!500 = !DISubrange(count: 1)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !446, file: !445, line: 76, baseType: !385, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !445, line: 77, baseType: !396, size: 32, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !446, file: !445, line: 78, baseType: !504, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !435)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !446, file: !445, line: 78, baseType: !504, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !446, file: !445, line: 78, baseType: !504, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !446, file: !445, line: 78, baseType: !504, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !446, file: !445, line: 79, baseType: !509, size: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !512, line: 27, baseType: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !514, line: 43, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!515 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !446, file: !445, line: 80, baseType: !396, size: 32, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !446, file: !445, line: 81, baseType: !518, size: 32, offset: 992)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !446, file: !445, line: 82, baseType: !520, size: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !446, file: !445, line: 83, baseType: !524, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !446, file: !445, line: 84, baseType: !528, size: 64, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !446, file: !445, line: 85, baseType: !528, size: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !446, file: !445, line: 86, baseType: !528, size: 64, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !446, file: !445, line: 87, baseType: !528, size: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !446, file: !445, line: 88, baseType: !460, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !446, file: !445, line: 89, baseType: !509, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !446, file: !445, line: 90, baseType: !528, size: 64, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !446, file: !445, line: 91, baseType: !528, size: 64, offset: 1600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !446, file: !445, line: 92, baseType: !396, size: 32, offset: 1664)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !446, file: !445, line: 93, baseType: !389, size: 64, offset: 1728)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !446, file: !445, line: 94, baseType: !539, size: 64, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !510)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !446, file: !445, line: 95, baseType: !396, size: 32, offset: 1856)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !446, file: !445, line: 95, baseType: !396, size: 32, offset: 1888)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !446, file: !445, line: 96, baseType: !543, size: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !446, file: !445, line: 96, baseType: !543, size: 64, offset: 1984)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !446, file: !445, line: 97, baseType: !546, size: 64, offset: 2048)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !446, file: !445, line: 97, baseType: !548, size: 64, offset: 2112)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !446, file: !445, line: 98, baseType: !396, size: 32, offset: 2176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !446, file: !445, line: 98, baseType: !396, size: 32, offset: 2208)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !446, file: !445, line: 99, baseType: !543, size: 64, offset: 2240)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !446, file: !445, line: 99, baseType: !543, size: 64, offset: 2304)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !446, file: !445, line: 100, baseType: !554, size: 64, offset: 2368)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !446, file: !445, line: 100, baseType: !556, size: 64, offset: 2432)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !446, file: !445, line: 101, baseType: !396, size: 32, offset: 2496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !446, file: !445, line: 101, baseType: !396, size: 32, offset: 2528)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !446, file: !445, line: 102, baseType: !543, size: 64, offset: 2560)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !446, file: !445, line: 102, baseType: !543, size: 64, offset: 2624)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !446, file: !445, line: 103, baseType: !562, size: 64, offset: 2688)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !434)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !446, file: !445, line: 103, baseType: !565, size: 64, offset: 2752)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !446, file: !445, line: 104, baseType: !498, size: 64, offset: 2816)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !446, file: !445, line: 105, baseType: !396, size: 32, offset: 2880)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !446, file: !445, line: 106, baseType: !569, size: 128, offset: 2944)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !576)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !445, line: 64, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 61, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !572, file: !445, line: 62, baseType: !491, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !572, file: !445, line: 63, baseType: !389, size: 64, offset: 64)
!576 = !{!577}
!577 = !DISubrange(count: 2)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !446, file: !445, line: 107, baseType: !579, size: 64, offset: 3072)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 64, elements: !576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !446, file: !445, line: 108, baseType: !389, size: 64, offset: 3136)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !446, file: !445, line: 109, baseType: !582, size: 64, offset: 3200)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!459, !389}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !446, file: !445, line: 111, baseType: !396, size: 32, offset: 3264)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !446, file: !445, line: 112, baseType: !587, size: 320, offset: 3328)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 320, elements: !633)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!459, !591, !460, !389}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !594)
!594 = !{!595, !596, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !593, file: !10, line: 100, baseType: !396, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !10, line: 101, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !608, !609, !610, !614, !616, !618, !619, !620}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !599, file: !10, line: 84, baseType: !528, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !599, file: !10, line: 85, baseType: !528, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !10, line: 86, baseType: !389, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !599, file: !10, line: 87, baseType: !520, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !599, file: !10, line: 88, baseType: !606, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !599, file: !10, line: 89, baseType: !482, size: 8, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !599, file: !10, line: 90, baseType: !528, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !599, file: !10, line: 91, baseType: !611, size: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !612, line: 46, baseType: !613)
!612 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!613 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !599, file: !10, line: 92, baseType: !615, size: 32, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !10, line: 93, baseType: !617, size: 32, offset: 544)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !10, line: 94, baseType: !597, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !599, file: !10, line: 95, baseType: !528, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !599, file: !10, line: 96, baseType: !389, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !593, file: !10, line: 102, baseType: !528, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !593, file: !10, line: 102, baseType: !528, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !593, file: !10, line: 103, baseType: !528, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !593, file: !10, line: 104, baseType: !385, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !593, file: !10, line: 105, baseType: !615, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !593, file: !10, line: 105, baseType: !615, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !593, file: !10, line: 105, baseType: !615, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !593, file: !10, line: 106, baseType: !460, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !593, file: !10, line: 107, baseType: !630, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!633 = !{!634}
!634 = !DISubrange(count: 5)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !446, file: !445, line: 113, baseType: !636, size: 320, offset: 3648)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 320, elements: !633)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!459, !460, !389}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !446, file: !445, line: 114, baseType: !641, size: 320, offset: 3968)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 320, elements: !633)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !446, file: !445, line: 115, baseType: !615, size: 32, offset: 4288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !446, file: !445, line: 120, baseType: !630, size: 64, offset: 4352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !446, file: !445, line: 121, baseType: !615, size: 32, offset: 4416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !440, file: !441, line: 437, baseType: !646, size: 9472, offset: 4480)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 9472, elements: !499)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !441, line: 32, size: 9472, elements: !648)
!648 = !{!649, !658, !662, !663, !667, !671, !672, !673, !674, !675, !676, !677, !701, !705, !710, !716, !735, !740, !744, !745, !750, !755, !756, !761, !765, !769, !773, !777, !781, !782, !783, !784, !785, !789, !790, !795, !796, !797, !798, !799, !804, !811, !816, !820, !824, !828, !832, !833, !837, !838, !845, !850, !851, !852, !853, !915, !923, !924, !928, !929, !933, !934, !938, !943, !944, !948, !952, !959, !960, !961, !962, !963, !964, !969, !970, !974, !978, !982, !983, !984, !988, !998, !999, !1003, !1004, !1008, !1009, !1013, !1014, !1019, !1020, !1024, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1038, !1039, !1040, !1041, !1042, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1058, !1062, !1063, !1064, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1078, !1079, !1080, !1085, !1089, !1090, !1094, !1095, !1096, !1097, !1123, !1127, !1128, !1129, !1130, !1131, !1135, !1136, !1137, !1138, !1139, !1143, !1147, !1148}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !647, file: !441, line: 34, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!459, !438, !396, !653, !396, !653, !655, !657}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !647, file: !441, line: 35, baseType: !659, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!459, !438, !396, !546, !548, !565}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !647, file: !441, line: 36, baseType: !659, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !647, file: !441, line: 37, baseType: !664, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!459, !438, !419, !419}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !647, file: !441, line: 38, baseType: !668, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!459, !438, !419, !419, !419}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !647, file: !441, line: 40, baseType: !664, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !647, file: !441, line: 41, baseType: !668, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !647, file: !441, line: 42, baseType: !664, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !647, file: !441, line: 43, baseType: !668, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !647, file: !441, line: 44, baseType: !664, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !647, file: !441, line: 46, baseType: !668, size: 64, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !647, file: !441, line: 47, baseType: !678, size: 64, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!459, !438, !681, !681, !685}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !682, line: 11, baseType: !683)
!682 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !682, line: 11, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !688, file: !36, line: 1227, baseType: !434, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !688, file: !36, line: 1228, baseType: !434, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !688, file: !36, line: 1229, baseType: !434, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !688, file: !36, line: 1230, baseType: !434, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !688, file: !36, line: 1231, baseType: !434, size: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !688, file: !36, line: 1232, baseType: !434, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !688, file: !36, line: 1233, baseType: !434, size: 64, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !688, file: !36, line: 1234, baseType: !434, size: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !688, file: !36, line: 1236, baseType: !434, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !688, file: !36, line: 1237, baseType: !434, size: 64, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !688, file: !36, line: 1238, baseType: !434, size: 64, offset: 640)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !647, file: !441, line: 48, baseType: !702, size: 64, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!459, !438, !681, !685}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !647, file: !441, line: 49, baseType: !706, size: 64, offset: 832)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!459, !438, !419, !434, !709, !434, !396, !396, !419}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !647, file: !441, line: 50, baseType: !711, size: 64, offset: 896)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!459, !438, !714, !715}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !647, file: !441, line: 52, baseType: !717, size: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!459, !438, !720, !721}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !723, file: !36, line: 593, baseType: !504, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !723, file: !36, line: 594, baseType: !504, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !723, file: !36, line: 594, baseType: !504, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !723, file: !36, line: 594, baseType: !504, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !723, file: !36, line: 595, baseType: !504, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !723, file: !36, line: 596, baseType: !504, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !723, file: !36, line: 597, baseType: !504, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !723, file: !36, line: 598, baseType: !504, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !723, file: !36, line: 598, baseType: !504, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !723, file: !36, line: 599, baseType: !504, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !647, file: !441, line: 53, baseType: !736, size: 64, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!459, !438, !438, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !647, file: !441, line: 54, baseType: !741, size: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!459, !438, !419}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !647, file: !441, line: 55, baseType: !664, size: 64, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !647, file: !441, line: 56, baseType: !746, size: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!459, !438, !749, !554}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !647, file: !441, line: 58, baseType: !751, size: 64, offset: 1280)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!459, !438, !754}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !647, file: !441, line: 59, baseType: !751, size: 64, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !647, file: !441, line: 60, baseType: !757, size: 64, offset: 1408)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!459, !438, !760, !615}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !647, file: !441, line: 61, baseType: !762, size: 64, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!459, !438}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !647, file: !441, line: 63, baseType: !766, size: 64, offset: 1536)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!459, !438, !396, !653, !563, !419, !419}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !647, file: !441, line: 64, baseType: !770, size: 64, offset: 1600)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!459, !438, !438, !681, !681, !685}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !647, file: !441, line: 65, baseType: !774, size: 64, offset: 1664)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!459, !438, !438, !685}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !647, file: !441, line: 66, baseType: !778, size: 64, offset: 1728)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!459, !438, !438, !681, !685}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !647, file: !441, line: 67, baseType: !774, size: 64, offset: 1792)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !647, file: !441, line: 69, baseType: !762, size: 64, offset: 1856)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !647, file: !441, line: 70, baseType: !770, size: 64, offset: 1920)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !647, file: !441, line: 71, baseType: !778, size: 64, offset: 1984)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !647, file: !441, line: 72, baseType: !786, size: 64, offset: 2048)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!459, !438, !715}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !647, file: !441, line: 73, baseType: !762, size: 64, offset: 2112)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !647, file: !441, line: 75, baseType: !791, size: 64, offset: 2176)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!459, !438, !794, !715}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !647, file: !441, line: 76, baseType: !664, size: 64, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !647, file: !441, line: 77, baseType: !664, size: 64, offset: 2304)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !647, file: !441, line: 78, baseType: !678, size: 64, offset: 2368)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !647, file: !441, line: 79, baseType: !702, size: 64, offset: 2432)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !647, file: !441, line: 81, baseType: !800, size: 64, offset: 2496)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!459, !438, !563, !438, !803}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !647, file: !441, line: 82, baseType: !805, size: 64, offset: 2560)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!459, !438, !396, !808, !808, !714, !810}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !647, file: !441, line: 83, baseType: !812, size: 64, offset: 2624)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!459, !438, !396, !815, !396}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !647, file: !441, line: 84, baseType: !817, size: 64, offset: 2688)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!459, !438, !396, !653, !396, !653, !562}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !647, file: !441, line: 85, baseType: !821, size: 64, offset: 2752)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!459, !438, !438, !803}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !647, file: !441, line: 87, baseType: !825, size: 64, offset: 2816)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!459, !438, !419, !546}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !647, file: !441, line: 88, baseType: !829, size: 64, offset: 2880)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!459, !438, !563}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !647, file: !441, line: 89, baseType: !829, size: 64, offset: 2944)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !647, file: !441, line: 90, baseType: !834, size: 64, offset: 3008)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!459, !438, !419, !657}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !647, file: !441, line: 91, baseType: !766, size: 64, offset: 3072)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !647, file: !441, line: 93, baseType: !839, size: 64, offset: 3136)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!459, !438, !842}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !647, file: !441, line: 94, baseType: !846, size: 64, offset: 3200)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!459, !438, !396, !615, !615, !546, !849, !849, !739}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !647, file: !441, line: 95, baseType: !846, size: 64, offset: 3264)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !647, file: !441, line: 96, baseType: !846, size: 64, offset: 3328)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !647, file: !441, line: 97, baseType: !846, size: 64, offset: 3392)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !647, file: !441, line: 99, baseType: !854, size: 64, offset: 3456)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!459, !438, !857, !860}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !682, line: 51, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !682, line: 51, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !441, line: 609, size: 6208, elements: !863)
!863 = !{!864, !865, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !884, !891, !892, !893, !894, !895, !896, !897, !898, !902, !903, !904, !905, !906, !908, !909, !910, !911, !912, !913, !914}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !862, file: !441, line: 610, baseType: !444, size: 4480)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !862, file: !441, line: 610, baseType: !866, size: 32, offset: 4480)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !499)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !862, file: !441, line: 611, baseType: !396, size: 32, offset: 4512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !862, file: !441, line: 611, baseType: !396, size: 32, offset: 4544)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !862, file: !441, line: 611, baseType: !396, size: 32, offset: 4576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !862, file: !441, line: 612, baseType: !396, size: 32, offset: 4608)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !862, file: !441, line: 613, baseType: !396, size: 32, offset: 4640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !862, file: !441, line: 614, baseType: !546, size: 64, offset: 4672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !862, file: !441, line: 615, baseType: !548, size: 64, offset: 4736)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !862, file: !441, line: 616, baseType: !815, size: 64, offset: 4800)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !862, file: !441, line: 617, baseType: !546, size: 64, offset: 4864)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !862, file: !441, line: 618, baseType: !877, size: 64, offset: 4928)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !441, line: 602, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 598, size: 128, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !879, file: !441, line: 599, baseType: !396, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !879, file: !441, line: 600, baseType: !396, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !879, file: !441, line: 601, baseType: !562, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !862, file: !441, line: 619, baseType: !885, size: 64, offset: 4992)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !441, line: 607, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 604, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !887, file: !441, line: 605, baseType: !396, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !887, file: !441, line: 606, baseType: !562, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !862, file: !441, line: 620, baseType: !562, size: 64, offset: 5056)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !862, file: !441, line: 621, baseType: !434, size: 64, offset: 5120)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !862, file: !441, line: 622, baseType: !434, size: 64, offset: 5184)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !862, file: !441, line: 623, baseType: !419, size: 64, offset: 5248)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !862, file: !441, line: 623, baseType: !419, size: 64, offset: 5312)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !862, file: !441, line: 623, baseType: !419, size: 64, offset: 5376)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !862, file: !441, line: 624, baseType: !615, size: 32, offset: 5440)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !862, file: !441, line: 625, baseType: !899, size: 64, offset: 5504)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!459}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !862, file: !441, line: 626, baseType: !389, size: 64, offset: 5568)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !862, file: !441, line: 627, baseType: !419, size: 64, offset: 5632)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !862, file: !441, line: 628, baseType: !396, size: 32, offset: 5696)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !862, file: !441, line: 629, baseType: !480, size: 64, offset: 5760)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !862, file: !441, line: 630, baseType: !907, size: 32, offset: 5824)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !862, file: !441, line: 631, baseType: !396, size: 32, offset: 5856)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !862, file: !441, line: 631, baseType: !396, size: 32, offset: 5888)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !862, file: !441, line: 632, baseType: !615, size: 32, offset: 5920)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !862, file: !441, line: 633, baseType: !615, size: 32, offset: 5952)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !862, file: !441, line: 634, baseType: !491, size: 64, offset: 6016)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !862, file: !441, line: 634, baseType: !389, size: 64, offset: 6080)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !862, file: !441, line: 635, baseType: !509, size: 64, offset: 6144)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !647, file: !441, line: 100, baseType: !916, size: 64, offset: 3520)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!459, !438, !396, !396, !919, !922}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !921)
!921 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !647, file: !441, line: 101, baseType: !762, size: 64, offset: 3584)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !647, file: !441, line: 102, baseType: !925, size: 64, offset: 3648)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!459, !438, !681, !681, !715}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !647, file: !441, line: 103, baseType: !650, size: 64, offset: 3712)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !647, file: !441, line: 105, baseType: !930, size: 64, offset: 3776)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!459, !438, !681, !681, !714, !715}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !647, file: !441, line: 106, baseType: !762, size: 64, offset: 3840)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !647, file: !441, line: 107, baseType: !935, size: 64, offset: 3904)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!459, !438, !467}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !647, file: !441, line: 108, baseType: !939, size: 64, offset: 3968)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!459, !438, !942, !714, !715}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !480)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !647, file: !441, line: 109, baseType: !899, size: 64, offset: 4032)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !647, file: !441, line: 111, baseType: !945, size: 64, offset: 4096)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!459, !438, !438, !438, !434, !438}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !647, file: !441, line: 112, baseType: !949, size: 64, offset: 4160)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!459, !438, !438, !438, !438}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !647, file: !441, line: 113, baseType: !953, size: 64, offset: 4224)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!459, !438, !956, !956}
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !682, line: 30, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !682, line: 30, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !647, file: !441, line: 114, baseType: !650, size: 64, offset: 4288)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !647, file: !441, line: 115, baseType: !766, size: 64, offset: 4352)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !647, file: !441, line: 117, baseType: !825, size: 64, offset: 4416)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !647, file: !441, line: 118, baseType: !825, size: 64, offset: 4480)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !647, file: !441, line: 119, baseType: !939, size: 64, offset: 4544)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !647, file: !441, line: 120, baseType: !965, size: 64, offset: 4608)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!459, !438, !968, !739}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !647, file: !441, line: 121, baseType: !899, size: 64, offset: 4672)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !647, file: !441, line: 123, baseType: !971, size: 64, offset: 4736)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!459, !438, !396, !389}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !647, file: !441, line: 124, baseType: !975, size: 64, offset: 4800)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!459, !438, !860, !419, !389}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !647, file: !441, line: 125, baseType: !979, size: 64, offset: 4864)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!459, !591, !438}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !647, file: !441, line: 126, baseType: !664, size: 64, offset: 4928)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !647, file: !441, line: 127, baseType: !664, size: 64, offset: 4992)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !647, file: !441, line: 129, baseType: !985, size: 64, offset: 5056)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!459, !438, !815}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !647, file: !441, line: 130, baseType: !989, size: 64, offset: 5120)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!459, !438, !992, !992}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !994, file: !60, line: 653, baseType: !396, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !994, file: !60, line: 653, baseType: !419, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !647, file: !441, line: 131, baseType: !989, size: 64, offset: 5184)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !647, file: !441, line: 132, baseType: !1000, size: 64, offset: 5248)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!459, !438, !546, !546, !546}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !647, file: !441, line: 133, baseType: !935, size: 64, offset: 5312)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !647, file: !441, line: 135, baseType: !1005, size: 64, offset: 5376)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!459, !438, !434, !739}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !647, file: !441, line: 136, baseType: !1005, size: 64, offset: 5440)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !647, file: !441, line: 137, baseType: !1010, size: 64, offset: 5504)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!459, !438, !739}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !647, file: !441, line: 138, baseType: !650, size: 64, offset: 5568)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !647, file: !441, line: 139, baseType: !1015, size: 64, offset: 5632)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!459, !438, !1018, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !647, file: !441, line: 141, baseType: !899, size: 64, offset: 5696)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !647, file: !441, line: 142, baseType: !1021, size: 64, offset: 5760)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!459, !438, !438, !434, !438}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !647, file: !441, line: 143, baseType: !1025, size: 64, offset: 5824)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!459, !438, !438, !438}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !647, file: !441, line: 144, baseType: !899, size: 64, offset: 5888)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !647, file: !441, line: 145, baseType: !1021, size: 64, offset: 5952)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !647, file: !441, line: 147, baseType: !1025, size: 64, offset: 6016)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !647, file: !441, line: 148, baseType: !899, size: 64, offset: 6080)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !647, file: !441, line: 149, baseType: !1021, size: 64, offset: 6144)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !647, file: !441, line: 150, baseType: !1025, size: 64, offset: 6208)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !647, file: !441, line: 151, baseType: !1035, size: 64, offset: 6272)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!459, !438, !615}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !647, file: !441, line: 153, baseType: !762, size: 64, offset: 6336)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !647, file: !441, line: 154, baseType: !762, size: 64, offset: 6400)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !647, file: !441, line: 155, baseType: !762, size: 64, offset: 6464)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !647, file: !441, line: 156, baseType: !762, size: 64, offset: 6528)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !647, file: !441, line: 157, baseType: !935, size: 64, offset: 6592)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !647, file: !441, line: 159, baseType: !1044, size: 64, offset: 6656)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!459, !438, !396, !655}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !647, file: !441, line: 160, baseType: !762, size: 64, offset: 6720)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !647, file: !441, line: 161, baseType: !762, size: 64, offset: 6784)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !647, file: !441, line: 162, baseType: !762, size: 64, offset: 6848)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !647, file: !441, line: 163, baseType: !762, size: 64, offset: 6912)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !647, file: !441, line: 165, baseType: !1025, size: 64, offset: 6976)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !647, file: !441, line: 166, baseType: !1025, size: 64, offset: 7040)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !647, file: !441, line: 167, baseType: !825, size: 64, offset: 7104)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !647, file: !441, line: 168, baseType: !1055, size: 64, offset: 7168)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!459, !438, !419, !396}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !647, file: !441, line: 169, baseType: !1059, size: 64, offset: 7232)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!459, !438, !739, !546}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !647, file: !441, line: 171, baseType: !786, size: 64, offset: 7296)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !647, file: !441, line: 172, baseType: !762, size: 64, offset: 7360)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !647, file: !441, line: 173, baseType: !1065, size: 64, offset: 7424)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!459, !438, !546, !849}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !647, file: !441, line: 174, baseType: !925, size: 64, offset: 7488)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !647, file: !441, line: 175, baseType: !925, size: 64, offset: 7552)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !647, file: !441, line: 177, baseType: !664, size: 64, offset: 7616)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !647, file: !441, line: 178, baseType: !711, size: 64, offset: 7680)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !647, file: !441, line: 179, baseType: !664, size: 64, offset: 7744)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !647, file: !441, line: 180, baseType: !668, size: 64, offset: 7808)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !647, file: !441, line: 181, baseType: !1075, size: 64, offset: 7872)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!459, !438, !385, !714, !715}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !647, file: !441, line: 183, baseType: !985, size: 64, offset: 7936)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !647, file: !441, line: 184, baseType: !746, size: 64, offset: 8000)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !647, file: !441, line: 185, baseType: !1081, size: 64, offset: 8064)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!459, !438, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !647, file: !441, line: 186, baseType: !1086, size: 64, offset: 8128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!459, !438, !396, !653, !562}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !647, file: !441, line: 187, baseType: !805, size: 64, offset: 8192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !647, file: !441, line: 189, baseType: !1091, size: 64, offset: 8256)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!459, !438, !396, !396, !546, !655}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !647, file: !441, line: 190, baseType: !899, size: 64, offset: 8320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !647, file: !441, line: 191, baseType: !1021, size: 64, offset: 8384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !647, file: !441, line: 192, baseType: !1025, size: 64, offset: 8448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !647, file: !441, line: 193, baseType: !1098, size: 64, offset: 8512)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!459, !438, !857, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !441, line: 660, size: 5312, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1103, file: !441, line: 661, baseType: !444, size: 4480)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1103, file: !441, line: 661, baseType: !866, size: 32, offset: 4480)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1103, file: !441, line: 662, baseType: !396, size: 32, offset: 4512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1103, file: !441, line: 662, baseType: !396, size: 32, offset: 4544)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1103, file: !441, line: 662, baseType: !396, size: 32, offset: 4576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1103, file: !441, line: 663, baseType: !396, size: 32, offset: 4608)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1103, file: !441, line: 664, baseType: !396, size: 32, offset: 4640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1103, file: !441, line: 665, baseType: !546, size: 64, offset: 4672)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1103, file: !441, line: 666, baseType: !546, size: 64, offset: 4736)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1103, file: !441, line: 667, baseType: !396, size: 32, offset: 4800)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1103, file: !441, line: 668, baseType: !907, size: 32, offset: 4832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1103, file: !441, line: 670, baseType: !546, size: 64, offset: 4864)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1103, file: !441, line: 670, baseType: !546, size: 64, offset: 4928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1103, file: !441, line: 671, baseType: !546, size: 64, offset: 4992)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1103, file: !441, line: 672, baseType: !546, size: 64, offset: 5056)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1103, file: !441, line: 673, baseType: !546, size: 64, offset: 5120)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1103, file: !441, line: 674, baseType: !396, size: 32, offset: 5184)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1103, file: !441, line: 675, baseType: !546, size: 64, offset: 5248)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !647, file: !441, line: 195, baseType: !1124, size: 64, offset: 8576)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!459, !1101, !438, !438}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !647, file: !441, line: 196, baseType: !1124, size: 64, offset: 8640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !647, file: !441, line: 197, baseType: !899, size: 64, offset: 8704)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !647, file: !441, line: 198, baseType: !1021, size: 64, offset: 8768)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !647, file: !441, line: 199, baseType: !1025, size: 64, offset: 8832)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !647, file: !441, line: 201, baseType: !1132, size: 64, offset: 8896)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!459, !438, !396, !396}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !647, file: !441, line: 202, baseType: !800, size: 64, offset: 8960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !647, file: !441, line: 203, baseType: !668, size: 64, offset: 9024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !647, file: !441, line: 204, baseType: !854, size: 64, offset: 9088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !647, file: !441, line: 205, baseType: !985, size: 64, offset: 9152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !647, file: !441, line: 206, baseType: !1140, size: 64, offset: 9216)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!459, !385, !438, !396, !714, !715}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !647, file: !441, line: 208, baseType: !1144, size: 64, offset: 9280)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!459, !396, !810}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !647, file: !441, line: 209, baseType: !1025, size: 64, offset: 9344)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !647, file: !441, line: 210, baseType: !817, size: 64, offset: 9408)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !440, file: !441, line: 438, baseType: !1150, size: 64, offset: 13952)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !682, line: 60, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1152, file: !114, line: 241, baseType: !385, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !114, line: 242, baseType: !518, size: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1152, file: !114, line: 243, baseType: !396, size: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1152, file: !114, line: 243, baseType: !396, size: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1152, file: !114, line: 244, baseType: !396, size: 32, offset: 160)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1152, file: !114, line: 244, baseType: !396, size: 32, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1152, file: !114, line: 245, baseType: !546, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1152, file: !114, line: 246, baseType: !615, size: 32, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1152, file: !114, line: 247, baseType: !396, size: 32, offset: 352)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1152, file: !114, line: 251, baseType: !396, size: 32, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1152, file: !114, line: 252, baseType: !956, size: 64, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1152, file: !114, line: 253, baseType: !615, size: 32, offset: 512)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1152, file: !114, line: 254, baseType: !396, size: 32, offset: 544)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1152, file: !114, line: 254, baseType: !396, size: 32, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1152, file: !114, line: 255, baseType: !396, size: 32, offset: 608)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !440, file: !441, line: 438, baseType: !1150, size: 64, offset: 14016)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !441, line: 439, baseType: !389, size: 64, offset: 14080)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !440, file: !441, line: 440, baseType: !1172, size: 32, offset: 14144)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !440, file: !441, line: 441, baseType: !615, size: 32, offset: 14176)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !440, file: !441, line: 442, baseType: !615, size: 32, offset: 14208)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !440, file: !441, line: 443, baseType: !1176, size: 448, offset: 14272)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 448, elements: !1178)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !480)
!1178 = !{!1179}
!1179 = !DISubrange(count: 7)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !440, file: !441, line: 444, baseType: !615, size: 32, offset: 14720)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !440, file: !441, line: 445, baseType: !615, size: 32, offset: 14752)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !440, file: !441, line: 446, baseType: !396, size: 32, offset: 14784)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !440, file: !441, line: 447, baseType: !539, size: 64, offset: 14848)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !440, file: !441, line: 448, baseType: !539, size: 64, offset: 14912)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !440, file: !441, line: 449, baseType: !722, size: 640, offset: 14976)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !440, file: !441, line: 450, baseType: !657, size: 32, offset: 15616)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !440, file: !441, line: 451, baseType: !1188, size: 2880, offset: 15680)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !441, line: 318, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !441, line: 319, size: 2880, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1210, !1211, !1216, !1221, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1236, !1237, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1269, !1270, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1295, !1299, !1300}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1189, file: !441, line: 320, baseType: !396, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1189, file: !441, line: 321, baseType: !396, size: 32, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1189, file: !441, line: 322, baseType: !396, size: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1189, file: !441, line: 323, baseType: !396, size: 32, offset: 96)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1189, file: !441, line: 324, baseType: !396, size: 32, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1189, file: !441, line: 325, baseType: !396, size: 32, offset: 160)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1189, file: !441, line: 326, baseType: !1198, size: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !441, line: 293, baseType: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !441, line: 295, size: 448, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1200, file: !441, line: 296, baseType: !1198, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1200, file: !441, line: 297, baseType: !562, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1200, file: !441, line: 297, baseType: !562, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1200, file: !441, line: 298, baseType: !546, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1200, file: !441, line: 298, baseType: !546, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1200, file: !441, line: 299, baseType: !396, size: 32, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1200, file: !441, line: 300, baseType: !396, size: 32, offset: 352)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1200, file: !441, line: 301, baseType: !396, size: 32, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1189, file: !441, line: 326, baseType: !1198, size: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1189, file: !441, line: 328, baseType: !1212, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!459, !438, !1215, !546}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1189, file: !441, line: 329, baseType: !1217, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!459, !1215, !1220, !548, !548, !565, !546}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1189, file: !441, line: 330, baseType: !1222, size: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!459, !1215}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1189, file: !441, line: 331, baseType: !1222, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1189, file: !441, line: 334, baseType: !385, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1189, file: !441, line: 335, baseType: !518, size: 32, offset: 640)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1189, file: !441, line: 335, baseType: !518, size: 32, offset: 672)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1189, file: !441, line: 336, baseType: !518, size: 32, offset: 704)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1189, file: !441, line: 336, baseType: !518, size: 32, offset: 736)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1189, file: !441, line: 337, baseType: !1232, size: 64, offset: 768)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !386, line: 339, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !386, line: 339, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1189, file: !441, line: 338, baseType: !1232, size: 64, offset: 832)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1189, file: !441, line: 339, baseType: !1238, size: 64, offset: 896)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !386, line: 341, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !386, line: 351, size: 192, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1240, file: !386, line: 354, baseType: !72, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1240, file: !386, line: 355, baseType: !72, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1240, file: !386, line: 356, baseType: !72, size: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1240, file: !386, line: 361, baseType: !72, size: 32, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1240, file: !386, line: 362, baseType: !611, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1189, file: !441, line: 340, baseType: !396, size: 32, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1189, file: !441, line: 340, baseType: !396, size: 32, offset: 992)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1189, file: !441, line: 341, baseType: !562, size: 64, offset: 1024)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1189, file: !441, line: 342, baseType: !546, size: 64, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1189, file: !441, line: 343, baseType: !565, size: 64, offset: 1152)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1189, file: !441, line: 344, baseType: !548, size: 64, offset: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1189, file: !441, line: 345, baseType: !396, size: 32, offset: 1280)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1189, file: !441, line: 346, baseType: !1220, size: 64, offset: 1344)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1189, file: !441, line: 347, baseType: !615, size: 32, offset: 1408)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1189, file: !441, line: 348, baseType: !396, size: 32, offset: 1440)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1189, file: !441, line: 351, baseType: !615, size: 32, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1189, file: !441, line: 352, baseType: !615, size: 32, offset: 1504)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1189, file: !441, line: 353, baseType: !518, size: 32, offset: 1536)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1189, file: !441, line: 354, baseType: !518, size: 32, offset: 1568)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1189, file: !441, line: 355, baseType: !1220, size: 64, offset: 1600)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1189, file: !441, line: 356, baseType: !1220, size: 64, offset: 1664)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1189, file: !441, line: 357, baseType: !1264, size: 64, offset: 1728)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !441, line: 310, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 308, size: 32, elements: !1267)
!1267 = !{!1268}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1266, file: !441, line: 309, baseType: !396, size: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1189, file: !441, line: 357, baseType: !1264, size: 64, offset: 1792)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1189, file: !441, line: 358, baseType: !1271, size: 64, offset: 1856)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !441, line: 316, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 312, size: 128, elements: !1274)
!1274 = !{!1275, !1276, !1277}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1273, file: !441, line: 313, baseType: !389, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1273, file: !441, line: 314, baseType: !396, size: 32, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1273, file: !441, line: 315, baseType: !482, size: 8, offset: 96)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1189, file: !441, line: 359, baseType: !1271, size: 64, offset: 1920)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1189, file: !441, line: 360, baseType: !1271, size: 64, offset: 1984)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1189, file: !441, line: 361, baseType: !396, size: 32, offset: 2048)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1189, file: !441, line: 362, baseType: !518, size: 32, offset: 2080)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1189, file: !441, line: 363, baseType: !396, size: 32, offset: 2112)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1189, file: !441, line: 364, baseType: !1220, size: 64, offset: 2176)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1189, file: !441, line: 365, baseType: !1238, size: 64, offset: 2240)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1189, file: !441, line: 366, baseType: !518, size: 32, offset: 2304)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1189, file: !441, line: 367, baseType: !518, size: 32, offset: 2336)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1189, file: !441, line: 368, baseType: !1232, size: 64, offset: 2368)
