; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/matfd/ftn-custom/zfdmatrixf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/matfd/ftn-custom/zfdmatrixf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_MatFDColoring = type { %struct._p_PetscObject, [1 x i32], i32, i32, i32, i32, i32, i32*, i32**, %struct._p_IS**, i32*, %struct.MatEntry*, %struct.MatEntry2*, double*, double, double, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, i32 ()*, i8*, %struct._p_Vec*, i32, i8*, i32, i32, i32, i32, i32, void ()*, i8*, i64 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!36 = !DISubroutineType(types: !37)
!37 = !{null}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCodeFunction", file: !39, line: 1452, baseType: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !44)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !47, line: 135, baseType: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !49, line: 100, baseType: !50)
!49 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !32, line: 330, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !32, line: 330, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !50)
!55 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59, !64, !67, !67, !30, !72}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !61, line: 5, baseType: !62)
!61 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/matfd/ftn-custom/zfdmatrixf.c", directory: "/home/users/ndemeye/xSDK")
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !61, line: 5, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !66)
!66 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !69, line: 21, baseType: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !69, line: 21, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, !67, !67, !30, !72}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !61, line: 6, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !61, line: 6, flags: DIFlagFwdDecl)
!80 = !{i32 7, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 4}
!83 = !{i32 7, !"PIC Level", i32 2}
!84 = !{i32 7, !"uwtable", i32 1}
!85 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!86 = distinct !DISubprogram(name: "matfdcoloringgetperturbedcolumnsf90_", scope: !61, file: !61, line: 24, type: !87, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !350)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !343, !349}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !91, line: 1378, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !94, line: 609, size: 6208, elements: !95)
!94 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!95 = !{!96, !291, !293, !294, !295, !296, !297, !298, !299, !300, !306, !307, !315, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !336, !337, !338, !339, !340, !341, !342}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !93, file: !94, line: 610, baseType: !97, size: 4480)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !98, line: 122, baseType: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !98, line: 73, size: 4480, elements: !100)
!100 = !{!101, !103, !150, !151, !153, !155, !156, !157, !158, !166, !167, !169, !173, !177, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !190, !191, !192, !194, !195, !197, !199, !200, !201, !202, !203, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !227, !229, !230, !234, !235, !281, !286, !288, !289, !290}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !99, file: !98, line: 74, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !44)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !99, file: !98, line: 75, baseType: !104, size: 448, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 448, elements: !148)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !98, line: 53, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 45, size: 448, elements: !107)
!107 = !{!108, !115, !123, !128, !135, !139, !143}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !106, file: !98, line: 46, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !112, !114}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !106, file: !98, line: 47, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!43, !112, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !120, line: 16, baseType: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !120, line: 16, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !106, file: !98, line: 48, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!43, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !106, file: !98, line: 49, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!43, !112, !132, !112}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !106, file: !98, line: 50, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!43, !112, !132, !127}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !106, file: !98, line: 51, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!43, !112, !132, !35}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !106, file: !98, line: 52, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!43, !112, !132, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !99, file: !98, line: 76, baseType: !51, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !98, line: 77, baseType: !152, size: 32, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !44)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !66)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !99, file: !98, line: 78, baseType: !154, size: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !98, line: 79, baseType: !159, size: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !162, line: 27, baseType: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !164, line: 43, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!165 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !99, file: !98, line: 80, baseType: !152, size: 32, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !98, line: 81, baseType: !168, size: 32, offset: 992)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !44)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !99, file: !98, line: 82, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !99, file: !98, line: 83, baseType: !174, size: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !99, file: !98, line: 84, baseType: !178, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !99, file: !98, line: 85, baseType: !178, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !99, file: !98, line: 86, baseType: !178, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !99, file: !98, line: 87, baseType: !178, size: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !98, line: 88, baseType: !112, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !99, file: !98, line: 89, baseType: !159, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !98, line: 90, baseType: !178, size: 64, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !99, file: !98, line: 91, baseType: !178, size: 64, offset: 1600)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !99, file: !98, line: 92, baseType: !152, size: 32, offset: 1664)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !99, file: !98, line: 93, baseType: !30, size: 64, offset: 1728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !98, line: 94, baseType: !189, size: 64, offset: 1792)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !99, file: !98, line: 95, baseType: !152, size: 32, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !99, file: !98, line: 95, baseType: !152, size: 32, offset: 1888)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !99, file: !98, line: 96, baseType: !193, size: 64, offset: 1920)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !99, file: !98, line: 96, baseType: !193, size: 64, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !99, file: !98, line: 97, baseType: !196, size: 64, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !99, file: !98, line: 97, baseType: !198, size: 64, offset: 2112)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !99, file: !98, line: 98, baseType: !152, size: 32, offset: 2176)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !99, file: !98, line: 98, baseType: !152, size: 32, offset: 2208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !99, file: !98, line: 99, baseType: !193, size: 64, offset: 2240)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !99, file: !98, line: 99, baseType: !193, size: 64, offset: 2304)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !99, file: !98, line: 100, baseType: !64, size: 64, offset: 2368)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !99, file: !98, line: 100, baseType: !205, size: 64, offset: 2432)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !99, file: !98, line: 101, baseType: !152, size: 32, offset: 2496)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !99, file: !98, line: 101, baseType: !152, size: 32, offset: 2528)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !99, file: !98, line: 102, baseType: !193, size: 64, offset: 2560)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !99, file: !98, line: 102, baseType: !193, size: 64, offset: 2624)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !99, file: !98, line: 103, baseType: !211, size: 64, offset: 2688)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !65)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !99, file: !98, line: 103, baseType: !214, size: 64, offset: 2752)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !99, file: !98, line: 104, baseType: !147, size: 64, offset: 2816)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !99, file: !98, line: 105, baseType: !152, size: 32, offset: 2880)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !99, file: !98, line: 106, baseType: !218, size: 128, offset: 2944)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !225)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !98, line: 64, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 61, size: 128, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !221, file: !98, line: 62, baseType: !35, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !221, file: !98, line: 63, baseType: !30, size: 64, offset: 64)
!225 = !{!226}
!226 = !DISubrange(count: 2)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !99, file: !98, line: 107, baseType: !228, size: 64, offset: 3072)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !225)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !99, file: !98, line: 108, baseType: !30, size: 64, offset: 3136)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !99, file: !98, line: 109, baseType: !231, size: 64, offset: 3200)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!43, !30}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !99, file: !98, line: 111, baseType: !152, size: 32, offset: 3264)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !99, file: !98, line: 112, baseType: !236, size: 320, offset: 3328)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 320, elements: !279)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!43, !240, !112, !30}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !243)
!243 = !{!244, !245, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !242, file: !10, line: 100, baseType: !152, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !10, line: 101, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !257, !258, !259, !260, !262, !264, !265, !266}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !248, file: !10, line: 84, baseType: !178, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !248, file: !10, line: 85, baseType: !178, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !10, line: 86, baseType: !30, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !248, file: !10, line: 87, baseType: !170, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !248, file: !10, line: 88, baseType: !255, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !248, file: !10, line: 89, baseType: !134, size: 8, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !248, file: !10, line: 90, baseType: !178, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !248, file: !10, line: 91, baseType: !54, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !248, file: !10, line: 92, baseType: !261, size: 32, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !10, line: 93, baseType: !263, size: 32, offset: 544)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !10, line: 94, baseType: !246, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !248, file: !10, line: 95, baseType: !178, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !248, file: !10, line: 96, baseType: !30, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !242, file: !10, line: 102, baseType: !178, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !242, file: !10, line: 102, baseType: !178, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !242, file: !10, line: 103, baseType: !178, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !242, file: !10, line: 104, baseType: !51, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !242, file: !10, line: 105, baseType: !261, size: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !242, file: !10, line: 106, baseType: !112, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !242, file: !10, line: 107, baseType: !276, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!279 = !{!280}
!280 = !DISubrange(count: 5)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !99, file: !98, line: 113, baseType: !282, size: 320, offset: 3648)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !279)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!43, !112, !30}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !99, file: !98, line: 114, baseType: !287, size: 320, offset: 3968)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 320, elements: !279)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !99, file: !98, line: 115, baseType: !261, size: 32, offset: 4288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !99, file: !98, line: 120, baseType: !276, size: 64, offset: 4352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !99, file: !98, line: 121, baseType: !261, size: 32, offset: 4416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !93, file: !94, line: 610, baseType: !292, size: 32, offset: 4480)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !148)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !93, file: !94, line: 611, baseType: !152, size: 32, offset: 4512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !93, file: !94, line: 611, baseType: !152, size: 32, offset: 4544)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !93, file: !94, line: 611, baseType: !152, size: 32, offset: 4576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !93, file: !94, line: 612, baseType: !152, size: 32, offset: 4608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !93, file: !94, line: 613, baseType: !152, size: 32, offset: 4640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !93, file: !94, line: 614, baseType: !196, size: 64, offset: 4672)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !93, file: !94, line: 615, baseType: !198, size: 64, offset: 4736)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !93, file: !94, line: 616, baseType: !301, size: 64, offset: 4800)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !303, line: 11, baseType: !304)
!303 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !303, line: 11, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !93, file: !94, line: 617, baseType: !196, size: 64, offset: 4864)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !93, file: !94, line: 618, baseType: !308, size: 64, offset: 4928)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !94, line: 602, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 598, size: 128, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !310, file: !94, line: 599, baseType: !152, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !310, file: !94, line: 600, baseType: !152, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !310, file: !94, line: 601, baseType: !211, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !93, file: !94, line: 619, baseType: !316, size: 64, offset: 4992)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !94, line: 607, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 604, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !318, file: !94, line: 605, baseType: !152, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !318, file: !94, line: 606, baseType: !211, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !93, file: !94, line: 620, baseType: !211, size: 64, offset: 5056)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !93, file: !94, line: 621, baseType: !65, size: 64, offset: 5120)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !93, file: !94, line: 622, baseType: !65, size: 64, offset: 5184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !93, file: !94, line: 623, baseType: !68, size: 64, offset: 5248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !93, file: !94, line: 623, baseType: !68, size: 64, offset: 5312)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !93, file: !94, line: 623, baseType: !68, size: 64, offset: 5376)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !93, file: !94, line: 624, baseType: !261, size: 32, offset: 5440)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !93, file: !94, line: 625, baseType: !40, size: 64, offset: 5504)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !93, file: !94, line: 626, baseType: !30, size: 64, offset: 5568)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !93, file: !94, line: 627, baseType: !68, size: 64, offset: 5632)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !93, file: !94, line: 628, baseType: !152, size: 32, offset: 5696)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !93, file: !94, line: 629, baseType: !132, size: 64, offset: 5760)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !93, file: !94, line: 630, baseType: !335, size: 32, offset: 5824)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !93, file: !94, line: 631, baseType: !152, size: 32, offset: 5856)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !93, file: !94, line: 631, baseType: !152, size: 32, offset: 5888)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !93, file: !94, line: 632, baseType: !261, size: 32, offset: 5920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !93, file: !94, line: 633, baseType: !261, size: 32, offset: 5952)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !93, file: !94, line: 634, baseType: !35, size: 64, offset: 6016)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !93, file: !94, line: 634, baseType: !30, size: 64, offset: 6080)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !93, file: !94, line: 635, baseType: !159, size: 64, offset: 6144)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "F90Array1d", file: !345, line: 17, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/f90impl.h", directory: "/home/users/ndemeye/xSDK")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 17, size: 8, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !346, file: !345, line: 17, baseType: !134, size: 8)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!350 = !{!351, !352, !353, !354, !357}
!351 = !DILocalVariable(name: "x", arg: 1, scope: !86, file: !61, line: 24, type: !89)
!352 = !DILocalVariable(name: "ptr", arg: 2, scope: !86, file: !61, line: 24, type: !343)
!353 = !DILocalVariable(name: "__ierr", arg: 3, scope: !86, file: !61, line: 24, type: !349)
!354 = !DILocalVariable(name: "fa", scope: !86, file: !61, line: 26, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!357 = !DILocalVariable(name: "len", scope: !86, file: !61, line: 27, type: !152)
!358 = !DILocation(line: 0, scope: !86)
!359 = !DILocation(line: 26, column: 3, scope: !86)
!360 = !DILocation(line: 27, column: 3, scope: !86)
!361 = !DILocation(line: 29, column: 46, scope: !86)
!362 = !{!363, !363, i64 0}
!363 = !{!"any pointer", !364, i64 0}
!364 = !{!"omnipotent char", !365, i64 0}
!365 = !{!"Simple C/C++ TBAA"}
!366 = !DILocation(line: 29, column: 13, scope: !86)
!367 = !DILocation(line: 29, column: 11, scope: !86)
!368 = !{!369, !369, i64 0}
!369 = !{!"int", !364, i64 0}
!370 = !DILocation(line: 29, column: 66, scope: !371)
!371 = distinct !DILexicalBlock(scope: !86, file: !61, line: 29, column: 66)
!372 = !DILocation(line: 29, column: 66, scope: !86)
!373 = !DILocation(line: 30, column: 37, scope: !86)
!374 = !DILocation(line: 30, column: 51, scope: !86)
!375 = !DILocation(line: 30, column: 13, scope: !86)
!376 = !DILocation(line: 30, column: 11, scope: !86)
!377 = !DILocation(line: 31, column: 1, scope: !86)
!378 = !DISubprogram(name: "MatFDColoringGetPerturbedColumns", scope: !91, file: !91, line: 1389, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !384)
!379 = !DISubroutineType(types: !380)
!380 = !{!44, !92, !349, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!384 = !{}
!385 = !DISubprogram(name: "F90Array1dCreate", scope: !345, file: !345, line: 22, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !384)
!386 = !DISubroutineType(types: !387)
!387 = !{!44, !30, !33, !44, !44, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!389 = distinct !DISubprogram(name: "matfdcoloringrestoreperturbedcolumnsf90_", scope: !61, file: !61, line: 32, type: !87, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !390)
!390 = !{!391, !392, !393}
!391 = !DILocalVariable(name: "x", arg: 1, scope: !389, file: !61, line: 32, type: !89)
!392 = !DILocalVariable(name: "ptr", arg: 2, scope: !389, file: !61, line: 32, type: !343)
!393 = !DILocalVariable(name: "__ierr", arg: 3, scope: !389, file: !61, line: 32, type: !349)
!394 = !DILocation(line: 0, scope: !389)
!395 = !DILocation(line: 34, column: 13, scope: !389)
!396 = !DILocation(line: 34, column: 11, scope: !389)
!397 = !DILocation(line: 35, column: 1, scope: !389)
