; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpreallocate.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpreallocate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 663, baseType: !5, size: 32, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!89 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 442, baseType: !109, size: 32, elements: !110)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!111 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!112 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!113 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!114 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!115 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!116 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!117 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!118 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!119 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!120 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!121 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!122 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!123 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!124 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!125 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!126 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!127 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!128 = !DIEnumerator(name: "MAT_SPD", value: 15)
!129 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!130 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!131 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!132 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!133 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!134 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!135 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!136 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!137 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!138 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 424, baseType: !5, size: 32, elements: !140)
!140 = !{!141, !142}
!141 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!143 = !{!144, !148, !149, !234, !109, !184, !224, !352, !355, !318, !5}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !145, line: 330, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !145, line: 330, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !152, line: 73, size: 4480, elements: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!153 = !{!154, !156, !205, !206, !208, !211, !212, !213, !214, !222, !223, !225, !229, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !250, !251, !253, !255, !256, !257, !258, !259, !262, !264, !265, !266, !267, !268, !271, !273, !274, !275, !285, !287, !288, !292, !293, !342, !347, !349, !350, !351}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !151, file: !152, line: 74, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !109)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !151, file: !152, line: 75, baseType: !157, size: 448, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 448, elements: !203)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !152, line: 53, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 45, size: 448, elements: !160)
!160 = !{!161, !167, !175, !180, !187, !191, !198}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !159, file: !152, line: 46, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !149, !166}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !109)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !159, file: !152, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!165, !149, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !159, file: !152, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!165, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !159, file: !152, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!165, !149, !184, !149}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !159, file: !152, line: 50, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!165, !149, !184, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !159, file: !152, line: 51, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!165, !149, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !159, file: !152, line: 52, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!165, !149, !184, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!203 = !{!204}
!204 = !DISubrange(count: 1)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !151, file: !152, line: 76, baseType: !144, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !152, line: 77, baseType: !207, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !109)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !151, file: !152, line: 78, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !210)
!210 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !151, file: !152, line: 78, baseType: !209, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !151, file: !152, line: 78, baseType: !209, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !151, file: !152, line: 78, baseType: !209, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 79, baseType: !215, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !218, line: 27, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !220, line: 43, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!221 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !151, file: !152, line: 80, baseType: !207, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !151, file: !152, line: 81, baseType: !224, size: 32, offset: 992)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !109)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !151, file: !152, line: 82, baseType: !226, size: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !151, file: !152, line: 83, baseType: !230, size: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !151, file: !152, line: 84, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !151, file: !152, line: 85, baseType: !234, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !151, file: !152, line: 86, baseType: !234, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !151, file: !152, line: 87, baseType: !234, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !151, file: !152, line: 88, baseType: !149, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !151, file: !152, line: 89, baseType: !215, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 90, baseType: !234, size: 64, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !151, file: !152, line: 91, baseType: !234, size: 64, offset: 1600)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !151, file: !152, line: 92, baseType: !207, size: 32, offset: 1664)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !151, file: !152, line: 93, baseType: !148, size: 64, offset: 1728)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !151, file: !152, line: 94, baseType: !245, size: 64, offset: 1792)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !151, file: !152, line: 95, baseType: !207, size: 32, offset: 1856)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !151, file: !152, line: 95, baseType: !207, size: 32, offset: 1888)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !151, file: !152, line: 96, baseType: !249, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !151, file: !152, line: 96, baseType: !249, size: 64, offset: 1984)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !151, file: !152, line: 97, baseType: !252, size: 64, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !151, file: !152, line: 97, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !151, file: !152, line: 98, baseType: !207, size: 32, offset: 2176)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !151, file: !152, line: 98, baseType: !207, size: 32, offset: 2208)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !151, file: !152, line: 99, baseType: !249, size: 64, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !151, file: !152, line: 99, baseType: !249, size: 64, offset: 2304)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !151, file: !152, line: 100, baseType: !260, size: 64, offset: 2368)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !210)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !151, file: !152, line: 100, baseType: !263, size: 64, offset: 2432)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !151, file: !152, line: 101, baseType: !207, size: 32, offset: 2496)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !151, file: !152, line: 101, baseType: !207, size: 32, offset: 2528)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !151, file: !152, line: 102, baseType: !249, size: 64, offset: 2560)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !151, file: !152, line: 102, baseType: !249, size: 64, offset: 2624)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !151, file: !152, line: 103, baseType: !269, size: 64, offset: 2688)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !261)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !151, file: !152, line: 103, baseType: !272, size: 64, offset: 2752)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !151, file: !152, line: 104, baseType: !202, size: 64, offset: 2816)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !151, file: !152, line: 105, baseType: !207, size: 32, offset: 2880)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !151, file: !152, line: 106, baseType: !276, size: 128, offset: 2944)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !283)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !152, line: 64, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 61, size: 128, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !279, file: !152, line: 62, baseType: !195, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !279, file: !152, line: 63, baseType: !148, size: 64, offset: 64)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !151, file: !152, line: 107, baseType: !286, size: 64, offset: 3072)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !283)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !151, file: !152, line: 108, baseType: !148, size: 64, offset: 3136)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !151, file: !152, line: 109, baseType: !289, size: 64, offset: 3200)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!165, !148}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !151, file: !152, line: 111, baseType: !207, size: 32, offset: 3264)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !151, file: !152, line: 112, baseType: !294, size: 320, offset: 3328)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !340)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!165, !298, !149, !148}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !301)
!301 = !{!302, !303, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !300, file: !10, line: 100, baseType: !207, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !10, line: 101, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !315, !316, !317, !321, !323, !325, !326, !327}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !306, file: !10, line: 84, baseType: !234, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !306, file: !10, line: 85, baseType: !234, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !10, line: 86, baseType: !148, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !306, file: !10, line: 87, baseType: !226, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !306, file: !10, line: 88, baseType: !313, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !306, file: !10, line: 89, baseType: !186, size: 8, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !306, file: !10, line: 90, baseType: !234, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !306, file: !10, line: 91, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !319, line: 46, baseType: !320)
!319 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!320 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !10, line: 92, baseType: !322, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !10, line: 93, baseType: !324, size: 32, offset: 544)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !10, line: 94, baseType: !304, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !306, file: !10, line: 95, baseType: !234, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !306, file: !10, line: 96, baseType: !148, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !300, file: !10, line: 102, baseType: !234, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !300, file: !10, line: 102, baseType: !234, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !300, file: !10, line: 103, baseType: !234, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !300, file: !10, line: 104, baseType: !144, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !300, file: !10, line: 105, baseType: !322, size: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !10, line: 106, baseType: !149, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !300, file: !10, line: 107, baseType: !337, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!340 = !{!341}
!341 = !DISubrange(count: 5)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !151, file: !152, line: 113, baseType: !343, size: 320, offset: 3648)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 320, elements: !340)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!165, !149, !148}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !151, file: !152, line: 114, baseType: !348, size: 320, offset: 3968)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 320, elements: !340)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !151, file: !152, line: 115, baseType: !322, size: 32, offset: 4288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !151, file: !152, line: 120, baseType: !337, size: 64, offset: 4352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !151, file: !152, line: 121, baseType: !322, size: 32, offset: 4416)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !145, line: 331, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !145, line: 331, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !145, line: 338, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !145, line: 338, flags: DIFlagFwdDecl)
!358 = !{i32 7, !"Dwarf Version", i32 4}
!359 = !{i32 2, !"Debug Info Version", i32 3}
!360 = !{i32 1, !"wchar_size", i32 4}
!361 = !{i32 7, !"PIC Level", i32 2}
!362 = !{i32 7, !"uwtable", i32 1}
!363 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!364 = distinct !DISubprogram(name: "DMPlexPreallocateOperator", scope: !365, file: !365, line: 709, type: !366, scopeLine: 710, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1236)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexpreallocate.c", directory: "/home/users/ndemeye/xSDK")
!366 = !DISubroutineType(types: !367)
!367 = !{!165, !368, !207, !252, !252, !252, !252, !591, !322}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !56, line: 14, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !62, line: 202, size: 40000, elements: !371)
!371 = !{!372, !374, !754, !758, !759, !760, !761, !771, !772, !780, !781, !789, !790, !791, !792, !796, !797, !801, !803, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !831, !843, !855, !867, !876, !877, !900, !901, !902, !903, !904, !905, !907, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1008, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1024, !1036, !1037, !1038, !1047, !1135, !1136, !1224, !1225, !1226, !1227, !1229, !1231, !1232, !1233, !1234, !1235}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !62, line: 203, baseType: !373, size: 4480)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !152, line: 122, baseType: !151)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !62, line: 203, baseType: !375, size: 3456, offset: 4480)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 3456, elements: !203)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !62, line: 30, size: 3456, elements: !377)
!377 = !{!378, !382, !383, !388, !392, !396, !397, !398, !407, !408, !409, !556, !557, !565, !586, !594, !598, !602, !603, !607, !608, !612, !613, !617, !618, !626, !630, !635, !636, !637, !638, !639, !640, !641, !645, !649, !653, !658, !662, !673, !677, !682, !689, !693, !694, !700, !711, !715, !725, !729, !737, !741, !749, !750}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !376, file: !62, line: 31, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!165, !368, !171}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !376, file: !62, line: 32, baseType: !379, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !376, file: !62, line: 33, baseType: !384, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!165, !368, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !376, file: !62, line: 34, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!165, !298, !368}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !376, file: !62, line: 35, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!165, !368}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !376, file: !62, line: 36, baseType: !393, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !376, file: !62, line: 37, baseType: !393, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !376, file: !62, line: 38, baseType: !399, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!165, !368, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !404, line: 21, baseType: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !404, line: 21, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !376, file: !62, line: 39, baseType: !399, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !376, file: !62, line: 40, baseType: !393, size: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !376, file: !62, line: 41, baseType: !410, size: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!165, !368, !252, !413, !415}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !418, line: 11, baseType: !419)
!418 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !35, line: 50, size: 7104, elements: !421)
!421 = !{!422, !423, !489, !543, !544, !545, !546, !547, !548, !549, !550, !553}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !420, file: !35, line: 51, baseType: !373, size: 4480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !420, file: !35, line: 51, baseType: !424, size: 1536, offset: 4480)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1536, elements: !203)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !35, line: 21, size: 1536, elements: !426)
!426 = !{!427, !434, !435, !439, !443, !444, !449, !453, !454, !458, !459, !463, !464, !469, !473, !477, !481, !482, !483, !484, !485, !486, !487, !488}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !425, file: !35, line: 22, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!165, !417, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !425, file: !35, line: 23, baseType: !428, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !425, file: !35, line: 24, baseType: !436, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!165, !417, !207, !416}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !425, file: !35, line: 25, baseType: !440, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!165, !417}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !425, file: !35, line: 26, baseType: !440, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !425, file: !35, line: 27, baseType: !445, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!165, !417, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !425, file: !35, line: 28, baseType: !450, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!165, !417, !416}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !425, file: !35, line: 29, baseType: !440, size: 64, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !425, file: !35, line: 30, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!165, !417, !171}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !425, file: !35, line: 31, baseType: !455, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !425, file: !35, line: 32, baseType: !460, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!165, !417, !417}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !425, file: !35, line: 33, baseType: !440, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !425, file: !35, line: 34, baseType: !465, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!165, !417, !144, !468, !416}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !24)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !425, file: !35, line: 35, baseType: !470, size: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!165, !417, !207}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !425, file: !35, line: 36, baseType: !474, size: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!165, !417, !207, !207, !252, !448}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !425, file: !35, line: 37, baseType: !478, size: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!165, !417, !207, !252}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !425, file: !35, line: 38, baseType: !445, size: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !425, file: !35, line: 39, baseType: !445, size: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !425, file: !35, line: 40, baseType: !445, size: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !425, file: !35, line: 41, baseType: !445, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !425, file: !35, line: 42, baseType: !445, size: 64, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !425, file: !35, line: 43, baseType: !445, size: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !425, file: !35, line: 44, baseType: !445, size: 64, offset: 1408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !425, file: !35, line: 45, baseType: !445, size: 64, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !420, file: !35, line: 52, baseType: !490, size: 64, offset: 6016)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !418, line: 60, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !30, line: 240, size: 640, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !539, !540, !541, !542}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !492, file: !30, line: 241, baseType: !144, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !30, line: 242, baseType: !224, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !492, file: !30, line: 243, baseType: !207, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !492, file: !30, line: 243, baseType: !207, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !492, file: !30, line: 244, baseType: !207, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !492, file: !30, line: 244, baseType: !207, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !492, file: !30, line: 245, baseType: !252, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !492, file: !30, line: 246, baseType: !322, size: 32, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !492, file: !30, line: 247, baseType: !207, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !492, file: !30, line: 251, baseType: !207, size: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !492, file: !30, line: 252, baseType: !505, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !418, line: 30, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !35, line: 73, size: 5440, elements: !508)
!508 = !{!509, !510, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !507, file: !35, line: 74, baseType: !373, size: 4480)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !507, file: !35, line: 74, baseType: !511, size: 256, offset: 4480)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, elements: !203)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !35, line: 66, size: 256, elements: !513)
!513 = !{!514, !518, !523, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !512, file: !35, line: 67, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!165, !505}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !512, file: !35, line: 68, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!165, !505, !522, !207, !432, !252, !252}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !30, line: 149, baseType: !29)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !512, file: !35, line: 69, baseType: !519, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !512, file: !35, line: 70, baseType: !515, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !507, file: !35, line: 75, baseType: !207, size: 32, offset: 4736)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !507, file: !35, line: 76, baseType: !207, size: 32, offset: 4768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !507, file: !35, line: 77, baseType: !252, size: 64, offset: 4800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !507, file: !35, line: 78, baseType: !207, size: 32, offset: 4864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !507, file: !35, line: 79, baseType: !207, size: 32, offset: 4896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !507, file: !35, line: 80, baseType: !322, size: 32, offset: 4928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !507, file: !35, line: 81, baseType: !322, size: 32, offset: 4960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !507, file: !35, line: 82, baseType: !207, size: 32, offset: 4992)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !507, file: !35, line: 83, baseType: !252, size: 64, offset: 5056)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !507, file: !35, line: 84, baseType: !252, size: 64, offset: 5120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !507, file: !35, line: 85, baseType: !254, size: 64, offset: 5184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !507, file: !35, line: 86, baseType: !252, size: 64, offset: 5248)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !507, file: !35, line: 87, baseType: !254, size: 64, offset: 5312)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !507, file: !35, line: 88, baseType: !148, size: 64, offset: 5376)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !492, file: !30, line: 253, baseType: !322, size: 32, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !492, file: !30, line: 254, baseType: !207, size: 32, offset: 544)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !492, file: !30, line: 254, baseType: !207, size: 32, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !492, file: !30, line: 255, baseType: !207, size: 32, offset: 608)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !420, file: !35, line: 53, baseType: !207, size: 32, offset: 6080)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !420, file: !35, line: 53, baseType: !207, size: 32, offset: 6112)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !420, file: !35, line: 54, baseType: !148, size: 64, offset: 6144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !420, file: !35, line: 55, baseType: !252, size: 64, offset: 6208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !420, file: !35, line: 55, baseType: !252, size: 64, offset: 6272)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !420, file: !35, line: 56, baseType: !207, size: 32, offset: 6336)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !420, file: !35, line: 57, baseType: !417, size: 64, offset: 6400)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !420, file: !35, line: 58, baseType: !551, size: 320, offset: 6464)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 320, elements: !552)
!552 = !{!284, !341}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !420, file: !35, line: 59, baseType: !554, size: 320, offset: 6784)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 320, elements: !552)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !35, line: 48, baseType: !34)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !376, file: !62, line: 42, baseType: !384, size: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !376, file: !62, line: 43, baseType: !558, size: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!165, !368, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !56, line: 165, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !56, line: 165, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !376, file: !62, line: 45, baseType: !566, size: 64, offset: 832)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!165, !368, !569, !570}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !30, line: 213, baseType: !40)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !418, line: 51, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !35, line: 91, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !583, !584, !585}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !573, file: !35, line: 92, baseType: !207, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !573, file: !35, line: 93, baseType: !207, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !573, file: !35, line: 94, baseType: !416, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !573, file: !35, line: 95, baseType: !144, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !573, file: !35, line: 96, baseType: !580, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !30, line: 215, baseType: !582)
!582 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !573, file: !35, line: 97, baseType: !207, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !573, file: !35, line: 98, baseType: !569, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !573, file: !35, line: 99, baseType: !322, size: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !376, file: !62, line: 46, baseType: !587, size: 64, offset: 896)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!165, !368, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !108, line: 16, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !108, line: 16, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !376, file: !62, line: 47, baseType: !595, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!165, !368, !368, !590, !402}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !376, file: !62, line: 48, baseType: !599, size: 64, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!165, !368, !368, !590}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !376, file: !62, line: 49, baseType: !599, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !376, file: !62, line: 50, baseType: !604, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!165, !368, !448}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !376, file: !62, line: 51, baseType: !599, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !376, file: !62, line: 53, baseType: !609, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!165, !368, !144, !387}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !376, file: !62, line: 54, baseType: !609, size: 64, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !376, file: !62, line: 55, baseType: !614, size: 64, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!165, !368, !207, !387}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !376, file: !62, line: 56, baseType: !614, size: 64, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !376, file: !62, line: 57, baseType: !619, size: 64, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!165, !368, !622, !387}
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !623, line: 12, baseType: !624)
!623 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !623, line: 12, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !376, file: !62, line: 58, baseType: !627, size: 64, offset: 1600)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!165, !368, !403, !622, !387}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !376, file: !62, line: 60, baseType: !631, size: 64, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!165, !368, !403, !634, !403}
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !44)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !376, file: !62, line: 61, baseType: !631, size: 64, offset: 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !376, file: !62, line: 62, baseType: !631, size: 64, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !376, file: !62, line: 63, baseType: !631, size: 64, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !376, file: !62, line: 64, baseType: !631, size: 64, offset: 1920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !376, file: !62, line: 65, baseType: !631, size: 64, offset: 1984)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !376, file: !62, line: 67, baseType: !393, size: 64, offset: 2048)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !376, file: !62, line: 69, baseType: !642, size: 64, offset: 2112)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!165, !368, !403, !403}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !376, file: !62, line: 71, baseType: !646, size: 64, offset: 2176)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!165, !368, !207, !432, !416, !387}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !376, file: !62, line: 72, baseType: !650, size: 64, offset: 2240)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!165, !387, !207, !415, !387}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !376, file: !62, line: 73, baseType: !654, size: 64, offset: 2304)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!165, !368, !252, !413, !415, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !376, file: !62, line: 74, baseType: !659, size: 64, offset: 2368)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!165, !368, !252, !413, !415, !415, !657}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !376, file: !62, line: 75, baseType: !663, size: 64, offset: 2432)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!165, !368, !207, !387, !666, !666, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !669, line: 59, baseType: !670)
!669 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !669, line: 15, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !669, line: 15, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !376, file: !62, line: 77, baseType: !674, size: 64, offset: 2496)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!165, !368, !207, !252, !252}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !376, file: !62, line: 78, baseType: !678, size: 64, offset: 2560)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!165, !368, !403, !681, !670}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !56, line: 74, baseType: !55)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !376, file: !62, line: 79, baseType: !683, size: 64, offset: 2624)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!165, !368, !252, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !376, file: !62, line: 80, baseType: !690, size: 64, offset: 2688)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!165, !368, !260, !260}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !376, file: !62, line: 81, baseType: !690, size: 64, offset: 2752)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !376, file: !62, line: 82, baseType: !695, size: 64, offset: 2816)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!165, !368, !403, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !376, file: !62, line: 84, baseType: !701, size: 64, offset: 2880)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!165, !368, !261, !704, !710, !634, !403}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!165, !207, !261, !708, !207, !269, !148}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !376, file: !62, line: 85, baseType: !712, size: 64, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!165, !368, !261, !622, !207, !432, !207, !432, !704, !710, !634, !403}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !376, file: !62, line: 86, baseType: !716, size: 64, offset: 3008)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!165, !368, !261, !403, !719, !634, !403}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !207, !207, !207, !432, !432, !723, !723, !723, !432, !432, !723, !723, !723, !261, !708, !207, !723, !269}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !376, file: !62, line: 87, baseType: !726, size: 64, offset: 3072)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!165, !368, !261, !622, !207, !432, !207, !432, !403, !719, !634, !403}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !376, file: !62, line: 88, baseType: !730, size: 64, offset: 3136)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!165, !368, !261, !622, !207, !432, !207, !432, !403, !733, !634, !403}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !207, !207, !207, !432, !432, !723, !723, !723, !432, !432, !723, !723, !723, !261, !708, !708, !207, !723, !269}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !376, file: !62, line: 89, baseType: !738, size: 64, offset: 3200)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!165, !368, !261, !704, !710, !403, !260}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !376, file: !62, line: 90, baseType: !742, size: 64, offset: 3264)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!165, !368, !261, !745, !710, !403, !708, !260}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!165, !207, !261, !708, !708, !207, !269, !148}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !376, file: !62, line: 91, baseType: !738, size: 64, offset: 3328)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !376, file: !62, line: 93, baseType: !751, size: 64, offset: 3392)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!165, !368, !368, !448, !448}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !370, file: !62, line: 204, baseType: !755, size: 6400, offset: 7936)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 6400, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 100)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !370, file: !62, line: 204, baseType: !755, size: 6400, offset: 14336)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !370, file: !62, line: 205, baseType: !755, size: 6400, offset: 20736)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !370, file: !62, line: 205, baseType: !755, size: 6400, offset: 27136)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !370, file: !62, line: 206, baseType: !762, size: 64, offset: 33536)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !62, line: 141, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !62, line: 142, size: 256, elements: !765)
!765 = !{!766, !767, !768, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !764, file: !62, line: 143, baseType: !403, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !62, line: 144, baseType: !234, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !764, file: !62, line: 145, baseType: !769, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !62, line: 140, baseType: !61)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !62, line: 146, baseType: !762, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !370, file: !62, line: 207, baseType: !762, size: 64, offset: 33600)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !370, file: !62, line: 208, baseType: !773, size: 64, offset: 33664)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !62, line: 149, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !62, line: 150, size: 192, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !775, file: !62, line: 151, baseType: !318, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !775, file: !62, line: 152, baseType: !148, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !62, line: 153, baseType: !773, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !370, file: !62, line: 208, baseType: !773, size: 64, offset: 33728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !370, file: !62, line: 209, baseType: !782, size: 64, offset: 33792)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !62, line: 163, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !62, line: 158, size: 192, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !784, file: !62, line: 159, baseType: !622, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !784, file: !62, line: 160, baseType: !322, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !62, line: 161, baseType: !783, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !370, file: !62, line: 210, baseType: !622, size: 64, offset: 33856)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !370, file: !62, line: 211, baseType: !622, size: 64, offset: 33920)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !370, file: !62, line: 212, baseType: !148, size: 64, offset: 33984)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !370, file: !62, line: 213, baseType: !793, size: 64, offset: 34048)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!165, !710}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !370, file: !62, line: 214, baseType: !569, size: 32, offset: 34112)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !370, file: !62, line: 215, baseType: !798, size: 64, offset: 34176)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !108, line: 1378, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !108, line: 1378, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !370, file: !62, line: 216, baseType: !802, size: 64, offset: 34240)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !404, line: 83, baseType: !184)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !370, file: !62, line: 217, baseType: !804, size: 64, offset: 34304)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !108, line: 25, baseType: !184)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !370, file: !62, line: 218, baseType: !207, size: 32, offset: 34368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !370, file: !62, line: 219, baseType: !505, size: 64, offset: 34432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !370, file: !62, line: 220, baseType: !322, size: 32, offset: 34496)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !370, file: !62, line: 221, baseType: !322, size: 32, offset: 34528)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !370, file: !62, line: 222, baseType: !207, size: 32, offset: 34560)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !370, file: !62, line: 222, baseType: !207, size: 32, offset: 34592)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !370, file: !62, line: 223, baseType: !322, size: 32, offset: 34624)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !370, file: !62, line: 224, baseType: !322, size: 32, offset: 34656)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !62, line: 225, baseType: !148, size: 64, offset: 34688)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !370, file: !62, line: 227, baseType: !368, size: 64, offset: 34752)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !370, file: !62, line: 228, baseType: !368, size: 64, offset: 34816)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !370, file: !62, line: 229, baseType: !817, size: 64, offset: 34880)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !62, line: 100, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !62, line: 101, size: 256, elements: !820)
!820 = !{!821, !825, !829, !830}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !819, file: !62, line: 102, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!165, !368, !368, !148}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !819, file: !62, line: 103, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!165, !368, !591, !403, !591, !368, !148}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !819, file: !62, line: 104, baseType: !148, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !62, line: 105, baseType: !817, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !370, file: !62, line: 230, baseType: !832, size: 64, offset: 34944)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !62, line: 108, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !62, line: 109, size: 256, elements: !835)
!835 = !{!836, !837, !841, !842}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !834, file: !62, line: 110, baseType: !822, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !834, file: !62, line: 111, baseType: !838, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!165, !368, !591, !368, !148}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !834, file: !62, line: 112, baseType: !148, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !62, line: 113, baseType: !832, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !370, file: !62, line: 231, baseType: !844, size: 64, offset: 35008)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !62, line: 116, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !62, line: 117, size: 256, elements: !847)
!847 = !{!848, !849, !853, !854}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !846, file: !62, line: 118, baseType: !822, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !846, file: !62, line: 119, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!165, !368, !668, !668, !368, !148}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !846, file: !62, line: 120, baseType: !148, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !62, line: 121, baseType: !844, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !370, file: !62, line: 232, baseType: !856, size: 64, offset: 35072)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !62, line: 124, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !62, line: 125, size: 256, elements: !859)
!859 = !{!860, !864, !865, !866}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !858, file: !62, line: 126, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!165, !368, !403, !634, !403, !148}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !858, file: !62, line: 127, baseType: !861, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !858, file: !62, line: 128, baseType: !148, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !62, line: 129, baseType: !856, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !370, file: !62, line: 233, baseType: !868, size: 64, offset: 35136)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !62, line: 132, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !62, line: 133, size: 256, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !870, file: !62, line: 134, baseType: !861, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !870, file: !62, line: 135, baseType: !861, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !870, file: !62, line: 136, baseType: !148, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !62, line: 137, baseType: !868, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !370, file: !62, line: 235, baseType: !207, size: 32, offset: 35200)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !370, file: !62, line: 237, baseType: !878, size: 64, offset: 35264)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !62, line: 27, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !62, line: 27, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !62, line: 27, size: 320, elements: !882)
!882 = !{!883, !887, !888, !889, !890, !892, !899}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !881, file: !62, line: 27, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !885, line: 166, baseType: !886)
!885 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !885, line: 139, baseType: !5)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !881, file: !62, line: 27, baseType: !884, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !881, file: !62, line: 27, baseType: !884, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !881, file: !62, line: 27, baseType: !884, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !881, file: !62, line: 27, baseType: !891, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !881, file: !62, line: 27, baseType: !893, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !62, line: 21, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !62, line: 17, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !895, file: !62, line: 19, baseType: !622, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !895, file: !62, line: 20, baseType: !207, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !881, file: !62, line: 27, baseType: !402, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !370, file: !62, line: 239, baseType: !670, size: 64, offset: 35328)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !370, file: !62, line: 240, baseType: !670, size: 64, offset: 35392)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !370, file: !62, line: 241, baseType: !670, size: 64, offset: 35456)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !370, file: !62, line: 242, baseType: !670, size: 64, offset: 35520)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !370, file: !62, line: 243, baseType: !322, size: 32, offset: 35584)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !370, file: !62, line: 245, baseType: !906, size: 64, offset: 35616)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !283)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !370, file: !62, line: 246, baseType: !908, size: 64, offset: 35712)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !909, line: 18, baseType: !910)
!909 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !912, line: 29, size: 5760, elements: !913)
!912 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!913 = !{!914, !915, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933, !934, !935, !936, !961, !962, !963}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !911, file: !912, line: 30, baseType: !373, size: 4480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !911, file: !912, line: 30, baseType: !916, size: 32, offset: 4480)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 32, elements: !203)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !911, file: !912, line: 31, baseType: !207, size: 32, offset: 4512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !911, file: !912, line: 31, baseType: !207, size: 32, offset: 4544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !911, file: !912, line: 32, baseType: !417, size: 64, offset: 4608)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !911, file: !912, line: 33, baseType: !322, size: 32, offset: 4672)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !911, file: !912, line: 34, baseType: !322, size: 32, offset: 4704)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !911, file: !912, line: 35, baseType: !252, size: 64, offset: 4736)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !911, file: !912, line: 36, baseType: !252, size: 64, offset: 4800)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !911, file: !912, line: 37, baseType: !207, size: 32, offset: 4864)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !911, file: !912, line: 38, baseType: !908, size: 64, offset: 4928)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !911, file: !912, line: 39, baseType: !252, size: 64, offset: 4992)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !911, file: !912, line: 40, baseType: !322, size: 32, offset: 5056)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !911, file: !912, line: 42, baseType: !207, size: 32, offset: 5088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !911, file: !912, line: 43, baseType: !414, size: 64, offset: 5120)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !911, file: !912, line: 44, baseType: !252, size: 64, offset: 5184)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !911, file: !912, line: 45, baseType: !932, size: 64, offset: 5248)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !911, file: !912, line: 46, baseType: !322, size: 32, offset: 5312)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !911, file: !912, line: 47, baseType: !413, size: 64, offset: 5376)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !911, file: !912, line: 49, baseType: !149, size: 64, offset: 5440)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !911, file: !912, line: 50, baseType: !937, size: 64, offset: 5504)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !912, line: 27, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !912, line: 27, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !912, line: 27, size: 320, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !954}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !940, file: !912, line: 27, baseType: !884, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !940, file: !912, line: 27, baseType: !884, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !940, file: !912, line: 27, baseType: !884, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !940, file: !912, line: 27, baseType: !884, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !912, line: 27, baseType: !891, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !940, file: !912, line: 27, baseType: !948, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !912, line: 10, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !912, line: 8, size: 64, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !950, file: !912, line: 9, baseType: !207, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !950, file: !912, line: 9, baseType: !207, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !940, file: !912, line: 27, baseType: !955, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !912, line: 14, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !912, line: 12, size: 128, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !957, file: !912, line: 13, baseType: !252, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !957, file: !912, line: 13, baseType: !252, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !911, file: !912, line: 51, baseType: !908, size: 64, offset: 5568)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !911, file: !912, line: 52, baseType: !417, size: 64, offset: 5632)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !911, file: !912, line: 53, baseType: !964, size: 64, offset: 5696)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !909, line: 33, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !912, line: 72, size: 4864, elements: !967)
!967 = !{!968, !969, !986, !987, !996}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !966, file: !912, line: 73, baseType: !373, size: 4480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !966, file: !912, line: 73, baseType: !970, size: 192, offset: 4480)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 192, elements: !203)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !912, line: 56, size: 192, elements: !972)
!972 = !{!973, !978, !982}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !971, file: !912, line: 57, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!165, !964, !908, !207, !432, !431, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !971, file: !912, line: 58, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!165, !964}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !971, file: !912, line: 59, baseType: !983, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!165, !964, !171}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !966, file: !912, line: 74, baseType: !148, size: 64, offset: 4672)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !966, file: !912, line: 75, baseType: !988, size: 64, offset: 4736)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !912, line: 62, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !912, line: 64, size: 256, elements: !991)
!991 = !{!992, !993, !994, !995}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !912, line: 66, baseType: !988, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !990, file: !912, line: 67, baseType: !431, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !990, file: !912, line: 68, baseType: !977, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !990, file: !912, line: 69, baseType: !207, size: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !966, file: !912, line: 76, baseType: !988, size: 64, offset: 4800)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !370, file: !62, line: 247, baseType: !908, size: 64, offset: 35776)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !370, file: !62, line: 248, baseType: !490, size: 64, offset: 35840)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !370, file: !62, line: 250, baseType: !908, size: 64, offset: 35904)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !370, file: !62, line: 251, baseType: !591, size: 64, offset: 35968)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !370, file: !62, line: 253, baseType: !368, size: 64, offset: 36032)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !370, file: !62, line: 254, baseType: !403, size: 64, offset: 36096)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !370, file: !62, line: 255, baseType: !148, size: 64, offset: 36160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !370, file: !62, line: 256, baseType: !1005, size: 64, offset: 36224)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!165, !368, !148}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !370, file: !62, line: 257, baseType: !1005, size: 64, offset: 36288)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !370, file: !62, line: 258, baseType: !1010, size: 64, offset: 36352)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!165, !368, !708, !322, !977, !148}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !370, file: !62, line: 260, baseType: !207, size: 32, offset: 36416)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !370, file: !62, line: 261, baseType: !368, size: 64, offset: 36480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !370, file: !62, line: 262, baseType: !403, size: 64, offset: 36544)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !370, file: !62, line: 263, baseType: !403, size: 64, offset: 36608)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !370, file: !62, line: 264, baseType: !322, size: 32, offset: 36672)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !370, file: !62, line: 265, baseType: !562, size: 64, offset: 36736)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !370, file: !62, line: 266, baseType: !260, size: 64, offset: 36800)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !370, file: !62, line: 266, baseType: !260, size: 64, offset: 36864)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !370, file: !62, line: 267, baseType: !1022, size: 64, offset: 36928)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !56, line: 42, baseType: !66)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !370, file: !62, line: 269, baseType: !1025, size: 640, offset: 36992)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 640, elements: !1034)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !62, line: 15, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!165, !368, !207, !207, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !108, line: 1723, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !108, line: 1723, flags: DIFlagFwdDecl)
!1034 = !{!1035}
!1035 = !DISubrange(count: 10)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !370, file: !62, line: 270, baseType: !1025, size: 640, offset: 37632)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !370, file: !62, line: 272, baseType: !207, size: 32, offset: 38272)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !370, file: !62, line: 273, baseType: !1039, size: 64, offset: 38336)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !62, line: 178, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !62, line: 173, size: 256, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !1041, file: !62, line: 174, baseType: !149, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1041, file: !62, line: 175, baseType: !622, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !1041, file: !62, line: 176, baseType: !906, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !1041, file: !62, line: 177, baseType: !322, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !370, file: !62, line: 274, baseType: !1048, size: 64, offset: 38400)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !62, line: 165, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !62, line: 167, size: 192, elements: !1051)
!1051 = !{!1052, !1133, !1134}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !1050, file: !62, line: 168, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !1054, line: 11, baseType: !1055)
!1054 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !1054, line: 13, size: 832, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !1054, line: 14, baseType: !184, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1056, file: !1054, line: 15, baseType: !622, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !1056, file: !1054, line: 16, baseType: !184, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !1056, file: !1054, line: 17, baseType: !207, size: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1056, file: !1054, line: 18, baseType: !252, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !1056, file: !1054, line: 19, baseType: !1064, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !1065, line: 22, baseType: !1066)
!1065 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !1054, line: 81, size: 4992, elements: !1068)
!1068 = !{!1069, !1070, !1084, !1085, !1086, !1095}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1067, file: !1054, line: 82, baseType: !373, size: 4480)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1067, file: !1054, line: 82, baseType: !1071, size: 256, offset: 4480)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 256, elements: !203)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !1054, line: 74, size: 256, elements: !1073)
!1073 = !{!1074, !1078, !1079, !1083}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !1072, file: !1054, line: 75, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!165, !1064}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1072, file: !1054, line: 76, baseType: !1075, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1072, file: !1054, line: 77, baseType: !1080, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!165, !1064, !171}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1072, file: !1054, line: 78, baseType: !1075, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !1054, line: 83, baseType: !148, size: 64, offset: 4736)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !1067, file: !1054, line: 85, baseType: !207, size: 32, offset: 4800)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !1067, file: !1054, line: 86, baseType: !1087, size: 64, offset: 4864)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !1054, line: 41, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1054, line: 36, size: 256, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094}
