; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/fft/ftn-custom/zfftf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/fft/ftn-custom/zfftf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !{!295, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 46, baseType: !297)
!296 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!300 = !{i32 7, !"Dwarf Version", i32 4}
!301 = !{i32 2, !"Debug Info Version", i32 3}
!302 = !{i32 1, !"wchar_size", i32 4}
!303 = !{i32 7, !"PIC Level", i32 2}
!304 = !{i32 7, !"uwtable", i32 1}
!305 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!306 = distinct !DISubprogram(name: "matcreatefft_", scope: !307, file: !307, line: 10, type: !308, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1286)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/fft/ftn-custom/zfftf.c", directory: "/home/users/ndemeye/xSDK")
!308 = !DISubroutineType(types: !309)
!309 = !{null, !310, !315, !315, !317, !319, !1285, !295}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !312, line: 330, baseType: !313)
!312 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !312, line: 330, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !323, line: 436, size: 23424, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !522, !1028, !1048, !1049, !1050, !1052, !1053, !1054, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1181, !1182, !1198, !1199, !1200, !1201, !1202, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1237, !1257, !1258, !1260, !1261, !1262, !1263, !1264, !1265, !1283, !1284}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !322, file: !323, line: 437, baseType: !326, size: 4480)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !327, line: 122, baseType: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !327, line: 73, size: 4480, elements: !329)
!329 = !{!330, !332, !381, !382, !383, !386, !387, !388, !389, !397, !398, !400, !404, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !420, !421, !422, !424, !425, !426, !428, !429, !430, !431, !432, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !458, !460, !461, !465, !466, !512, !517, !519, !520, !521}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !328, file: !327, line: 74, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !328, file: !327, line: 75, baseType: !333, size: 448, offset: 64)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 448, elements: !379)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !327, line: 53, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 45, size: 448, elements: !336)
!336 = !{!337, !344, !352, !357, !363, !367, !374}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !335, file: !327, line: 46, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !342, !310}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !335, file: !327, line: 47, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!341, !342, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !349, line: 16, baseType: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !349, line: 16, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !335, file: !327, line: 48, baseType: !353, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!341, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !335, file: !327, line: 49, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!341, !342, !361, !342}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !335, file: !327, line: 50, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!341, !342, !361, !356}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !335, file: !327, line: 51, baseType: !368, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!341, !342, !361, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !335, file: !327, line: 52, baseType: !375, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!341, !342, !361, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!379 = !{!380}
!380 = !DISubrange(count: 1)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !328, file: !327, line: 76, baseType: !311, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !327, line: 77, baseType: !316, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !328, file: !327, line: 78, baseType: !384, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !385)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !328, file: !327, line: 78, baseType: !384, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !328, file: !327, line: 78, baseType: !384, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !328, file: !327, line: 78, baseType: !384, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !327, line: 79, baseType: !390, size: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !393, line: 27, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !395, line: 43, baseType: !396)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!396 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !328, file: !327, line: 80, baseType: !316, size: 32, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !328, file: !327, line: 81, baseType: !399, size: 32, offset: 992)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !328, file: !327, line: 82, baseType: !401, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !328, file: !327, line: 83, baseType: !405, size: 64, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !328, file: !327, line: 84, baseType: !317, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !328, file: !327, line: 85, baseType: !317, size: 64, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !328, file: !327, line: 86, baseType: !317, size: 64, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !328, file: !327, line: 87, baseType: !317, size: 64, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !328, file: !327, line: 88, baseType: !342, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !328, file: !327, line: 89, baseType: !390, size: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !327, line: 90, baseType: !317, size: 64, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !328, file: !327, line: 91, baseType: !317, size: 64, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !328, file: !327, line: 92, baseType: !316, size: 32, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !328, file: !327, line: 93, baseType: !299, size: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !327, line: 94, baseType: !419, size: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !391)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !328, file: !327, line: 95, baseType: !316, size: 32, offset: 1856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !328, file: !327, line: 95, baseType: !316, size: 32, offset: 1888)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !328, file: !327, line: 96, baseType: !423, size: 64, offset: 1920)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !328, file: !327, line: 96, baseType: !423, size: 64, offset: 1984)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !328, file: !327, line: 97, baseType: !315, size: 64, offset: 2048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !328, file: !327, line: 97, baseType: !427, size: 64, offset: 2112)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !328, file: !327, line: 98, baseType: !316, size: 32, offset: 2176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !328, file: !327, line: 98, baseType: !316, size: 32, offset: 2208)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !328, file: !327, line: 99, baseType: !423, size: 64, offset: 2240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !328, file: !327, line: 99, baseType: !423, size: 64, offset: 2304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !328, file: !327, line: 100, baseType: !433, size: 64, offset: 2368)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !385)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !328, file: !327, line: 100, baseType: !436, size: 64, offset: 2432)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !328, file: !327, line: 101, baseType: !316, size: 32, offset: 2496)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !328, file: !327, line: 101, baseType: !316, size: 32, offset: 2528)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !328, file: !327, line: 102, baseType: !423, size: 64, offset: 2560)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !328, file: !327, line: 102, baseType: !423, size: 64, offset: 2624)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !328, file: !327, line: 103, baseType: !442, size: 64, offset: 2688)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !434)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !328, file: !327, line: 103, baseType: !445, size: 64, offset: 2752)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !328, file: !327, line: 104, baseType: !378, size: 64, offset: 2816)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !328, file: !327, line: 105, baseType: !316, size: 32, offset: 2880)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !328, file: !327, line: 106, baseType: !449, size: 128, offset: 2944)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, elements: !456)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !327, line: 64, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 61, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !452, file: !327, line: 62, baseType: !371, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !452, file: !327, line: 63, baseType: !299, size: 64, offset: 64)
!456 = !{!457}
!457 = !DISubrange(count: 2)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !328, file: !327, line: 107, baseType: !459, size: 64, offset: 3072)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 64, elements: !456)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !328, file: !327, line: 108, baseType: !299, size: 64, offset: 3136)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !328, file: !327, line: 109, baseType: !462, size: 64, offset: 3200)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!341, !299}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !328, file: !327, line: 111, baseType: !316, size: 32, offset: 3264)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !328, file: !327, line: 112, baseType: !467, size: 320, offset: 3328)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 320, elements: !510)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!341, !471, !342, !299}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !474)
!474 = !{!475, !476, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !473, file: !10, line: 100, baseType: !316, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !10, line: 101, baseType: !477, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !488, !489, !490, !491, !493, !495, !496, !497}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !479, file: !10, line: 84, baseType: !317, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !479, file: !10, line: 85, baseType: !317, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !10, line: 86, baseType: !299, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !479, file: !10, line: 87, baseType: !401, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !479, file: !10, line: 88, baseType: !486, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !479, file: !10, line: 89, baseType: !318, size: 8, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !479, file: !10, line: 90, baseType: !317, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !479, file: !10, line: 91, baseType: !295, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !479, file: !10, line: 92, baseType: !492, size: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !10, line: 93, baseType: !494, size: 32, offset: 544)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !10, line: 94, baseType: !477, size: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !479, file: !10, line: 95, baseType: !317, size: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !479, file: !10, line: 96, baseType: !299, size: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !473, file: !10, line: 102, baseType: !317, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !473, file: !10, line: 102, baseType: !317, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !473, file: !10, line: 103, baseType: !317, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !473, file: !10, line: 104, baseType: !311, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !473, file: !10, line: 105, baseType: !492, size: 32, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !473, file: !10, line: 105, baseType: !492, size: 32, offset: 416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !473, file: !10, line: 105, baseType: !492, size: 32, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !473, file: !10, line: 106, baseType: !342, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !473, file: !10, line: 107, baseType: !507, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!510 = !{!511}
!511 = !DISubrange(count: 5)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !328, file: !327, line: 113, baseType: !513, size: 320, offset: 3648)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !510)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!341, !342, !299}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !328, file: !327, line: 114, baseType: !518, size: 320, offset: 3968)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !510)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !328, file: !327, line: 115, baseType: !492, size: 32, offset: 4288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !328, file: !327, line: 120, baseType: !507, size: 64, offset: 4352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !328, file: !327, line: 121, baseType: !492, size: 32, offset: 4416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !322, file: !323, line: 437, baseType: !523, size: 9472, offset: 4480)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 9472, elements: !379)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !323, line: 32, size: 9472, elements: !525)
!525 = !{!526, !535, !539, !540, !547, !551, !552, !553, !554, !555, !556, !557, !581, !585, !590, !595, !614, !619, !623, !624, !629, !634, !635, !640, !644, !648, !652, !656, !660, !661, !662, !663, !664, !668, !669, !674, !675, !676, !677, !678, !683, !690, !695, !699, !703, !707, !711, !712, !716, !717, !724, !729, !730, !731, !732, !794, !802, !803, !807, !808, !812, !813, !817, !822, !823, !827, !831, !838, !839, !840, !841, !842, !843, !848, !849, !853, !857, !861, !862, !863, !867, !877, !878, !882, !883, !887, !888, !892, !893, !898, !899, !903, !907, !908, !909, !910, !911, !912, !913, !917, !918, !919, !920, !921, !922, !926, !927, !928, !929, !930, !931, !932, !933, !937, !941, !942, !943, !947, !948, !949, !950, !951, !952, !953, !957, !958, !959, !964, !968, !969, !973, !974, !975, !976, !1002, !1006, !1007, !1008, !1009, !1010, !1014, !1015, !1016, !1017, !1018, !1022, !1026, !1027}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !524, file: !323, line: 34, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!341, !320, !316, !530, !316, !530, !532, !534}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !524, file: !323, line: 35, baseType: !536, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!341, !320, !316, !315, !427, !445}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !524, file: !323, line: 36, baseType: !536, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !524, file: !323, line: 37, baseType: !541, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!341, !320, !544, !544}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !524, file: !323, line: 38, baseType: !548, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!341, !320, !544, !544, !544}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !524, file: !323, line: 40, baseType: !541, size: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !524, file: !323, line: 41, baseType: !548, size: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !524, file: !323, line: 42, baseType: !541, size: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !524, file: !323, line: 43, baseType: !548, size: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !524, file: !323, line: 44, baseType: !541, size: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !524, file: !323, line: 46, baseType: !548, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !524, file: !323, line: 47, baseType: !558, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!341, !320, !561, !561, !565}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !562, line: 11, baseType: !563)
!562 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !562, line: 11, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !568, file: !36, line: 1227, baseType: !434, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !568, file: !36, line: 1228, baseType: !434, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !568, file: !36, line: 1229, baseType: !434, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !568, file: !36, line: 1230, baseType: !434, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !568, file: !36, line: 1231, baseType: !434, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !568, file: !36, line: 1232, baseType: !434, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !568, file: !36, line: 1233, baseType: !434, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !568, file: !36, line: 1234, baseType: !434, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !568, file: !36, line: 1236, baseType: !434, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !568, file: !36, line: 1237, baseType: !434, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !568, file: !36, line: 1238, baseType: !434, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !524, file: !323, line: 48, baseType: !582, size: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!341, !320, !561, !565}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !524, file: !323, line: 49, baseType: !586, size: 64, offset: 832)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!341, !320, !544, !434, !589, !434, !316, !316, !544}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !524, file: !323, line: 50, baseType: !591, size: 64, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!341, !320, !594, !319}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !524, file: !323, line: 52, baseType: !596, size: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!341, !320, !599, !600}
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !602, file: !36, line: 593, baseType: !384, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !602, file: !36, line: 594, baseType: !384, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !602, file: !36, line: 594, baseType: !384, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !602, file: !36, line: 594, baseType: !384, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !602, file: !36, line: 595, baseType: !384, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !602, file: !36, line: 596, baseType: !384, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !602, file: !36, line: 597, baseType: !384, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !602, file: !36, line: 598, baseType: !384, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !602, file: !36, line: 598, baseType: !384, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !602, file: !36, line: 599, baseType: !384, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !524, file: !323, line: 53, baseType: !615, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!341, !320, !320, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !524, file: !323, line: 54, baseType: !620, size: 64, offset: 1088)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!341, !320, !544}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !524, file: !323, line: 55, baseType: !541, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !524, file: !323, line: 56, baseType: !625, size: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!341, !320, !628, !433}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !524, file: !323, line: 58, baseType: !630, size: 64, offset: 1280)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!341, !320, !633}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !524, file: !323, line: 59, baseType: !630, size: 64, offset: 1344)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !524, file: !323, line: 60, baseType: !636, size: 64, offset: 1408)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!341, !320, !639, !492}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !524, file: !323, line: 61, baseType: !641, size: 64, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!341, !320}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !524, file: !323, line: 63, baseType: !645, size: 64, offset: 1536)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!341, !320, !316, !530, !443, !544, !544}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !524, file: !323, line: 64, baseType: !649, size: 64, offset: 1600)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!341, !320, !320, !561, !561, !565}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !524, file: !323, line: 65, baseType: !653, size: 64, offset: 1664)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!341, !320, !320, !565}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !524, file: !323, line: 66, baseType: !657, size: 64, offset: 1728)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!341, !320, !320, !561, !565}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !524, file: !323, line: 67, baseType: !653, size: 64, offset: 1792)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !524, file: !323, line: 69, baseType: !641, size: 64, offset: 1856)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !524, file: !323, line: 70, baseType: !649, size: 64, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !524, file: !323, line: 71, baseType: !657, size: 64, offset: 1984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !524, file: !323, line: 72, baseType: !665, size: 64, offset: 2048)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!341, !320, !319}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !524, file: !323, line: 73, baseType: !641, size: 64, offset: 2112)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !524, file: !323, line: 75, baseType: !670, size: 64, offset: 2176)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!341, !320, !673, !319}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !524, file: !323, line: 76, baseType: !541, size: 64, offset: 2240)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !524, file: !323, line: 77, baseType: !541, size: 64, offset: 2304)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !524, file: !323, line: 78, baseType: !558, size: 64, offset: 2368)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !524, file: !323, line: 79, baseType: !582, size: 64, offset: 2432)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !524, file: !323, line: 81, baseType: !679, size: 64, offset: 2496)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!341, !320, !443, !320, !682}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !524, file: !323, line: 82, baseType: !684, size: 64, offset: 2560)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!341, !320, !316, !687, !687, !594, !689}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !524, file: !323, line: 83, baseType: !691, size: 64, offset: 2624)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!341, !320, !316, !694, !316}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !524, file: !323, line: 84, baseType: !696, size: 64, offset: 2688)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!341, !320, !316, !530, !316, !530, !442}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !524, file: !323, line: 85, baseType: !700, size: 64, offset: 2752)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!341, !320, !320, !682}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !524, file: !323, line: 87, baseType: !704, size: 64, offset: 2816)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!341, !320, !544, !315}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !524, file: !323, line: 88, baseType: !708, size: 64, offset: 2880)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!341, !320, !443}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !524, file: !323, line: 89, baseType: !708, size: 64, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !524, file: !323, line: 90, baseType: !713, size: 64, offset: 3008)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!341, !320, !544, !534}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !524, file: !323, line: 91, baseType: !645, size: 64, offset: 3072)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !524, file: !323, line: 93, baseType: !718, size: 64, offset: 3136)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!341, !320, !721}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !524, file: !323, line: 94, baseType: !725, size: 64, offset: 3200)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!341, !320, !316, !492, !492, !315, !728, !728, !618}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !524, file: !323, line: 95, baseType: !725, size: 64, offset: 3264)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !524, file: !323, line: 96, baseType: !725, size: 64, offset: 3328)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !524, file: !323, line: 97, baseType: !725, size: 64, offset: 3392)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !524, file: !323, line: 99, baseType: !733, size: 64, offset: 3456)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!341, !320, !736, !739}
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !562, line: 51, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !562, line: 51, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !323, line: 609, size: 6208, elements: !742)
!742 = !{!743, !744, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !763, !770, !771, !772, !773, !774, !775, !776, !777, !781, !782, !783, !784, !785, !787, !788, !789, !790, !791, !792, !793}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !741, file: !323, line: 610, baseType: !326, size: 4480)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !741, file: !323, line: 610, baseType: !745, size: 32, offset: 4480)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !379)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !741, file: !323, line: 611, baseType: !316, size: 32, offset: 4512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !741, file: !323, line: 611, baseType: !316, size: 32, offset: 4544)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !741, file: !323, line: 611, baseType: !316, size: 32, offset: 4576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !741, file: !323, line: 612, baseType: !316, size: 32, offset: 4608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !741, file: !323, line: 613, baseType: !316, size: 32, offset: 4640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !741, file: !323, line: 614, baseType: !315, size: 64, offset: 4672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !741, file: !323, line: 615, baseType: !427, size: 64, offset: 4736)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !741, file: !323, line: 616, baseType: !694, size: 64, offset: 4800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !741, file: !323, line: 617, baseType: !315, size: 64, offset: 4864)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !741, file: !323, line: 618, baseType: !756, size: 64, offset: 4928)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !323, line: 602, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 598, size: 128, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !758, file: !323, line: 599, baseType: !316, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !758, file: !323, line: 600, baseType: !316, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !758, file: !323, line: 601, baseType: !442, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !741, file: !323, line: 619, baseType: !764, size: 64, offset: 4992)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !323, line: 607, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 604, size: 128, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !766, file: !323, line: 605, baseType: !316, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !766, file: !323, line: 606, baseType: !442, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !741, file: !323, line: 620, baseType: !442, size: 64, offset: 5056)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !741, file: !323, line: 621, baseType: !434, size: 64, offset: 5120)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !741, file: !323, line: 622, baseType: !434, size: 64, offset: 5184)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !741, file: !323, line: 623, baseType: !544, size: 64, offset: 5248)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !741, file: !323, line: 623, baseType: !544, size: 64, offset: 5312)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !741, file: !323, line: 623, baseType: !544, size: 64, offset: 5376)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !741, file: !323, line: 624, baseType: !492, size: 32, offset: 5440)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !741, file: !323, line: 625, baseType: !778, size: 64, offset: 5504)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!341}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !741, file: !323, line: 626, baseType: !299, size: 64, offset: 5568)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !741, file: !323, line: 627, baseType: !544, size: 64, offset: 5632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !741, file: !323, line: 628, baseType: !316, size: 32, offset: 5696)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !741, file: !323, line: 629, baseType: !361, size: 64, offset: 5760)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !741, file: !323, line: 630, baseType: !786, size: 32, offset: 5824)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !741, file: !323, line: 631, baseType: !316, size: 32, offset: 5856)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !741, file: !323, line: 631, baseType: !316, size: 32, offset: 5888)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !741, file: !323, line: 632, baseType: !492, size: 32, offset: 5920)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !741, file: !323, line: 633, baseType: !492, size: 32, offset: 5952)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !741, file: !323, line: 634, baseType: !371, size: 64, offset: 6016)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !741, file: !323, line: 634, baseType: !299, size: 64, offset: 6080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !741, file: !323, line: 635, baseType: !390, size: 64, offset: 6144)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !524, file: !323, line: 100, baseType: !795, size: 64, offset: 3520)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!341, !320, !316, !316, !798, !801}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !800)
!800 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !524, file: !323, line: 101, baseType: !641, size: 64, offset: 3584)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !524, file: !323, line: 102, baseType: !804, size: 64, offset: 3648)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!341, !320, !561, !561, !319}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !524, file: !323, line: 103, baseType: !527, size: 64, offset: 3712)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !524, file: !323, line: 105, baseType: !809, size: 64, offset: 3776)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!341, !320, !561, !561, !594, !319}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !524, file: !323, line: 106, baseType: !641, size: 64, offset: 3840)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !524, file: !323, line: 107, baseType: !814, size: 64, offset: 3904)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!341, !320, !348}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !524, file: !323, line: 108, baseType: !818, size: 64, offset: 3968)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!341, !320, !821, !594, !319}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !361)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !524, file: !323, line: 109, baseType: !778, size: 64, offset: 4032)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !524, file: !323, line: 111, baseType: !824, size: 64, offset: 4096)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!341, !320, !320, !320, !434, !320}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !524, file: !323, line: 112, baseType: !828, size: 64, offset: 4160)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!341, !320, !320, !320, !320}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !524, file: !323, line: 113, baseType: !832, size: 64, offset: 4224)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!341, !320, !835, !835}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !562, line: 30, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !562, line: 30, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !524, file: !323, line: 114, baseType: !527, size: 64, offset: 4288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !524, file: !323, line: 115, baseType: !645, size: 64, offset: 4352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !524, file: !323, line: 117, baseType: !704, size: 64, offset: 4416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !524, file: !323, line: 118, baseType: !704, size: 64, offset: 4480)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !524, file: !323, line: 119, baseType: !818, size: 64, offset: 4544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !524, file: !323, line: 120, baseType: !844, size: 64, offset: 4608)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!341, !320, !847, !618}
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !524, file: !323, line: 121, baseType: !778, size: 64, offset: 4672)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !524, file: !323, line: 123, baseType: !850, size: 64, offset: 4736)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!341, !320, !316, !299}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !524, file: !323, line: 124, baseType: !854, size: 64, offset: 4800)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!341, !320, !739, !544, !299}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !524, file: !323, line: 125, baseType: !858, size: 64, offset: 4864)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!341, !471, !320}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !524, file: !323, line: 126, baseType: !541, size: 64, offset: 4928)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !524, file: !323, line: 127, baseType: !541, size: 64, offset: 4992)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !524, file: !323, line: 129, baseType: !864, size: 64, offset: 5056)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!341, !320, !694}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !524, file: !323, line: 130, baseType: !868, size: 64, offset: 5120)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!341, !320, !871, !871}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !873, file: !60, line: 653, baseType: !316, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !873, file: !60, line: 653, baseType: !544, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !524, file: !323, line: 131, baseType: !868, size: 64, offset: 5184)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !524, file: !323, line: 132, baseType: !879, size: 64, offset: 5248)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!341, !320, !315, !315, !315}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !524, file: !323, line: 133, baseType: !814, size: 64, offset: 5312)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !524, file: !323, line: 135, baseType: !884, size: 64, offset: 5376)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!341, !320, !434, !618}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !524, file: !323, line: 136, baseType: !884, size: 64, offset: 5440)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !524, file: !323, line: 137, baseType: !889, size: 64, offset: 5504)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!341, !320, !618}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !524, file: !323, line: 138, baseType: !527, size: 64, offset: 5568)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !524, file: !323, line: 139, baseType: !894, size: 64, offset: 5632)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!341, !320, !897, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !524, file: !323, line: 141, baseType: !778, size: 64, offset: 5696)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !524, file: !323, line: 142, baseType: !900, size: 64, offset: 5760)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!341, !320, !320, !434, !320}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !524, file: !323, line: 143, baseType: !904, size: 64, offset: 5824)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!341, !320, !320, !320}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !524, file: !323, line: 144, baseType: !778, size: 64, offset: 5888)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !524, file: !323, line: 145, baseType: !900, size: 64, offset: 5952)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !524, file: !323, line: 147, baseType: !904, size: 64, offset: 6016)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !524, file: !323, line: 148, baseType: !778, size: 64, offset: 6080)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !524, file: !323, line: 149, baseType: !900, size: 64, offset: 6144)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !524, file: !323, line: 150, baseType: !904, size: 64, offset: 6208)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !524, file: !323, line: 151, baseType: !914, size: 64, offset: 6272)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!341, !320, !492}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !524, file: !323, line: 153, baseType: !641, size: 64, offset: 6336)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !524, file: !323, line: 154, baseType: !641, size: 64, offset: 6400)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !524, file: !323, line: 155, baseType: !641, size: 64, offset: 6464)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !524, file: !323, line: 156, baseType: !641, size: 64, offset: 6528)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !524, file: !323, line: 157, baseType: !814, size: 64, offset: 6592)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !524, file: !323, line: 159, baseType: !923, size: 64, offset: 6656)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!341, !320, !316, !532}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !524, file: !323, line: 160, baseType: !641, size: 64, offset: 6720)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !524, file: !323, line: 161, baseType: !641, size: 64, offset: 6784)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !524, file: !323, line: 162, baseType: !641, size: 64, offset: 6848)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !524, file: !323, line: 163, baseType: !641, size: 64, offset: 6912)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !524, file: !323, line: 165, baseType: !904, size: 64, offset: 6976)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !524, file: !323, line: 166, baseType: !904, size: 64, offset: 7040)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !524, file: !323, line: 167, baseType: !704, size: 64, offset: 7104)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !524, file: !323, line: 168, baseType: !934, size: 64, offset: 7168)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!341, !320, !544, !316}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !524, file: !323, line: 169, baseType: !938, size: 64, offset: 7232)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!341, !320, !618, !315}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !524, file: !323, line: 171, baseType: !665, size: 64, offset: 7296)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !524, file: !323, line: 172, baseType: !641, size: 64, offset: 7360)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !524, file: !323, line: 173, baseType: !944, size: 64, offset: 7424)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!341, !320, !315, !728}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !524, file: !323, line: 174, baseType: !804, size: 64, offset: 7488)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !524, file: !323, line: 175, baseType: !804, size: 64, offset: 7552)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !524, file: !323, line: 177, baseType: !541, size: 64, offset: 7616)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !524, file: !323, line: 178, baseType: !591, size: 64, offset: 7680)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !524, file: !323, line: 179, baseType: !541, size: 64, offset: 7744)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !524, file: !323, line: 180, baseType: !548, size: 64, offset: 7808)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !524, file: !323, line: 181, baseType: !954, size: 64, offset: 7872)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!341, !320, !311, !594, !319}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !524, file: !323, line: 183, baseType: !864, size: 64, offset: 7936)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !524, file: !323, line: 184, baseType: !625, size: 64, offset: 8000)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !524, file: !323, line: 185, baseType: !960, size: 64, offset: 8064)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!341, !320, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !524, file: !323, line: 186, baseType: !965, size: 64, offset: 8128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!341, !320, !316, !530, !442}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !524, file: !323, line: 187, baseType: !684, size: 64, offset: 8192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !524, file: !323, line: 189, baseType: !970, size: 64, offset: 8256)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!341, !320, !316, !316, !315, !532}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !524, file: !323, line: 190, baseType: !778, size: 64, offset: 8320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !524, file: !323, line: 191, baseType: !900, size: 64, offset: 8384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !524, file: !323, line: 192, baseType: !904, size: 64, offset: 8448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !524, file: !323, line: 193, baseType: !977, size: 64, offset: 8512)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!341, !320, !736, !980}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !323, line: 660, size: 5312, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !982, file: !323, line: 661, baseType: !326, size: 4480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !982, file: !323, line: 661, baseType: !745, size: 32, offset: 4480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !982, file: !323, line: 662, baseType: !316, size: 32, offset: 4512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !982, file: !323, line: 662, baseType: !316, size: 32, offset: 4544)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !982, file: !323, line: 662, baseType: !316, size: 32, offset: 4576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !982, file: !323, line: 663, baseType: !316, size: 32, offset: 4608)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !982, file: !323, line: 664, baseType: !316, size: 32, offset: 4640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !982, file: !323, line: 665, baseType: !315, size: 64, offset: 4672)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !982, file: !323, line: 666, baseType: !315, size: 64, offset: 4736)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !982, file: !323, line: 667, baseType: !316, size: 32, offset: 4800)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !982, file: !323, line: 668, baseType: !786, size: 32, offset: 4832)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !982, file: !323, line: 670, baseType: !315, size: 64, offset: 4864)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !982, file: !323, line: 670, baseType: !315, size: 64, offset: 4928)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !982, file: !323, line: 671, baseType: !315, size: 64, offset: 4992)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !982, file: !323, line: 672, baseType: !315, size: 64, offset: 5056)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !982, file: !323, line: 673, baseType: !315, size: 64, offset: 5120)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !982, file: !323, line: 674, baseType: !316, size: 32, offset: 5184)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !982, file: !323, line: 675, baseType: !315, size: 64, offset: 5248)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !524, file: !323, line: 195, baseType: !1003, size: 64, offset: 8576)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!341, !980, !320, !320}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !524, file: !323, line: 196, baseType: !1003, size: 64, offset: 8640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !524, file: !323, line: 197, baseType: !778, size: 64, offset: 8704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !524, file: !323, line: 198, baseType: !900, size: 64, offset: 8768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !524, file: !323, line: 199, baseType: !904, size: 64, offset: 8832)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !524, file: !323, line: 201, baseType: !1011, size: 64, offset: 8896)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!341, !320, !316, !316}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !524, file: !323, line: 202, baseType: !679, size: 64, offset: 8960)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !524, file: !323, line: 203, baseType: !548, size: 64, offset: 9024)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !524, file: !323, line: 204, baseType: !733, size: 64, offset: 9088)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !524, file: !323, line: 205, baseType: !864, size: 64, offset: 9152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !524, file: !323, line: 206, baseType: !1019, size: 64, offset: 9216)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!341, !311, !320, !316, !594, !319}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !524, file: !323, line: 208, baseType: !1023, size: 64, offset: 9280)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!341, !316, !689}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !524, file: !323, line: 209, baseType: !904, size: 64, offset: 9344)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !524, file: !323, line: 210, baseType: !696, size: 64, offset: 9408)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !322, file: !323, line: 438, baseType: !1029, size: 64, offset: 13952)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !562, line: 60, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1031, file: !114, line: 241, baseType: !311, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1031, file: !114, line: 242, baseType: !399, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1031, file: !114, line: 243, baseType: !316, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1031, file: !114, line: 243, baseType: !316, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1031, file: !114, line: 244, baseType: !316, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1031, file: !114, line: 244, baseType: !316, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1031, file: !114, line: 245, baseType: !315, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1031, file: !114, line: 246, baseType: !492, size: 32, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1031, file: !114, line: 247, baseType: !316, size: 32, offset: 352)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1031, file: !114, line: 251, baseType: !316, size: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1031, file: !114, line: 252, baseType: !835, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1031, file: !114, line: 253, baseType: !492, size: 32, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1031, file: !114, line: 254, baseType: !316, size: 32, offset: 544)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1031, file: !114, line: 254, baseType: !316, size: 32, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1031, file: !114, line: 255, baseType: !316, size: 32, offset: 608)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !322, file: !323, line: 438, baseType: !1029, size: 64, offset: 14016)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !323, line: 439, baseType: !299, size: 64, offset: 14080)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !322, file: !323, line: 440, baseType: !1051, size: 32, offset: 14144)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !322, file: !323, line: 441, baseType: !492, size: 32, offset: 14176)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !322, file: !323, line: 442, baseType: !492, size: 32, offset: 14208)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !322, file: !323, line: 443, baseType: !1055, size: 448, offset: 14272)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 448, elements: !1057)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !361)
!1057 = !{!1058}
!1058 = !DISubrange(count: 7)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !322, file: !323, line: 444, baseType: !492, size: 32, offset: 14720)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !322, file: !323, line: 445, baseType: !492, size: 32, offset: 14752)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !322, file: !323, line: 446, baseType: !316, size: 32, offset: 14784)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !322, file: !323, line: 447, baseType: !419, size: 64, offset: 14848)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !322, file: !323, line: 448, baseType: !419, size: 64, offset: 14912)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !322, file: !323, line: 449, baseType: !601, size: 640, offset: 14976)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !322, file: !323, line: 450, baseType: !534, size: 32, offset: 15616)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !322, file: !323, line: 451, baseType: !1067, size: 2880, offset: 15680)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !323, line: 318, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !323, line: 319, size: 2880, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1089, !1090, !1095, !1100, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1115, !1116, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1148, !1149, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1172, !1173, !1174, !1178, !1179}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1068, file: !323, line: 320, baseType: !316, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1068, file: !323, line: 321, baseType: !316, size: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1068, file: !323, line: 322, baseType: !316, size: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1068, file: !323, line: 323, baseType: !316, size: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1068, file: !323, line: 324, baseType: !316, size: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1068, file: !323, line: 325, baseType: !316, size: 32, offset: 160)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1068, file: !323, line: 326, baseType: !1077, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !323, line: 293, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !323, line: 295, size: 448, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !323, line: 296, baseType: !1077, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1079, file: !323, line: 297, baseType: !442, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1079, file: !323, line: 297, baseType: !442, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1079, file: !323, line: 298, baseType: !315, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1079, file: !323, line: 298, baseType: !315, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1079, file: !323, line: 299, baseType: !316, size: 32, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1079, file: !323, line: 300, baseType: !316, size: 32, offset: 352)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1079, file: !323, line: 301, baseType: !316, size: 32, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1068, file: !323, line: 326, baseType: !1077, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1068, file: !323, line: 328, baseType: !1091, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!341, !320, !1094, !315}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1068, file: !323, line: 329, baseType: !1096, size: 64, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!341, !1094, !1099, !427, !427, !445, !315}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1068, file: !323, line: 330, baseType: !1101, size: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!341, !1094}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1068, file: !323, line: 331, baseType: !1101, size: 64, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1068, file: !323, line: 334, baseType: !311, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !323, line: 335, baseType: !399, size: 32, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1068, file: !323, line: 335, baseType: !399, size: 32, offset: 672)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1068, file: !323, line: 336, baseType: !399, size: 32, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1068, file: !323, line: 336, baseType: !399, size: 32, offset: 736)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1068, file: !323, line: 337, baseType: !1111, size: 64, offset: 768)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !312, line: 339, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !312, line: 339, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1068, file: !323, line: 338, baseType: !1111, size: 64, offset: 832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1068, file: !323, line: 339, baseType: !1117, size: 64, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !312, line: 341, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !312, line: 351, size: 192, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1119, file: !312, line: 354, baseType: !72, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1119, file: !312, line: 355, baseType: !72, size: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1119, file: !312, line: 356, baseType: !72, size: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1119, file: !312, line: 361, baseType: !72, size: 32, offset: 96)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1119, file: !312, line: 362, baseType: !295, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1068, file: !323, line: 340, baseType: !316, size: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1068, file: !323, line: 340, baseType: !316, size: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1068, file: !323, line: 341, baseType: !442, size: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1068, file: !323, line: 342, baseType: !315, size: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1068, file: !323, line: 343, baseType: !445, size: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1068, file: !323, line: 344, baseType: !427, size: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1068, file: !323, line: 345, baseType: !316, size: 32, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1068, file: !323, line: 346, baseType: !1099, size: 64, offset: 1344)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1068, file: !323, line: 347, baseType: !492, size: 32, offset: 1408)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1068, file: !323, line: 348, baseType: !316, size: 32, offset: 1440)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1068, file: !323, line: 351, baseType: !492, size: 32, offset: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1068, file: !323, line: 352, baseType: !492, size: 32, offset: 1504)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1068, file: !323, line: 353, baseType: !399, size: 32, offset: 1536)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1068, file: !323, line: 354, baseType: !399, size: 32, offset: 1568)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1068, file: !323, line: 355, baseType: !1099, size: 64, offset: 1600)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1068, file: !323, line: 356, baseType: !1099, size: 64, offset: 1664)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1068, file: !323, line: 357, baseType: !1143, size: 64, offset: 1728)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !323, line: 310, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 308, size: 32, elements: !1146)
!1146 = !{!1147}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1145, file: !323, line: 309, baseType: !316, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1068, file: !323, line: 357, baseType: !1143, size: 64, offset: 1792)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1068, file: !323, line: 358, baseType: !1150, size: 64, offset: 1856)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !323, line: 316, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 312, size: 128, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1152, file: !323, line: 313, baseType: !299, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1152, file: !323, line: 314, baseType: !316, size: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1152, file: !323, line: 315, baseType: !318, size: 8, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1068, file: !323, line: 359, baseType: !1150, size: 64, offset: 1920)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1068, file: !323, line: 360, baseType: !1150, size: 64, offset: 1984)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1068, file: !323, line: 361, baseType: !316, size: 32, offset: 2048)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1068, file: !323, line: 362, baseType: !399, size: 32, offset: 2080)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1068, file: !323, line: 363, baseType: !316, size: 32, offset: 2112)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1068, file: !323, line: 364, baseType: !1099, size: 64, offset: 2176)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1068, file: !323, line: 365, baseType: !1117, size: 64, offset: 2240)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1068, file: !323, line: 366, baseType: !399, size: 32, offset: 2304)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1068, file: !323, line: 367, baseType: !399, size: 32, offset: 2336)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1068, file: !323, line: 368, baseType: !1111, size: 64, offset: 2368)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1068, file: !323, line: 369, baseType: !1111, size: 64, offset: 2432)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1068, file: !323, line: 370, baseType: !1169, size: 64, offset: 2496)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1068, file: !323, line: 371, baseType: !1169, size: 64, offset: 2560)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1068, file: !323, line: 372, baseType: !1169, size: 64, offset: 2624)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1068, file: !323, line: 373, baseType: !1175, size: 64, offset: 2688)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !312, line: 331, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !312, line: 331, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1068, file: !323, line: 374, baseType: !295, size: 64, offset: 2752)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1068, file: !323, line: 375, baseType: !1180, size: 64, offset: 2816)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !322, file: !323, line: 451, baseType: !1067, size: 2880, offset: 18560)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !322, file: !323, line: 452, baseType: !1183, size: 64, offset: 21440)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !323, line: 681, size: 4864, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1185, file: !323, line: 682, baseType: !326, size: 4480)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1185, file: !323, line: 682, baseType: !745, size: 32, offset: 4480)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1185, file: !323, line: 683, baseType: !492, size: 32, offset: 4512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1185, file: !323, line: 684, baseType: !316, size: 32, offset: 4544)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1185, file: !323, line: 685, baseType: !897, size: 64, offset: 4608)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1185, file: !323, line: 686, baseType: !442, size: 64, offset: 4672)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1185, file: !323, line: 687, baseType: !1194, size: 64, offset: 4736)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!341, !1183, !544, !299}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1185, file: !323, line: 688, baseType: !299, size: 64, offset: 4800)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !322, file: !323, line: 453, baseType: !1183, size: 64, offset: 21504)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !322, file: !323, line: 454, baseType: !1183, size: 64, offset: 21568)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !322, file: !323, line: 455, baseType: !316, size: 32, offset: 21632)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !322, file: !323, line: 456, baseType: !492, size: 32, offset: 21664)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !322, file: !323, line: 457, baseType: !1203, size: 320, offset: 21696)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !323, line: 399, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 394, size: 320, elements: !1205)
!1205 = !{!1206, !1207, !1211, !1212}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1204, file: !323, line: 395, baseType: !316, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1204, file: !323, line: 396, baseType: !1208, size: 128, offset: 32)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 128, elements: !1209)
!1209 = !{!1210}
!1210 = !DISubrange(count: 4)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1204, file: !323, line: 397, baseType: !1208, size: 128, offset: 160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1204, file: !323, line: 398, baseType: !492, size: 32, offset: 288)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !322, file: !323, line: 458, baseType: !492, size: 32, offset: 22016)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !322, file: !323, line: 458, baseType: !492, size: 32, offset: 22048)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !322, file: !323, line: 458, baseType: !492, size: 32, offset: 22080)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !322, file: !323, line: 458, baseType: !492, size: 32, offset: 22112)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !322, file: !323, line: 459, baseType: !492, size: 32, offset: 22144)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !322, file: !323, line: 459, baseType: !492, size: 32, offset: 22176)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !322, file: !323, line: 459, baseType: !492, size: 32, offset: 22208)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "spd_set", scope: !322, file: !323, line: 459, baseType: !492, size: 32, offset: 22240)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_eternal", scope: !322, file: !323, line: 460, baseType: !492, size: 32, offset: 22272)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nooffprocentries", scope: !322, file: !323, line: 461, baseType: !492, size: 32, offset: 22304)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nooffproczerorows", scope: !322, file: !323, line: 461, baseType: !492, size: 32, offset: 22336)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !322, file: !323, line: 462, baseType: !492, size: 32, offset: 22368)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "submat_singleis", scope: !322, file: !323, line: 463, baseType: !492, size: 32, offset: 22400)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !322, file: !323, line: 464, baseType: !492, size: 32, offset: 22432)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "sortedfull", scope: !322, file: !323, line: 465, baseType: !492, size: 32, offset: 22464)
