; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/f90-custom/zda1f90.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/f90-custom/zda1f90.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_datatype_t = type opaque
%struct._p_DM = type opaque
%struct.DMDALocalInfo = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_DM* }
%struct._p_Vec = type opaque
%struct.F90Array1d = type { i8 }
%struct.ompi_datatype_t = type opaque
%struct.F90Array2d = type { i8 }
%struct.F90Array3d = type { i8 }
%struct.F90Array4d = type { i8 }

@ompi_mpi_double = external global %struct.ompi_predefined_datatype_t, align 1

; Function Attrs: nounwind uwtable
define void @dmdagetlocalinfof90_(%struct._p_DM** nocapture readonly %0, %struct.DMDALocalInfo* %1, i32* nocapture %2) local_unnamed_addr #0 !dbg !30 {
  call void @llvm.dbg.value(metadata %struct._p_DM** %0, metadata !73, metadata !DIExpression()), !dbg !76
  call void @llvm.dbg.value(metadata %struct.DMDALocalInfo* %1, metadata !74, metadata !DIExpression()), !dbg !76
  call void @llvm.dbg.value(metadata i32* %2, metadata !75, metadata !DIExpression()), !dbg !76
  %4 = load %struct._p_DM*, %struct._p_DM** %0, align 8, !dbg !77, !tbaa !78

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !17, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/f90-custom/zda1f90.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !12}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 14, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!17 = !{!18, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !19, line: 331, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !19, line: 331, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!24 = !{i32 7, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{i32 7, !"PIC Level", i32 2}
!28 = !{i32 7, !"uwtable", i32 1}
!29 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!30 = distinct !DISubprogram(name: "dmdagetlocalinfof90_", scope: !31, file: !31, line: 42, type: !32, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !72)
!31 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/da/f90-custom/zda1f90.c", directory: "/home/users/ndemeye/xSDK")
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !38, !70}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !4, line: 14, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !4, line: 14, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDALocalInfo", file: !13, line: 62, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 52, size: 768, elements: !41)
!41 = !{!42, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !65, !66, !67, !69}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !40, file: !13, line: 53, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !44, line: 102, baseType: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !40, file: !13, line: 53, baseType: !43, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sw", scope: !40, file: !13, line: 53, baseType: !43, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !40, file: !13, line: 54, baseType: !43, size: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !40, file: !13, line: 54, baseType: !43, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mz", scope: !40, file: !13, line: 54, baseType: !43, size: 32, offset: 160)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "xs", scope: !40, file: !13, line: 55, baseType: !43, size: 32, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ys", scope: !40, file: !13, line: 55, baseType: !43, size: 32, offset: 224)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "zs", scope: !40, file: !13, line: 55, baseType: !43, size: 32, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "xm", scope: !40, file: !13, line: 56, baseType: !43, size: 32, offset: 288)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ym", scope: !40, file: !13, line: 56, baseType: !43, size: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "zm", scope: !40, file: !13, line: 56, baseType: !43, size: 32, offset: 352)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "gxs", scope: !40, file: !13, line: 57, baseType: !43, size: 32, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gys", scope: !40, file: !13, line: 57, baseType: !43, size: 32, offset: 416)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "gzs", scope: !40, file: !13, line: 57, baseType: !43, size: 32, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "gxm", scope: !40, file: !13, line: 58, baseType: !43, size: 32, offset: 480)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gym", scope: !40, file: !13, line: 58, baseType: !43, size: 32, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "gzm", scope: !40, file: !13, line: 58, baseType: !43, size: 32, offset: 544)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !40, file: !13, line: 59, baseType: !64, size: 32, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !4, line: 42, baseType: !3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "by", scope: !40, file: !13, line: 59, baseType: !64, size: 32, offset: 608)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bz", scope: !40, file: !13, line: 59, baseType: !64, size: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !40, file: !13, line: 60, baseType: !68, size: 32, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDAStencilType", file: !13, line: 14, baseType: !12)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "da", scope: !40, file: !13, line: 61, baseType: !35, size: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !44, line: 14, baseType: !45)
!72 = !{!73, !74, !75}
!73 = !DILocalVariable(name: "da", arg: 1, scope: !30, file: !31, line: 42, type: !34)
!74 = !DILocalVariable(name: "info", arg: 2, scope: !30, file: !31, line: 42, type: !38)
!75 = !DILocalVariable(name: "ierr", arg: 3, scope: !30, file: !31, line: 42, type: !70)
!76 = !DILocation(line: 0, scope: !30)
!77 = !DILocation(line: 44, column: 28, scope: !30)
!78 = !{!79, !79, i64 0}
!79 = !{!"any pointer", !80, i64 0}
!80 = !{!"omnipotent char", !81, i64 0}
!81 = !{!"Simple C/C++ TBAA"}
!82 = !DILocation(line: 44, column: 11, scope: !30)
!83 = !DILocation(line: 44, column: 9, scope: !30)
!84 = !{!85, !85, i64 0}
!85 = !{!"int", !80, i64 0}
!86 = !DILocation(line: 45, column: 1, scope: !30)
!87 = !DISubprogram(name: "DMDAGetLocalInfo", scope: !88, file: !88, line: 183, type: !89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmda.h", directory: "/home/users/ndemeye/xSDK")
!89 = !DISubroutineType(types: !90)
!90 = !{!45, !36, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!92 = !{}
!93 = distinct !DISubprogram(name: "dmdavecgetarrayf901_", scope: !31, file: !31, line: 47, type: !94, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !108)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !34, !96, !101, !70}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !98, line: 21, baseType: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !98, line: 21, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "F90Array1d", file: !103, line: 17, baseType: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/f90impl.h", directory: "/home/users/ndemeye/xSDK")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 17, size: 8, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !104, file: !103, line: 17, baseType: !107, size: 8)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!109 = !DILocalVariable(name: "da", arg: 1, scope: !93, file: !31, line: 47, type: !34)
!110 = !DILocalVariable(name: "v", arg: 2, scope: !93, file: !31, line: 47, type: !96)
!111 = !DILocalVariable(name: "a", arg: 3, scope: !93, file: !31, line: 47, type: !101)
!112 = !DILocalVariable(name: "ierr", arg: 4, scope: !93, file: !31, line: 47, type: !70)
!113 = !DILocalVariable(name: "xs", scope: !93, file: !31, line: 49, type: !43)
!114 = !DILocalVariable(name: "ys", scope: !93, file: !31, line: 49, type: !43)
!115 = !DILocalVariable(name: "zs", scope: !93, file: !31, line: 49, type: !43)
!116 = !DILocalVariable(name: "xm", scope: !93, file: !31, line: 49, type: !43)
!117 = !DILocalVariable(name: "ym", scope: !93, file: !31, line: 49, type: !43)
!118 = !DILocalVariable(name: "zm", scope: !93, file: !31, line: 49, type: !43)
!119 = !DILocalVariable(name: "gxs", scope: !93, file: !31, line: 49, type: !43)
!120 = !DILocalVariable(name: "gys", scope: !93, file: !31, line: 49, type: !43)
