; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dense/mpi/mmdense.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/dense/mpi/mmdense.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 35, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!307 = !{!308, !339, !420, !336, !360, !495, !400, !1183, !1313, !410, !72, !5, !1316, !1342, !385}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIDense", file: !310, line: 48, baseType: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/dense/mpi/mpidense.h", directory: "/home/users/ndemeye/xSDK")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 26, size: 960, elements: !312)
!312 = !{!313, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1307, !1308, !1309, !1310, !1311, !1312}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !311, file: !310, line: 27, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !317, line: 436, size: 23424, elements: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!318 = !{!319, !529, !1036, !1056, !1057, !1058, !1060, !1061, !1062, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1189, !1190, !1206, !1207, !1208, !1209, !1210, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1245, !1265, !1266, !1268, !1269, !1270, !1271, !1272, !1273, !1291, !1292}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !316, file: !317, line: 437, baseType: !320, size: 4480)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !321, line: 122, baseType: !322)
!321 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !321, line: 73, size: 4480, elements: !323)
!323 = !{!324, !326, !381, !382, !384, !387, !388, !389, !390, !398, !399, !401, !405, !409, !411, !412, !413, !414, !415, !416, !417, !418, !419, !421, !423, !424, !425, !427, !428, !430, !432, !433, !434, !435, !436, !439, !441, !442, !443, !444, !445, !448, !450, !451, !452, !462, !464, !465, !469, !470, !519, !524, !526, !527, !528}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !322, file: !321, line: 74, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !322, file: !321, line: 75, baseType: !327, size: 448, offset: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 448, elements: !379)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !321, line: 53, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 45, size: 448, elements: !330)
!330 = !{!331, !343, !351, !356, !363, !367, !374}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !329, file: !321, line: 46, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !336, !338}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !340, line: 330, baseType: !341)
!340 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !340, line: 330, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !321, line: 47, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!335, !336, !347}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !348, line: 16, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !348, line: 16, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !321, line: 48, baseType: !352, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!335, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !329, file: !321, line: 49, baseType: !357, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!335, !336, !360, !336}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !329, file: !321, line: 50, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!335, !336, !360, !355}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !329, file: !321, line: 51, baseType: !368, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!335, !336, !360, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !329, file: !321, line: 52, baseType: !375, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!335, !336, !360, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!379 = !{!380}
!380 = !DISubrange(count: 1)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !322, file: !321, line: 76, baseType: !339, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !321, line: 77, baseType: !383, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !322, file: !321, line: 78, baseType: !385, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !386)
!386 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !322, file: !321, line: 78, baseType: !385, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !322, file: !321, line: 78, baseType: !385, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !322, file: !321, line: 78, baseType: !385, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !322, file: !321, line: 79, baseType: !391, size: 64, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !394, line: 27, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !396, line: 43, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!397 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !322, file: !321, line: 80, baseType: !383, size: 32, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !322, file: !321, line: 81, baseType: !400, size: 32, offset: 992)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !322, file: !321, line: 82, baseType: !402, size: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !322, file: !321, line: 83, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !322, file: !321, line: 84, baseType: !410, size: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !322, file: !321, line: 85, baseType: !410, size: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !322, file: !321, line: 86, baseType: !410, size: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !322, file: !321, line: 87, baseType: !410, size: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !321, line: 88, baseType: !336, size: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !322, file: !321, line: 89, baseType: !391, size: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !321, line: 90, baseType: !410, size: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !322, file: !321, line: 91, baseType: !410, size: 64, offset: 1600)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !322, file: !321, line: 92, baseType: !383, size: 32, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !322, file: !321, line: 93, baseType: !420, size: 64, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !322, file: !321, line: 94, baseType: !422, size: 64, offset: 1792)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !392)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !322, file: !321, line: 95, baseType: !383, size: 32, offset: 1856)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !322, file: !321, line: 95, baseType: !383, size: 32, offset: 1888)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !322, file: !321, line: 96, baseType: !426, size: 64, offset: 1920)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !322, file: !321, line: 96, baseType: !426, size: 64, offset: 1984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !322, file: !321, line: 97, baseType: !429, size: 64, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !322, file: !321, line: 97, baseType: !431, size: 64, offset: 2112)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !322, file: !321, line: 98, baseType: !383, size: 32, offset: 2176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !322, file: !321, line: 98, baseType: !383, size: 32, offset: 2208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !322, file: !321, line: 99, baseType: !426, size: 64, offset: 2240)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !322, file: !321, line: 99, baseType: !426, size: 64, offset: 2304)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !322, file: !321, line: 100, baseType: !437, size: 64, offset: 2368)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !386)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !322, file: !321, line: 100, baseType: !440, size: 64, offset: 2432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !322, file: !321, line: 101, baseType: !383, size: 32, offset: 2496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !322, file: !321, line: 101, baseType: !383, size: 32, offset: 2528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !322, file: !321, line: 102, baseType: !426, size: 64, offset: 2560)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !322, file: !321, line: 102, baseType: !426, size: 64, offset: 2624)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !322, file: !321, line: 103, baseType: !446, size: 64, offset: 2688)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !438)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !322, file: !321, line: 103, baseType: !449, size: 64, offset: 2752)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !322, file: !321, line: 104, baseType: !378, size: 64, offset: 2816)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !322, file: !321, line: 105, baseType: !383, size: 32, offset: 2880)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !322, file: !321, line: 106, baseType: !453, size: 128, offset: 2944)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !460)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !321, line: 64, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 61, size: 128, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !456, file: !321, line: 62, baseType: !371, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !456, file: !321, line: 63, baseType: !420, size: 64, offset: 64)
!460 = !{!461}
!461 = !DISubrange(count: 2)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !322, file: !321, line: 107, baseType: !463, size: 64, offset: 3072)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !460)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !322, file: !321, line: 108, baseType: !420, size: 64, offset: 3136)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !322, file: !321, line: 109, baseType: !466, size: 64, offset: 3200)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!335, !420}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !322, file: !321, line: 111, baseType: !383, size: 32, offset: 3264)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !322, file: !321, line: 112, baseType: !471, size: 320, offset: 3328)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 320, elements: !517)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!335, !475, !336, !420}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !478)
!478 = !{!479, !480, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !477, file: !10, line: 100, baseType: !383, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !10, line: 101, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !492, !493, !494, !498, !500, !502, !503, !504}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !483, file: !10, line: 84, baseType: !410, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !483, file: !10, line: 85, baseType: !410, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !10, line: 86, baseType: !420, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !483, file: !10, line: 87, baseType: !402, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !483, file: !10, line: 88, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !483, file: !10, line: 89, baseType: !362, size: 8, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !483, file: !10, line: 90, baseType: !410, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !483, file: !10, line: 91, baseType: !495, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !496, line: 46, baseType: !497)
!496 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!497 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !483, file: !10, line: 92, baseType: !499, size: 32, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !10, line: 93, baseType: !501, size: 32, offset: 544)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 94, baseType: !481, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !483, file: !10, line: 95, baseType: !410, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !483, file: !10, line: 96, baseType: !420, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !477, file: !10, line: 102, baseType: !410, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !477, file: !10, line: 102, baseType: !410, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !477, file: !10, line: 103, baseType: !410, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !477, file: !10, line: 104, baseType: !339, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !477, file: !10, line: 105, baseType: !499, size: 32, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !477, file: !10, line: 106, baseType: !336, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !477, file: !10, line: 107, baseType: !514, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!517 = !{!518}
!518 = !DISubrange(count: 5)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !322, file: !321, line: 113, baseType: !520, size: 320, offset: 3648)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !517)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!335, !336, !420}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !322, file: !321, line: 114, baseType: !525, size: 320, offset: 3968)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 320, elements: !517)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !322, file: !321, line: 115, baseType: !499, size: 32, offset: 4288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !322, file: !321, line: 120, baseType: !514, size: 64, offset: 4352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !322, file: !321, line: 121, baseType: !499, size: 32, offset: 4416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !317, line: 437, baseType: !530, size: 9472, offset: 4480)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 9472, elements: !379)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !317, line: 32, size: 9472, elements: !532)
!532 = !{!533, !542, !546, !547, !554, !558, !559, !560, !561, !562, !563, !564, !588, !592, !597, !603, !622, !627, !631, !632, !637, !642, !643, !648, !652, !656, !660, !664, !668, !669, !670, !671, !672, !676, !677, !682, !683, !684, !685, !686, !691, !698, !703, !707, !711, !715, !719, !720, !724, !725, !732, !737, !738, !739, !740, !802, !810, !811, !815, !816, !820, !821, !825, !830, !831, !835, !839, !846, !847, !848, !849, !850, !851, !856, !857, !861, !865, !869, !870, !871, !875, !885, !886, !890, !891, !895, !896, !900, !901, !906, !907, !911, !915, !916, !917, !918, !919, !920, !921, !925, !926, !927, !928, !929, !930, !934, !935, !936, !937, !938, !939, !940, !941, !945, !949, !950, !951, !955, !956, !957, !958, !959, !960, !961, !965, !966, !967, !972, !976, !977, !981, !982, !983, !984, !1010, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1030, !1034, !1035}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !531, file: !317, line: 34, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!335, !314, !383, !537, !383, !537, !539, !541}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !531, file: !317, line: 35, baseType: !543, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!335, !314, !383, !429, !431, !449}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !531, file: !317, line: 36, baseType: !543, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !531, file: !317, line: 37, baseType: !548, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!335, !314, !551, !551}
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !531, file: !317, line: 38, baseType: !555, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!335, !314, !551, !551, !551}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !531, file: !317, line: 40, baseType: !548, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !531, file: !317, line: 41, baseType: !555, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !531, file: !317, line: 42, baseType: !548, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !531, file: !317, line: 43, baseType: !555, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !531, file: !317, line: 44, baseType: !548, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !531, file: !317, line: 46, baseType: !555, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !531, file: !317, line: 47, baseType: !565, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!335, !314, !568, !568, !572}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !569, line: 11, baseType: !570)
!569 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !569, line: 11, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !575, file: !36, line: 1227, baseType: !438, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !575, file: !36, line: 1228, baseType: !438, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !575, file: !36, line: 1229, baseType: !438, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !575, file: !36, line: 1230, baseType: !438, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !575, file: !36, line: 1231, baseType: !438, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !575, file: !36, line: 1232, baseType: !438, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !575, file: !36, line: 1233, baseType: !438, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !575, file: !36, line: 1234, baseType: !438, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !575, file: !36, line: 1236, baseType: !438, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !575, file: !36, line: 1237, baseType: !438, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !575, file: !36, line: 1238, baseType: !438, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !531, file: !317, line: 48, baseType: !589, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!335, !314, !568, !572}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !531, file: !317, line: 49, baseType: !593, size: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!335, !314, !551, !438, !596, !438, !383, !383, !551}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !531, file: !317, line: 50, baseType: !598, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!335, !314, !601, !602}
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !531, file: !317, line: 52, baseType: !604, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!335, !314, !607, !608}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !610, file: !36, line: 593, baseType: !385, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !610, file: !36, line: 594, baseType: !385, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !610, file: !36, line: 594, baseType: !385, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !610, file: !36, line: 594, baseType: !385, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !610, file: !36, line: 595, baseType: !385, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !610, file: !36, line: 596, baseType: !385, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !610, file: !36, line: 597, baseType: !385, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !610, file: !36, line: 598, baseType: !385, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !610, file: !36, line: 598, baseType: !385, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !610, file: !36, line: 599, baseType: !385, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !531, file: !317, line: 53, baseType: !623, size: 64, offset: 1024)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!335, !314, !314, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !531, file: !317, line: 54, baseType: !628, size: 64, offset: 1088)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!335, !314, !551}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !531, file: !317, line: 55, baseType: !548, size: 64, offset: 1152)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !531, file: !317, line: 56, baseType: !633, size: 64, offset: 1216)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!335, !314, !636, !437}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !531, file: !317, line: 58, baseType: !638, size: 64, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!335, !314, !641}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !531, file: !317, line: 59, baseType: !638, size: 64, offset: 1344)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !531, file: !317, line: 60, baseType: !644, size: 64, offset: 1408)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!335, !314, !647, !499}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !531, file: !317, line: 61, baseType: !649, size: 64, offset: 1472)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!335, !314}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !531, file: !317, line: 63, baseType: !653, size: 64, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!335, !314, !383, !537, !447, !551, !551}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !531, file: !317, line: 64, baseType: !657, size: 64, offset: 1600)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!335, !314, !314, !568, !568, !572}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !531, file: !317, line: 65, baseType: !661, size: 64, offset: 1664)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!335, !314, !314, !572}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !531, file: !317, line: 66, baseType: !665, size: 64, offset: 1728)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!335, !314, !314, !568, !572}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !531, file: !317, line: 67, baseType: !661, size: 64, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !531, file: !317, line: 69, baseType: !649, size: 64, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !531, file: !317, line: 70, baseType: !657, size: 64, offset: 1920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !531, file: !317, line: 71, baseType: !665, size: 64, offset: 1984)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !531, file: !317, line: 72, baseType: !673, size: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!335, !314, !602}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !531, file: !317, line: 73, baseType: !649, size: 64, offset: 2112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !531, file: !317, line: 75, baseType: !678, size: 64, offset: 2176)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!335, !314, !681, !602}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !531, file: !317, line: 76, baseType: !548, size: 64, offset: 2240)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !531, file: !317, line: 77, baseType: !548, size: 64, offset: 2304)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !531, file: !317, line: 78, baseType: !565, size: 64, offset: 2368)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !531, file: !317, line: 79, baseType: !589, size: 64, offset: 2432)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !531, file: !317, line: 81, baseType: !687, size: 64, offset: 2496)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!335, !314, !447, !314, !690}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !531, file: !317, line: 82, baseType: !692, size: 64, offset: 2560)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!335, !314, !383, !695, !695, !601, !697}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !531, file: !317, line: 83, baseType: !699, size: 64, offset: 2624)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!335, !314, !383, !702, !383}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !531, file: !317, line: 84, baseType: !704, size: 64, offset: 2688)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!335, !314, !383, !537, !383, !537, !446}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !531, file: !317, line: 85, baseType: !708, size: 64, offset: 2752)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!335, !314, !314, !690}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !531, file: !317, line: 87, baseType: !712, size: 64, offset: 2816)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!335, !314, !551, !429}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !531, file: !317, line: 88, baseType: !716, size: 64, offset: 2880)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!335, !314, !447}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !531, file: !317, line: 89, baseType: !716, size: 64, offset: 2944)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !531, file: !317, line: 90, baseType: !721, size: 64, offset: 3008)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!335, !314, !551, !541}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !531, file: !317, line: 91, baseType: !653, size: 64, offset: 3072)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !531, file: !317, line: 93, baseType: !726, size: 64, offset: 3136)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!335, !314, !729}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !531, file: !317, line: 94, baseType: !733, size: 64, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!335, !314, !383, !499, !499, !429, !736, !736, !626}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !531, file: !317, line: 95, baseType: !733, size: 64, offset: 3264)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !531, file: !317, line: 96, baseType: !733, size: 64, offset: 3328)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !531, file: !317, line: 97, baseType: !733, size: 64, offset: 3392)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !531, file: !317, line: 99, baseType: !741, size: 64, offset: 3456)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!335, !314, !744, !747}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !569, line: 51, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !569, line: 51, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !317, line: 609, size: 6208, elements: !750)
!750 = !{!751, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !771, !778, !779, !780, !781, !782, !783, !784, !785, !789, !790, !791, !792, !793, !795, !796, !797, !798, !799, !800, !801}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !749, file: !317, line: 610, baseType: !320, size: 4480)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !749, file: !317, line: 610, baseType: !753, size: 32, offset: 4480)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !379)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !749, file: !317, line: 611, baseType: !383, size: 32, offset: 4512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !749, file: !317, line: 611, baseType: !383, size: 32, offset: 4544)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !749, file: !317, line: 611, baseType: !383, size: 32, offset: 4576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !749, file: !317, line: 612, baseType: !383, size: 32, offset: 4608)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !749, file: !317, line: 613, baseType: !383, size: 32, offset: 4640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !749, file: !317, line: 614, baseType: !429, size: 64, offset: 4672)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !749, file: !317, line: 615, baseType: !431, size: 64, offset: 4736)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !749, file: !317, line: 616, baseType: !702, size: 64, offset: 4800)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !749, file: !317, line: 617, baseType: !429, size: 64, offset: 4864)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !749, file: !317, line: 618, baseType: !764, size: 64, offset: 4928)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !317, line: 602, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 598, size: 128, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !766, file: !317, line: 599, baseType: !383, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !766, file: !317, line: 600, baseType: !383, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !766, file: !317, line: 601, baseType: !446, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !749, file: !317, line: 619, baseType: !772, size: 64, offset: 4992)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !317, line: 607, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 604, size: 128, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !774, file: !317, line: 605, baseType: !383, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !774, file: !317, line: 606, baseType: !446, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !749, file: !317, line: 620, baseType: !446, size: 64, offset: 5056)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !749, file: !317, line: 621, baseType: !438, size: 64, offset: 5120)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !749, file: !317, line: 622, baseType: !438, size: 64, offset: 5184)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !749, file: !317, line: 623, baseType: !551, size: 64, offset: 5248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !749, file: !317, line: 623, baseType: !551, size: 64, offset: 5312)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !749, file: !317, line: 623, baseType: !551, size: 64, offset: 5376)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !749, file: !317, line: 624, baseType: !499, size: 32, offset: 5440)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !749, file: !317, line: 625, baseType: !786, size: 64, offset: 5504)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!335}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !749, file: !317, line: 626, baseType: !420, size: 64, offset: 5568)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !749, file: !317, line: 627, baseType: !551, size: 64, offset: 5632)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !749, file: !317, line: 628, baseType: !383, size: 32, offset: 5696)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !749, file: !317, line: 629, baseType: !360, size: 64, offset: 5760)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !749, file: !317, line: 630, baseType: !794, size: 32, offset: 5824)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !749, file: !317, line: 631, baseType: !383, size: 32, offset: 5856)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !749, file: !317, line: 631, baseType: !383, size: 32, offset: 5888)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !749, file: !317, line: 632, baseType: !499, size: 32, offset: 5920)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !749, file: !317, line: 633, baseType: !499, size: 32, offset: 5952)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !749, file: !317, line: 634, baseType: !371, size: 64, offset: 6016)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !749, file: !317, line: 634, baseType: !420, size: 64, offset: 6080)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !749, file: !317, line: 635, baseType: !391, size: 64, offset: 6144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !531, file: !317, line: 100, baseType: !803, size: 64, offset: 3520)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!335, !314, !383, !383, !806, !809}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !808)
!808 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !531, file: !317, line: 101, baseType: !649, size: 64, offset: 3584)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !531, file: !317, line: 102, baseType: !812, size: 64, offset: 3648)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!335, !314, !568, !568, !602}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !531, file: !317, line: 103, baseType: !534, size: 64, offset: 3712)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !531, file: !317, line: 105, baseType: !817, size: 64, offset: 3776)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!335, !314, !568, !568, !601, !602}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !531, file: !317, line: 106, baseType: !649, size: 64, offset: 3840)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !531, file: !317, line: 107, baseType: !822, size: 64, offset: 3904)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!335, !314, !347}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !531, file: !317, line: 108, baseType: !826, size: 64, offset: 3968)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!335, !314, !829, !601, !602}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !360)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !531, file: !317, line: 109, baseType: !786, size: 64, offset: 4032)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !531, file: !317, line: 111, baseType: !832, size: 64, offset: 4096)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!335, !314, !314, !314, !438, !314}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !531, file: !317, line: 112, baseType: !836, size: 64, offset: 4160)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!335, !314, !314, !314, !314}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !531, file: !317, line: 113, baseType: !840, size: 64, offset: 4224)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!335, !314, !843, !843}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !569, line: 30, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !569, line: 30, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !531, file: !317, line: 114, baseType: !534, size: 64, offset: 4288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !531, file: !317, line: 115, baseType: !653, size: 64, offset: 4352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !531, file: !317, line: 117, baseType: !712, size: 64, offset: 4416)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !531, file: !317, line: 118, baseType: !712, size: 64, offset: 4480)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !531, file: !317, line: 119, baseType: !826, size: 64, offset: 4544)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !531, file: !317, line: 120, baseType: !852, size: 64, offset: 4608)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!335, !314, !855, !626}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !531, file: !317, line: 121, baseType: !786, size: 64, offset: 4672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !531, file: !317, line: 123, baseType: !858, size: 64, offset: 4736)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!335, !314, !383, !420}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !531, file: !317, line: 124, baseType: !862, size: 64, offset: 4800)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!335, !314, !747, !551, !420}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !531, file: !317, line: 125, baseType: !866, size: 64, offset: 4864)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!335, !475, !314}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !531, file: !317, line: 126, baseType: !548, size: 64, offset: 4928)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !531, file: !317, line: 127, baseType: !548, size: 64, offset: 4992)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !531, file: !317, line: 129, baseType: !872, size: 64, offset: 5056)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!335, !314, !702}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !531, file: !317, line: 130, baseType: !876, size: 64, offset: 5120)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!335, !314, !879, !879}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !881, file: !60, line: 653, baseType: !383, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !881, file: !60, line: 653, baseType: !551, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !531, file: !317, line: 131, baseType: !876, size: 64, offset: 5184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !531, file: !317, line: 132, baseType: !887, size: 64, offset: 5248)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!335, !314, !429, !429, !429}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !531, file: !317, line: 133, baseType: !822, size: 64, offset: 5312)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !531, file: !317, line: 135, baseType: !892, size: 64, offset: 5376)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!335, !314, !438, !626}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !531, file: !317, line: 136, baseType: !892, size: 64, offset: 5440)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !531, file: !317, line: 137, baseType: !897, size: 64, offset: 5504)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!335, !314, !626}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !531, file: !317, line: 138, baseType: !534, size: 64, offset: 5568)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !531, file: !317, line: 139, baseType: !902, size: 64, offset: 5632)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!335, !314, !905, !905}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !531, file: !317, line: 141, baseType: !786, size: 64, offset: 5696)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !531, file: !317, line: 142, baseType: !908, size: 64, offset: 5760)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!335, !314, !314, !438, !314}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !531, file: !317, line: 143, baseType: !912, size: 64, offset: 5824)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!335, !314, !314, !314}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !531, file: !317, line: 144, baseType: !786, size: 64, offset: 5888)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !531, file: !317, line: 145, baseType: !908, size: 64, offset: 5952)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !531, file: !317, line: 147, baseType: !912, size: 64, offset: 6016)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !531, file: !317, line: 148, baseType: !786, size: 64, offset: 6080)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !531, file: !317, line: 149, baseType: !908, size: 64, offset: 6144)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !531, file: !317, line: 150, baseType: !912, size: 64, offset: 6208)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !531, file: !317, line: 151, baseType: !922, size: 64, offset: 6272)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!335, !314, !499}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !531, file: !317, line: 153, baseType: !649, size: 64, offset: 6336)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !531, file: !317, line: 154, baseType: !649, size: 64, offset: 6400)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !531, file: !317, line: 155, baseType: !649, size: 64, offset: 6464)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !531, file: !317, line: 156, baseType: !649, size: 64, offset: 6528)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !531, file: !317, line: 157, baseType: !822, size: 64, offset: 6592)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !531, file: !317, line: 159, baseType: !931, size: 64, offset: 6656)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!335, !314, !383, !539}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !531, file: !317, line: 160, baseType: !649, size: 64, offset: 6720)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !531, file: !317, line: 161, baseType: !649, size: 64, offset: 6784)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !531, file: !317, line: 162, baseType: !649, size: 64, offset: 6848)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !531, file: !317, line: 163, baseType: !649, size: 64, offset: 6912)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !531, file: !317, line: 165, baseType: !912, size: 64, offset: 6976)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !531, file: !317, line: 166, baseType: !912, size: 64, offset: 7040)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !531, file: !317, line: 167, baseType: !712, size: 64, offset: 7104)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !531, file: !317, line: 168, baseType: !942, size: 64, offset: 7168)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!335, !314, !551, !383}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !531, file: !317, line: 169, baseType: !946, size: 64, offset: 7232)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!335, !314, !626, !429}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !531, file: !317, line: 171, baseType: !673, size: 64, offset: 7296)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !531, file: !317, line: 172, baseType: !649, size: 64, offset: 7360)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !531, file: !317, line: 173, baseType: !952, size: 64, offset: 7424)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!335, !314, !429, !736}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !531, file: !317, line: 174, baseType: !812, size: 64, offset: 7488)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !531, file: !317, line: 175, baseType: !812, size: 64, offset: 7552)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !531, file: !317, line: 177, baseType: !548, size: 64, offset: 7616)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !531, file: !317, line: 178, baseType: !598, size: 64, offset: 7680)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !531, file: !317, line: 179, baseType: !548, size: 64, offset: 7744)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !531, file: !317, line: 180, baseType: !555, size: 64, offset: 7808)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !531, file: !317, line: 181, baseType: !962, size: 64, offset: 7872)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!335, !314, !339, !601, !602}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !531, file: !317, line: 183, baseType: !872, size: 64, offset: 7936)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !531, file: !317, line: 184, baseType: !633, size: 64, offset: 8000)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !531, file: !317, line: 185, baseType: !968, size: 64, offset: 8064)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!335, !314, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !531, file: !317, line: 186, baseType: !973, size: 64, offset: 8128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!335, !314, !383, !537, !446}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !531, file: !317, line: 187, baseType: !692, size: 64, offset: 8192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !531, file: !317, line: 189, baseType: !978, size: 64, offset: 8256)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!335, !314, !383, !383, !429, !539}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !531, file: !317, line: 190, baseType: !786, size: 64, offset: 8320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !531, file: !317, line: 191, baseType: !908, size: 64, offset: 8384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !531, file: !317, line: 192, baseType: !912, size: 64, offset: 8448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !531, file: !317, line: 193, baseType: !985, size: 64, offset: 8512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!335, !314, !744, !988}
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !317, line: 660, size: 5312, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !990, file: !317, line: 661, baseType: !320, size: 4480)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !990, file: !317, line: 661, baseType: !753, size: 32, offset: 4480)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !990, file: !317, line: 662, baseType: !383, size: 32, offset: 4512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !990, file: !317, line: 662, baseType: !383, size: 32, offset: 4544)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !990, file: !317, line: 662, baseType: !383, size: 32, offset: 4576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !990, file: !317, line: 663, baseType: !383, size: 32, offset: 4608)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !990, file: !317, line: 664, baseType: !383, size: 32, offset: 4640)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !990, file: !317, line: 665, baseType: !429, size: 64, offset: 4672)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !990, file: !317, line: 666, baseType: !429, size: 64, offset: 4736)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !990, file: !317, line: 667, baseType: !383, size: 32, offset: 4800)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !990, file: !317, line: 668, baseType: !794, size: 32, offset: 4832)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !990, file: !317, line: 670, baseType: !429, size: 64, offset: 4864)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !990, file: !317, line: 670, baseType: !429, size: 64, offset: 4928)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !990, file: !317, line: 671, baseType: !429, size: 64, offset: 4992)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !990, file: !317, line: 672, baseType: !429, size: 64, offset: 5056)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !990, file: !317, line: 673, baseType: !429, size: 64, offset: 5120)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !990, file: !317, line: 674, baseType: !383, size: 32, offset: 5184)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !990, file: !317, line: 675, baseType: !429, size: 64, offset: 5248)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !531, file: !317, line: 195, baseType: !1011, size: 64, offset: 8576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!335, !988, !314, !314}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !531, file: !317, line: 196, baseType: !1011, size: 64, offset: 8640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !531, file: !317, line: 197, baseType: !786, size: 64, offset: 8704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !531, file: !317, line: 198, baseType: !908, size: 64, offset: 8768)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !531, file: !317, line: 199, baseType: !912, size: 64, offset: 8832)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !531, file: !317, line: 201, baseType: !1019, size: 64, offset: 8896)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!335, !314, !383, !383}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !531, file: !317, line: 202, baseType: !687, size: 64, offset: 8960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !531, file: !317, line: 203, baseType: !555, size: 64, offset: 9024)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !531, file: !317, line: 204, baseType: !741, size: 64, offset: 9088)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !531, file: !317, line: 205, baseType: !872, size: 64, offset: 9152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !531, file: !317, line: 206, baseType: !1027, size: 64, offset: 9216)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!335, !339, !314, !383, !601, !602}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !531, file: !317, line: 208, baseType: !1031, size: 64, offset: 9280)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!335, !383, !697}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !531, file: !317, line: 209, baseType: !912, size: 64, offset: 9344)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !531, file: !317, line: 210, baseType: !704, size: 64, offset: 9408)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !316, file: !317, line: 438, baseType: !1037, size: 64, offset: 13952)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !569, line: 60, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1039, file: !114, line: 241, baseType: !339, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !114, line: 242, baseType: !400, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1039, file: !114, line: 243, baseType: !383, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1039, file: !114, line: 243, baseType: !383, size: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1039, file: !114, line: 244, baseType: !383, size: 32, offset: 160)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1039, file: !114, line: 244, baseType: !383, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !114, line: 245, baseType: !429, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1039, file: !114, line: 246, baseType: !499, size: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1039, file: !114, line: 247, baseType: !383, size: 32, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1039, file: !114, line: 251, baseType: !383, size: 32, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1039, file: !114, line: 252, baseType: !843, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1039, file: !114, line: 253, baseType: !499, size: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1039, file: !114, line: 254, baseType: !383, size: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1039, file: !114, line: 254, baseType: !383, size: 32, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1039, file: !114, line: 255, baseType: !383, size: 32, offset: 608)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !316, file: !317, line: 438, baseType: !1037, size: 64, offset: 14016)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !317, line: 439, baseType: !420, size: 64, offset: 14080)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !316, file: !317, line: 440, baseType: !1059, size: 32, offset: 14144)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !316, file: !317, line: 441, baseType: !499, size: 32, offset: 14176)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !316, file: !317, line: 442, baseType: !499, size: 32, offset: 14208)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !316, file: !317, line: 443, baseType: !1063, size: 448, offset: 14272)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 448, elements: !1065)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !360)
!1065 = !{!1066}
!1066 = !DISubrange(count: 7)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !316, file: !317, line: 444, baseType: !499, size: 32, offset: 14720)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !316, file: !317, line: 445, baseType: !499, size: 32, offset: 14752)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !316, file: !317, line: 446, baseType: !383, size: 32, offset: 14784)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !316, file: !317, line: 447, baseType: !422, size: 64, offset: 14848)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !316, file: !317, line: 448, baseType: !422, size: 64, offset: 14912)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !316, file: !317, line: 449, baseType: !609, size: 640, offset: 14976)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !316, file: !317, line: 450, baseType: !541, size: 32, offset: 15616)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !316, file: !317, line: 451, baseType: !1075, size: 2880, offset: 15680)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !317, line: 318, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !317, line: 319, size: 2880, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1097, !1098, !1103, !1108, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1123, !1124, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1156, !1157, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1186, !1187}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1076, file: !317, line: 320, baseType: !383, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1076, file: !317, line: 321, baseType: !383, size: 32, offset: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1076, file: !317, line: 322, baseType: !383, size: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1076, file: !317, line: 323, baseType: !383, size: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1076, file: !317, line: 324, baseType: !383, size: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1076, file: !317, line: 325, baseType: !383, size: 32, offset: 160)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1076, file: !317, line: 326, baseType: !1085, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !317, line: 293, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !317, line: 295, size: 448, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !317, line: 296, baseType: !1085, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1087, file: !317, line: 297, baseType: !446, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1087, file: !317, line: 297, baseType: !446, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1087, file: !317, line: 298, baseType: !429, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1087, file: !317, line: 298, baseType: !429, size: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1087, file: !317, line: 299, baseType: !383, size: 32, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1087, file: !317, line: 300, baseType: !383, size: 32, offset: 352)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1087, file: !317, line: 301, baseType: !383, size: 32, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1076, file: !317, line: 326, baseType: !1085, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1076, file: !317, line: 328, baseType: !1099, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!335, !314, !1102, !429}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1076, file: !317, line: 329, baseType: !1104, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!335, !1102, !1107, !431, !431, !449, !429}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1076, file: !317, line: 330, baseType: !1109, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!335, !1102}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1076, file: !317, line: 331, baseType: !1109, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1076, file: !317, line: 334, baseType: !339, size: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !317, line: 335, baseType: !400, size: 32, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1076, file: !317, line: 335, baseType: !400, size: 32, offset: 672)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1076, file: !317, line: 336, baseType: !400, size: 32, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1076, file: !317, line: 336, baseType: !400, size: 32, offset: 736)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1076, file: !317, line: 337, baseType: !1119, size: 64, offset: 768)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !340, line: 339, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !340, line: 339, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1076, file: !317, line: 338, baseType: !1119, size: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1076, file: !317, line: 339, baseType: !1125, size: 64, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !340, line: 341, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !340, line: 351, size: 192, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1127, file: !340, line: 354, baseType: !72, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1127, file: !340, line: 355, baseType: !72, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1127, file: !340, line: 356, baseType: !72, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1127, file: !340, line: 361, baseType: !72, size: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1127, file: !340, line: 362, baseType: !495, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1076, file: !317, line: 340, baseType: !383, size: 32, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1076, file: !317, line: 340, baseType: !383, size: 32, offset: 992)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1076, file: !317, line: 341, baseType: !446, size: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1076, file: !317, line: 342, baseType: !429, size: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1076, file: !317, line: 343, baseType: !449, size: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1076, file: !317, line: 344, baseType: !431, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1076, file: !317, line: 345, baseType: !383, size: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1076, file: !317, line: 346, baseType: !1107, size: 64, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1076, file: !317, line: 347, baseType: !499, size: 32, offset: 1408)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1076, file: !317, line: 348, baseType: !383, size: 32, offset: 1440)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1076, file: !317, line: 351, baseType: !499, size: 32, offset: 1472)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1076, file: !317, line: 352, baseType: !499, size: 32, offset: 1504)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1076, file: !317, line: 353, baseType: !400, size: 32, offset: 1536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1076, file: !317, line: 354, baseType: !400, size: 32, offset: 1568)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1076, file: !317, line: 355, baseType: !1107, size: 64, offset: 1600)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1076, file: !317, line: 356, baseType: !1107, size: 64, offset: 1664)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1076, file: !317, line: 357, baseType: !1151, size: 64, offset: 1728)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !317, line: 310, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 308, size: 32, elements: !1154)
!1154 = !{!1155}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1153, file: !317, line: 309, baseType: !383, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1076, file: !317, line: 357, baseType: !1151, size: 64, offset: 1792)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1076, file: !317, line: 358, baseType: !1158, size: 64, offset: 1856)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !317, line: 316, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 312, size: 128, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1160, file: !317, line: 313, baseType: !420, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1160, file: !317, line: 314, baseType: !383, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1160, file: !317, line: 315, baseType: !362, size: 8, offset: 96)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1076, file: !317, line: 359, baseType: !1158, size: 64, offset: 1920)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1076, file: !317, line: 360, baseType: !1158, size: 64, offset: 1984)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1076, file: !317, line: 361, baseType: !383, size: 32, offset: 2048)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1076, file: !317, line: 362, baseType: !400, size: 32, offset: 2080)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1076, file: !317, line: 363, baseType: !383, size: 32, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1076, file: !317, line: 364, baseType: !1107, size: 64, offset: 2176)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1076, file: !317, line: 365, baseType: !1125, size: 64, offset: 2240)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1076, file: !317, line: 366, baseType: !400, size: 32, offset: 2304)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1076, file: !317, line: 367, baseType: !400, size: 32, offset: 2336)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1076, file: !317, line: 368, baseType: !1119, size: 64, offset: 2368)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1076, file: !317, line: 369, baseType: !1119, size: 64, offset: 2432)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1076, file: !317, line: 370, baseType: !1177, size: 64, offset: 2496)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1076, file: !317, line: 371, baseType: !1177, size: 64, offset: 2560)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1076, file: !317, line: 372, baseType: !1177, size: 64, offset: 2624)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1076, file: !317, line: 373, baseType: !1183, size: 64, offset: 2688)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !340, line: 331, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !340, line: 331, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1076, file: !317, line: 374, baseType: !495, size: 64, offset: 2752)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1076, file: !317, line: 375, baseType: !1188, size: 64, offset: 2816)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !316, file: !317, line: 451, baseType: !1075, size: 2880, offset: 18560)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !316, file: !317, line: 452, baseType: !1191, size: 64, offset: 21440)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !317, line: 681, size: 4864, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1201, !1205}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1193, file: !317, line: 682, baseType: !320, size: 4480)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1193, file: !317, line: 682, baseType: !753, size: 32, offset: 4480)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1193, file: !317, line: 683, baseType: !499, size: 32, offset: 4512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1193, file: !317, line: 684, baseType: !383, size: 32, offset: 4544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1193, file: !317, line: 685, baseType: !905, size: 64, offset: 4608)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1193, file: !317, line: 686, baseType: !446, size: 64, offset: 4672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1193, file: !317, line: 687, baseType: !1202, size: 64, offset: 4736)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!335, !1191, !551, !420}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1193, file: !317, line: 688, baseType: !420, size: 64, offset: 4800)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !316, file: !317, line: 453, baseType: !1191, size: 64, offset: 21504)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !316, file: !317, line: 454, baseType: !1191, size: 64, offset: 21568)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !316, file: !317, line: 455, baseType: !383, size: 32, offset: 21632)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !316, file: !317, line: 456, baseType: !499, size: 32, offset: 21664)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !316, file: !317, line: 457, baseType: !1211, size: 320, offset: 21696)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !317, line: 399, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 394, size: 320, elements: !1213)
!1213 = !{!1214, !1215, !1219, !1220}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1212, file: !317, line: 395, baseType: !383, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1212, file: !317, line: 396, baseType: !1216, size: 128, offset: 32)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 128, elements: !1217)
!1217 = !{!1218}
!1218 = !DISubrange(count: 4)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1212, file: !317, line: 397, baseType: !1216, size: 128, offset: 160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1212, file: !317, line: 398, baseType: !499, size: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !316, file: !317, line: 458, baseType: !499, size: 32, offset: 22016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !316, file: !317, line: 458, baseType: !499, size: 32, offset: 22048)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !316, file: !317, line: 458, baseType: !499, size: 32, offset: 22080)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !316, file: !317, line: 458, baseType: !499, size: 32, offset: 22112)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !316, file: !317, line: 459, baseType: !499, size: 32, offset: 22144)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !316, file: !317, line: 459, baseType: !499, size: 32, offset: 22176)
