; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pgmres/pgmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pgmres/pgmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133}
!127 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!128 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!129 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!130 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!131 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!132 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!133 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 155, baseType: !5, size: 32, elements: !136)
!135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!136 = !{!137, !138, !139, !140, !141}
!137 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!140 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!141 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!142 = !{!143, !194, !273, !191, !344, !215, !634, !164, !636, !639, !263, !26, !642, !152}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_PGMRES", file: !145, line: 9, baseType: !146)
!145 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/pgmres/pgmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 7, size: 1600, elements: !147)
!147 = !{!148, !153, !154, !155, !156, !157, !158, !159, !161, !162, !163, !165, !166, !616, !618, !619, !620, !621, !622, !623, !624, !626, !627, !628, !629, !630, !631, !632, !633}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !146, file: !145, line: 8, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !152)
!152 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !146, file: !145, line: 8, baseType: !160, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !146, file: !145, line: 8, baseType: !151, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 672)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !146, file: !145, line: 8, baseType: !167, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !171, !164}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !174)
!174 = !{!175, !378, !431, !436, !437, !438, !439, !469, !470, !471, !472, !473, !475, !480, !481, !482, !483, !484, !485, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !509, !515, !516, !517, !518, !523, !524, !525, !526, !531, !532, !533, !534, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !597, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !613, !614, !615}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !173, file: !102, line: 76, baseType: !176, size: 4480)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !177, line: 122, baseType: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !177, line: 73, size: 4480, elements: !179)
!179 = !{!180, !182, !236, !237, !238, !240, !241, !242, !243, !251, !252, !254, !258, !262, !264, !265, !266, !267, !268, !269, !270, !271, !272, !274, !276, !277, !278, !280, !281, !283, !285, !286, !287, !288, !289, !290, !292, !293, !294, !295, !296, !297, !299, !300, !301, !311, !313, !314, !318, !319, !368, !373, !375, !376, !377}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !178, file: !177, line: 74, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !178, file: !177, line: 75, baseType: !183, size: 448, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 448, elements: !234)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !177, line: 53, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 45, size: 448, elements: !186)
!186 = !{!187, !198, !206, !211, !218, !222, !229}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !185, file: !177, line: 46, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!170, !191, !193}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !195, line: 330, baseType: !196)
!195 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !195, line: 330, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !185, file: !177, line: 47, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!170, !191, !202}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !203, line: 16, baseType: !204)
!203 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !203, line: 16, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !185, file: !177, line: 48, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!170, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !185, file: !177, line: 49, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!170, !191, !215, !191}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !185, file: !177, line: 50, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!170, !191, !215, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !185, file: !177, line: 51, baseType: !223, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!170, !191, !215, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !185, file: !177, line: 52, baseType: !230, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!170, !191, !215, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!234 = !{!235}
!235 = !DISubrange(count: 1)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !178, file: !177, line: 76, baseType: !194, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !178, file: !177, line: 77, baseType: !164, size: 32, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !178, file: !177, line: 78, baseType: !239, size: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !178, file: !177, line: 78, baseType: !239, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !178, file: !177, line: 78, baseType: !239, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !178, file: !177, line: 78, baseType: !239, size: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !178, file: !177, line: 79, baseType: !244, size: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !247, line: 27, baseType: !248)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !249, line: 43, baseType: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!250 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !178, file: !177, line: 80, baseType: !164, size: 32, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !178, file: !177, line: 81, baseType: !253, size: 32, offset: 992)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !178, file: !177, line: 82, baseType: !255, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !178, file: !177, line: 83, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !178, file: !177, line: 84, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !178, file: !177, line: 85, baseType: !263, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !178, file: !177, line: 86, baseType: !263, size: 64, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !178, file: !177, line: 87, baseType: !263, size: 64, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !178, file: !177, line: 88, baseType: !191, size: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !178, file: !177, line: 89, baseType: !244, size: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !177, line: 90, baseType: !263, size: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !178, file: !177, line: 91, baseType: !263, size: 64, offset: 1600)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !178, file: !177, line: 92, baseType: !164, size: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !178, file: !177, line: 93, baseType: !273, size: 64, offset: 1728)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !178, file: !177, line: 94, baseType: !275, size: 64, offset: 1792)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !245)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !178, file: !177, line: 95, baseType: !164, size: 32, offset: 1856)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !178, file: !177, line: 95, baseType: !164, size: 32, offset: 1888)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !178, file: !177, line: 96, baseType: !279, size: 64, offset: 1920)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !178, file: !177, line: 96, baseType: !279, size: 64, offset: 1984)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !178, file: !177, line: 97, baseType: !282, size: 64, offset: 2048)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !178, file: !177, line: 97, baseType: !284, size: 64, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !178, file: !177, line: 98, baseType: !164, size: 32, offset: 2176)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !178, file: !177, line: 98, baseType: !164, size: 32, offset: 2208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !178, file: !177, line: 99, baseType: !279, size: 64, offset: 2240)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !178, file: !177, line: 99, baseType: !279, size: 64, offset: 2304)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !178, file: !177, line: 100, baseType: !160, size: 64, offset: 2368)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !178, file: !177, line: 100, baseType: !291, size: 64, offset: 2432)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !178, file: !177, line: 101, baseType: !164, size: 32, offset: 2496)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !178, file: !177, line: 101, baseType: !164, size: 32, offset: 2528)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !178, file: !177, line: 102, baseType: !279, size: 64, offset: 2560)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !178, file: !177, line: 102, baseType: !279, size: 64, offset: 2624)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !178, file: !177, line: 103, baseType: !149, size: 64, offset: 2688)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !178, file: !177, line: 103, baseType: !298, size: 64, offset: 2752)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !178, file: !177, line: 104, baseType: !233, size: 64, offset: 2816)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !178, file: !177, line: 105, baseType: !164, size: 32, offset: 2880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !178, file: !177, line: 106, baseType: !302, size: 128, offset: 2944)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, elements: !309)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !177, line: 64, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 61, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !305, file: !177, line: 62, baseType: !226, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !305, file: !177, line: 63, baseType: !273, size: 64, offset: 64)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !178, file: !177, line: 107, baseType: !312, size: 64, offset: 3072)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !309)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !178, file: !177, line: 108, baseType: !273, size: 64, offset: 3136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !178, file: !177, line: 109, baseType: !315, size: 64, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!170, !273}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !178, file: !177, line: 111, baseType: !164, size: 32, offset: 3264)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !178, file: !177, line: 112, baseType: !320, size: 320, offset: 3328)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !366)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!170, !324, !191, !273}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !327)
!327 = !{!328, !329, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !326, file: !10, line: 100, baseType: !164, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !10, line: 101, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !341, !342, !343, !347, !349, !351, !352, !353}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !332, file: !10, line: 84, baseType: !263, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !332, file: !10, line: 85, baseType: !263, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !10, line: 86, baseType: !273, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !332, file: !10, line: 87, baseType: !255, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !332, file: !10, line: 88, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !332, file: !10, line: 89, baseType: !217, size: 8, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !332, file: !10, line: 90, baseType: !263, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !332, file: !10, line: 91, baseType: !344, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 46, baseType: !346)
!345 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !10, line: 92, baseType: !348, size: 32, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !10, line: 93, baseType: !350, size: 32, offset: 544)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !10, line: 94, baseType: !330, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !332, file: !10, line: 95, baseType: !263, size: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !332, file: !10, line: 96, baseType: !273, size: 64, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !326, file: !10, line: 102, baseType: !263, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !326, file: !10, line: 102, baseType: !263, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !326, file: !10, line: 103, baseType: !263, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !326, file: !10, line: 104, baseType: !194, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !326, file: !10, line: 105, baseType: !348, size: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !326, file: !10, line: 105, baseType: !348, size: 32, offset: 416)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !326, file: !10, line: 105, baseType: !348, size: 32, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !326, file: !10, line: 106, baseType: !191, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !326, file: !10, line: 107, baseType: !363, size: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!366 = !{!367}
!367 = !DISubrange(count: 5)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !178, file: !177, line: 113, baseType: !369, size: 320, offset: 3648)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 320, elements: !366)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!170, !191, !273}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !178, file: !177, line: 114, baseType: !374, size: 320, offset: 3968)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 320, elements: !366)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !178, file: !177, line: 115, baseType: !348, size: 32, offset: 4288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !178, file: !177, line: 120, baseType: !363, size: 64, offset: 4352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !178, file: !177, line: 121, baseType: !348, size: 32, offset: 4416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !173, file: !102, line: 76, baseType: !379, size: 896, offset: 4480)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 896, elements: !234)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !381)
!381 = !{!382, !390, !394, !398, !406, !407, !411, !412, !416, !420, !424, !425, !429, !430}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !380, file: !102, line: 19, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!170, !171, !386, !389}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !135, line: 21, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !135, line: 21, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !380, file: !102, line: 22, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!170, !171, !386, !386, !389}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !380, file: !102, line: 25, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!170, !171}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !380, file: !102, line: 26, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!170, !171, !402, !402}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !403, line: 16, baseType: !404)
!403 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !403, line: 16, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !380, file: !102, line: 27, baseType: !395, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !380, file: !102, line: 28, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!170, !324, !171}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !380, file: !102, line: 29, baseType: !395, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !380, file: !102, line: 30, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!170, !171, !160, !160}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !380, file: !102, line: 31, baseType: !417, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!170, !171, !164, !160, !160, !282}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !380, file: !102, line: 32, baseType: !421, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!170, !171, !348, !348, !282, !389, !160, !160}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !380, file: !102, line: 33, baseType: !395, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !102, line: 34, baseType: !426, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!170, !171, !202}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !380, file: !102, line: 35, baseType: !395, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !380, file: !102, line: 36, baseType: !426, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !173, file: !102, line: 77, baseType: !432, size: 64, offset: 5376)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !433, line: 14, baseType: !434)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !433, line: 14, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !173, file: !102, line: 78, baseType: !348, size: 32, offset: 5440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !173, file: !102, line: 79, baseType: !348, size: 32, offset: 5472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !173, file: !102, line: 81, baseType: !164, size: 32, offset: 5504)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !173, file: !102, line: 82, baseType: !440, size: 64, offset: 5568)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !443)
!443 = !{!444, !445, !465, !466, !467, !468}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !442, file: !102, line: 55, baseType: !176, size: 4480)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !442, file: !102, line: 55, baseType: !446, size: 448, offset: 4480)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 448, elements: !234)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !448)
!448 = !{!449, !453, !454, !458, !459, !460, !464}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !447, file: !102, line: 42, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!170, !440, !386, !386}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !447, file: !102, line: 43, baseType: !450, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !447, file: !102, line: 44, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!170, !440}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !447, file: !102, line: 45, baseType: !455, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !447, file: !102, line: 46, baseType: !455, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !447, file: !102, line: 47, baseType: !461, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!170, !440, !202}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !447, file: !102, line: 48, baseType: !455, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !442, file: !102, line: 56, baseType: !171, size: 64, offset: 4928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !442, file: !102, line: 57, baseType: !402, size: 64, offset: 4992)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !442, file: !102, line: 58, baseType: !275, size: 64, offset: 5056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !102, line: 59, baseType: !273, size: 64, offset: 5120)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !173, file: !102, line: 83, baseType: !348, size: 32, offset: 5632)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !173, file: !102, line: 84, baseType: !348, size: 32, offset: 5664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !173, file: !102, line: 85, baseType: !348, size: 32, offset: 5696)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !173, file: !102, line: 86, baseType: !348, size: 32, offset: 5728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !173, file: !102, line: 87, baseType: !474, size: 32, offset: 5760)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !173, file: !102, line: 88, baseType: !476, size: 384, offset: 5792)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 384, elements: !477)
!477 = !{!478, !479}
!478 = !DISubrange(count: 4)
!479 = !DISubrange(count: 3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !173, file: !102, line: 89, baseType: !151, size: 64, offset: 6208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !173, file: !102, line: 90, baseType: !151, size: 64, offset: 6272)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !173, file: !102, line: 91, baseType: !151, size: 64, offset: 6336)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !173, file: !102, line: 92, baseType: !151, size: 64, offset: 6400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !173, file: !102, line: 93, baseType: !151, size: 64, offset: 6464)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !173, file: !102, line: 94, baseType: !151, size: 64, offset: 6528)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !173, file: !102, line: 95, baseType: !487, size: 32, offset: 6592)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !173, file: !102, line: 96, baseType: !348, size: 32, offset: 6624)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !173, file: !102, line: 98, baseType: !386, size: 64, offset: 6656)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !173, file: !102, line: 98, baseType: !386, size: 64, offset: 6720)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !173, file: !102, line: 102, baseType: !160, size: 64, offset: 6784)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !173, file: !102, line: 103, baseType: !160, size: 64, offset: 6848)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !173, file: !102, line: 104, baseType: !164, size: 32, offset: 6912)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !173, file: !102, line: 105, baseType: !164, size: 32, offset: 6944)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !173, file: !102, line: 106, baseType: !348, size: 32, offset: 6976)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !173, file: !102, line: 107, baseType: !160, size: 64, offset: 7040)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !173, file: !102, line: 108, baseType: !160, size: 64, offset: 7104)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !173, file: !102, line: 109, baseType: !164, size: 32, offset: 7168)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !173, file: !102, line: 110, baseType: !164, size: 32, offset: 7200)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !173, file: !102, line: 111, baseType: !348, size: 32, offset: 7232)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !173, file: !102, line: 113, baseType: !164, size: 32, offset: 7264)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !173, file: !102, line: 114, baseType: !348, size: 32, offset: 7296)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !173, file: !102, line: 117, baseType: !164, size: 32, offset: 7328)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !173, file: !102, line: 120, baseType: !505, size: 320, offset: 7360)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 320, elements: !366)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!170, !171, !164, !151, !273}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !173, file: !102, line: 121, baseType: !510, size: 320, offset: 7680)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 320, elements: !366)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!170, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !173, file: !102, line: 122, baseType: !374, size: 320, offset: 8000)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !173, file: !102, line: 123, baseType: !164, size: 32, offset: 8320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !173, file: !102, line: 124, baseType: !348, size: 32, offset: 8352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !173, file: !102, line: 126, baseType: !519, size: 320, offset: 8384)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !366)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!170, !171, !273}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !173, file: !102, line: 127, baseType: !510, size: 320, offset: 8704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !173, file: !102, line: 128, baseType: !374, size: 320, offset: 9024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !173, file: !102, line: 129, baseType: !164, size: 32, offset: 9344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !173, file: !102, line: 131, baseType: !527, size: 64, offset: 9408)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!170, !171, !164, !151, !530, !273}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !173, file: !102, line: 132, baseType: !315, size: 64, offset: 9472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !173, file: !102, line: 133, baseType: !273, size: 64, offset: 9536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !173, file: !102, line: 135, baseType: !273, size: 64, offset: 9600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !173, file: !102, line: 137, baseType: !535, size: 64, offset: 9664)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !102, line: 139, baseType: !273, size: 64, offset: 9728)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9792)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9824)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9888)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9920)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9952)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 9984)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10016)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10080)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10112)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10176)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !173, file: !102, line: 142, baseType: !348, size: 32, offset: 10208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10304)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10368)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10432)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10560)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10624)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10688)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10752)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10816)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10880)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 10944)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 11008)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !173, file: !102, line: 143, baseType: !202, size: 64, offset: 11072)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11136)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11168)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11200)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11232)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11264)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11296)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11328)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11360)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11392)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11424)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11456)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11488)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11520)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !173, file: !102, line: 144, baseType: !568, size: 32, offset: 11552)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !173, file: !102, line: 147, baseType: !164, size: 32, offset: 11584)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !173, file: !102, line: 148, baseType: !389, size: 64, offset: 11648)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !173, file: !102, line: 150, baseType: !585, size: 32, offset: 11712)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !173, file: !102, line: 151, baseType: !348, size: 32, offset: 11744)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !173, file: !102, line: 153, baseType: !164, size: 32, offset: 11776)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !173, file: !102, line: 154, baseType: !164, size: 32, offset: 11808)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !173, file: !102, line: 156, baseType: !348, size: 32, offset: 11840)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !173, file: !102, line: 161, baseType: !591, size: 192, offset: 11904)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !102, line: 157, size: 192, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !591, file: !102, line: 158, baseType: !402, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !591, file: !102, line: 158, baseType: !402, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !591, file: !102, line: 159, baseType: !348, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !591, file: !102, line: 160, baseType: !348, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !173, file: !102, line: 163, baseType: !598, size: 32, offset: 12096)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !173, file: !102, line: 165, baseType: !474, size: 32, offset: 12128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !173, file: !102, line: 166, baseType: !598, size: 32, offset: 12160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !173, file: !102, line: 171, baseType: !348, size: 32, offset: 12192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !173, file: !102, line: 172, baseType: !348, size: 32, offset: 12224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !173, file: !102, line: 173, baseType: !348, size: 32, offset: 12256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !173, file: !102, line: 174, baseType: !386, size: 64, offset: 12288)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !173, file: !102, line: 175, baseType: !386, size: 64, offset: 12352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !173, file: !102, line: 177, baseType: !164, size: 32, offset: 12416)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !173, file: !102, line: 178, baseType: !348, size: 32, offset: 12448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !173, file: !102, line: 180, baseType: !202, size: 64, offset: 12480)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !173, file: !102, line: 182, baseType: !610, size: 64, offset: 12544)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!170, !171, !386, !386, !273}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !173, file: !102, line: 183, baseType: !610, size: 64, offset: 12608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !173, file: !102, line: 184, baseType: !273, size: 64, offset: 12672)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !173, file: !102, line: 184, baseType: !273, size: 64, offset: 12736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !146, file: !145, line: 8, baseType: !617, size: 32, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !146, file: !145, line: 8, baseType: !389, size: 64, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !146, file: !145, line: 8, baseType: !389, size: 64, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 992)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 1024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 1056)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !146, file: !145, line: 8, baseType: !625, size: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !146, file: !145, line: 8, baseType: !282, size: 64, offset: 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 1248)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !146, file: !145, line: 8, baseType: !164, size: 32, offset: 1280)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !146, file: !145, line: 8, baseType: !149, size: 64, offset: 1344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !146, file: !145, line: 8, baseType: !386, size: 64, offset: 1408)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !146, file: !145, line: 8, baseType: !151, size: 64, offset: 1472)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !146, file: !145, line: 8, baseType: !151, size: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !635, line: 1451, baseType: !226)
!635 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !195, line: 331, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !195, line: 331, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !195, line: 338, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !195, line: 338, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !125)
!643 = !{i32 7, !"Dwarf Version", i32 4}
!644 = !{i32 2, !"Debug Info Version", i32 3}
!645 = !{i32 1, !"wchar_size", i32 4}
!646 = !{i32 7, !"PIC Level", i32 2}
!647 = !{i32 7, !"uwtable", i32 1}
!648 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!649 = distinct !DISubprogram(name: "KSPBuildSolution_PGMRES", scope: !650, file: !650, line: 401, type: !384, scopeLine: 402, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !651)
!650 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pgmres/pgmres.c", directory: "/home/users/ndemeye/xSDK")
!651 = !{!652, !653, !654, !655, !656, !657, !663, !665, !669, !671}
!652 = !DILocalVariable(name: "ksp", arg: 1, scope: !649, file: !650, line: 401, type: !171)
!653 = !DILocalVariable(name: "ptr", arg: 2, scope: !649, file: !650, line: 401, type: !386)
!654 = !DILocalVariable(name: "result", arg: 3, scope: !649, file: !650, line: 401, type: !389)
!655 = !DILocalVariable(name: "pgmres", scope: !649, file: !650, line: 403, type: !143)
!656 = !DILocalVariable(name: "ierr", scope: !649, file: !650, line: 404, type: !170)
!657 = !DILocalVariable(name: "ierr__", scope: !658, file: !650, line: 409, type: !170)
!658 = distinct !DILexicalBlock(scope: !659, file: !650, line: 409, column: 59)
!659 = distinct !DILexicalBlock(scope: !660, file: !650, line: 408, column: 28)
!660 = distinct !DILexicalBlock(scope: !661, file: !650, line: 408, column: 9)
!661 = distinct !DILexicalBlock(scope: !662, file: !650, line: 407, column: 13)
!662 = distinct !DILexicalBlock(scope: !649, file: !650, line: 407, column: 7)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !650, line: 410, type: !170)
!664 = distinct !DILexicalBlock(scope: !659, file: !650, line: 410, column: 83)
!665 = !DILocalVariable(name: "ierr__", scope: !666, file: !650, line: 416, type: !170)
!666 = distinct !DILexicalBlock(scope: !667, file: !650, line: 416, column: 53)
!667 = distinct !DILexicalBlock(scope: !668, file: !650, line: 414, column: 21)
!668 = distinct !DILexicalBlock(scope: !649, file: !650, line: 414, column: 7)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !650, line: 417, type: !170)
!670 = distinct !DILexicalBlock(scope: !667, file: !650, line: 417, column: 85)
!671 = !DILocalVariable(name: "ierr__", scope: !672, file: !650, line: 420, type: !170)
!672 = distinct !DILexicalBlock(scope: !649, file: !650, line: 420, column: 74)
!673 = !DILocation(line: 0, scope: !649)
!674 = !DILocation(line: 403, column: 46, scope: !649)
!675 = !{!676, !681, i64 1216}
