; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/classical.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/gamg/classical.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!313 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!314 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!315 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!316 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!317 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 663, baseType: !7, size: 32, elements: !320)
!319 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!320 = !{!321, !322, !323}
!321 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!326 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 264, baseType: !7, size: 32, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIEnumerator(name: "PC_MG_MULTIPLICATIVE", value: 0, isUnsigned: true)
!347 = !DIEnumerator(name: "PC_MG_ADDITIVE", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "PC_MG_FULL", value: 2, isUnsigned: true)
!349 = !DIEnumerator(name: "PC_MG_KASKADE", value: 3, isUnsigned: true)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 297, baseType: !7, size: 32, elements: !351)
!351 = !{!352, !353, !354, !355, !356}
!352 = !DIEnumerator(name: "PC_MG_GALERKIN_BOTH", value: 0, isUnsigned: true)
!353 = !DIEnumerator(name: "PC_MG_GALERKIN_PMAT", value: 1, isUnsigned: true)
!354 = !DIEnumerator(name: "PC_MG_GALERKIN_MAT", value: 2, isUnsigned: true)
!355 = !DIEnumerator(name: "PC_MG_GALERKIN_NONE", value: 3, isUnsigned: true)
!356 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 330, baseType: !7, size: 32, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!362 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 405, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366}
!365 = !DIEnumerator(name: "PCGAMG_LAYOUT_COMPACT", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "PCGAMG_LAYOUT_SPREAD", value: 1, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!372 = !{!373, !377, !378, !581, !413, !584, !1520, !547, !1615, !1278, !1659, !1662, !463, !74, !582}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !374, line: 330, baseType: !375)
!374 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !374, line: 330, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !381, line: 73, size: 4480, elements: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!382 = !{!383, !385, !434, !435, !437, !440, !441, !442, !443, !451, !452, !454, !458, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !475, !476, !477, !479, !480, !482, !484, !485, !486, !487, !488, !491, !493, !494, !495, !496, !497, !500, !502, !503, !504, !514, !516, !517, !521, !522, !571, !576, !578, !579, !580}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !380, file: !381, line: 74, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !380, file: !381, line: 75, baseType: !386, size: 448, offset: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 448, elements: !432)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !381, line: 53, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 45, size: 448, elements: !389)
!389 = !{!390, !396, !404, !409, !416, !420, !427}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !388, file: !381, line: 46, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !378, !395}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !388, file: !381, line: 47, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!394, !378, !400}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !401, line: 16, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !401, line: 16, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !388, file: !381, line: 48, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!394, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !388, file: !381, line: 49, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!394, !378, !413, !378}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !388, file: !381, line: 50, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!394, !378, !413, !408}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !388, file: !381, line: 51, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!394, !378, !413, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !388, file: !381, line: 52, baseType: !428, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!394, !378, !413, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!432 = !{!433}
!433 = !DISubrange(count: 1)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !380, file: !381, line: 76, baseType: !373, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !381, line: 77, baseType: !436, size: 32, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !380, file: !381, line: 78, baseType: !438, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !439)
!439 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !380, file: !381, line: 78, baseType: !438, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !380, file: !381, line: 78, baseType: !438, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !380, file: !381, line: 78, baseType: !438, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !381, line: 79, baseType: !444, size: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !447, line: 27, baseType: !448)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !449, line: 43, baseType: !450)
!449 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!450 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !380, file: !381, line: 80, baseType: !436, size: 32, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !380, file: !381, line: 81, baseType: !453, size: 32, offset: 992)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !380, file: !381, line: 82, baseType: !455, size: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !380, file: !381, line: 83, baseType: !459, size: 64, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !380, file: !381, line: 84, baseType: !463, size: 64, offset: 1152)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !380, file: !381, line: 85, baseType: !463, size: 64, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !380, file: !381, line: 86, baseType: !463, size: 64, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !380, file: !381, line: 87, baseType: !463, size: 64, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !381, line: 88, baseType: !378, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !380, file: !381, line: 89, baseType: !444, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !381, line: 90, baseType: !463, size: 64, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !380, file: !381, line: 91, baseType: !463, size: 64, offset: 1600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !380, file: !381, line: 92, baseType: !436, size: 32, offset: 1664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !380, file: !381, line: 93, baseType: !377, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !381, line: 94, baseType: !474, size: 64, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !445)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !380, file: !381, line: 95, baseType: !436, size: 32, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !380, file: !381, line: 95, baseType: !436, size: 32, offset: 1888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !380, file: !381, line: 96, baseType: !478, size: 64, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !380, file: !381, line: 96, baseType: !478, size: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !380, file: !381, line: 97, baseType: !481, size: 64, offset: 2048)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !380, file: !381, line: 97, baseType: !483, size: 64, offset: 2112)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !380, file: !381, line: 98, baseType: !436, size: 32, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !380, file: !381, line: 98, baseType: !436, size: 32, offset: 2208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !380, file: !381, line: 99, baseType: !478, size: 64, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !380, file: !381, line: 99, baseType: !478, size: 64, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !380, file: !381, line: 100, baseType: !489, size: 64, offset: 2368)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !439)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !380, file: !381, line: 100, baseType: !492, size: 64, offset: 2432)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !380, file: !381, line: 101, baseType: !436, size: 32, offset: 2496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !380, file: !381, line: 101, baseType: !436, size: 32, offset: 2528)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !380, file: !381, line: 102, baseType: !478, size: 64, offset: 2560)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !380, file: !381, line: 102, baseType: !478, size: 64, offset: 2624)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !380, file: !381, line: 103, baseType: !498, size: 64, offset: 2688)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !490)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !380, file: !381, line: 103, baseType: !501, size: 64, offset: 2752)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !380, file: !381, line: 104, baseType: !431, size: 64, offset: 2816)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !380, file: !381, line: 105, baseType: !436, size: 32, offset: 2880)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !380, file: !381, line: 106, baseType: !505, size: 128, offset: 2944)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 128, elements: !512)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !381, line: 64, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 61, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !508, file: !381, line: 62, baseType: !424, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !508, file: !381, line: 63, baseType: !377, size: 64, offset: 64)
!512 = !{!513}
!513 = !DISubrange(count: 2)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !380, file: !381, line: 107, baseType: !515, size: 64, offset: 3072)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 64, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !380, file: !381, line: 108, baseType: !377, size: 64, offset: 3136)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !380, file: !381, line: 109, baseType: !518, size: 64, offset: 3200)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!394, !377}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !380, file: !381, line: 111, baseType: !436, size: 32, offset: 3264)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !380, file: !381, line: 112, baseType: !523, size: 320, offset: 3328)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !569)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!394, !527, !378, !377}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !530)
!530 = !{!531, !532, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !529, file: !12, line: 100, baseType: !436, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !12, line: 101, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !544, !545, !546, !550, !552, !554, !555, !556}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !535, file: !12, line: 84, baseType: !463, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !535, file: !12, line: 85, baseType: !463, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !12, line: 86, baseType: !377, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !535, file: !12, line: 87, baseType: !455, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !535, file: !12, line: 88, baseType: !542, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !535, file: !12, line: 89, baseType: !415, size: 8, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !535, file: !12, line: 90, baseType: !463, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !535, file: !12, line: 91, baseType: !547, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !548, line: 46, baseType: !549)
!548 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!549 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !535, file: !12, line: 92, baseType: !551, size: 32, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !12, line: 93, baseType: !553, size: 32, offset: 544)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !12, line: 94, baseType: !533, size: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !535, file: !12, line: 95, baseType: !463, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !535, file: !12, line: 96, baseType: !377, size: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !529, file: !12, line: 102, baseType: !463, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !529, file: !12, line: 102, baseType: !463, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !529, file: !12, line: 103, baseType: !463, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !529, file: !12, line: 104, baseType: !373, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !529, file: !12, line: 105, baseType: !551, size: 32, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !529, file: !12, line: 105, baseType: !551, size: 32, offset: 416)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !529, file: !12, line: 105, baseType: !551, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !529, file: !12, line: 106, baseType: !378, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !529, file: !12, line: 107, baseType: !566, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!569 = !{!570}
!570 = !DISubrange(count: 5)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !380, file: !381, line: 113, baseType: !572, size: 320, offset: 3648)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !569)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!394, !378, !377}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !380, file: !381, line: 114, baseType: !577, size: 320, offset: 3968)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 320, elements: !569)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !380, file: !381, line: 115, baseType: !551, size: 32, offset: 4288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !380, file: !381, line: 120, baseType: !566, size: 64, offset: 4352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !380, file: !381, line: 121, baseType: !551, size: 32, offset: 4416)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !583, line: 1451, baseType: !424)
!583 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !586, line: 79, baseType: !587)
!586 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 53, size: 2240, elements: !588)
!588 = !{!589, !591, !592, !593, !595, !596, !597, !599, !600, !601, !602, !603, !604, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1424, !1515, !1519}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !587, file: !586, line: 54, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !297, line: 264, baseType: !344)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !587, file: !586, line: 55, baseType: !436, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !587, file: !586, line: 56, baseType: !436, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !587, file: !586, line: 57, baseType: !594, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !297, line: 297, baseType: !350)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !587, file: !586, line: 58, baseType: !551, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !587, file: !586, line: 60, baseType: !551, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !587, file: !586, line: 61, baseType: !598, size: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !297, line: 330, baseType: !357)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !587, file: !586, line: 62, baseType: !436, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !587, file: !586, line: 63, baseType: !436, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !587, file: !586, line: 64, baseType: !551, size: 32, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !587, file: !586, line: 66, baseType: !551, size: 32, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !587, file: !586, line: 68, baseType: !436, size: 32, offset: 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !587, file: !586, line: 69, baseType: !605, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !586, line: 48, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 14, size: 1600, elements: !609)
!609 = !{!610, !611, !612, !613, !617, !618, !619, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1412, !1413, !1414}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !608, file: !586, line: 15, baseType: !436, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !608, file: !586, line: 16, baseType: !436, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !608, file: !586, line: 17, baseType: !436, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !608, file: !586, line: 18, baseType: !614, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !608, file: !586, line: 19, baseType: !614, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !608, file: !586, line: 20, baseType: !614, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !608, file: !586, line: 21, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !623, line: 436, size: 23424, elements: !624)
!623 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!624 = !{!625, !627, !1131, !1151, !1152, !1153, !1155, !1156, !1157, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1284, !1285, !1301, !1302, !1303, !1304, !1305, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1340, !1360, !1361, !1363, !1364, !1365, !1366, !1367, !1368, !1386, !1387}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !622, file: !623, line: 437, baseType: !626, size: 4480)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !381, line: 122, baseType: !380)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !622, file: !623, line: 437, baseType: !628, size: 9472, offset: 4480)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 9472, elements: !432)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !623, line: 32, size: 9472, elements: !630)
!630 = !{!631, !640, !644, !645, !649, !653, !654, !655, !656, !657, !658, !659, !683, !687, !692, !698, !717, !722, !726, !727, !732, !737, !738, !743, !747, !751, !755, !759, !763, !764, !765, !766, !767, !771, !772, !777, !778, !779, !780, !781, !786, !793, !798, !802, !806, !810, !814, !815, !819, !820, !827, !832, !833, !834, !835, !897, !905, !906, !910, !911, !915, !916, !920, !925, !926, !930, !934, !941, !942, !943, !944, !945, !946, !951, !952, !956, !960, !964, !965, !966, !970, !980, !981, !985, !986, !990, !991, !995, !996, !1001, !1002, !1006, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1020, !1021, !1022, !1023, !1024, !1025, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1040, !1044, !1045, !1046, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1060, !1061, !1062, !1067, !1071, !1072, !1076, !1077, !1078, !1079, !1105, !1109, !1110, !1111, !1112, !1113, !1117, !1118, !1119, !1120, !1121, !1125, !1129, !1130}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !629, file: !623, line: 34, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!394, !620, !436, !635, !436, !635, !637, !639}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !629, file: !623, line: 35, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!394, !620, !436, !481, !483, !501}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !629, file: !623, line: 36, baseType: !641, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !629, file: !623, line: 37, baseType: !646, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!394, !620, !614, !614}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !629, file: !623, line: 38, baseType: !650, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!394, !620, !614, !614, !614}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !629, file: !623, line: 40, baseType: !646, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !629, file: !623, line: 41, baseType: !650, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !629, file: !623, line: 42, baseType: !646, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !629, file: !623, line: 43, baseType: !650, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !629, file: !623, line: 44, baseType: !646, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !629, file: !623, line: 46, baseType: !650, size: 64, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !629, file: !623, line: 47, baseType: !660, size: 64, offset: 704)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!394, !620, !663, !663, !667}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !664, line: 11, baseType: !665)
!664 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !664, line: 11, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !670, file: !38, line: 1227, baseType: !490, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !670, file: !38, line: 1228, baseType: !490, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !670, file: !38, line: 1229, baseType: !490, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !670, file: !38, line: 1230, baseType: !490, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !670, file: !38, line: 1231, baseType: !490, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !670, file: !38, line: 1232, baseType: !490, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !670, file: !38, line: 1233, baseType: !490, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !670, file: !38, line: 1234, baseType: !490, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !670, file: !38, line: 1236, baseType: !490, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !670, file: !38, line: 1237, baseType: !490, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !670, file: !38, line: 1238, baseType: !490, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !629, file: !623, line: 48, baseType: !684, size: 64, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!394, !620, !663, !667}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !629, file: !623, line: 49, baseType: !688, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!394, !620, !614, !490, !691, !490, !436, !436, !614}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !629, file: !623, line: 50, baseType: !693, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!394, !620, !696, !697}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !629, file: !623, line: 52, baseType: !699, size: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!394, !620, !702, !703}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !705, file: !38, line: 593, baseType: !438, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !705, file: !38, line: 594, baseType: !438, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !705, file: !38, line: 594, baseType: !438, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !705, file: !38, line: 594, baseType: !438, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !705, file: !38, line: 595, baseType: !438, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !705, file: !38, line: 596, baseType: !438, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !705, file: !38, line: 597, baseType: !438, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !705, file: !38, line: 598, baseType: !438, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !705, file: !38, line: 598, baseType: !438, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !705, file: !38, line: 599, baseType: !438, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !629, file: !623, line: 53, baseType: !718, size: 64, offset: 1024)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!394, !620, !620, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !629, file: !623, line: 54, baseType: !723, size: 64, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!394, !620, !614}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !629, file: !623, line: 55, baseType: !646, size: 64, offset: 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !629, file: !623, line: 56, baseType: !728, size: 64, offset: 1216)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!394, !620, !731, !489}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !629, file: !623, line: 58, baseType: !733, size: 64, offset: 1280)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!394, !620, !736}
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !629, file: !623, line: 59, baseType: !733, size: 64, offset: 1344)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !629, file: !623, line: 60, baseType: !739, size: 64, offset: 1408)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!394, !620, !742, !551}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !629, file: !623, line: 61, baseType: !744, size: 64, offset: 1472)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!394, !620}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !629, file: !623, line: 63, baseType: !748, size: 64, offset: 1536)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!394, !620, !436, !635, !499, !614, !614}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !629, file: !623, line: 64, baseType: !752, size: 64, offset: 1600)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!394, !620, !620, !663, !663, !667}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !629, file: !623, line: 65, baseType: !756, size: 64, offset: 1664)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!394, !620, !620, !667}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !629, file: !623, line: 66, baseType: !760, size: 64, offset: 1728)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!394, !620, !620, !663, !667}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !629, file: !623, line: 67, baseType: !756, size: 64, offset: 1792)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !629, file: !623, line: 69, baseType: !744, size: 64, offset: 1856)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !629, file: !623, line: 70, baseType: !752, size: 64, offset: 1920)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !629, file: !623, line: 71, baseType: !760, size: 64, offset: 1984)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !629, file: !623, line: 72, baseType: !768, size: 64, offset: 2048)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!394, !620, !697}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !629, file: !623, line: 73, baseType: !744, size: 64, offset: 2112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !629, file: !623, line: 75, baseType: !773, size: 64, offset: 2176)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!394, !620, !776, !697}
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !629, file: !623, line: 76, baseType: !646, size: 64, offset: 2240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !629, file: !623, line: 77, baseType: !646, size: 64, offset: 2304)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !629, file: !623, line: 78, baseType: !660, size: 64, offset: 2368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !629, file: !623, line: 79, baseType: !684, size: 64, offset: 2432)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !629, file: !623, line: 81, baseType: !782, size: 64, offset: 2496)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!394, !620, !499, !620, !785}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !629, file: !623, line: 82, baseType: !787, size: 64, offset: 2560)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!394, !620, !436, !790, !790, !696, !792}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !629, file: !623, line: 83, baseType: !794, size: 64, offset: 2624)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!394, !620, !436, !797, !436}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !629, file: !623, line: 84, baseType: !799, size: 64, offset: 2688)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!394, !620, !436, !635, !436, !635, !498}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !629, file: !623, line: 85, baseType: !803, size: 64, offset: 2752)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!394, !620, !620, !785}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !629, file: !623, line: 87, baseType: !807, size: 64, offset: 2816)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!394, !620, !614, !481}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !629, file: !623, line: 88, baseType: !811, size: 64, offset: 2880)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!394, !620, !499}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !629, file: !623, line: 89, baseType: !811, size: 64, offset: 2944)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !629, file: !623, line: 90, baseType: !816, size: 64, offset: 3008)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!394, !620, !614, !639}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !629, file: !623, line: 91, baseType: !748, size: 64, offset: 3072)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !629, file: !623, line: 93, baseType: !821, size: 64, offset: 3136)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!394, !620, !824}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !629, file: !623, line: 94, baseType: !828, size: 64, offset: 3200)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!394, !620, !436, !551, !551, !481, !831, !831, !721}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !629, file: !623, line: 95, baseType: !828, size: 64, offset: 3264)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !629, file: !623, line: 96, baseType: !828, size: 64, offset: 3328)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !629, file: !623, line: 97, baseType: !828, size: 64, offset: 3392)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !629, file: !623, line: 99, baseType: !836, size: 64, offset: 3456)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!394, !620, !839, !842}
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !664, line: 51, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !664, line: 51, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !623, line: 609, size: 6208, elements: !845)
!845 = !{!846, !847, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !866, !873, !874, !875, !876, !877, !878, !879, !880, !884, !885, !886, !887, !888, !890, !891, !892, !893, !894, !895, !896}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !844, file: !623, line: 610, baseType: !626, size: 4480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !844, file: !623, line: 610, baseType: !848, size: 32, offset: 4480)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !432)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !844, file: !623, line: 611, baseType: !436, size: 32, offset: 4512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !844, file: !623, line: 611, baseType: !436, size: 32, offset: 4544)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !844, file: !623, line: 611, baseType: !436, size: 32, offset: 4576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !844, file: !623, line: 612, baseType: !436, size: 32, offset: 4608)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !844, file: !623, line: 613, baseType: !436, size: 32, offset: 4640)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !844, file: !623, line: 614, baseType: !481, size: 64, offset: 4672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !844, file: !623, line: 615, baseType: !483, size: 64, offset: 4736)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !844, file: !623, line: 616, baseType: !797, size: 64, offset: 4800)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !844, file: !623, line: 617, baseType: !481, size: 64, offset: 4864)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !844, file: !623, line: 618, baseType: !859, size: 64, offset: 4928)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !623, line: 602, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 598, size: 128, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !861, file: !623, line: 599, baseType: !436, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !861, file: !623, line: 600, baseType: !436, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !861, file: !623, line: 601, baseType: !498, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !844, file: !623, line: 619, baseType: !867, size: 64, offset: 4992)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !623, line: 607, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 604, size: 128, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !869, file: !623, line: 605, baseType: !436, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !869, file: !623, line: 606, baseType: !498, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !844, file: !623, line: 620, baseType: !498, size: 64, offset: 5056)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !844, file: !623, line: 621, baseType: !490, size: 64, offset: 5120)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !844, file: !623, line: 622, baseType: !490, size: 64, offset: 5184)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !844, file: !623, line: 623, baseType: !614, size: 64, offset: 5248)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !844, file: !623, line: 623, baseType: !614, size: 64, offset: 5312)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !844, file: !623, line: 623, baseType: !614, size: 64, offset: 5376)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !844, file: !623, line: 624, baseType: !551, size: 32, offset: 5440)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !844, file: !623, line: 625, baseType: !881, size: 64, offset: 5504)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!394}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !844, file: !623, line: 626, baseType: !377, size: 64, offset: 5568)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !844, file: !623, line: 627, baseType: !614, size: 64, offset: 5632)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !844, file: !623, line: 628, baseType: !436, size: 32, offset: 5696)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !844, file: !623, line: 629, baseType: !413, size: 64, offset: 5760)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !844, file: !623, line: 630, baseType: !889, size: 32, offset: 5824)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !844, file: !623, line: 631, baseType: !436, size: 32, offset: 5856)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !844, file: !623, line: 631, baseType: !436, size: 32, offset: 5888)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !844, file: !623, line: 632, baseType: !551, size: 32, offset: 5920)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !844, file: !623, line: 633, baseType: !551, size: 32, offset: 5952)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !844, file: !623, line: 634, baseType: !424, size: 64, offset: 6016)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !844, file: !623, line: 634, baseType: !377, size: 64, offset: 6080)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !844, file: !623, line: 635, baseType: !444, size: 64, offset: 6144)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !629, file: !623, line: 100, baseType: !898, size: 64, offset: 3520)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!394, !620, !436, !436, !901, !904}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !903)
!903 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !629, file: !623, line: 101, baseType: !744, size: 64, offset: 3584)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !629, file: !623, line: 102, baseType: !907, size: 64, offset: 3648)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!394, !620, !663, !663, !697}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !629, file: !623, line: 103, baseType: !632, size: 64, offset: 3712)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !629, file: !623, line: 105, baseType: !912, size: 64, offset: 3776)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!394, !620, !663, !663, !696, !697}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !629, file: !623, line: 106, baseType: !744, size: 64, offset: 3840)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !629, file: !623, line: 107, baseType: !917, size: 64, offset: 3904)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!394, !620, !400}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !629, file: !623, line: 108, baseType: !921, size: 64, offset: 3968)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!394, !620, !924, !696, !697}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !413)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !629, file: !623, line: 109, baseType: !881, size: 64, offset: 4032)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !629, file: !623, line: 111, baseType: !927, size: 64, offset: 4096)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!394, !620, !620, !620, !490, !620}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !629, file: !623, line: 112, baseType: !931, size: 64, offset: 4160)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!394, !620, !620, !620, !620}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !629, file: !623, line: 113, baseType: !935, size: 64, offset: 4224)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!394, !620, !938, !938}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !664, line: 30, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !664, line: 30, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !629, file: !623, line: 114, baseType: !632, size: 64, offset: 4288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !629, file: !623, line: 115, baseType: !748, size: 64, offset: 4352)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !629, file: !623, line: 117, baseType: !807, size: 64, offset: 4416)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !629, file: !623, line: 118, baseType: !807, size: 64, offset: 4480)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !629, file: !623, line: 119, baseType: !921, size: 64, offset: 4544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !629, file: !623, line: 120, baseType: !947, size: 64, offset: 4608)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!394, !620, !950, !721}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !629, file: !623, line: 121, baseType: !881, size: 64, offset: 4672)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !629, file: !623, line: 123, baseType: !953, size: 64, offset: 4736)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!394, !620, !436, !377}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !629, file: !623, line: 124, baseType: !957, size: 64, offset: 4800)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!394, !620, !842, !614, !377}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !629, file: !623, line: 125, baseType: !961, size: 64, offset: 4864)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!394, !527, !620}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !629, file: !623, line: 126, baseType: !646, size: 64, offset: 4928)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !629, file: !623, line: 127, baseType: !646, size: 64, offset: 4992)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !629, file: !623, line: 129, baseType: !967, size: 64, offset: 5056)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!394, !620, !797}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !629, file: !623, line: 130, baseType: !971, size: 64, offset: 5120)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!394, !620, !974, !974}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !976, file: !62, line: 653, baseType: !436, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !976, file: !62, line: 653, baseType: !614, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !629, file: !623, line: 131, baseType: !971, size: 64, offset: 5184)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !629, file: !623, line: 132, baseType: !982, size: 64, offset: 5248)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!394, !620, !481, !481, !481}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !629, file: !623, line: 133, baseType: !917, size: 64, offset: 5312)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !629, file: !623, line: 135, baseType: !987, size: 64, offset: 5376)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!394, !620, !490, !721}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !629, file: !623, line: 136, baseType: !987, size: 64, offset: 5440)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !629, file: !623, line: 137, baseType: !992, size: 64, offset: 5504)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!394, !620, !721}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !629, file: !623, line: 138, baseType: !632, size: 64, offset: 5568)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !629, file: !623, line: 139, baseType: !997, size: 64, offset: 5632)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!394, !620, !1000, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !629, file: !623, line: 141, baseType: !881, size: 64, offset: 5696)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !629, file: !623, line: 142, baseType: !1003, size: 64, offset: 5760)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!394, !620, !620, !490, !620}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !629, file: !623, line: 143, baseType: !1007, size: 64, offset: 5824)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!394, !620, !620, !620}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !629, file: !623, line: 144, baseType: !881, size: 64, offset: 5888)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !629, file: !623, line: 145, baseType: !1003, size: 64, offset: 5952)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !629, file: !623, line: 147, baseType: !1007, size: 64, offset: 6016)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !629, file: !623, line: 148, baseType: !881, size: 64, offset: 6080)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !629, file: !623, line: 149, baseType: !1003, size: 64, offset: 6144)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !629, file: !623, line: 150, baseType: !1007, size: 64, offset: 6208)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !629, file: !623, line: 151, baseType: !1017, size: 64, offset: 6272)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!394, !620, !551}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !629, file: !623, line: 153, baseType: !744, size: 64, offset: 6336)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !629, file: !623, line: 154, baseType: !744, size: 64, offset: 6400)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !629, file: !623, line: 155, baseType: !744, size: 64, offset: 6464)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !629, file: !623, line: 156, baseType: !744, size: 64, offset: 6528)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !629, file: !623, line: 157, baseType: !917, size: 64, offset: 6592)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !629, file: !623, line: 159, baseType: !1026, size: 64, offset: 6656)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!394, !620, !436, !637}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !629, file: !623, line: 160, baseType: !744, size: 64, offset: 6720)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !629, file: !623, line: 161, baseType: !744, size: 64, offset: 6784)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !629, file: !623, line: 162, baseType: !744, size: 64, offset: 6848)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !629, file: !623, line: 163, baseType: !744, size: 64, offset: 6912)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !629, file: !623, line: 165, baseType: !1007, size: 64, offset: 6976)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !629, file: !623, line: 166, baseType: !1007, size: 64, offset: 7040)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !629, file: !623, line: 167, baseType: !807, size: 64, offset: 7104)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !629, file: !623, line: 168, baseType: !1037, size: 64, offset: 7168)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!394, !620, !614, !436}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !629, file: !623, line: 169, baseType: !1041, size: 64, offset: 7232)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!394, !620, !721, !481}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !629, file: !623, line: 171, baseType: !768, size: 64, offset: 7296)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !629, file: !623, line: 172, baseType: !744, size: 64, offset: 7360)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !629, file: !623, line: 173, baseType: !1047, size: 64, offset: 7424)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!394, !620, !481, !831}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !629, file: !623, line: 174, baseType: !907, size: 64, offset: 7488)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !629, file: !623, line: 175, baseType: !907, size: 64, offset: 7552)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !629, file: !623, line: 177, baseType: !646, size: 64, offset: 7616)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !629, file: !623, line: 178, baseType: !693, size: 64, offset: 7680)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !629, file: !623, line: 179, baseType: !646, size: 64, offset: 7744)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !629, file: !623, line: 180, baseType: !650, size: 64, offset: 7808)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !629, file: !623, line: 181, baseType: !1057, size: 64, offset: 7872)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!394, !620, !373, !696, !697}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !629, file: !623, line: 183, baseType: !967, size: 64, offset: 7936)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !629, file: !623, line: 184, baseType: !728, size: 64, offset: 8000)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !629, file: !623, line: 185, baseType: !1063, size: 64, offset: 8064)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!394, !620, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !629, file: !623, line: 186, baseType: !1068, size: 64, offset: 8128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!394, !620, !436, !635, !498}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !629, file: !623, line: 187, baseType: !787, size: 64, offset: 8192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !629, file: !623, line: 189, baseType: !1073, size: 64, offset: 8256)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!394, !620, !436, !436, !481, !637}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !629, file: !623, line: 190, baseType: !881, size: 64, offset: 8320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !629, file: !623, line: 191, baseType: !1003, size: 64, offset: 8384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !629, file: !623, line: 192, baseType: !1007, size: 64, offset: 8448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !629, file: !623, line: 193, baseType: !1080, size: 64, offset: 8512)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!394, !620, !839, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !623, line: 660, size: 5312, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1085, file: !623, line: 661, baseType: !626, size: 4480)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1085, file: !623, line: 661, baseType: !848, size: 32, offset: 4480)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1085, file: !623, line: 662, baseType: !436, size: 32, offset: 4512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1085, file: !623, line: 662, baseType: !436, size: 32, offset: 4544)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1085, file: !623, line: 662, baseType: !436, size: 32, offset: 4576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1085, file: !623, line: 663, baseType: !436, size: 32, offset: 4608)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1085, file: !623, line: 664, baseType: !436, size: 32, offset: 4640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1085, file: !623, line: 665, baseType: !481, size: 64, offset: 4672)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1085, file: !623, line: 666, baseType: !481, size: 64, offset: 4736)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1085, file: !623, line: 667, baseType: !436, size: 32, offset: 4800)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1085, file: !623, line: 668, baseType: !889, size: 32, offset: 4832)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1085, file: !623, line: 670, baseType: !481, size: 64, offset: 4864)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1085, file: !623, line: 670, baseType: !481, size: 64, offset: 4928)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1085, file: !623, line: 671, baseType: !481, size: 64, offset: 4992)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1085, file: !623, line: 672, baseType: !481, size: 64, offset: 5056)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1085, file: !623, line: 673, baseType: !481, size: 64, offset: 5120)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1085, file: !623, line: 674, baseType: !436, size: 32, offset: 5184)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1085, file: !623, line: 675, baseType: !481, size: 64, offset: 5248)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !629, file: !623, line: 195, baseType: !1106, size: 64, offset: 8576)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!394, !1083, !620, !620}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !629, file: !623, line: 196, baseType: !1106, size: 64, offset: 8640)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !629, file: !623, line: 197, baseType: !881, size: 64, offset: 8704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !629, file: !623, line: 198, baseType: !1003, size: 64, offset: 8768)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !629, file: !623, line: 199, baseType: !1007, size: 64, offset: 8832)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !629, file: !623, line: 201, baseType: !1114, size: 64, offset: 8896)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!394, !620, !436, !436}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !629, file: !623, line: 202, baseType: !782, size: 64, offset: 8960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !629, file: !623, line: 203, baseType: !650, size: 64, offset: 9024)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !629, file: !623, line: 204, baseType: !836, size: 64, offset: 9088)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !629, file: !623, line: 205, baseType: !967, size: 64, offset: 9152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !629, file: !623, line: 206, baseType: !1122, size: 64, offset: 9216)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!394, !373, !620, !436, !696, !697}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !629, file: !623, line: 208, baseType: !1126, size: 64, offset: 9280)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!394, !436, !792}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !629, file: !623, line: 209, baseType: !1007, size: 64, offset: 9344)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !629, file: !623, line: 210, baseType: !799, size: 64, offset: 9408)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !622, file: !623, line: 438, baseType: !1132, size: 64, offset: 13952)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !664, line: 60, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1134, file: !116, line: 241, baseType: !373, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !116, line: 242, baseType: !453, size: 32, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1134, file: !116, line: 243, baseType: !436, size: 32, offset: 96)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1134, file: !116, line: 243, baseType: !436, size: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1134, file: !116, line: 244, baseType: !436, size: 32, offset: 160)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1134, file: !116, line: 244, baseType: !436, size: 32, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1134, file: !116, line: 245, baseType: !481, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1134, file: !116, line: 246, baseType: !551, size: 32, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1134, file: !116, line: 247, baseType: !436, size: 32, offset: 352)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1134, file: !116, line: 251, baseType: !436, size: 32, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1134, file: !116, line: 252, baseType: !938, size: 64, offset: 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1134, file: !116, line: 253, baseType: !551, size: 32, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1134, file: !116, line: 254, baseType: !436, size: 32, offset: 544)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1134, file: !116, line: 254, baseType: !436, size: 32, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1134, file: !116, line: 255, baseType: !436, size: 32, offset: 608)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !622, file: !623, line: 438, baseType: !1132, size: 64, offset: 14016)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !622, file: !623, line: 439, baseType: !377, size: 64, offset: 14080)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !622, file: !623, line: 440, baseType: !1154, size: 32, offset: 14144)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !622, file: !623, line: 441, baseType: !551, size: 32, offset: 14176)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !622, file: !623, line: 442, baseType: !551, size: 32, offset: 14208)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !622, file: !623, line: 443, baseType: !1158, size: 448, offset: 14272)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 448, elements: !1160)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !413)
!1160 = !{!1161}
!1161 = !DISubrange(count: 7)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !622, file: !623, line: 444, baseType: !551, size: 32, offset: 14720)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !622, file: !623, line: 445, baseType: !551, size: 32, offset: 14752)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !622, file: !623, line: 446, baseType: !436, size: 32, offset: 14784)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !622, file: !623, line: 447, baseType: !474, size: 64, offset: 14848)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !622, file: !623, line: 448, baseType: !474, size: 64, offset: 14912)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !622, file: !623, line: 449, baseType: !704, size: 640, offset: 14976)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !622, file: !623, line: 450, baseType: !639, size: 32, offset: 15616)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !622, file: !623, line: 451, baseType: !1170, size: 2880, offset: 15680)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !623, line: 318, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !623, line: 319, size: 2880, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1192, !1193, !1198, !1203, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1218, !1219, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1251, !1252, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1275, !1276, !1277, !1281, !1282}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1171, file: !623, line: 320, baseType: !436, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1171, file: !623, line: 321, baseType: !436, size: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1171, file: !623, line: 322, baseType: !436, size: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1171, file: !623, line: 323, baseType: !436, size: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1171, file: !623, line: 324, baseType: !436, size: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1171, file: !623, line: 325, baseType: !436, size: 32, offset: 160)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1171, file: !623, line: 326, baseType: !1180, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !623, line: 293, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !623, line: 295, size: 448, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1182, file: !623, line: 296, baseType: !1180, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1182, file: !623, line: 297, baseType: !498, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1182, file: !623, line: 297, baseType: !498, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1182, file: !623, line: 298, baseType: !481, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1182, file: !623, line: 298, baseType: !481, size: 64, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1182, file: !623, line: 299, baseType: !436, size: 32, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1182, file: !623, line: 300, baseType: !436, size: 32, offset: 352)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1182, file: !623, line: 301, baseType: !436, size: 32, offset: 384)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1171, file: !623, line: 326, baseType: !1180, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1171, file: !623, line: 328, baseType: !1194, size: 64, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!394, !620, !1197, !481}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1171, file: !623, line: 329, baseType: !1199, size: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!394, !1197, !1202, !483, !483, !501, !481}
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1171, file: !623, line: 330, baseType: !1204, size: 64, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!394, !1197}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1171, file: !623, line: 331, baseType: !1204, size: 64, offset: 512)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1171, file: !623, line: 334, baseType: !373, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !623, line: 335, baseType: !453, size: 32, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1171, file: !623, line: 335, baseType: !453, size: 32, offset: 672)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1171, file: !623, line: 336, baseType: !453, size: 32, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1171, file: !623, line: 336, baseType: !453, size: 32, offset: 736)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1171, file: !623, line: 337, baseType: !1214, size: 64, offset: 768)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !374, line: 339, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !374, line: 339, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1171, file: !623, line: 338, baseType: !1214, size: 64, offset: 832)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1171, file: !623, line: 339, baseType: !1220, size: 64, offset: 896)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !374, line: 341, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !374, line: 351, size: 192, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1228}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1222, file: !374, line: 354, baseType: !74, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1222, file: !374, line: 355, baseType: !74, size: 32, offset: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1222, file: !374, line: 356, baseType: !74, size: 32, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1222, file: !374, line: 361, baseType: !74, size: 32, offset: 96)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1222, file: !374, line: 362, baseType: !547, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1171, file: !623, line: 340, baseType: !436, size: 32, offset: 960)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1171, file: !623, line: 340, baseType: !436, size: 32, offset: 992)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1171, file: !623, line: 341, baseType: !498, size: 64, offset: 1024)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1171, file: !623, line: 342, baseType: !481, size: 64, offset: 1088)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1171, file: !623, line: 343, baseType: !501, size: 64, offset: 1152)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1171, file: !623, line: 344, baseType: !483, size: 64, offset: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1171, file: !623, line: 345, baseType: !436, size: 32, offset: 1280)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1171, file: !623, line: 346, baseType: !1202, size: 64, offset: 1344)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1171, file: !623, line: 347, baseType: !551, size: 32, offset: 1408)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1171, file: !623, line: 348, baseType: !436, size: 32, offset: 1440)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1171, file: !623, line: 351, baseType: !551, size: 32, offset: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1171, file: !623, line: 352, baseType: !551, size: 32, offset: 1504)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1171, file: !623, line: 353, baseType: !453, size: 32, offset: 1536)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1171, file: !623, line: 354, baseType: !453, size: 32, offset: 1568)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1171, file: !623, line: 355, baseType: !1202, size: 64, offset: 1600)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1171, file: !623, line: 356, baseType: !1202, size: 64, offset: 1664)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1171, file: !623, line: 357, baseType: !1246, size: 64, offset: 1728)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !623, line: 310, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 308, size: 32, elements: !1249)
!1249 = !{!1250}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1248, file: !623, line: 309, baseType: !436, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1171, file: !623, line: 357, baseType: !1246, size: 64, offset: 1792)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1171, file: !623, line: 358, baseType: !1253, size: 64, offset: 1856)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !623, line: 316, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 312, size: 128, elements: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1255, file: !623, line: 313, baseType: !377, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1255, file: !623, line: 314, baseType: !436, size: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1255, file: !623, line: 315, baseType: !415, size: 8, offset: 96)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1171, file: !623, line: 359, baseType: !1253, size: 64, offset: 1920)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1171, file: !623, line: 360, baseType: !1253, size: 64, offset: 1984)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1171, file: !623, line: 361, baseType: !436, size: 32, offset: 2048)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1171, file: !623, line: 362, baseType: !453, size: 32, offset: 2080)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1171, file: !623, line: 363, baseType: !436, size: 32, offset: 2112)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1171, file: !623, line: 364, baseType: !1202, size: 64, offset: 2176)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1171, file: !623, line: 365, baseType: !1220, size: 64, offset: 2240)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1171, file: !623, line: 366, baseType: !453, size: 32, offset: 2304)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1171, file: !623, line: 367, baseType: !453, size: 32, offset: 2336)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1171, file: !623, line: 368, baseType: !1214, size: 64, offset: 2368)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1171, file: !623, line: 369, baseType: !1214, size: 64, offset: 2432)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1171, file: !623, line: 370, baseType: !1272, size: 64, offset: 2496)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1273)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1171, file: !623, line: 371, baseType: !1272, size: 64, offset: 2560)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1171, file: !623, line: 372, baseType: !1272, size: 64, offset: 2624)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1171, file: !623, line: 373, baseType: !1278, size: 64, offset: 2688)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !374, line: 331, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
