; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/lrc/lrc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/lrc/lrc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 624, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!327 = !{!328, !359, !439, !419, !356, !1202, !1320, !429, !72, !379, !1323, !1325, !514, !5}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LRC", file: !330, line: 11, baseType: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/lrc/lrc.c", directory: "/home/users/ndemeye/xSDK")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 4, size: 576, elements: !332)
!332 = !{!333, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !331, file: !330, line: 5, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !337, line: 436, size: 23424, elements: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!338 = !{!339, !548, !1055, !1075, !1076, !1077, !1079, !1080, !1081, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1208, !1209, !1225, !1226, !1227, !1228, !1229, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1264, !1284, !1285, !1287, !1288, !1289, !1290, !1291, !1292, !1310, !1311}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !336, file: !337, line: 437, baseType: !340, size: 4480)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !341, line: 122, baseType: !342)
!341 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !341, line: 73, size: 4480, elements: !343)
!343 = !{!344, !346, !400, !401, !403, !406, !407, !408, !409, !417, !418, !420, !424, !428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !440, !442, !443, !444, !446, !447, !449, !451, !452, !453, !454, !455, !458, !460, !461, !462, !463, !464, !467, !469, !470, !471, !481, !483, !484, !488, !489, !538, !543, !545, !546, !547}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !342, file: !341, line: 74, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !342, file: !341, line: 75, baseType: !347, size: 448, offset: 64)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 448, elements: !398)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !341, line: 53, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 45, size: 448, elements: !350)
!350 = !{!351, !362, !370, !375, !382, !386, !393}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !349, file: !341, line: 46, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !356, !358}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !321, line: 330, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !321, line: 330, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !349, file: !341, line: 47, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!355, !356, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !367, line: 16, baseType: !368)
!367 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !367, line: 16, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !349, file: !341, line: 48, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!355, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !349, file: !341, line: 49, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!355, !356, !379, !356}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !349, file: !341, line: 50, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!355, !356, !379, !374}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !349, file: !341, line: 51, baseType: !387, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!355, !356, !379, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{null}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !349, file: !341, line: 52, baseType: !394, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!355, !356, !379, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!398 = !{!399}
!399 = !DISubrange(count: 1)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !342, file: !341, line: 76, baseType: !359, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !341, line: 77, baseType: !402, size: 32, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !342, file: !341, line: 78, baseType: !404, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !405)
!405 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !342, file: !341, line: 78, baseType: !404, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !342, file: !341, line: 78, baseType: !404, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !342, file: !341, line: 78, baseType: !404, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !342, file: !341, line: 79, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !413, line: 27, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !415, line: 43, baseType: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!416 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !342, file: !341, line: 80, baseType: !402, size: 32, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !342, file: !341, line: 81, baseType: !419, size: 32, offset: 992)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !342, file: !341, line: 82, baseType: !421, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !342, file: !341, line: 83, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !342, file: !341, line: 84, baseType: !429, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !342, file: !341, line: 85, baseType: !429, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !342, file: !341, line: 86, baseType: !429, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !342, file: !341, line: 87, baseType: !429, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !342, file: !341, line: 88, baseType: !356, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !342, file: !341, line: 89, baseType: !410, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !341, line: 90, baseType: !429, size: 64, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !342, file: !341, line: 91, baseType: !429, size: 64, offset: 1600)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !342, file: !341, line: 92, baseType: !402, size: 32, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !342, file: !341, line: 93, baseType: !439, size: 64, offset: 1728)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !342, file: !341, line: 94, baseType: !441, size: 64, offset: 1792)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !411)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !342, file: !341, line: 95, baseType: !402, size: 32, offset: 1856)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !342, file: !341, line: 95, baseType: !402, size: 32, offset: 1888)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !342, file: !341, line: 96, baseType: !445, size: 64, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !342, file: !341, line: 96, baseType: !445, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !342, file: !341, line: 97, baseType: !448, size: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !342, file: !341, line: 97, baseType: !450, size: 64, offset: 2112)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !342, file: !341, line: 98, baseType: !402, size: 32, offset: 2176)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !342, file: !341, line: 98, baseType: !402, size: 32, offset: 2208)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !342, file: !341, line: 99, baseType: !445, size: 64, offset: 2240)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !342, file: !341, line: 99, baseType: !445, size: 64, offset: 2304)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !342, file: !341, line: 100, baseType: !456, size: 64, offset: 2368)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !405)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !342, file: !341, line: 100, baseType: !459, size: 64, offset: 2432)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !342, file: !341, line: 101, baseType: !402, size: 32, offset: 2496)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !342, file: !341, line: 101, baseType: !402, size: 32, offset: 2528)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !342, file: !341, line: 102, baseType: !445, size: 64, offset: 2560)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !342, file: !341, line: 102, baseType: !445, size: 64, offset: 2624)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !342, file: !341, line: 103, baseType: !465, size: 64, offset: 2688)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !457)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !342, file: !341, line: 103, baseType: !468, size: 64, offset: 2752)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !342, file: !341, line: 104, baseType: !397, size: 64, offset: 2816)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !342, file: !341, line: 105, baseType: !402, size: 32, offset: 2880)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !342, file: !341, line: 106, baseType: !472, size: 128, offset: 2944)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 128, elements: !479)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !341, line: 64, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 61, size: 128, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !475, file: !341, line: 62, baseType: !390, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !475, file: !341, line: 63, baseType: !439, size: 64, offset: 64)
!479 = !{!480}
!480 = !DISubrange(count: 2)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !342, file: !341, line: 107, baseType: !482, size: 64, offset: 3072)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 64, elements: !479)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !342, file: !341, line: 108, baseType: !439, size: 64, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !342, file: !341, line: 109, baseType: !485, size: 64, offset: 3200)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!355, !439}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !342, file: !341, line: 111, baseType: !402, size: 32, offset: 3264)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !342, file: !341, line: 112, baseType: !490, size: 320, offset: 3328)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 320, elements: !536)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!355, !494, !356, !439}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !497)
!497 = !{!498, !499, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !496, file: !10, line: 100, baseType: !402, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !10, line: 101, baseType: !500, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !511, !512, !513, !517, !519, !521, !522, !523}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !502, file: !10, line: 84, baseType: !429, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !502, file: !10, line: 85, baseType: !429, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !502, file: !10, line: 86, baseType: !439, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !502, file: !10, line: 87, baseType: !421, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !502, file: !10, line: 88, baseType: !509, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !502, file: !10, line: 89, baseType: !381, size: 8, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !502, file: !10, line: 90, baseType: !429, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !502, file: !10, line: 91, baseType: !514, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !515, line: 46, baseType: !516)
!515 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!516 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !502, file: !10, line: 92, baseType: !518, size: 32, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !10, line: 93, baseType: !520, size: 32, offset: 544)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !10, line: 94, baseType: !500, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !502, file: !10, line: 95, baseType: !429, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !502, file: !10, line: 96, baseType: !439, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !496, file: !10, line: 102, baseType: !429, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !496, file: !10, line: 102, baseType: !429, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !496, file: !10, line: 103, baseType: !429, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !496, file: !10, line: 104, baseType: !359, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !496, file: !10, line: 105, baseType: !518, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !496, file: !10, line: 105, baseType: !518, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !496, file: !10, line: 105, baseType: !518, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !496, file: !10, line: 106, baseType: !356, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !496, file: !10, line: 107, baseType: !533, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!536 = !{!537}
!537 = !DISubrange(count: 5)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !342, file: !341, line: 113, baseType: !539, size: 320, offset: 3648)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 320, elements: !536)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!355, !356, !439}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !342, file: !341, line: 114, baseType: !544, size: 320, offset: 3968)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 320, elements: !536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !342, file: !341, line: 115, baseType: !518, size: 32, offset: 4288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !342, file: !341, line: 120, baseType: !533, size: 64, offset: 4352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !342, file: !341, line: 121, baseType: !518, size: 32, offset: 4416)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !336, file: !337, line: 437, baseType: !549, size: 9472, offset: 4480)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 9472, elements: !398)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !337, line: 32, size: 9472, elements: !551)
!551 = !{!552, !561, !565, !566, !573, !577, !578, !579, !580, !581, !582, !583, !607, !611, !616, !622, !641, !646, !650, !651, !656, !661, !662, !667, !671, !675, !679, !683, !687, !688, !689, !690, !691, !695, !696, !701, !702, !703, !704, !705, !710, !717, !722, !726, !730, !734, !738, !739, !743, !744, !751, !756, !757, !758, !759, !821, !829, !830, !834, !835, !839, !840, !844, !849, !850, !854, !858, !865, !866, !867, !868, !869, !870, !875, !876, !880, !884, !888, !889, !890, !894, !904, !905, !909, !910, !914, !915, !919, !920, !925, !926, !930, !934, !935, !936, !937, !938, !939, !940, !944, !945, !946, !947, !948, !949, !953, !954, !955, !956, !957, !958, !959, !960, !964, !968, !969, !970, !974, !975, !976, !977, !978, !979, !980, !984, !985, !986, !991, !995, !996, !1000, !1001, !1002, !1003, !1029, !1033, !1034, !1035, !1036, !1037, !1041, !1042, !1043, !1044, !1045, !1049, !1053, !1054}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !550, file: !337, line: 34, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!355, !334, !402, !556, !402, !556, !558, !560}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !550, file: !337, line: 35, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!355, !334, !402, !448, !450, !468}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !550, file: !337, line: 36, baseType: !562, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !550, file: !337, line: 37, baseType: !567, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!355, !334, !570, !570}
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !550, file: !337, line: 38, baseType: !574, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!355, !334, !570, !570, !570}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !550, file: !337, line: 40, baseType: !567, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !550, file: !337, line: 41, baseType: !574, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !550, file: !337, line: 42, baseType: !567, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !550, file: !337, line: 43, baseType: !574, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !550, file: !337, line: 44, baseType: !567, size: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !550, file: !337, line: 46, baseType: !574, size: 64, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !550, file: !337, line: 47, baseType: !584, size: 64, offset: 704)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!355, !334, !587, !587, !591}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !588, line: 11, baseType: !589)
!588 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !588, line: 11, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !594, file: !36, line: 1227, baseType: !457, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !594, file: !36, line: 1228, baseType: !457, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !594, file: !36, line: 1229, baseType: !457, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !594, file: !36, line: 1230, baseType: !457, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !594, file: !36, line: 1231, baseType: !457, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !594, file: !36, line: 1232, baseType: !457, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !594, file: !36, line: 1233, baseType: !457, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !594, file: !36, line: 1234, baseType: !457, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !594, file: !36, line: 1236, baseType: !457, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !594, file: !36, line: 1237, baseType: !457, size: 64, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !594, file: !36, line: 1238, baseType: !457, size: 64, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !550, file: !337, line: 48, baseType: !608, size: 64, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!355, !334, !587, !591}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !550, file: !337, line: 49, baseType: !612, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!355, !334, !570, !457, !615, !457, !402, !402, !570}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !550, file: !337, line: 50, baseType: !617, size: 64, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!355, !334, !620, !621}
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !550, file: !337, line: 52, baseType: !623, size: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!355, !334, !626, !627}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !629, file: !36, line: 593, baseType: !404, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !629, file: !36, line: 594, baseType: !404, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !629, file: !36, line: 594, baseType: !404, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !629, file: !36, line: 594, baseType: !404, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !629, file: !36, line: 595, baseType: !404, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !629, file: !36, line: 596, baseType: !404, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !629, file: !36, line: 597, baseType: !404, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !629, file: !36, line: 598, baseType: !404, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !629, file: !36, line: 598, baseType: !404, size: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !629, file: !36, line: 599, baseType: !404, size: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !550, file: !337, line: 53, baseType: !642, size: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!355, !334, !334, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !550, file: !337, line: 54, baseType: !647, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!355, !334, !570}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !550, file: !337, line: 55, baseType: !567, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !550, file: !337, line: 56, baseType: !652, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!355, !334, !655, !456}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !550, file: !337, line: 58, baseType: !657, size: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!355, !334, !660}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !550, file: !337, line: 59, baseType: !657, size: 64, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !550, file: !337, line: 60, baseType: !663, size: 64, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!355, !334, !666, !518}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !550, file: !337, line: 61, baseType: !668, size: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!355, !334}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !550, file: !337, line: 63, baseType: !672, size: 64, offset: 1536)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!355, !334, !402, !556, !466, !570, !570}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !550, file: !337, line: 64, baseType: !676, size: 64, offset: 1600)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!355, !334, !334, !587, !587, !591}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !550, file: !337, line: 65, baseType: !680, size: 64, offset: 1664)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!355, !334, !334, !591}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !550, file: !337, line: 66, baseType: !684, size: 64, offset: 1728)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!355, !334, !334, !587, !591}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !550, file: !337, line: 67, baseType: !680, size: 64, offset: 1792)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !550, file: !337, line: 69, baseType: !668, size: 64, offset: 1856)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !550, file: !337, line: 70, baseType: !676, size: 64, offset: 1920)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !550, file: !337, line: 71, baseType: !684, size: 64, offset: 1984)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !550, file: !337, line: 72, baseType: !692, size: 64, offset: 2048)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!355, !334, !621}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !550, file: !337, line: 73, baseType: !668, size: 64, offset: 2112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !550, file: !337, line: 75, baseType: !697, size: 64, offset: 2176)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!355, !334, !700, !621}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !550, file: !337, line: 76, baseType: !567, size: 64, offset: 2240)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !550, file: !337, line: 77, baseType: !567, size: 64, offset: 2304)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !550, file: !337, line: 78, baseType: !584, size: 64, offset: 2368)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !550, file: !337, line: 79, baseType: !608, size: 64, offset: 2432)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !550, file: !337, line: 81, baseType: !706, size: 64, offset: 2496)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!355, !334, !466, !334, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !550, file: !337, line: 82, baseType: !711, size: 64, offset: 2560)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!355, !334, !402, !714, !714, !620, !716}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !550, file: !337, line: 83, baseType: !718, size: 64, offset: 2624)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!355, !334, !402, !721, !402}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !550, file: !337, line: 84, baseType: !723, size: 64, offset: 2688)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!355, !334, !402, !556, !402, !556, !465}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !550, file: !337, line: 85, baseType: !727, size: 64, offset: 2752)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!355, !334, !334, !709}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !550, file: !337, line: 87, baseType: !731, size: 64, offset: 2816)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!355, !334, !570, !448}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !550, file: !337, line: 88, baseType: !735, size: 64, offset: 2880)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!355, !334, !466}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !550, file: !337, line: 89, baseType: !735, size: 64, offset: 2944)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !550, file: !337, line: 90, baseType: !740, size: 64, offset: 3008)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!355, !334, !570, !560}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !550, file: !337, line: 91, baseType: !672, size: 64, offset: 3072)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !550, file: !337, line: 93, baseType: !745, size: 64, offset: 3136)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!355, !334, !748}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !550, file: !337, line: 94, baseType: !752, size: 64, offset: 3200)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!355, !334, !402, !518, !518, !448, !755, !755, !645}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !550, file: !337, line: 95, baseType: !752, size: 64, offset: 3264)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !550, file: !337, line: 96, baseType: !752, size: 64, offset: 3328)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !550, file: !337, line: 97, baseType: !752, size: 64, offset: 3392)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !550, file: !337, line: 99, baseType: !760, size: 64, offset: 3456)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!355, !334, !763, !766}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !588, line: 51, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !588, line: 51, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !337, line: 609, size: 6208, elements: !769)
!769 = !{!770, !771, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !790, !797, !798, !799, !800, !801, !802, !803, !804, !808, !809, !810, !811, !812, !814, !815, !816, !817, !818, !819, !820}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !768, file: !337, line: 610, baseType: !340, size: 4480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !768, file: !337, line: 610, baseType: !772, size: 32, offset: 4480)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !398)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !768, file: !337, line: 611, baseType: !402, size: 32, offset: 4512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !768, file: !337, line: 611, baseType: !402, size: 32, offset: 4544)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !768, file: !337, line: 611, baseType: !402, size: 32, offset: 4576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !768, file: !337, line: 612, baseType: !402, size: 32, offset: 4608)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !768, file: !337, line: 613, baseType: !402, size: 32, offset: 4640)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !768, file: !337, line: 614, baseType: !448, size: 64, offset: 4672)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !768, file: !337, line: 615, baseType: !450, size: 64, offset: 4736)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !768, file: !337, line: 616, baseType: !721, size: 64, offset: 4800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !768, file: !337, line: 617, baseType: !448, size: 64, offset: 4864)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !768, file: !337, line: 618, baseType: !783, size: 64, offset: 4928)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !337, line: 602, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 598, size: 128, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !785, file: !337, line: 599, baseType: !402, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !785, file: !337, line: 600, baseType: !402, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !785, file: !337, line: 601, baseType: !465, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !768, file: !337, line: 619, baseType: !791, size: 64, offset: 4992)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !337, line: 607, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 604, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !793, file: !337, line: 605, baseType: !402, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !793, file: !337, line: 606, baseType: !465, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !768, file: !337, line: 620, baseType: !465, size: 64, offset: 5056)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !768, file: !337, line: 621, baseType: !457, size: 64, offset: 5120)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !768, file: !337, line: 622, baseType: !457, size: 64, offset: 5184)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !768, file: !337, line: 623, baseType: !570, size: 64, offset: 5248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !768, file: !337, line: 623, baseType: !570, size: 64, offset: 5312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !768, file: !337, line: 623, baseType: !570, size: 64, offset: 5376)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !768, file: !337, line: 624, baseType: !518, size: 32, offset: 5440)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !768, file: !337, line: 625, baseType: !805, size: 64, offset: 5504)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!355}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !768, file: !337, line: 626, baseType: !439, size: 64, offset: 5568)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !768, file: !337, line: 627, baseType: !570, size: 64, offset: 5632)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !768, file: !337, line: 628, baseType: !402, size: 32, offset: 5696)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !768, file: !337, line: 629, baseType: !379, size: 64, offset: 5760)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !768, file: !337, line: 630, baseType: !813, size: 32, offset: 5824)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !768, file: !337, line: 631, baseType: !402, size: 32, offset: 5856)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !768, file: !337, line: 631, baseType: !402, size: 32, offset: 5888)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !768, file: !337, line: 632, baseType: !518, size: 32, offset: 5920)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !768, file: !337, line: 633, baseType: !518, size: 32, offset: 5952)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !768, file: !337, line: 634, baseType: !390, size: 64, offset: 6016)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !768, file: !337, line: 634, baseType: !439, size: 64, offset: 6080)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !768, file: !337, line: 635, baseType: !410, size: 64, offset: 6144)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !550, file: !337, line: 100, baseType: !822, size: 64, offset: 3520)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!355, !334, !402, !402, !825, !828}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !827)
!827 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !550, file: !337, line: 101, baseType: !668, size: 64, offset: 3584)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !550, file: !337, line: 102, baseType: !831, size: 64, offset: 3648)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!355, !334, !587, !587, !621}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !550, file: !337, line: 103, baseType: !553, size: 64, offset: 3712)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !550, file: !337, line: 105, baseType: !836, size: 64, offset: 3776)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!355, !334, !587, !587, !620, !621}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !550, file: !337, line: 106, baseType: !668, size: 64, offset: 3840)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !550, file: !337, line: 107, baseType: !841, size: 64, offset: 3904)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!355, !334, !366}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !550, file: !337, line: 108, baseType: !845, size: 64, offset: 3968)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!355, !334, !848, !620, !621}
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !379)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !550, file: !337, line: 109, baseType: !805, size: 64, offset: 4032)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !550, file: !337, line: 111, baseType: !851, size: 64, offset: 4096)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!355, !334, !334, !334, !457, !334}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !550, file: !337, line: 112, baseType: !855, size: 64, offset: 4160)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!355, !334, !334, !334, !334}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !550, file: !337, line: 113, baseType: !859, size: 64, offset: 4224)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!355, !334, !862, !862}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !588, line: 30, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !588, line: 30, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !550, file: !337, line: 114, baseType: !553, size: 64, offset: 4288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !550, file: !337, line: 115, baseType: !672, size: 64, offset: 4352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !550, file: !337, line: 117, baseType: !731, size: 64, offset: 4416)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !550, file: !337, line: 118, baseType: !731, size: 64, offset: 4480)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !550, file: !337, line: 119, baseType: !845, size: 64, offset: 4544)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !550, file: !337, line: 120, baseType: !871, size: 64, offset: 4608)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!355, !334, !874, !645}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !550, file: !337, line: 121, baseType: !805, size: 64, offset: 4672)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !550, file: !337, line: 123, baseType: !877, size: 64, offset: 4736)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!355, !334, !402, !439}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !550, file: !337, line: 124, baseType: !881, size: 64, offset: 4800)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!355, !334, !766, !570, !439}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !550, file: !337, line: 125, baseType: !885, size: 64, offset: 4864)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!355, !494, !334}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !550, file: !337, line: 126, baseType: !567, size: 64, offset: 4928)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !550, file: !337, line: 127, baseType: !567, size: 64, offset: 4992)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !550, file: !337, line: 129, baseType: !891, size: 64, offset: 5056)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!355, !334, !721}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !550, file: !337, line: 130, baseType: !895, size: 64, offset: 5120)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!355, !334, !898, !898}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !900, file: !60, line: 653, baseType: !402, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !900, file: !60, line: 653, baseType: !570, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !550, file: !337, line: 131, baseType: !895, size: 64, offset: 5184)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !550, file: !337, line: 132, baseType: !906, size: 64, offset: 5248)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!355, !334, !448, !448, !448}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !550, file: !337, line: 133, baseType: !841, size: 64, offset: 5312)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !550, file: !337, line: 135, baseType: !911, size: 64, offset: 5376)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!355, !334, !457, !645}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !550, file: !337, line: 136, baseType: !911, size: 64, offset: 5440)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !550, file: !337, line: 137, baseType: !916, size: 64, offset: 5504)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!355, !334, !645}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !550, file: !337, line: 138, baseType: !553, size: 64, offset: 5568)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !550, file: !337, line: 139, baseType: !921, size: 64, offset: 5632)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!355, !334, !924, !924}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !550, file: !337, line: 141, baseType: !805, size: 64, offset: 5696)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !550, file: !337, line: 142, baseType: !927, size: 64, offset: 5760)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!355, !334, !334, !457, !334}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !550, file: !337, line: 143, baseType: !931, size: 64, offset: 5824)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!355, !334, !334, !334}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !550, file: !337, line: 144, baseType: !805, size: 64, offset: 5888)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !550, file: !337, line: 145, baseType: !927, size: 64, offset: 5952)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !550, file: !337, line: 147, baseType: !931, size: 64, offset: 6016)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !550, file: !337, line: 148, baseType: !805, size: 64, offset: 6080)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !550, file: !337, line: 149, baseType: !927, size: 64, offset: 6144)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !550, file: !337, line: 150, baseType: !931, size: 64, offset: 6208)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !550, file: !337, line: 151, baseType: !941, size: 64, offset: 6272)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!355, !334, !518}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !550, file: !337, line: 153, baseType: !668, size: 64, offset: 6336)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !550, file: !337, line: 154, baseType: !668, size: 64, offset: 6400)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !550, file: !337, line: 155, baseType: !668, size: 64, offset: 6464)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !550, file: !337, line: 156, baseType: !668, size: 64, offset: 6528)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !550, file: !337, line: 157, baseType: !841, size: 64, offset: 6592)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !550, file: !337, line: 159, baseType: !950, size: 64, offset: 6656)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!355, !334, !402, !558}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !550, file: !337, line: 160, baseType: !668, size: 64, offset: 6720)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !550, file: !337, line: 161, baseType: !668, size: 64, offset: 6784)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !550, file: !337, line: 162, baseType: !668, size: 64, offset: 6848)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !550, file: !337, line: 163, baseType: !668, size: 64, offset: 6912)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !550, file: !337, line: 165, baseType: !931, size: 64, offset: 6976)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !550, file: !337, line: 166, baseType: !931, size: 64, offset: 7040)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !550, file: !337, line: 167, baseType: !731, size: 64, offset: 7104)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !550, file: !337, line: 168, baseType: !961, size: 64, offset: 7168)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!355, !334, !570, !402}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !550, file: !337, line: 169, baseType: !965, size: 64, offset: 7232)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!355, !334, !645, !448}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !550, file: !337, line: 171, baseType: !692, size: 64, offset: 7296)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !550, file: !337, line: 172, baseType: !668, size: 64, offset: 7360)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !550, file: !337, line: 173, baseType: !971, size: 64, offset: 7424)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!355, !334, !448, !755}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !550, file: !337, line: 174, baseType: !831, size: 64, offset: 7488)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !550, file: !337, line: 175, baseType: !831, size: 64, offset: 7552)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !550, file: !337, line: 177, baseType: !567, size: 64, offset: 7616)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !550, file: !337, line: 178, baseType: !617, size: 64, offset: 7680)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !550, file: !337, line: 179, baseType: !567, size: 64, offset: 7744)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !550, file: !337, line: 180, baseType: !574, size: 64, offset: 7808)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !550, file: !337, line: 181, baseType: !981, size: 64, offset: 7872)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!355, !334, !359, !620, !621}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !550, file: !337, line: 183, baseType: !891, size: 64, offset: 7936)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !550, file: !337, line: 184, baseType: !652, size: 64, offset: 8000)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !550, file: !337, line: 185, baseType: !987, size: 64, offset: 8064)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!355, !334, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !550, file: !337, line: 186, baseType: !992, size: 64, offset: 8128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!355, !334, !402, !556, !465}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !550, file: !337, line: 187, baseType: !711, size: 64, offset: 8192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !550, file: !337, line: 189, baseType: !997, size: 64, offset: 8256)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!355, !334, !402, !402, !448, !558}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !550, file: !337, line: 190, baseType: !805, size: 64, offset: 8320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !550, file: !337, line: 191, baseType: !927, size: 64, offset: 8384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !550, file: !337, line: 192, baseType: !931, size: 64, offset: 8448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !550, file: !337, line: 193, baseType: !1004, size: 64, offset: 8512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!355, !334, !763, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !337, line: 660, size: 5312, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1009, file: !337, line: 661, baseType: !340, size: 4480)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1009, file: !337, line: 661, baseType: !772, size: 32, offset: 4480)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1009, file: !337, line: 662, baseType: !402, size: 32, offset: 4512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1009, file: !337, line: 662, baseType: !402, size: 32, offset: 4544)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1009, file: !337, line: 662, baseType: !402, size: 32, offset: 4576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1009, file: !337, line: 663, baseType: !402, size: 32, offset: 4608)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1009, file: !337, line: 664, baseType: !402, size: 32, offset: 4640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1009, file: !337, line: 665, baseType: !448, size: 64, offset: 4672)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1009, file: !337, line: 666, baseType: !448, size: 64, offset: 4736)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1009, file: !337, line: 667, baseType: !402, size: 32, offset: 4800)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1009, file: !337, line: 668, baseType: !813, size: 32, offset: 4832)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1009, file: !337, line: 670, baseType: !448, size: 64, offset: 4864)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1009, file: !337, line: 670, baseType: !448, size: 64, offset: 4928)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1009, file: !337, line: 671, baseType: !448, size: 64, offset: 4992)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1009, file: !337, line: 672, baseType: !448, size: 64, offset: 5056)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1009, file: !337, line: 673, baseType: !448, size: 64, offset: 5120)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1009, file: !337, line: 674, baseType: !402, size: 32, offset: 5184)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1009, file: !337, line: 675, baseType: !448, size: 64, offset: 5248)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !550, file: !337, line: 195, baseType: !1030, size: 64, offset: 8576)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!355, !1007, !334, !334}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !550, file: !337, line: 196, baseType: !1030, size: 64, offset: 8640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !550, file: !337, line: 197, baseType: !805, size: 64, offset: 8704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !550, file: !337, line: 198, baseType: !927, size: 64, offset: 8768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !550, file: !337, line: 199, baseType: !931, size: 64, offset: 8832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !550, file: !337, line: 201, baseType: !1038, size: 64, offset: 8896)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!355, !334, !402, !402}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !550, file: !337, line: 202, baseType: !706, size: 64, offset: 8960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !550, file: !337, line: 203, baseType: !574, size: 64, offset: 9024)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !550, file: !337, line: 204, baseType: !760, size: 64, offset: 9088)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !550, file: !337, line: 205, baseType: !891, size: 64, offset: 9152)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !550, file: !337, line: 206, baseType: !1046, size: 64, offset: 9216)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!355, !359, !334, !402, !620, !621}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !550, file: !337, line: 208, baseType: !1050, size: 64, offset: 9280)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!355, !402, !716}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !550, file: !337, line: 209, baseType: !931, size: 64, offset: 9344)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !550, file: !337, line: 210, baseType: !723, size: 64, offset: 9408)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !336, file: !337, line: 438, baseType: !1056, size: 64, offset: 13952)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !588, line: 60, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1058, file: !114, line: 241, baseType: !359, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1058, file: !114, line: 242, baseType: !419, size: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1058, file: !114, line: 243, baseType: !402, size: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1058, file: !114, line: 243, baseType: !402, size: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1058, file: !114, line: 244, baseType: !402, size: 32, offset: 160)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1058, file: !114, line: 244, baseType: !402, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1058, file: !114, line: 245, baseType: !448, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1058, file: !114, line: 246, baseType: !518, size: 32, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1058, file: !114, line: 247, baseType: !402, size: 32, offset: 352)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1058, file: !114, line: 251, baseType: !402, size: 32, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1058, file: !114, line: 252, baseType: !862, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1058, file: !114, line: 253, baseType: !518, size: 32, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1058, file: !114, line: 254, baseType: !402, size: 32, offset: 544)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1058, file: !114, line: 254, baseType: !402, size: 32, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1058, file: !114, line: 255, baseType: !402, size: 32, offset: 608)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !336, file: !337, line: 438, baseType: !1056, size: 64, offset: 14016)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !337, line: 439, baseType: !439, size: 64, offset: 14080)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !336, file: !337, line: 440, baseType: !1078, size: 32, offset: 14144)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !336, file: !337, line: 441, baseType: !518, size: 32, offset: 14176)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !336, file: !337, line: 442, baseType: !518, size: 32, offset: 14208)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !336, file: !337, line: 443, baseType: !1082, size: 448, offset: 14272)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 448, elements: !1084)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !379)
!1084 = !{!1085}
!1085 = !DISubrange(count: 7)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !336, file: !337, line: 444, baseType: !518, size: 32, offset: 14720)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !336, file: !337, line: 445, baseType: !518, size: 32, offset: 14752)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !336, file: !337, line: 446, baseType: !402, size: 32, offset: 14784)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !336, file: !337, line: 447, baseType: !441, size: 64, offset: 14848)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !336, file: !337, line: 448, baseType: !441, size: 64, offset: 14912)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !336, file: !337, line: 449, baseType: !628, size: 640, offset: 14976)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !336, file: !337, line: 450, baseType: !560, size: 32, offset: 15616)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !336, file: !337, line: 451, baseType: !1094, size: 2880, offset: 15680)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !337, line: 318, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !337, line: 319, size: 2880, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1116, !1117, !1122, !1127, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1142, !1143, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1175, !1176, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1199, !1200, !1201, !1205, !1206}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1095, file: !337, line: 320, baseType: !402, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1095, file: !337, line: 321, baseType: !402, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1095, file: !337, line: 322, baseType: !402, size: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1095, file: !337, line: 323, baseType: !402, size: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1095, file: !337, line: 324, baseType: !402, size: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1095, file: !337, line: 325, baseType: !402, size: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1095, file: !337, line: 326, baseType: !1104, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !337, line: 293, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !337, line: 295, size: 448, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1106, file: !337, line: 296, baseType: !1104, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1106, file: !337, line: 297, baseType: !465, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1106, file: !337, line: 297, baseType: !465, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1106, file: !337, line: 298, baseType: !448, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1106, file: !337, line: 298, baseType: !448, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1106, file: !337, line: 299, baseType: !402, size: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1106, file: !337, line: 300, baseType: !402, size: 32, offset: 352)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1106, file: !337, line: 301, baseType: !402, size: 32, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1095, file: !337, line: 326, baseType: !1104, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1095, file: !337, line: 328, baseType: !1118, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!355, !334, !1121, !448}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1095, file: !337, line: 329, baseType: !1123, size: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!355, !1121, !1126, !450, !450, !468, !448}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1095, file: !337, line: 330, baseType: !1128, size: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!355, !1121}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1095, file: !337, line: 331, baseType: !1128, size: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1095, file: !337, line: 334, baseType: !359, size: 64, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !337, line: 335, baseType: !419, size: 32, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1095, file: !337, line: 335, baseType: !419, size: 32, offset: 672)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1095, file: !337, line: 336, baseType: !419, size: 32, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1095, file: !337, line: 336, baseType: !419, size: 32, offset: 736)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1095, file: !337, line: 337, baseType: !1138, size: 64, offset: 768)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !321, line: 339, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !321, line: 339, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1095, file: !337, line: 338, baseType: !1138, size: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1095, file: !337, line: 339, baseType: !1144, size: 64, offset: 896)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !321, line: 341, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !321, line: 351, size: 192, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1146, file: !321, line: 354, baseType: !72, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1146, file: !321, line: 355, baseType: !72, size: 32, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1146, file: !321, line: 356, baseType: !72, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1146, file: !321, line: 361, baseType: !72, size: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1146, file: !321, line: 362, baseType: !514, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1095, file: !337, line: 340, baseType: !402, size: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1095, file: !337, line: 340, baseType: !402, size: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1095, file: !337, line: 341, baseType: !465, size: 64, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1095, file: !337, line: 342, baseType: !448, size: 64, offset: 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1095, file: !337, line: 343, baseType: !468, size: 64, offset: 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1095, file: !337, line: 344, baseType: !450, size: 64, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1095, file: !337, line: 345, baseType: !402, size: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1095, file: !337, line: 346, baseType: !1126, size: 64, offset: 1344)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1095, file: !337, line: 347, baseType: !518, size: 32, offset: 1408)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1095, file: !337, line: 348, baseType: !402, size: 32, offset: 1440)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1095, file: !337, line: 351, baseType: !518, size: 32, offset: 1472)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1095, file: !337, line: 352, baseType: !518, size: 32, offset: 1504)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1095, file: !337, line: 353, baseType: !419, size: 32, offset: 1536)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1095, file: !337, line: 354, baseType: !419, size: 32, offset: 1568)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1095, file: !337, line: 355, baseType: !1126, size: 64, offset: 1600)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1095, file: !337, line: 356, baseType: !1126, size: 64, offset: 1664)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1095, file: !337, line: 357, baseType: !1170, size: 64, offset: 1728)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !337, line: 310, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 308, size: 32, elements: !1173)
!1173 = !{!1174}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1172, file: !337, line: 309, baseType: !402, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1095, file: !337, line: 357, baseType: !1170, size: 64, offset: 1792)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1095, file: !337, line: 358, baseType: !1177, size: 64, offset: 1856)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !337, line: 316, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 312, size: 128, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1179, file: !337, line: 313, baseType: !439, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1179, file: !337, line: 314, baseType: !402, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1179, file: !337, line: 315, baseType: !381, size: 8, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1095, file: !337, line: 359, baseType: !1177, size: 64, offset: 1920)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1095, file: !337, line: 360, baseType: !1177, size: 64, offset: 1984)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1095, file: !337, line: 361, baseType: !402, size: 32, offset: 2048)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1095, file: !337, line: 362, baseType: !419, size: 32, offset: 2080)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1095, file: !337, line: 363, baseType: !402, size: 32, offset: 2112)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1095, file: !337, line: 364, baseType: !1126, size: 64, offset: 2176)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1095, file: !337, line: 365, baseType: !1144, size: 64, offset: 2240)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1095, file: !337, line: 366, baseType: !419, size: 32, offset: 2304)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1095, file: !337, line: 367, baseType: !419, size: 32, offset: 2336)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1095, file: !337, line: 368, baseType: !1138, size: 64, offset: 2368)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1095, file: !337, line: 369, baseType: !1138, size: 64, offset: 2432)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1095, file: !337, line: 370, baseType: !1196, size: 64, offset: 2496)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1095, file: !337, line: 371, baseType: !1196, size: 64, offset: 2560)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1095, file: !337, line: 372, baseType: !1196, size: 64, offset: 2624)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1095, file: !337, line: 373, baseType: !1202, size: 64, offset: 2688)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !321, line: 331, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !321, line: 331, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1095, file: !337, line: 374, baseType: !514, size: 64, offset: 2752)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1095, file: !337, line: 375, baseType: !1207, size: 64, offset: 2816)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !336, file: !337, line: 451, baseType: !1094, size: 2880, offset: 18560)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !336, file: !337, line: 452, baseType: !1210, size: 64, offset: 21440)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !337, line: 681, size: 4864, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1219, !1220, !1224}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1212, file: !337, line: 682, baseType: !340, size: 4480)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1212, file: !337, line: 682, baseType: !772, size: 32, offset: 4480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1212, file: !337, line: 683, baseType: !518, size: 32, offset: 4512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1212, file: !337, line: 684, baseType: !402, size: 32, offset: 4544)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1212, file: !337, line: 685, baseType: !924, size: 64, offset: 4608)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1212, file: !337, line: 686, baseType: !465, size: 64, offset: 4672)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1212, file: !337, line: 687, baseType: !1221, size: 64, offset: 4736)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!355, !1210, !570, !439}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1212, file: !337, line: 688, baseType: !439, size: 64, offset: 4800)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !336, file: !337, line: 453, baseType: !1210, size: 64, offset: 21504)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !336, file: !337, line: 454, baseType: !1210, size: 64, offset: 21568)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !336, file: !337, line: 455, baseType: !402, size: 32, offset: 21632)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !336, file: !337, line: 456, baseType: !518, size: 32, offset: 21664)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !336, file: !337, line: 457, baseType: !1230, size: 320, offset: 21696)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !337, line: 399, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 394, size: 320, elements: !1232)
!1232 = !{!1233, !1234, !1238, !1239}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1231, file: !337, line: 395, baseType: !402, size: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1231, file: !337, line: 396, baseType: !1235, size: 128, offset: 32)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 128, elements: !1236)
!1236 = !{!1237}
!1237 = !DISubrange(count: 4)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1231, file: !337, line: 397, baseType: !1235, size: 128, offset: 160)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1231, file: !337, line: 398, baseType: !518, size: 32, offset: 288)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !336, file: !337, line: 458, baseType: !518, size: 32, offset: 22016)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !336, file: !337, line: 458, baseType: !518, size: 32, offset: 22048)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !336, file: !337, line: 458, baseType: !518, size: 32, offset: 22080)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !336, file: !337, line: 458, baseType: !518, size: 32, offset: 22112)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !336, file: !337, line: 459, baseType: !518, size: 32, offset: 22144)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !336, file: !337, line: 459, baseType: !518, size: 32, offset: 22176)
