; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtext.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtext.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscDrawXiFont = type { i64, i32, i32, i32, i64 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.anon = type { i32, i32, i32 }
%struct.PetscDraw_X = type { %struct._XDisplay*, i32, %struct.Visual*, i32, %struct.PetscDrawXiGC, %struct.PetscDrawXiFont*, i64, i64, i64, i32, i64, i64, [256 x i64], [256 x [3 x i8]], i32, i32, i32, i32 }
%struct._XDisplay = type opaque
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.PetscDrawXiGC = type { %struct._XGC*, i64 }
%struct._XGC = type opaque
%struct.XGCValues = type { i32, i64, i64, i64, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32, i32, i64, i32, i32, i32, i32, i64, i32, i8 }
%struct.XFontStruct = type { %struct._XExtData*, i64, i32, i32, i32, i32, i32, i32, i32, i32, %struct.XFontProp*, %struct.XCharStruct, %struct.XCharStruct, %struct.XCharStruct*, i32, i32 }
%struct.XFontProp = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "curfont", scope: !2, file: !3, line: 22, type: !63, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "PetscDrawXiFontFixed", scope: !3, file: !3, line: 20, type: !4, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !136)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtext.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !8, !8, !96}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw_X", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/impls/x/ximpl.h", directory: "/home/users/ndemeye/xSDK")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 27, size: 23488, elements: !13)
!13 = !{!14, !19, !20, !51, !52, !62, !74, !76, !78, !80, !81, !82, !83, !87, !92, !93, !94, !95}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !12, file: !11, line: 28, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !17, line: 487, baseType: !18)
!17 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !17, line: 255, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !12, file: !11, line: 29, baseType: !8, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vis", scope: !12, file: !11, line: 30, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !17, line: 238, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 227, size: 448, elements: !24)
!24 = !{!25, !41, !45, !46, !47, !48, !49, !50}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !23, file: !17, line: 228, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !17, line: 155, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !17, line: 148, size: 256, elements: !29)
!29 = !{!30, !31, !33, !37}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !28, file: !17, line: 149, baseType: !8, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !17, line: 150, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !28, file: !17, line: 151, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!8, !32}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !28, file: !17, line: 154, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !17, line: 80, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !23, file: !17, line: 229, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !43, line: 76, baseType: !44)
!43 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !23, file: !17, line: 233, baseType: !8, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !23, file: !17, line: 235, baseType: !44, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !23, file: !17, line: 235, baseType: !44, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !23, file: !17, line: 235, baseType: !44, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !23, file: !17, line: 236, baseType: !8, size: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !23, file: !17, line: 237, baseType: !8, size: 32, offset: 416)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !12, file: !11, line: 31, baseType: !8, size: 32, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !12, file: !11, line: 32, baseType: !53, size: 128, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiGC", file: !11, line: 18, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 15, size: 128, elements: !55)
!55 = !{!56, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !54, file: !11, line: 16, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !17, line: 222, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !17, line: 214, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pix", scope: !54, file: !11, line: 17, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiPixVal", file: !11, line: 13, baseType: !44)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !12, file: !11, line: 33, baseType: !63, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawXiFont", file: !11, line: 25, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 20, size: 256, elements: !66)
!66 = !{!67, !70, !71, !72, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fnt", scope: !65, file: !11, line: 21, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Font", file: !43, line: 100, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !43, line: 66, baseType: !44)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "font_w", scope: !65, file: !11, line: 22, baseType: !8, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "font_h", scope: !65, file: !11, line: 22, baseType: !8, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "font_descent", scope: !65, file: !11, line: 23, baseType: !8, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "font_pix", scope: !65, file: !11, line: 24, baseType: !61, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !12, file: !11, line: 34, baseType: !75, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !43, line: 96, baseType: !69)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "drw", scope: !12, file: !11, line: 35, baseType: !77, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !43, line: 97, baseType: !69)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !12, file: !11, line: 36, baseType: !79, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !43, line: 104, baseType: !69)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cmapsize", scope: !12, file: !11, line: 37, baseType: !8, size: 32, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !12, file: !11, line: 38, baseType: !61, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !12, file: !11, line: 39, baseType: !61, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cmapping", scope: !12, file: !11, line: 40, baseType: !84, size: 16384, offset: 832)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 16384, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cpalette", scope: !12, file: !11, line: 41, baseType: !88, size: 6144, offset: 17216)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 6144, elements: !90)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !{!86, !91}
!91 = !DISubrange(count: 3)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !12, file: !11, line: 42, baseType: !8, size: 32, offset: 23360)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !12, file: !11, line: 42, baseType: !8, size: 32, offset: 23392)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !12, file: !11, line: 42, baseType: !8, size: 32, offset: 23424)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !12, file: !11, line: 42, baseType: !8, size: 32, offset: 23456)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !111, globals: !121, splitDebugInlining: false, nameTableKind: None)
!98 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/x/xtext.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!99 = !{!100, !107}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 663, baseType: !102, size: 32, elements: !103)
!101 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !102, size: 32, elements: !108)
!108 = !{!109, !110}
!109 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!111 = !{!112, !116, !117, !119}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !113, line: 330, baseType: !114)
!113 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !113, line: 330, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !44)
!118 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!121 = !{!0, !122, !124, !134}
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "font", scope: !2, file: !3, line: 22, type: !63, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "nfonts", scope: !97, file: !3, line: 40, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 1920, elements: !132)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 96, elements: !128)
!128 = !{!129, !130, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !127, file: !3, line: 39, baseType: !8, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !127, file: !3, line: 39, baseType: !8, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !127, file: !3, line: 39, baseType: !8, size: 32, offset: 64)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "act_nfonts", scope: !97, file: !3, line: 41, type: !8, isLocal: true, isDefinition: true)
!136 = !{!137, !138, !139, !140, !141, !142, !146, !148, !150}
!137 = !DILocalVariable(name: "XBWin", arg: 1, scope: !2, file: !3, line: 20, type: !9)
!138 = !DILocalVariable(name: "w", arg: 2, scope: !2, file: !3, line: 20, type: !8)
!139 = !DILocalVariable(name: "h", arg: 3, scope: !2, file: !3, line: 20, type: !8)
!140 = !DILocalVariable(name: "outfont", arg: 4, scope: !2, file: !3, line: 20, type: !96)
!141 = !DILocalVariable(name: "ierr", scope: !2, file: !3, line: 23, type: !6)
!142 = !DILocalVariable(name: "ierr__", scope: !143, file: !3, line: 26, type: !6)
!143 = distinct !DILexicalBlock(scope: !144, file: !3, line: 26, column: 54)
!144 = distinct !DILexicalBlock(scope: !145, file: !3, line: 26, column: 17)
!145 = distinct !DILexicalBlock(scope: !2, file: !3, line: 26, column: 7)
!146 = !DILocalVariable(name: "ierr__", scope: !147, file: !3, line: 27, type: !6)
!147 = distinct !DILexicalBlock(scope: !2, file: !3, line: 27, column: 26)
!148 = !DILocalVariable(name: "ierr__", scope: !149, file: !3, line: 28, type: !6)
!149 = distinct !DILexicalBlock(scope: !2, file: !3, line: 28, column: 45)
!150 = !DILocalVariable(name: "ierr__", scope: !151, file: !3, line: 29, type: !6)
!151 = distinct !DILexicalBlock(scope: !2, file: !3, line: 29, column: 42)
!152 = !{i32 7, !"Dwarf Version", i32 4}
!153 = !{i32 2, !"Debug Info Version", i32 3}
!154 = !{i32 1, !"wchar_size", i32 4}
!155 = !{i32 7, !"PIC Level", i32 2}
!156 = !{i32 7, !"uwtable", i32 1}
!157 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!158 = !DILocation(line: 0, scope: !2)
!159 = !DILocation(line: 25, column: 3, scope: !160)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 25, column: 3)
!161 = distinct !DILexicalBlock(scope: !162, file: !3, line: 25, column: 3)
!162 = distinct !DILexicalBlock(scope: !2, file: !3, line: 25, column: 3)
!163 = !{!164, !164, i64 0}
!164 = !{!"any pointer", !165, i64 0}
!165 = !{!"omnipotent char", !166, i64 0}
!166 = !{!"Simple C/C++ TBAA"}
!167 = !DILocation(line: 25, column: 3, scope: !161)
!168 = !DILocation(line: 25, column: 3, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 25, column: 3)
!170 = distinct !DILexicalBlock(scope: !160, file: !3, line: 25, column: 3)
!171 = !{!172, !173, i64 1536}
!172 = !{!"", !165, i64 0, !165, i64 512, !165, i64 1024, !165, i64 1280, !173, i64 1536, !173, i64 1540, !165, i64 1544}
!173 = !{!"int", !165, i64 0}
!174 = !DILocation(line: 25, column: 3, scope: !170)
!175 = !DILocation(line: 25, column: 3, scope: !176)
!176 = distinct !DILexicalBlock(scope: !169, file: !3, line: 25, column: 3)
!177 = !{!173, !173, i64 0}
!178 = !{!172, !173, i64 1540}
!179 = !DILocation(line: 26, column: 8, scope: !145)
!180 = !DILocation(line: 26, column: 7, scope: !2)
!181 = !DILocalVariable(name: "XBWin", arg: 1, scope: !182, file: !3, line: 74, type: !9)
!182 = distinct !DISubprogram(name: "PetscDrawXiInitFonts", scope: !3, file: !3, line: 74, type: !183, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{!6, !9}
!185 = !{!181, !186, !188, !189, !190, !191, !231, !237, !238}
!186 = !DILocalVariable(name: "names", scope: !182, file: !3, line: 76, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!188 = !DILocalVariable(name: "cnt", scope: !182, file: !3, line: 77, type: !8)
!189 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 77, type: !8)
!190 = !DILocalVariable(name: "j", scope: !182, file: !3, line: 77, type: !8)
!191 = !DILocalVariable(name: "info", scope: !182, file: !3, line: 78, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFontStruct", file: !17, line: 1052, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1035, size: 768, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !214, !226, !227, !229, !230}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !194, file: !17, line: 1036, baseType: !26, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !194, file: !17, line: 1037, baseType: !68, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !194, file: !17, line: 1038, baseType: !102, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "min_char_or_byte2", scope: !194, file: !17, line: 1039, baseType: !102, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "max_char_or_byte2", scope: !194, file: !17, line: 1040, baseType: !102, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "min_byte1", scope: !194, file: !17, line: 1041, baseType: !102, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "max_byte1", scope: !194, file: !17, line: 1042, baseType: !102, size: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "all_chars_exist", scope: !194, file: !17, line: 1043, baseType: !8, size: 32, offset: 288)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "default_char", scope: !194, file: !17, line: 1044, baseType: !102, size: 32, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "n_properties", scope: !194, file: !17, line: 1045, baseType: !8, size: 32, offset: 352)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !194, file: !17, line: 1046, baseType: !207, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFontProp", file: !17, line: 1033, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1030, size: 128, elements: !210)
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !17, line: 1031, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !43, line: 74, baseType: !44)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "card32", scope: !209, file: !17, line: 1032, baseType: !44, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "min_bounds", scope: !194, file: !17, line: 1047, baseType: !215, size: 96, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCharStruct", file: !17, line: 1024, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 1017, size: 96, elements: !217)
!217 = !{!218, !220, !221, !222, !223, !224}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lbearing", scope: !216, file: !17, line: 1018, baseType: !219, size: 16)
!219 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rbearing", scope: !216, file: !17, line: 1019, baseType: !219, size: 16, offset: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !216, file: !17, line: 1020, baseType: !219, size: 16, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !216, file: !17, line: 1021, baseType: !219, size: 16, offset: 48)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !216, file: !17, line: 1022, baseType: !219, size: 16, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !216, file: !17, line: 1023, baseType: !225, size: 16, offset: 80)
!225 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "max_bounds", scope: !194, file: !17, line: 1048, baseType: !215, size: 96, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "per_char", scope: !194, file: !17, line: 1049, baseType: !228, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !194, file: !17, line: 1050, baseType: !8, size: 32, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !194, file: !17, line: 1051, baseType: !8, size: 32, offset: 736)
!231 = !DILocalVariable(name: "ierr", scope: !232, file: !3, line: 102, type: !6)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 101, column: 27)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 101, column: 5)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 101, column: 5)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 97, column: 20)
!236 = distinct !DILexicalBlock(scope: !182, file: !3, line: 97, column: 7)
!237 = !DILocalVariable(name: "len", scope: !232, file: !3, line: 103, type: !117)
!238 = !DILocalVariable(name: "ierr__", scope: !239, file: !3, line: 105, type: !6)
!239 = distinct !DILexicalBlock(scope: !232, file: !3, line: 105, column: 41)
!240 = !DILocation(line: 0, scope: !182, inlinedAt: !241)
!241 = distinct !DILocation(line: 26, column: 26, scope: !144)
!242 = !DILocation(line: 77, column: 3, scope: !182, inlinedAt: !241)
!243 = !DILocation(line: 78, column: 3, scope: !182, inlinedAt: !241)
!244 = !DILocation(line: 80, column: 3, scope: !245, inlinedAt: !241)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 80, column: 3)
!246 = distinct !DILexicalBlock(scope: !247, file: !3, line: 80, column: 3)
!247 = distinct !DILexicalBlock(scope: !182, file: !3, line: 80, column: 3)
!248 = !DILocation(line: 80, column: 3, scope: !246, inlinedAt: !241)
!249 = !DILocation(line: 80, column: 3, scope: !250, inlinedAt: !241)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 80, column: 3)
!251 = distinct !DILexicalBlock(scope: !245, file: !3, line: 80, column: 3)
!252 = !DILocation(line: 80, column: 3, scope: !251, inlinedAt: !241)
!253 = !DILocation(line: 80, column: 3, scope: !254, inlinedAt: !241)
!254 = distinct !DILexicalBlock(scope: !250, file: !3, line: 80, column: 3)
!255 = !DILocation(line: 82, column: 37, scope: !182, inlinedAt: !241)
!256 = !{!257, !164, i64 0}
!257 = !{!"", !164, i64 0, !173, i64 8, !164, i64 16, !173, i64 24, !258, i64 32, !164, i64 48, !259, i64 56, !259, i64 64, !259, i64 72, !173, i64 80, !259, i64 88, !259, i64 96, !165, i64 104, !165, i64 2152, !173, i64 2920, !173, i64 2924, !173, i64 2928, !173, i64 2932}
!258 = !{!"", !164, i64 0, !259, i64 8}
!259 = !{!"long", !165, i64 0}
!260 = !DILocation(line: 82, column: 11, scope: !182, inlinedAt: !241)
!261 = !DILocation(line: 84, column: 15, scope: !262, inlinedAt: !241)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 84, column: 3)
!263 = distinct !DILexicalBlock(scope: !182, file: !3, line: 84, column: 3)
!264 = !DILocation(line: 84, column: 14, scope: !262, inlinedAt: !241)
!265 = !DILocation(line: 84, column: 3, scope: !263, inlinedAt: !241)
!266 = !DILocation(line: 93, column: 14, scope: !182, inlinedAt: !241)
!267 = !DILocation(line: 97, column: 7, scope: !182, inlinedAt: !241)
!268 = !DILocation(line: 85, column: 5, scope: !269, inlinedAt: !241)
!269 = distinct !DILexicalBlock(scope: !262, file: !3, line: 84, column: 25)
!270 = !DILocation(line: 85, column: 23, scope: !269, inlinedAt: !241)
!271 = !{!165, !165, i64 0}
!272 = !DILocation(line: 86, column: 25, scope: !269, inlinedAt: !241)
!273 = !DILocation(line: 86, column: 44, scope: !269, inlinedAt: !241)
!274 = !{!275, !277, i64 72}
!275 = !{!"", !164, i64 0, !259, i64 8, !173, i64 16, !173, i64 20, !173, i64 24, !173, i64 28, !173, i64 32, !173, i64 36, !173, i64 40, !173, i64 44, !164, i64 48, !276, i64 56, !276, i64 68, !164, i64 80, !173, i64 88, !173, i64 92}
!276 = !{!"", !277, i64 0, !277, i64 2, !277, i64 4, !277, i64 6, !277, i64 8, !277, i64 10}
!277 = !{!"short", !165, i64 0}
!278 = !DILocation(line: 86, column: 5, scope: !269, inlinedAt: !241)
!279 = !DILocation(line: 86, column: 15, scope: !269, inlinedAt: !241)
!280 = !DILocation(line: 86, column: 23, scope: !269, inlinedAt: !241)
!281 = !{!282, !173, i64 0}
!282 = !{!"", !173, i64 0, !173, i64 4, !173, i64 8}
!283 = !DILocation(line: 87, column: 33, scope: !269, inlinedAt: !241)
!284 = !{!275, !173, i64 88}
!285 = !DILocation(line: 87, column: 50, scope: !269, inlinedAt: !241)
!286 = !{!275, !173, i64 92}
!287 = !DILocation(line: 87, column: 40, scope: !269, inlinedAt: !241)
!288 = !DILocation(line: 87, column: 15, scope: !269, inlinedAt: !241)
!289 = !DILocation(line: 87, column: 23, scope: !269, inlinedAt: !241)
!290 = !{!282, !173, i64 4}
!291 = !DILocation(line: 88, column: 15, scope: !269, inlinedAt: !241)
!292 = !DILocation(line: 88, column: 23, scope: !269, inlinedAt: !241)
!293 = !{!282, !173, i64 8}
!294 = !DILocation(line: 89, column: 21, scope: !295, inlinedAt: !241)
!295 = distinct !DILexicalBlock(scope: !269, file: !3, line: 89, column: 9)
!296 = !DILocation(line: 89, column: 26, scope: !295, inlinedAt: !241)
!297 = !DILocation(line: 90, column: 6, scope: !269, inlinedAt: !241)
!298 = !DILocation(line: 91, column: 11, scope: !299, inlinedAt: !241)
!299 = distinct !DILexicalBlock(scope: !269, file: !3, line: 91, column: 9)
!300 = !DILocation(line: 91, column: 9, scope: !269, inlinedAt: !241)
!301 = !DILocation(line: 84, column: 21, scope: !262, inlinedAt: !241)
!302 = distinct !{!302, !265, !303, !304}
!303 = !DILocation(line: 92, column: 3, scope: !263, inlinedAt: !241)
!304 = !{!"llvm.loop.mustprogress"}
!305 = !DILocation(line: 94, column: 7, scope: !306, inlinedAt: !241)
!306 = distinct !DILexicalBlock(scope: !182, file: !3, line: 94, column: 7)
!307 = !DILocation(line: 94, column: 11, scope: !306, inlinedAt: !241)
!308 = !DILocation(line: 94, column: 7, scope: !182, inlinedAt: !241)
!309 = !DILocation(line: 94, column: 16, scope: !306, inlinedAt: !241)
!310 = !DILocation(line: 97, column: 8, scope: !236, inlinedAt: !241)
!311 = !DILocation(line: 99, column: 39, scope: !235, inlinedAt: !241)
!312 = !DILocation(line: 99, column: 13, scope: !235, inlinedAt: !241)
!313 = !DILocation(line: 101, column: 17, scope: !233, inlinedAt: !241)
!314 = !DILocation(line: 101, column: 16, scope: !233, inlinedAt: !241)
!315 = !DILocation(line: 101, column: 5, scope: !234, inlinedAt: !241)
!316 = !DILocation(line: 103, column: 7, scope: !232, inlinedAt: !241)
!317 = !DILocation(line: 105, column: 26, scope: !232, inlinedAt: !241)
!318 = !DILocation(line: 0, scope: !232, inlinedAt: !241)
!319 = !DILocation(line: 105, column: 14, scope: !232, inlinedAt: !241)
!320 = !DILocation(line: 0, scope: !239, inlinedAt: !241)
!321 = !DILocation(line: 105, column: 41, scope: !322, inlinedAt: !241)
!322 = distinct !DILexicalBlock(scope: !239, file: !3, line: 105, column: 41)
!323 = !DILocation(line: 105, column: 41, scope: !239, inlinedAt: !241)
!324 = !{!"branch_weights", i32 2000, i32 1}
!325 = !DILocation(line: 106, column: 11, scope: !326, inlinedAt: !241)
!326 = distinct !DILexicalBlock(scope: !232, file: !3, line: 106, column: 11)
!327 = !{!259, !259, i64 0}
!328 = !DILocation(line: 106, column: 15, scope: !326, inlinedAt: !241)
!329 = !DILocation(line: 106, column: 11, scope: !232, inlinedAt: !241)
!330 = !DILocation(line: 107, column: 7, scope: !232, inlinedAt: !241)
!331 = !DILocation(line: 107, column: 25, scope: !232, inlinedAt: !241)
!332 = !DILocation(line: 108, column: 27, scope: !232, inlinedAt: !241)
!333 = !DILocation(line: 108, column: 46, scope: !232, inlinedAt: !241)
!334 = !DILocation(line: 108, column: 7, scope: !232, inlinedAt: !241)
!335 = !DILocation(line: 108, column: 17, scope: !232, inlinedAt: !241)
!336 = !DILocation(line: 108, column: 25, scope: !232, inlinedAt: !241)
!337 = !DILocation(line: 110, column: 35, scope: !232, inlinedAt: !241)
!338 = !DILocation(line: 110, column: 52, scope: !232, inlinedAt: !241)
!339 = !DILocation(line: 110, column: 42, scope: !232, inlinedAt: !241)
!340 = !DILocation(line: 110, column: 17, scope: !232, inlinedAt: !241)
!341 = !DILocation(line: 110, column: 25, scope: !232, inlinedAt: !241)
!342 = !DILocation(line: 111, column: 17, scope: !232, inlinedAt: !241)
!343 = !DILocation(line: 111, column: 25, scope: !232, inlinedAt: !241)
!344 = !DILocation(line: 112, column: 23, scope: !345, inlinedAt: !241)
!345 = distinct !DILexicalBlock(scope: !232, file: !3, line: 112, column: 11)
!346 = !DILocation(line: 112, column: 28, scope: !345, inlinedAt: !241)
!347 = !DILocation(line: 113, column: 8, scope: !232, inlinedAt: !241)
!348 = !DILocation(line: 114, column: 13, scope: !349, inlinedAt: !241)
!349 = distinct !DILexicalBlock(scope: !232, file: !3, line: 114, column: 11)
!350 = !DILocation(line: 0, scope: !233, inlinedAt: !241)
!351 = !DILocation(line: 115, column: 5, scope: !233, inlinedAt: !241)
!352 = !DILocation(line: 117, column: 30, scope: !235, inlinedAt: !241)
!353 = !DILocation(line: 101, column: 23, scope: !233, inlinedAt: !241)
!354 = distinct !{!354, !315, !355, !304}
!355 = !DILocation(line: 115, column: 5, scope: !234, inlinedAt: !241)
!356 = !DILocation(line: 100, column: 11, scope: !235, inlinedAt: !241)
!357 = !DILocation(line: 116, column: 16, scope: !235, inlinedAt: !241)
!358 = !DILocation(line: 117, column: 25, scope: !235, inlinedAt: !241)
!359 = !DILocation(line: 117, column: 5, scope: !235, inlinedAt: !241)
!360 = !DILocation(line: 118, column: 3, scope: !235, inlinedAt: !241)
!361 = !DILocation(line: 119, column: 3, scope: !362, inlinedAt: !241)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 119, column: 3)
!363 = distinct !DILexicalBlock(scope: !364, file: !3, line: 119, column: 3)
!364 = distinct !DILexicalBlock(scope: !182, file: !3, line: 119, column: 3)
!365 = !DILocation(line: 119, column: 3, scope: !363, inlinedAt: !241)
!366 = !DILocation(line: 119, column: 3, scope: !367, inlinedAt: !241)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 119, column: 3)
!368 = distinct !DILexicalBlock(scope: !362, file: !3, line: 119, column: 3)
!369 = !DILocation(line: 119, column: 3, scope: !368, inlinedAt: !241)
!370 = !DILocation(line: 119, column: 3, scope: !371, inlinedAt: !241)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 119, column: 3)
!372 = distinct !DILexicalBlock(scope: !367, file: !3, line: 119, column: 3)
!373 = !{!172, !165, i64 1544}
!374 = !DILocation(line: 119, column: 3, scope: !372, inlinedAt: !241)
!375 = !DILocation(line: 119, column: 3, scope: !376, inlinedAt: !241)
!376 = distinct !DILexicalBlock(scope: !371, file: !3, line: 119, column: 3)
!377 = !DILocation(line: 119, column: 3, scope: !378, inlinedAt: !241)
!378 = distinct !DILexicalBlock(scope: !367, file: !3, line: 119, column: 3)
!379 = !DILocation(line: 119, column: 3, scope: !380, inlinedAt: !241)
!380 = distinct !DILexicalBlock(scope: !378, file: !3, line: 119, column: 3)
!381 = !DILocation(line: 119, column: 3, scope: !382, inlinedAt: !241)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 119, column: 3)
!383 = distinct !DILexicalBlock(scope: !380, file: !3, line: 119, column: 3)
!384 = !DILocation(line: 119, column: 3, scope: !383, inlinedAt: !241)
!385 = !DILocation(line: 119, column: 3, scope: !386, inlinedAt: !241)
!386 = distinct !DILexicalBlock(scope: !382, file: !3, line: 119, column: 3)
!387 = !DILocation(line: 120, column: 1, scope: !182, inlinedAt: !241)
!388 = !DILocation(line: 0, scope: !143)
!389 = !DILocation(line: 26, column: 54, scope: !143)
!390 = !DILocation(line: 26, column: 54, scope: !391)
!391 = distinct !DILexicalBlock(scope: !143, file: !3, line: 26, column: 54)
!392 = !DILocation(line: 27, column: 10, scope: !2)
!393 = !DILocation(line: 0, scope: !147)
!394 = !DILocation(line: 27, column: 26, scope: !395)
!395 = distinct !DILexicalBlock(scope: !147, file: !3, line: 27, column: 26)
!396 = !DILocation(line: 27, column: 26, scope: !147)
!397 = !DILocation(line: 28, column: 35, scope: !2)
!398 = !DILocalVariable(name: "font", arg: 1, scope: !399, file: !3, line: 122, type: !63)
!399 = distinct !DISubprogram(name: "PetscDrawXiMatchFontSize", scope: !3, file: !3, line: 122, type: !400, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{!6, !63, !8, !8}
!402 = !{!398, !403, !404, !405, !406, !407, !408}
!403 = !DILocalVariable(name: "w", arg: 2, scope: !399, file: !3, line: 122, type: !8)
!404 = !DILocalVariable(name: "h", arg: 3, scope: !399, file: !3, line: 122, type: !8)
!405 = !DILocalVariable(name: "i", scope: !399, file: !3, line: 124, type: !8)
!406 = !DILocalVariable(name: "max", scope: !399, file: !3, line: 124, type: !8)
!407 = !DILocalVariable(name: "imax", scope: !399, file: !3, line: 124, type: !8)
!408 = !DILocalVariable(name: "tmp", scope: !399, file: !3, line: 124, type: !8)
!409 = !DILocation(line: 0, scope: !399, inlinedAt: !410)
!410 = distinct !DILocation(line: 28, column: 10, scope: !2)
!411 = !DILocation(line: 126, column: 3, scope: !412, inlinedAt: !410)
!412 = distinct !DILexicalBlock(scope: !413, file: !3, line: 126, column: 3)
!413 = distinct !DILexicalBlock(scope: !414, file: !3, line: 126, column: 3)
!414 = distinct !DILexicalBlock(scope: !399, file: !3, line: 126, column: 3)
!415 = !DILocation(line: 126, column: 3, scope: !413, inlinedAt: !410)
!416 = !DILocation(line: 126, column: 3, scope: !417, inlinedAt: !410)
!417 = distinct !DILexicalBlock(scope: !418, file: !3, line: 126, column: 3)
!418 = distinct !DILexicalBlock(scope: !412, file: !3, line: 126, column: 3)
!419 = !DILocation(line: 126, column: 3, scope: !418, inlinedAt: !410)
!420 = !DILocation(line: 126, column: 3, scope: !421, inlinedAt: !410)
!421 = distinct !DILexicalBlock(scope: !417, file: !3, line: 126, column: 3)
!422 = !DILocation(line: 127, column: 14, scope: !423, inlinedAt: !410)
!423 = distinct !DILexicalBlock(scope: !424, file: !3, line: 127, column: 3)
!424 = distinct !DILexicalBlock(scope: !399, file: !3, line: 127, column: 3)
!425 = !DILocation(line: 127, column: 3, scope: !424, inlinedAt: !410)
!426 = !DILocation(line: 128, column: 19, scope: !427, inlinedAt: !410)
!427 = distinct !DILexicalBlock(scope: !428, file: !3, line: 128, column: 9)
!428 = distinct !DILexicalBlock(scope: !423, file: !3, line: 127, column: 32)
!429 = !DILocation(line: 128, column: 21, scope: !427, inlinedAt: !410)
!430 = !DILocation(line: 128, column: 26, scope: !427, inlinedAt: !410)
!431 = !DILocation(line: 128, column: 39, scope: !427, inlinedAt: !410)
!432 = !DILocation(line: 128, column: 41, scope: !427, inlinedAt: !410)
!433 = !DILocation(line: 128, column: 9, scope: !428, inlinedAt: !410)
!434 = !DILocation(line: 128, column: 9, scope: !427, inlinedAt: !410)
!435 = !DILocation(line: 129, column: 13, scope: !436, inlinedAt: !410)
!436 = distinct !DILexicalBlock(scope: !427, file: !3, line: 128, column: 47)
!437 = !DILocation(line: 129, column: 26, scope: !436, inlinedAt: !410)
!438 = !{!439, !173, i64 8}
!439 = !{!"", !259, i64 0, !173, i64 8, !173, i64 12, !173, i64 16, !259, i64 24}
!440 = !DILocation(line: 130, column: 13, scope: !436, inlinedAt: !410)
!441 = !DILocation(line: 130, column: 26, scope: !436, inlinedAt: !410)
!442 = !{!439, !173, i64 12}
!443 = !DILocation(line: 131, column: 38, scope: !436, inlinedAt: !410)
!444 = !DILocation(line: 131, column: 13, scope: !436, inlinedAt: !410)
!445 = !DILocation(line: 131, column: 26, scope: !436, inlinedAt: !410)
!446 = !{!439, !173, i64 16}
!447 = !DILocation(line: 132, column: 7, scope: !448, inlinedAt: !410)
!448 = distinct !DILexicalBlock(scope: !449, file: !3, line: 132, column: 7)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 132, column: 7)
!450 = distinct !DILexicalBlock(scope: !436, file: !3, line: 132, column: 7)
!451 = !DILocation(line: 132, column: 7, scope: !449, inlinedAt: !410)
!452 = !DILocation(line: 132, column: 7, scope: !453, inlinedAt: !410)
!453 = distinct !DILexicalBlock(scope: !454, file: !3, line: 132, column: 7)
!454 = distinct !DILexicalBlock(scope: !448, file: !3, line: 132, column: 7)
!455 = !DILocation(line: 132, column: 7, scope: !454, inlinedAt: !410)
!456 = !DILocation(line: 132, column: 7, scope: !457, inlinedAt: !410)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 132, column: 7)
!458 = distinct !DILexicalBlock(scope: !453, file: !3, line: 132, column: 7)
!459 = !DILocation(line: 132, column: 7, scope: !458, inlinedAt: !410)
!460 = !DILocation(line: 132, column: 7, scope: !461, inlinedAt: !410)
!461 = distinct !DILexicalBlock(scope: !457, file: !3, line: 132, column: 7)
!462 = !DILocation(line: 132, column: 7, scope: !463, inlinedAt: !410)
!463 = distinct !DILexicalBlock(scope: !453, file: !3, line: 132, column: 7)
!464 = !DILocation(line: 132, column: 7, scope: !465, inlinedAt: !410)
!465 = distinct !DILexicalBlock(scope: !463, file: !3, line: 132, column: 7)
!466 = !DILocation(line: 132, column: 7, scope: !467, inlinedAt: !410)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 132, column: 7)
!468 = distinct !DILexicalBlock(scope: !465, file: !3, line: 132, column: 7)
!469 = !DILocation(line: 132, column: 7, scope: !468, inlinedAt: !410)
!470 = !DILocation(line: 132, column: 7, scope: !471, inlinedAt: !410)
!471 = distinct !DILexicalBlock(scope: !467, file: !3, line: 132, column: 7)
!472 = !DILocation(line: 127, column: 28, scope: !423, inlinedAt: !410)
!473 = distinct !{!473, !425, !474, !304}
!474 = !DILocation(line: 134, column: 3, scope: !424, inlinedAt: !410)
!475 = !DILocation(line: 138, column: 10, scope: !399, inlinedAt: !410)
!476 = !DILocation(line: 139, column: 14, scope: !477, inlinedAt: !410)
!477 = distinct !DILexicalBlock(scope: !478, file: !3, line: 139, column: 3)
!478 = distinct !DILexicalBlock(scope: !399, file: !3, line: 139, column: 3)
!479 = !DILocation(line: 139, column: 3, scope: !478, inlinedAt: !410)
!480 = !DILocation(line: 140, column: 11, scope: !481, inlinedAt: !410)
!481 = distinct !DILexicalBlock(scope: !477, file: !3, line: 139, column: 32)
!482 = !DILocation(line: 141, column: 13, scope: !483, inlinedAt: !410)
!483 = distinct !DILexicalBlock(scope: !481, file: !3, line: 141, column: 9)
!484 = !DILocation(line: 141, column: 9, scope: !481, inlinedAt: !410)
!485 = !DILocation(line: 139, column: 28, scope: !477, inlinedAt: !410)
!486 = distinct !{!486, !479, !487, !304}
!487 = !DILocation(line: 142, column: 3, scope: !478, inlinedAt: !410)
!488 = !DILocation(line: 145, column: 37, scope: !399, inlinedAt: !410)
!489 = !DILocation(line: 146, column: 37, scope: !399, inlinedAt: !410)
!490 = !DILocation(line: 145, column: 24, scope: !399, inlinedAt: !410)
!491 = !DILocation(line: 145, column: 9, scope: !399, inlinedAt: !410)
!492 = !DILocation(line: 145, column: 22, scope: !399, inlinedAt: !410)
!493 = !DILocation(line: 146, column: 9, scope: !399, inlinedAt: !410)
!494 = !DILocation(line: 146, column: 22, scope: !399, inlinedAt: !410)
!495 = !DILocation(line: 147, column: 37, scope: !399, inlinedAt: !410)
!496 = !DILocation(line: 147, column: 9, scope: !399, inlinedAt: !410)
!497 = !DILocation(line: 147, column: 22, scope: !399, inlinedAt: !410)
!498 = !DILocation(line: 148, column: 3, scope: !499, inlinedAt: !410)
!499 = distinct !DILexicalBlock(scope: !500, file: !3, line: 148, column: 3)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 148, column: 3)
!501 = distinct !DILexicalBlock(scope: !399, file: !3, line: 148, column: 3)
!502 = !DILocation(line: 148, column: 3, scope: !500, inlinedAt: !410)
!503 = !DILocation(line: 148, column: 3, scope: !504, inlinedAt: !410)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 148, column: 3)
!505 = distinct !DILexicalBlock(scope: !499, file: !3, line: 148, column: 3)
!506 = !DILocation(line: 148, column: 3, scope: !505, inlinedAt: !410)
!507 = !DILocation(line: 148, column: 3, scope: !508, inlinedAt: !410)
!508 = distinct !DILexicalBlock(scope: !509, file: !3, line: 148, column: 3)
!509 = distinct !DILexicalBlock(scope: !504, file: !3, line: 148, column: 3)
!510 = !DILocation(line: 148, column: 3, scope: !509, inlinedAt: !410)
!511 = !DILocation(line: 148, column: 3, scope: !512, inlinedAt: !410)
!512 = distinct !DILexicalBlock(scope: !508, file: !3, line: 148, column: 3)
!513 = !DILocation(line: 148, column: 3, scope: !514, inlinedAt: !410)
!514 = distinct !DILexicalBlock(scope: !504, file: !3, line: 148, column: 3)
!515 = !DILocation(line: 148, column: 3, scope: !516, inlinedAt: !410)
!516 = distinct !DILexicalBlock(scope: !514, file: !3, line: 148, column: 3)
!517 = !DILocation(line: 148, column: 3, scope: !518, inlinedAt: !410)
!518 = distinct !DILexicalBlock(scope: !519, file: !3, line: 148, column: 3)
!519 = distinct !DILexicalBlock(scope: !516, file: !3, line: 148, column: 3)
!520 = !DILocation(line: 148, column: 3, scope: !519, inlinedAt: !410)
!521 = !DILocation(line: 148, column: 3, scope: !522, inlinedAt: !410)
!522 = distinct !DILexicalBlock(scope: !518, file: !3, line: 148, column: 3)
!523 = !DILocation(line: 29, column: 36, scope: !2)
!524 = !DILocalVariable(name: "XBWin", arg: 1, scope: !525, file: !3, line: 48, type: !9)
!525 = distinct !DISubprogram(name: "PetscDrawXiLoadFont", scope: !3, file: !3, line: 48, type: !526, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !97, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!6, !9, !63}
!528 = !{!524, !529, !530, !534, !535}
!529 = !DILocalVariable(name: "font", arg: 2, scope: !525, file: !3, line: 48, type: !63)
!530 = !DILocalVariable(name: "font_name", scope: !525, file: !3, line: 50, type: !531)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 800, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 100)
!534 = !DILocalVariable(name: "FontInfo", scope: !525, file: !3, line: 51, type: !192)
!535 = !DILocalVariable(name: "values", scope: !525, file: !3, line: 52, type: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGCValues", file: !17, line: 207, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 181, size: 1024, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !537, file: !17, line: 182, baseType: !8, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "plane_mask", scope: !537, file: !17, line: 183, baseType: !44, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "foreground", scope: !537, file: !17, line: 184, baseType: !44, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !537, file: !17, line: 185, baseType: !44, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "line_width", scope: !537, file: !17, line: 186, baseType: !8, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "line_style", scope: !537, file: !17, line: 187, baseType: !8, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cap_style", scope: !537, file: !17, line: 188, baseType: !8, size: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "join_style", scope: !537, file: !17, line: 190, baseType: !8, size: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fill_style", scope: !537, file: !17, line: 191, baseType: !8, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !537, file: !17, line: 193, baseType: !8, size: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "arc_mode", scope: !537, file: !17, line: 194, baseType: !8, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !537, file: !17, line: 195, baseType: !551, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixmap", file: !43, line: 102, baseType: !69)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stipple", scope: !537, file: !17, line: 196, baseType: !551, size: 64, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !537, file: !17, line: 197, baseType: !8, size: 32, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !537, file: !17, line: 198, baseType: !8, size: 32, offset: 672)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !537, file: !17, line: 199, baseType: !68, size: 64, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow_mode", scope: !537, file: !17, line: 200, baseType: !8, size: 32, offset: 768)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "graphics_exposures", scope: !537, file: !17, line: 201, baseType: !8, size: 32, offset: 800)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !537, file: !17, line: 202, baseType: !8, size: 32, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !537, file: !17, line: 203, baseType: !8, size: 32, offset: 864)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !537, file: !17, line: 204, baseType: !551, size: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !537, file: !17, line: 205, baseType: !8, size: 32, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dashes", scope: !537, file: !17, line: 206, baseType: !40, size: 8, offset: 992)
!563 = !DILocation(line: 0, scope: !525, inlinedAt: !564)
!564 = distinct !DILocation(line: 29, column: 10, scope: !2)
!565 = !DILocation(line: 50, column: 3, scope: !525, inlinedAt: !564)
!566 = !DILocation(line: 50, column: 15, scope: !525, inlinedAt: !564)
!567 = !DILocation(line: 52, column: 3, scope: !525, inlinedAt: !564)
!568 = !DILocation(line: 52, column: 15, scope: !525, inlinedAt: !564)
!569 = !DILocation(line: 54, column: 3, scope: !570, inlinedAt: !564)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 54, column: 3)
!571 = distinct !DILexicalBlock(scope: !572, file: !3, line: 54, column: 3)
!572 = distinct !DILexicalBlock(scope: !525, file: !3, line: 54, column: 3)
!573 = !DILocation(line: 54, column: 3, scope: !571, inlinedAt: !564)
!574 = !DILocation(line: 54, column: 3, scope: !575, inlinedAt: !564)
!575 = distinct !DILexicalBlock(scope: !576, file: !3, line: 54, column: 3)
!576 = distinct !DILexicalBlock(scope: !570, file: !3, line: 54, column: 3)
!577 = !DILocation(line: 54, column: 3, scope: !576, inlinedAt: !564)
!578 = !DILocation(line: 54, column: 3, scope: !579, inlinedAt: !564)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 54, column: 3)
!580 = !DILocation(line: 55, column: 42, scope: !525, inlinedAt: !564)
!581 = !DILocation(line: 55, column: 55, scope: !525, inlinedAt: !564)
!582 = !DILocation(line: 55, column: 10, scope: !525, inlinedAt: !564)
!583 = !DILocation(line: 56, column: 32, scope: !525, inlinedAt: !564)
!584 = !DILocation(line: 56, column: 15, scope: !525, inlinedAt: !564)
!585 = !DILocation(line: 56, column: 9, scope: !525, inlinedAt: !564)
!586 = !DILocation(line: 56, column: 13, scope: !525, inlinedAt: !564)
!587 = !{!439, !259, i64 0}
!588 = !DILocation(line: 60, column: 42, scope: !525, inlinedAt: !564)
!589 = !DILocation(line: 60, column: 24, scope: !525, inlinedAt: !564)
!590 = !DILocation(line: 61, column: 34, scope: !525, inlinedAt: !564)
!591 = !DILocation(line: 61, column: 9, scope: !525, inlinedAt: !564)
!592 = !DILocation(line: 61, column: 22, scope: !525, inlinedAt: !564)
!593 = !DILocation(line: 62, column: 45, scope: !525, inlinedAt: !564)
!594 = !{!275, !277, i64 70}
!595 = !DILocation(line: 62, column: 24, scope: !525, inlinedAt: !564)
!596 = !DILocation(line: 62, column: 77, scope: !525, inlinedAt: !564)
!597 = !{!275, !277, i64 56}
!598 = !DILocation(line: 62, column: 56, scope: !525, inlinedAt: !564)
!599 = !DILocation(line: 62, column: 54, scope: !525, inlinedAt: !564)
!600 = !DILocation(line: 62, column: 22, scope: !525, inlinedAt: !564)
!601 = !DILocation(line: 63, column: 45, scope: !525, inlinedAt: !564)
!602 = !{!275, !277, i64 74}
!603 = !DILocation(line: 63, column: 24, scope: !525, inlinedAt: !564)
!604 = !DILocation(line: 63, column: 75, scope: !525, inlinedAt: !564)
!605 = !{!275, !277, i64 76}
!606 = !DILocation(line: 63, column: 54, scope: !525, inlinedAt: !564)
!607 = !DILocation(line: 63, column: 52, scope: !525, inlinedAt: !564)
!608 = !DILocation(line: 63, column: 22, scope: !525, inlinedAt: !564)
!609 = !DILocation(line: 65, column: 3, scope: !525, inlinedAt: !564)
!610 = !DILocation(line: 68, column: 23, scope: !525, inlinedAt: !564)
!611 = !DILocation(line: 68, column: 10, scope: !525, inlinedAt: !564)
!612 = !DILocation(line: 68, column: 15, scope: !525, inlinedAt: !564)
!613 = !{!614, !259, i64 88}
!614 = !{!"", !173, i64 0, !259, i64 8, !259, i64 16, !259, i64 24, !173, i64 32, !173, i64 36, !173, i64 40, !173, i64 44, !173, i64 48, !173, i64 52, !173, i64 56, !259, i64 64, !259, i64 72, !173, i64 80, !173, i64 84, !259, i64 88, !173, i64 96, !173, i64 100, !173, i64 104, !173, i64 108, !259, i64 112, !173, i64 120, !165, i64 124}
!615 = !DILocation(line: 69, column: 20, scope: !525, inlinedAt: !564)
!616 = !DILocation(line: 69, column: 35, scope: !525, inlinedAt: !564)
!617 = !{!257, !164, i64 32}
