; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glle.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glle.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!102 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 6, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ts/impls/implicit/glle/glle.h", directory: "/home/users/ndemeye/xSDK")
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "TSGLLEERROR_FORWARD", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "TSGLLEERROR_BACKWARD", value: 1, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130}
!122 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 30, baseType: !7, size: 32, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!137 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 238, baseType: !40, size: 32, elements: !140)
!139 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!141 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!142 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!143 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!144 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!145 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!146 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!147 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!148 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!149 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!150 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!151 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!152 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!153 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!154 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!155 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!156 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!157 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !159)
!159 = !{!160}
!160 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!161 = !{!162, !166, !167, !370, !202, !371, !336, !373, !252, !279, !288, !957, !382, !242, !958, !961, !40, !7, !964, !965}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !163, line: 330, baseType: !164)
!163 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !163, line: 330, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !170, line: 73, size: 4480, elements: !171)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!171 = !{!172, !174, !223, !224, !226, !229, !230, !231, !232, !240, !241, !243, !247, !251, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266, !268, !269, !271, !273, !274, !275, !276, !277, !280, !282, !283, !284, !285, !286, !289, !291, !292, !293, !303, !305, !306, !310, !311, !360, !365, !367, !368, !369}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !169, file: !170, line: 74, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !169, file: !170, line: 75, baseType: !175, size: 448, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 448, elements: !221)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !170, line: 53, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 45, size: 448, elements: !178)
!178 = !{!179, !185, !193, !198, !205, !209, !216}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !177, file: !170, line: 46, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !167, !184}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !177, file: !170, line: 47, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!183, !167, !189}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !190, line: 16, baseType: !191)
!190 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !190, line: 16, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !177, file: !170, line: 48, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!183, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !177, file: !170, line: 49, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!183, !167, !202, !167}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !177, file: !170, line: 50, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!183, !167, !202, !197}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !177, file: !170, line: 51, baseType: !210, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!183, !167, !202, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !177, file: !170, line: 52, baseType: !217, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!183, !167, !202, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!221 = !{!222}
!222 = !DISubrange(count: 1)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !169, file: !170, line: 76, baseType: !162, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !170, line: 77, baseType: !225, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !169, file: !170, line: 78, baseType: !227, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !228)
!228 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !169, file: !170, line: 78, baseType: !227, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !169, file: !170, line: 78, baseType: !227, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !169, file: !170, line: 78, baseType: !227, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !169, file: !170, line: 79, baseType: !233, size: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !236, line: 27, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !238, line: 43, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!239 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !169, file: !170, line: 80, baseType: !225, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !169, file: !170, line: 81, baseType: !242, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !169, file: !170, line: 82, baseType: !244, size: 64, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !169, file: !170, line: 83, baseType: !248, size: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !169, file: !170, line: 84, baseType: !252, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !169, file: !170, line: 85, baseType: !252, size: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !169, file: !170, line: 86, baseType: !252, size: 64, offset: 1280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !169, file: !170, line: 87, baseType: !252, size: 64, offset: 1344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !169, file: !170, line: 88, baseType: !167, size: 64, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !169, file: !170, line: 89, baseType: !233, size: 64, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !170, line: 90, baseType: !252, size: 64, offset: 1536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !169, file: !170, line: 91, baseType: !252, size: 64, offset: 1600)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !169, file: !170, line: 92, baseType: !225, size: 32, offset: 1664)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !169, file: !170, line: 93, baseType: !166, size: 64, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !170, line: 94, baseType: !263, size: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !234)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !169, file: !170, line: 95, baseType: !225, size: 32, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !169, file: !170, line: 95, baseType: !225, size: 32, offset: 1888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !169, file: !170, line: 96, baseType: !267, size: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !169, file: !170, line: 96, baseType: !267, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !169, file: !170, line: 97, baseType: !270, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !169, file: !170, line: 97, baseType: !272, size: 64, offset: 2112)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !169, file: !170, line: 98, baseType: !225, size: 32, offset: 2176)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !169, file: !170, line: 98, baseType: !225, size: 32, offset: 2208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !169, file: !170, line: 99, baseType: !267, size: 64, offset: 2240)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !169, file: !170, line: 99, baseType: !267, size: 64, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !169, file: !170, line: 100, baseType: !278, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !228)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !169, file: !170, line: 100, baseType: !281, size: 64, offset: 2432)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !169, file: !170, line: 101, baseType: !225, size: 32, offset: 2496)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !169, file: !170, line: 101, baseType: !225, size: 32, offset: 2528)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !169, file: !170, line: 102, baseType: !267, size: 64, offset: 2560)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !169, file: !170, line: 102, baseType: !267, size: 64, offset: 2624)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !169, file: !170, line: 103, baseType: !287, size: 64, offset: 2688)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !279)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !169, file: !170, line: 103, baseType: !290, size: 64, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !169, file: !170, line: 104, baseType: !220, size: 64, offset: 2816)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !169, file: !170, line: 105, baseType: !225, size: 32, offset: 2880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !169, file: !170, line: 106, baseType: !294, size: 128, offset: 2944)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 128, elements: !301)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !170, line: 64, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 61, size: 128, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !170, line: 62, baseType: !213, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !297, file: !170, line: 63, baseType: !166, size: 64, offset: 64)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !169, file: !170, line: 107, baseType: !304, size: 64, offset: 3072)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !301)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !169, file: !170, line: 108, baseType: !166, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !169, file: !170, line: 109, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!183, !166}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !169, file: !170, line: 111, baseType: !225, size: 32, offset: 3264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !169, file: !170, line: 112, baseType: !312, size: 320, offset: 3328)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 320, elements: !358)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!183, !316, !167, !166}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !319)
!319 = !{!320, !321, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !12, line: 100, baseType: !225, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !12, line: 101, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !333, !334, !335, !339, !341, !343, !344, !345}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !324, file: !12, line: 84, baseType: !252, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !324, file: !12, line: 85, baseType: !252, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !12, line: 86, baseType: !166, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !324, file: !12, line: 87, baseType: !244, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !12, line: 88, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !324, file: !12, line: 89, baseType: !204, size: 8, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !324, file: !12, line: 90, baseType: !252, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !324, file: !12, line: 91, baseType: !336, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !337, line: 46, baseType: !338)
!337 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!338 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !324, file: !12, line: 92, baseType: !340, size: 32, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !12, line: 93, baseType: !342, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !12, line: 94, baseType: !322, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !324, file: !12, line: 95, baseType: !252, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !324, file: !12, line: 96, baseType: !166, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !318, file: !12, line: 102, baseType: !252, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !318, file: !12, line: 102, baseType: !252, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !318, file: !12, line: 103, baseType: !252, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !318, file: !12, line: 104, baseType: !162, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !318, file: !12, line: 105, baseType: !340, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !318, file: !12, line: 105, baseType: !340, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !318, file: !12, line: 105, baseType: !340, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !318, file: !12, line: 106, baseType: !167, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !318, file: !12, line: 107, baseType: !355, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!358 = !{!359}
!359 = !DISubrange(count: 5)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !169, file: !170, line: 113, baseType: !361, size: 320, offset: 3648)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 320, elements: !358)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!183, !167, !166}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !169, file: !170, line: 114, baseType: !366, size: 320, offset: 3968)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 320, elements: !358)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !169, file: !170, line: 115, baseType: !340, size: 32, offset: 4288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !169, file: !170, line: 120, baseType: !355, size: 64, offset: 4352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !169, file: !170, line: 121, baseType: !340, size: 32, offset: 4416)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !372, line: 1451, baseType: !213)
!372 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_GLLE", file: !116, line: 76, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_GLLE", file: !116, line: 35, size: 5696, elements: !376)
!376 = !{!377, !885, !889, !893, !918, !922, !927, !931, !932, !933, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !954, !955, !956}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Accept", scope: !375, file: !116, line: 36, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAcceptFunction", file: !35, line: 786, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!183, !382, !279, !279, !883, !428}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !35, line: 17, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !56, line: 144, size: 17408, elements: !385)
!385 = !{!386, !388, !487, !489, !491, !496, !497, !498, !561, !563, !609, !616, !622, !624, !625, !630, !631, !632, !633, !634, !635, !639, !643, !644, !645, !649, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !759, !763, !767, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !819, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !849, !850, !851, !852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !881, !882}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !384, file: !56, line: 145, baseType: !387, size: 4480)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !170, line: 122, baseType: !169)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !384, file: !56, line: 145, baseType: !389, size: 2048, offset: 4480)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 2048, elements: !221)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !56, line: 33, size: 2048, elements: !391)
!391 = !{!392, !402, !409, !413, !414, !415, !419, !424, !429, !433, !434, !438, !439, !443, !444, !445, !451, !452, !453, !454, !455, !456, !457, !458, !459, !465, !469, !473, !477, !481, !482, !483}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !390, file: !56, line: 34, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!183, !396, !399, !399, !382}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !139, line: 18, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !139, line: 18, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !27, line: 21, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !390, file: !56, line: 35, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!183, !396, !399, !406, !406, !382}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !64, line: 16, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !64, line: 16, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !390, file: !56, line: 36, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!183, !382}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !390, file: !56, line: 37, baseType: !410, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !390, file: !56, line: 38, baseType: !410, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !390, file: !56, line: 39, baseType: !416, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!183, !382, !279, !399}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !390, file: !56, line: 40, baseType: !420, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!183, !382, !423, !270, !278}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !390, file: !56, line: 41, baseType: !425, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!183, !382, !225, !399, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !390, file: !56, line: 42, baseType: !430, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!183, !316, !382}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !390, file: !56, line: 43, baseType: !410, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !390, file: !56, line: 44, baseType: !435, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!183, !382, !189}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !390, file: !56, line: 45, baseType: !410, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !390, file: !56, line: 46, baseType: !440, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!183, !382, !279, !279, !278, !278}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !390, file: !56, line: 47, baseType: !435, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !390, file: !56, line: 48, baseType: !410, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !390, file: !56, line: 49, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!183, !382, !270, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !390, file: !56, line: 50, baseType: !410, size: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !390, file: !56, line: 51, baseType: !410, size: 64, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !390, file: !56, line: 52, baseType: !410, size: 64, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !390, file: !56, line: 53, baseType: !410, size: 64, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !390, file: !56, line: 54, baseType: !410, size: 64, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !390, file: !56, line: 55, baseType: !410, size: 64, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !390, file: !56, line: 56, baseType: !410, size: 64, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !390, file: !56, line: 57, baseType: !410, size: 64, offset: 1472)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !390, file: !56, line: 58, baseType: !460, size: 64, offset: 1536)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!183, !382, !270, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !390, file: !56, line: 59, baseType: !466, size: 64, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!183, !382, !270, !450}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !390, file: !56, line: 60, baseType: !470, size: 64, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!183, !382, !450}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !390, file: !56, line: 61, baseType: !474, size: 64, offset: 1728)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!183, !382, !225, !450}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !390, file: !56, line: 62, baseType: !478, size: 64, offset: 1792)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!183, !382, !399}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !390, file: !56, line: 63, baseType: !410, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !390, file: !56, line: 64, baseType: !478, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !390, file: !56, line: 65, baseType: !484, size: 64, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!183, !382, !399, !399}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !384, file: !56, line: 146, baseType: !488, size: 32, offset: 6528)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !35, line: 57, baseType: !34)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !384, file: !56, line: 147, baseType: !490, size: 32, offset: 6560)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !35, line: 88, baseType: !39)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !384, file: !56, line: 149, baseType: !492, size: 64, offset: 6592)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !493, line: 14, baseType: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !493, line: 14, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !384, file: !56, line: 150, baseType: !399, size: 64, offset: 6656)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !384, file: !56, line: 151, baseType: !399, size: 64, offset: 6720)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !384, file: !56, line: 152, baseType: !499, size: 64, offset: 6784)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !35, line: 686, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !56, line: 319, size: 10112, elements: !502)
!502 = !{!503, !504, !526, !527, !531, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !501, file: !56, line: 320, baseType: !387, size: 4480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !501, file: !56, line: 320, baseType: !505, size: 384, offset: 4480)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 384, elements: !221)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !56, line: 310, size: 384, elements: !507)
!507 = !{!508, !512, !516, !517, !521, !525}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !506, file: !56, line: 311, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!183, !499, !382, !279, !270, !278, !428, !278, !278, !278}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !506, file: !56, line: 312, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!183, !499}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !506, file: !56, line: 313, baseType: !513, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !506, file: !56, line: 314, baseType: !518, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!183, !499, !189}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !506, file: !56, line: 315, baseType: !522, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!183, !316, !499}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !506, file: !56, line: 316, baseType: !518, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !56, line: 321, baseType: !166, size: 64, offset: 4864)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !501, file: !56, line: 322, baseType: !528, size: 64, offset: 4928)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!183, !499, !382, !279, !399, !428}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !501, file: !56, line: 331, baseType: !532, size: 4160, offset: 4992)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !501, file: !56, line: 323, size: 4160, elements: !533)
!533 = !{!534, !535, !536, !540, !542, !543, !545}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !532, file: !56, line: 324, baseType: !225, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !532, file: !56, line: 325, baseType: !340, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !532, file: !56, line: 326, baseType: !537, size: 1024, offset: 64)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 1024, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 16)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !532, file: !56, line: 327, baseType: !541, size: 512, offset: 1088)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 512, elements: !538)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !532, file: !56, line: 328, baseType: !541, size: 512, offset: 1600)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !532, file: !56, line: 329, baseType: !544, size: 1024, offset: 2112)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 1024, elements: !538)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !532, file: !56, line: 330, baseType: !544, size: 1024, offset: 3136)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !501, file: !56, line: 332, baseType: !340, size: 32, offset: 9152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !501, file: !56, line: 333, baseType: !279, size: 64, offset: 9216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !501, file: !56, line: 334, baseType: !279, size: 64, offset: 9280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !501, file: !56, line: 335, baseType: !550, size: 128, offset: 9344)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !301)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !501, file: !56, line: 336, baseType: !279, size: 64, offset: 9472)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !501, file: !56, line: 336, baseType: !279, size: 64, offset: 9536)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !501, file: !56, line: 337, baseType: !279, size: 64, offset: 9600)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !501, file: !56, line: 338, baseType: !340, size: 32, offset: 9664)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !501, file: !56, line: 339, baseType: !279, size: 64, offset: 9728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !501, file: !56, line: 340, baseType: !550, size: 128, offset: 9792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !501, file: !56, line: 341, baseType: !423, size: 32, offset: 9920)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !501, file: !56, line: 342, baseType: !189, size: 64, offset: 9984)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !501, file: !56, line: 343, baseType: !225, size: 32, offset: 10048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !501, file: !56, line: 344, baseType: !225, size: 32, offset: 10080)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !384, file: !56, line: 153, baseType: !562, size: 64, offset: 6848)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !35, line: 695, baseType: !202)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !384, file: !56, line: 154, baseType: !564, size: 64, offset: 6912)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !56, line: 71, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !56, line: 410, size: 1792, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !584, !588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !607, !608}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !566, file: !56, line: 411, baseType: !287, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !566, file: !56, line: 412, baseType: !287, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !566, file: !56, line: 413, baseType: !279, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !566, file: !56, line: 414, baseType: !279, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !566, file: !56, line: 415, baseType: !279, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !566, file: !56, line: 416, baseType: !287, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !566, file: !56, line: 417, baseType: !270, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !566, file: !56, line: 418, baseType: !279, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !566, file: !56, line: 419, baseType: !279, size: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !566, file: !56, line: 420, baseType: !279, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !566, file: !56, line: 421, baseType: !279, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !566, file: !56, line: 422, baseType: !428, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !566, file: !56, line: 423, baseType: !581, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!183, !382, !279, !399, !287, !166}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !566, file: !56, line: 424, baseType: !585, size: 64, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!183, !382, !225, !270, !279, !399, !340, !166}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !566, file: !56, line: 425, baseType: !166, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !566, file: !56, line: 426, baseType: !270, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !566, file: !56, line: 427, baseType: !428, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !566, file: !56, line: 428, baseType: !225, size: 32, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !566, file: !56, line: 429, baseType: !225, size: 32, offset: 1120)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !566, file: !56, line: 430, baseType: !270, size: 64, offset: 1152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !566, file: !56, line: 431, baseType: !278, size: 64, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !566, file: !56, line: 432, baseType: !596, size: 32, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !56, line: 408, baseType: !55)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !566, file: !56, line: 433, baseType: !225, size: 32, offset: 1312)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !566, file: !56, line: 434, baseType: !189, size: 64, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !566, file: !56, line: 442, baseType: !600, size: 320, offset: 1408)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !56, line: 436, size: 320, elements: !601)
!601 = !{!602, !603, !604, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !600, file: !56, line: 437, baseType: !225, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !600, file: !56, line: 438, baseType: !278, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !600, file: !56, line: 439, baseType: !270, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !600, file: !56, line: 440, baseType: !270, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !600, file: !56, line: 441, baseType: !272, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !566, file: !56, line: 443, baseType: !225, size: 32, offset: 1728)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !566, file: !56, line: 444, baseType: !225, size: 32, offset: 1760)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !384, file: !56, line: 157, baseType: !610, size: 640, offset: 6976)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 640, elements: !614)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!183, !382, !225, !279, !399, !166}
!614 = !{!615}
!615 = !DISubrange(count: 10)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !384, file: !56, line: 158, baseType: !617, size: 640, offset: 7616)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 640, elements: !614)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!183, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !384, file: !56, line: 159, baseType: !623, size: 640, offset: 8256)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 640, elements: !614)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !384, file: !56, line: 160, baseType: !225, size: 32, offset: 8896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !384, file: !56, line: 161, baseType: !626, size: 640, offset: 8960)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 640, elements: !614)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!183, !382, !225, !279, !399, !225, !450, !450, !166}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !384, file: !56, line: 162, baseType: !617, size: 640, offset: 9600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !384, file: !56, line: 163, baseType: !623, size: 640, offset: 10240)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !384, file: !56, line: 164, baseType: !225, size: 32, offset: 10880)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !384, file: !56, line: 165, baseType: !225, size: 32, offset: 10912)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !384, file: !56, line: 167, baseType: !410, size: 64, offset: 10944)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !384, file: !56, line: 168, baseType: !636, size: 64, offset: 11008)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!183, !382, !279}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !384, file: !56, line: 169, baseType: !640, size: 64, offset: 11072)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!183, !382, !279, !225, !450}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !384, file: !56, line: 170, baseType: !410, size: 64, offset: 11136)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !384, file: !56, line: 171, baseType: !410, size: 64, offset: 11200)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !384, file: !56, line: 172, baseType: !646, size: 64, offset: 11264)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!183, !382, !279, !399, !428}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !384, file: !56, line: 175, baseType: !650, size: 64, offset: 11328)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !35, line: 293, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !56, line: 89, size: 7040, elements: !653)
!653 = !{!654, !655, !684, !688, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !725, !726, !727, !728, !729, !733, !734, !735}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !652, file: !56, line: 90, baseType: !387, size: 4480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !652, file: !56, line: 90, baseType: !656, size: 448, offset: 4480)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 448, elements: !221)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !56, line: 75, size: 448, elements: !658)
!658 = !{!659, !663, !667, !668, !672, !676, !680}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !657, file: !56, line: 76, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!183, !650, !189}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !657, file: !56, line: 77, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!183, !650}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !657, file: !56, line: 78, baseType: !664, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !657, file: !56, line: 79, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!183, !650, !382, !225, !279, !399}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !657, file: !56, line: 80, baseType: !673, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!183, !650, !382, !225, !278}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !657, file: !56, line: 81, baseType: !677, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!183, !316, !650}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !657, file: !56, line: 82, baseType: !681, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!183, !650, !382}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !652, file: !56, line: 91, baseType: !685, size: 64, offset: 4928)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !56, line: 87, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !56, line: 87, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !652, file: !56, line: 116, baseType: !689, size: 1024, offset: 4992)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !56, line: 93, size: 1024, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !706}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !689, file: !56, line: 94, baseType: !225, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !689, file: !56, line: 95, baseType: !450, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !689, file: !56, line: 96, baseType: !287, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !689, file: !56, line: 97, baseType: !278, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !689, file: !56, line: 98, baseType: !450, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !689, file: !56, line: 99, baseType: !428, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !689, file: !56, line: 100, baseType: !278, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !689, file: !56, line: 103, baseType: !340, size: 32, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !689, file: !56, line: 109, baseType: !700, size: 256, offset: 512)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !56, line: 104, size: 256, elements: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !700, file: !56, line: 105, baseType: !233, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !700, file: !56, line: 106, baseType: !263, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !700, file: !56, line: 107, baseType: !279, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !700, file: !56, line: 108, baseType: !225, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !689, file: !56, line: 115, baseType: !707, size: 256, offset: 768)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !56, line: 110, size: 256, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !707, file: !56, line: 111, baseType: !233, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !707, file: !56, line: 112, baseType: !263, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !707, file: !56, line: 113, baseType: !279, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !707, file: !56, line: 114, baseType: !225, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !652, file: !56, line: 117, baseType: !399, size: 64, offset: 6016)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !652, file: !56, line: 117, baseType: !399, size: 64, offset: 6080)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !652, file: !56, line: 118, baseType: !340, size: 32, offset: 6144)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !652, file: !56, line: 119, baseType: !340, size: 32, offset: 6176)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !652, file: !56, line: 120, baseType: !340, size: 32, offset: 6208)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !652, file: !56, line: 121, baseType: !189, size: 64, offset: 6272)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !652, file: !56, line: 122, baseType: !225, size: 32, offset: 6336)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !652, file: !56, line: 123, baseType: !225, size: 32, offset: 6368)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !652, file: !56, line: 124, baseType: !225, size: 32, offset: 6400)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !652, file: !56, line: 124, baseType: !225, size: 32, offset: 6432)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !652, file: !56, line: 125, baseType: !724, size: 64, offset: 6464)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !652, file: !56, line: 126, baseType: !340, size: 32, offset: 6528)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !652, file: !56, line: 127, baseType: !252, size: 64, offset: 6592)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !652, file: !56, line: 127, baseType: !252, size: 64, offset: 6656)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !652, file: !56, line: 128, baseType: !252, size: 64, offset: 6720)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !652, file: !56, line: 129, baseType: !730, size: 64, offset: 6784)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!183, !166, !399, !450}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !652, file: !56, line: 130, baseType: !307, size: 64, offset: 6848)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !652, file: !56, line: 131, baseType: !166, size: 64, offset: 6912)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !56, line: 132, baseType: !166, size: 64, offset: 6976)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !384, file: !56, line: 176, baseType: !450, size: 64, offset: 11392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !384, file: !56, line: 177, baseType: !450, size: 64, offset: 11456)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !384, file: !56, line: 178, baseType: !225, size: 32, offset: 11520)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !384, file: !56, line: 179, baseType: !399, size: 64, offset: 11584)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !384, file: !56, line: 180, baseType: !225, size: 32, offset: 11648)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !384, file: !56, line: 181, baseType: !225, size: 32, offset: 11680)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !384, file: !56, line: 182, baseType: !225, size: 32, offset: 11712)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !384, file: !56, line: 183, baseType: !340, size: 32, offset: 11744)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !384, file: !56, line: 184, baseType: !340, size: 32, offset: 11776)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !384, file: !56, line: 185, baseType: !399, size: 64, offset: 11840)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !384, file: !56, line: 186, baseType: !406, size: 64, offset: 11904)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !384, file: !56, line: 186, baseType: !406, size: 64, offset: 11968)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !384, file: !56, line: 187, baseType: !166, size: 64, offset: 12032)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !384, file: !56, line: 187, baseType: !166, size: 64, offset: 12096)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !384, file: !56, line: 188, baseType: !166, size: 64, offset: 12160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !384, file: !56, line: 189, baseType: !450, size: 64, offset: 12224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !384, file: !56, line: 190, baseType: !450, size: 64, offset: 12288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !384, file: !56, line: 191, baseType: !399, size: 64, offset: 12352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !384, file: !56, line: 191, baseType: !399, size: 64, offset: 12416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !384, file: !56, line: 194, baseType: !756, size: 64, offset: 12480)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!183, !382, !279, !399, !406, !166}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !384, file: !56, line: 195, baseType: !760, size: 64, offset: 12544)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!183, !382, !279, !399, !399, !279, !406, !166}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !384, file: !56, line: 196, baseType: !764, size: 64, offset: 12608)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!183, !382, !279, !399, !399, !166}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !384, file: !56, line: 197, baseType: !768, size: 64, offset: 12672)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!183, !382, !279, !399, !450, !166}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !384, file: !56, line: 198, baseType: !768, size: 64, offset: 12736)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !384, file: !56, line: 201, baseType: !450, size: 64, offset: 12800)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !384, file: !56, line: 202, baseType: !450, size: 64, offset: 12864)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !384, file: !56, line: 203, baseType: !399, size: 64, offset: 12928)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !384, file: !56, line: 204, baseType: !450, size: 64, offset: 12992)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !384, file: !56, line: 204, baseType: !450, size: 64, offset: 13056)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !384, file: !56, line: 205, baseType: !450, size: 64, offset: 13120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !384, file: !56, line: 205, baseType: !450, size: 64, offset: 13184)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !384, file: !56, line: 206, baseType: !450, size: 64, offset: 13248)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !384, file: !56, line: 206, baseType: !450, size: 64, offset: 13312)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !384, file: !56, line: 207, baseType: !450, size: 64, offset: 13376)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !384, file: !56, line: 207, baseType: !450, size: 64, offset: 13440)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !384, file: !56, line: 208, baseType: !166, size: 64, offset: 13504)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !384, file: !56, line: 208, baseType: !166, size: 64, offset: 13568)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !384, file: !56, line: 209, baseType: !786, size: 64, offset: 13632)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!183, !382, !279, !399, !450, !399, !450, !166}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !384, file: !56, line: 210, baseType: !786, size: 64, offset: 13696)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !384, file: !56, line: 211, baseType: !786, size: 64, offset: 13760)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !384, file: !56, line: 212, baseType: !786, size: 64, offset: 13824)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !384, file: !56, line: 213, baseType: !786, size: 64, offset: 13888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !384, file: !56, line: 214, baseType: !786, size: 64, offset: 13952)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !384, file: !56, line: 215, baseType: !786, size: 64, offset: 14016)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !384, file: !56, line: 216, baseType: !786, size: 64, offset: 14080)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !384, file: !56, line: 219, baseType: !406, size: 64, offset: 14144)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !384, file: !56, line: 220, baseType: !399, size: 64, offset: 14208)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !384, file: !56, line: 221, baseType: !450, size: 64, offset: 14272)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !384, file: !56, line: 222, baseType: !225, size: 32, offset: 14336)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !384, file: !56, line: 223, baseType: !225, size: 32, offset: 14368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !384, file: !56, line: 224, baseType: !166, size: 64, offset: 14400)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !384, file: !56, line: 225, baseType: !225, size: 32, offset: 14464)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !384, file: !56, line: 226, baseType: !340, size: 32, offset: 14496)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !384, file: !56, line: 227, baseType: !768, size: 64, offset: 14528)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !384, file: !56, line: 231, baseType: !406, size: 64, offset: 14592)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !384, file: !56, line: 232, baseType: !406, size: 64, offset: 14656)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !384, file: !56, line: 233, baseType: !399, size: 64, offset: 14720)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !384, file: !56, line: 247, baseType: !809, size: 384, offset: 14784)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !384, file: !56, line: 238, size: 384, elements: !810)
!810 = !{!811, !812, !813, !814, !816, !817, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !809, file: !56, line: 239, baseType: !279, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !809, file: !56, line: 240, baseType: !233, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !809, file: !56, line: 241, baseType: !263, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !809, file: !56, line: 242, baseType: !815, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !64, line: 285, baseType: !63)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !809, file: !56, line: 245, baseType: !340, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !809, file: !56, line: 246, baseType: !279, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !809, file: !56, line: 246, baseType: !279, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !384, file: !56, line: 251, baseType: !820, size: 64, offset: 15168)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !384, file: !56, line: 249, size: 64, elements: !821)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !820, file: !56, line: 250, baseType: !279, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !384, file: !56, line: 253, baseType: !815, size: 32, offset: 15232)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !384, file: !56, line: 255, baseType: !396, size: 64, offset: 15296)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !384, file: !56, line: 256, baseType: !340, size: 32, offset: 15360)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !384, file: !56, line: 258, baseType: !225, size: 32, offset: 15392)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !384, file: !56, line: 259, baseType: !225, size: 32, offset: 15424)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !384, file: !56, line: 260, baseType: !225, size: 32, offset: 15456)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !384, file: !56, line: 261, baseType: !225, size: 32, offset: 15488)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !384, file: !56, line: 264, baseType: !225, size: 32, offset: 15520)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !384, file: !56, line: 264, baseType: !225, size: 32, offset: 15552)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !384, file: !56, line: 264, baseType: !225, size: 32, offset: 15584)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !384, file: !56, line: 264, baseType: !225, size: 32, offset: 15616)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !384, file: !56, line: 267, baseType: !225, size: 32, offset: 15648)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !384, file: !56, line: 268, baseType: !166, size: 64, offset: 15680)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !384, file: !56, line: 269, baseType: !166, size: 64, offset: 15744)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !384, file: !56, line: 272, baseType: !225, size: 32, offset: 15808)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !384, file: !56, line: 273, baseType: !279, size: 64, offset: 15872)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !384, file: !56, line: 277, baseType: !340, size: 32, offset: 15936)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !384, file: !56, line: 278, baseType: !340, size: 32, offset: 15968)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !384, file: !56, line: 279, baseType: !225, size: 32, offset: 16000)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !384, file: !56, line: 280, baseType: !279, size: 64, offset: 16064)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !384, file: !56, line: 281, baseType: !279, size: 64, offset: 16128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !384, file: !56, line: 282, baseType: !279, size: 64, offset: 16192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !384, file: !56, line: 283, baseType: !279, size: 64, offset: 16256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !384, file: !56, line: 284, baseType: !279, size: 64, offset: 16320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !384, file: !56, line: 286, baseType: !848, size: 32, offset: 16384)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !35, line: 115, baseType: !70)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !384, file: !56, line: 287, baseType: !340, size: 32, offset: 16416)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !384, file: !56, line: 288, baseType: !225, size: 32, offset: 16448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !384, file: !56, line: 288, baseType: !225, size: 32, offset: 16480)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !384, file: !56, line: 289, baseType: !853, size: 32, offset: 16512)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !35, line: 217, baseType: !83)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !384, file: !56, line: 291, baseType: !279, size: 64, offset: 16576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !384, file: !56, line: 291, baseType: !279, size: 64, offset: 16640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !384, file: !56, line: 292, baseType: !399, size: 64, offset: 16704)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !384, file: !56, line: 292, baseType: !399, size: 64, offset: 16768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !384, file: !56, line: 293, baseType: !279, size: 64, offset: 16832)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !384, file: !56, line: 293, baseType: !279, size: 64, offset: 16896)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !384, file: !56, line: 295, baseType: !340, size: 32, offset: 16960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !384, file: !56, line: 296, baseType: !340, size: 32, offset: 16992)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !384, file: !56, line: 298, baseType: !225, size: 32, offset: 17024)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !384, file: !56, line: 299, baseType: !450, size: 64, offset: 17088)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !384, file: !56, line: 302, baseType: !225, size: 32, offset: 17152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !384, file: !56, line: 303, baseType: !866, size: 64, offset: 17216)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !56, line: 135, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !56, line: 136, size: 320, elements: !869)
!869 = !{!870, !871, !872, !877, !878}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !868, file: !56, line: 137, baseType: !382, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !868, file: !56, line: 138, baseType: !252, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !868, file: !56, line: 139, baseType: !873, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !874, line: 11, baseType: !875)
!874 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !874, line: 11, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !56, line: 140, baseType: !866, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !868, file: !56, line: 141, baseType: !879, size: 32, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !880, line: 80, baseType: !40)
!880 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!881 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !384, file: !56, line: 304, baseType: !340, size: 32, offset: 17280)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !384, file: !56, line: 307, baseType: !382, size: 64, offset: 17344)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !375, file: !116, line: 37, baseType: !886, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEAdapt", file: !35, line: 751, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSGLLEAdapt", file: !35, line: 751, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "accept_name", scope: !375, file: !116, line: 41, baseType: !890, size: 2048, offset: 128)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 2048, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "EstimateHigherMoments", scope: !375, file: !116, line: 44, baseType: !894, size: 64, offset: 2176)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!183, !897, !279, !450, !450, !450}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEScheme", file: !116, line: 8, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSGLLEScheme", file: !116, line: 9, size: 896, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !899, file: !116, line: 10, baseType: !225, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !899, file: !116, line: 11, baseType: !225, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !899, file: !116, line: 12, baseType: !225, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !899, file: !116, line: 13, baseType: !225, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !899, file: !116, line: 14, baseType: !287, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !899, file: !116, line: 15, baseType: !287, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !899, file: !116, line: 15, baseType: !287, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !899, file: !116, line: 15, baseType: !287, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !899, file: !116, line: 15, baseType: !287, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !899, file: !116, line: 18, baseType: !287, size: 64, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !899, file: !116, line: 19, baseType: !287, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !899, file: !116, line: 20, baseType: !287, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !899, file: !116, line: 26, baseType: !287, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !899, file: !116, line: 27, baseType: !287, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "stage_error", scope: !899, file: !116, line: 28, baseType: !287, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "stiffly_accurate", scope: !899, file: !116, line: 31, baseType: !340, size: 32, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fsal", scope: !899, file: !116, line: 32, baseType: !340, size: 32, offset: 864)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CompleteStep", scope: !375, file: !116, line: 45, baseType: !919, size: 64, offset: 2240)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!183, !897, !279, !897, !279, !450, !450, !450}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !375, file: !116, line: 46, baseType: !923, size: 64, offset: 2304)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!183, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !375, file: !116, line: 47, baseType: !928, size: 64, offset: 2368)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!183, !926, !189}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !375, file: !116, line: 48, baseType: !890, size: 2048, offset: 2432)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nschemes", scope: !375, file: !116, line: 49, baseType: !225, size: 32, offset: 4480)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "schemes", scope: !375, file: !116, line: 50, baseType: !934, size: 64, offset: 4544)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !375, file: !116, line: 52, baseType: !450, size: 64, offset: 4608)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Xold", scope: !375, file: !116, line: 53, baseType: !450, size: 64, offset: 4672)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !375, file: !116, line: 54, baseType: !399, size: 64, offset: 4736)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "himom", scope: !375, file: !116, line: 55, baseType: !450, size: 64, offset: 4800)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "wrms_atol", scope: !375, file: !116, line: 56, baseType: !279, size: 64, offset: 4864)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "wrms_rtol", scope: !375, file: !116, line: 56, baseType: !279, size: 64, offset: 4928)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Ydot", scope: !375, file: !116, line: 59, baseType: !450, size: 64, offset: 4992)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !375, file: !116, line: 60, baseType: !399, size: 64, offset: 5056)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !375, file: !116, line: 61, baseType: !399, size: 64, offset: 5120)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "scoeff", scope: !375, file: !116, line: 62, baseType: !279, size: 64, offset: 5184)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "stage_time", scope: !375, file: !116, line: 63, baseType: !279, size: 64, offset: 5248)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !375, file: !116, line: 64, baseType: !225, size: 32, offset: 5312)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "current_scheme", scope: !375, file: !116, line: 67, baseType: !225, size: 32, offset: 5344)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "max_order", scope: !375, file: !116, line: 68, baseType: !225, size: 32, offset: 5376)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "min_order", scope: !375, file: !116, line: 68, baseType: !225, size: 32, offset: 5408)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "start_order", scope: !375, file: !116, line: 68, baseType: !225, size: 32, offset: 5440)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "extrapolate", scope: !375, file: !116, line: 69, baseType: !340, size: 32, offset: 5472)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "error_direction", scope: !375, file: !116, line: 70, baseType: !953, size: 32, offset: 5504)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEErrorDirection", file: !116, line: 6, baseType: !115)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "max_step_rejections", scope: !375, file: !116, line: 72, baseType: !225, size: 32, offset: 5536)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !375, file: !116, line: 74, baseType: !340, size: 32, offset: 5568)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !116, line: 75, baseType: !166, size: 64, offset: 5632)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !40)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !163, line: 331, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !163, line: 331, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !163, line: 338, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !163, line: 338, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !158)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!966 = !{!0, !967, !970, !972, !974}
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "TSGLLEAcceptList", scope: !2, file: !969, line: 8, type: !244, isLocal: true, isDefinition: true)
!969 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/glle/glle.c", directory: "/home/users/ndemeye/xSDK")
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "TSGLLEPackageInitialized", scope: !2, file: !969, line: 9, type: !340, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "TSGLLERegisterAllCalled", scope: !2, file: !969, line: 10, type: !340, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "TSGLLEErrorDirections", scope: !2, file: !969, line: 6, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 320, elements: !358)
!977 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!978 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!979 = !{i32 7, !"Dwarf Version", i32 4}
!980 = !{i32 2, !"Debug Info Version", i32 3}
!981 = !{i32 1, !"wchar_size", i32 4}
!982 = !{i32 7, !"PIC Level", i32 2}
!983 = !{i32 7, !"uwtable", i32 1}
!984 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!985 = distinct !DISubprogram(name: "TSGLLESetType", scope: !969, file: !969, line: 615, type: !986, scopeLine: 616, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !989)
!986 = !DISubroutineType(types: !987)
!987 = !{!183, !382, !988}
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSGLLEType", file: !35, line: 796, baseType: !202)
!989 = !{!990, !991, !992, !993, !996, !997, !999, !1003}
!990 = !DILocalVariable(name: "ts", arg: 1, scope: !985, file: !969, line: 615, type: !382)
!991 = !DILocalVariable(name: "type", arg: 2, scope: !985, file: !969, line: 615, type: !988)
!992 = !DILocalVariable(name: "ierr", scope: !985, file: !969, line: 617, type: !183)
!993 = !DILocalVariable(name: "_7_f", scope: !994, file: !969, line: 622, type: !995)
!994 = distinct !DILexicalBlock(scope: !985, file: !969, line: 622, column: 10)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!996 = !DILocalVariable(name: "_7_ierr", scope: !994, file: !969, line: 622, type: !183)
!997 = !DILocalVariable(name: "ierr__", scope: !998, file: !969, line: 622, type: !183)
!998 = distinct !DILexicalBlock(scope: !994, file: !969, line: 622, column: 10)
