; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/window/sfwindow.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/window/sfwindow.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_info_t = type opaque
%struct.ompi_predefined_win_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_request_t = type opaque
%struct.ompi_predefined_group_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!93 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !95)
!95 = !{!96}
!96 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 119, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!100 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!142 = !{!143, !147, !148, !224, !352, !355, !234, !155, !358, !184, !361, !209, !602, !318, !599, !359, !7, !388, !400, !393, !556, !611, !612}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !144, line: 330, baseType: !145)
!144 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !144, line: 330, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !151, line: 73, size: 4480, elements: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!152 = !{!153, !156, !205, !206, !208, !211, !212, !213, !214, !222, !223, !225, !229, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !250, !251, !253, !255, !256, !257, !258, !259, !262, !264, !265, !266, !267, !268, !271, !273, !274, !275, !285, !287, !288, !292, !293, !342, !347, !349, !350, !351}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !150, file: !151, line: 74, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !155)
!155 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !150, file: !151, line: 75, baseType: !157, size: 448, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 448, elements: !203)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !151, line: 53, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 45, size: 448, elements: !160)
!160 = !{!161, !167, !175, !180, !187, !191, !198}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !159, file: !151, line: 46, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !148, !166}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !155)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !159, file: !151, line: 47, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!165, !148, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !172, line: 16, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !159, file: !151, line: 48, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!165, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !159, file: !151, line: 49, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!165, !148, !184, !148}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !159, file: !151, line: 50, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!165, !148, !184, !179}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !159, file: !151, line: 51, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!165, !148, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !159, file: !151, line: 52, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!165, !148, !184, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!203 = !{!204}
!204 = !DISubrange(count: 1)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !150, file: !151, line: 76, baseType: !143, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !151, line: 77, baseType: !207, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !155)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !150, file: !151, line: 78, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !210)
!210 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !150, file: !151, line: 78, baseType: !209, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !150, file: !151, line: 78, baseType: !209, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !150, file: !151, line: 78, baseType: !209, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !150, file: !151, line: 79, baseType: !215, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !218, line: 27, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !220, line: 43, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!221 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !150, file: !151, line: 80, baseType: !207, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !150, file: !151, line: 81, baseType: !224, size: 32, offset: 992)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !155)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !150, file: !151, line: 82, baseType: !226, size: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !150, file: !151, line: 83, baseType: !230, size: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !150, file: !151, line: 84, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !150, file: !151, line: 85, baseType: !234, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !150, file: !151, line: 86, baseType: !234, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !150, file: !151, line: 87, baseType: !234, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !150, file: !151, line: 88, baseType: !148, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !150, file: !151, line: 89, baseType: !215, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !151, line: 90, baseType: !234, size: 64, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !150, file: !151, line: 91, baseType: !234, size: 64, offset: 1600)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !150, file: !151, line: 92, baseType: !207, size: 32, offset: 1664)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !150, file: !151, line: 93, baseType: !147, size: 64, offset: 1728)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !150, file: !151, line: 94, baseType: !245, size: 64, offset: 1792)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !150, file: !151, line: 95, baseType: !207, size: 32, offset: 1856)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !150, file: !151, line: 95, baseType: !207, size: 32, offset: 1888)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !150, file: !151, line: 96, baseType: !249, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !150, file: !151, line: 96, baseType: !249, size: 64, offset: 1984)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !150, file: !151, line: 97, baseType: !252, size: 64, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !150, file: !151, line: 97, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !150, file: !151, line: 98, baseType: !207, size: 32, offset: 2176)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !150, file: !151, line: 98, baseType: !207, size: 32, offset: 2208)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !150, file: !151, line: 99, baseType: !249, size: 64, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !150, file: !151, line: 99, baseType: !249, size: 64, offset: 2304)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !150, file: !151, line: 100, baseType: !260, size: 64, offset: 2368)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !210)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !150, file: !151, line: 100, baseType: !263, size: 64, offset: 2432)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !150, file: !151, line: 101, baseType: !207, size: 32, offset: 2496)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !150, file: !151, line: 101, baseType: !207, size: 32, offset: 2528)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !150, file: !151, line: 102, baseType: !249, size: 64, offset: 2560)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !150, file: !151, line: 102, baseType: !249, size: 64, offset: 2624)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !150, file: !151, line: 103, baseType: !269, size: 64, offset: 2688)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !261)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !150, file: !151, line: 103, baseType: !272, size: 64, offset: 2752)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !150, file: !151, line: 104, baseType: !202, size: 64, offset: 2816)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !150, file: !151, line: 105, baseType: !207, size: 32, offset: 2880)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !150, file: !151, line: 106, baseType: !276, size: 128, offset: 2944)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !283)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !151, line: 64, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 61, size: 128, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !279, file: !151, line: 62, baseType: !195, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !279, file: !151, line: 63, baseType: !147, size: 64, offset: 64)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !150, file: !151, line: 107, baseType: !286, size: 64, offset: 3072)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !283)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !150, file: !151, line: 108, baseType: !147, size: 64, offset: 3136)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !150, file: !151, line: 109, baseType: !289, size: 64, offset: 3200)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!165, !147}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !150, file: !151, line: 111, baseType: !207, size: 32, offset: 3264)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !150, file: !151, line: 112, baseType: !294, size: 320, offset: 3328)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !340)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!165, !298, !148, !147}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !301)
!301 = !{!302, !303, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !300, file: !12, line: 100, baseType: !207, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !12, line: 101, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !315, !316, !317, !321, !323, !325, !326, !327}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !306, file: !12, line: 84, baseType: !234, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !306, file: !12, line: 85, baseType: !234, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !12, line: 86, baseType: !147, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !306, file: !12, line: 87, baseType: !226, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !306, file: !12, line: 88, baseType: !313, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !306, file: !12, line: 89, baseType: !186, size: 8, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !306, file: !12, line: 90, baseType: !234, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !306, file: !12, line: 91, baseType: !318, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !319, line: 46, baseType: !320)
!319 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!320 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !12, line: 92, baseType: !322, size: 32, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !12, line: 93, baseType: !324, size: 32, offset: 544)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !12, line: 94, baseType: !304, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !306, file: !12, line: 95, baseType: !234, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !306, file: !12, line: 96, baseType: !147, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !300, file: !12, line: 102, baseType: !234, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !300, file: !12, line: 102, baseType: !234, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !300, file: !12, line: 103, baseType: !234, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !300, file: !12, line: 104, baseType: !143, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !300, file: !12, line: 105, baseType: !322, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !300, file: !12, line: 105, baseType: !322, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !300, file: !12, line: 105, baseType: !322, size: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !12, line: 106, baseType: !148, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !300, file: !12, line: 107, baseType: !337, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!340 = !{!341}
!341 = !DISubrange(count: 5)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !150, file: !151, line: 113, baseType: !343, size: 320, offset: 3648)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 320, elements: !340)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!165, !148, !147}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !150, file: !151, line: 114, baseType: !348, size: 320, offset: 3968)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 320, elements: !340)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !150, file: !151, line: 115, baseType: !322, size: 32, offset: 4288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !150, file: !151, line: 120, baseType: !337, size: 64, offset: 4352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !150, file: !151, line: 121, baseType: !322, size: 32, offset: 4416)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !144, line: 331, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !144, line: 331, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !144, line: 338, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !144, line: 338, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !360, line: 1451, baseType: !195)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Window", file: !363, line: 13, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/window/sfwindow.c", directory: "/home/users/ndemeye/xSDK")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 6, size: 384, elements: !365)
!365 = !{!366, !368, !378, !404, !405, !598}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !364, file: !363, line: 7, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFWindowSyncType", file: !27, line: 48, baseType: !84)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !364, file: !363, line: 8, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDataLink", file: !363, line: 3, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFDataLink", file: !363, line: 15, size: 256, elements: !372)
!372 = !{!373, !374, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !371, file: !363, line: 16, baseType: !352, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !371, file: !363, line: 17, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !371, file: !363, line: 18, baseType: !375, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !363, line: 19, baseType: !369, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wins", scope: !364, file: !363, line: 9, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFWinLink", file: !363, line: 4, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFWinLink", file: !363, line: 22, size: 640, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !391, !396, !398, !402, !403}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !381, file: !363, line: 23, baseType: !322, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !381, file: !363, line: 24, baseType: !318, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !381, file: !363, line: 25, baseType: !147, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "paddr", scope: !381, file: !363, line: 26, baseType: !147, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !381, file: !363, line: 27, baseType: !388, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Win", file: !144, line: 342, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_win_t", file: !144, line: 342, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !381, file: !363, line: 28, baseType: !392, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !144, line: 339, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !144, line: 339, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flavor", scope: !381, file: !363, line: 29, baseType: !397, size: 32, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFWindowFlavorType", file: !27, line: 63, baseType: !52)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_target_addr", scope: !381, file: !363, line: 30, baseType: !399, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Aint", file: !144, line: 327, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !319, line: 35, baseType: !221)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !381, file: !363, line: 31, baseType: !322, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !363, line: 32, baseType: !379, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flavor", scope: !364, file: !363, line: 10, baseType: !397, size: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dynsf", scope: !364, file: !363, line: 11, baseType: !406, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !407, line: 15, baseType: !408)
!407 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !46, line: 66, size: 8640, elements: !410)
!410 = !{!411, !413, !506, !521, !522, !523, !524, !525, !526, !527, !529, !530, !531, !532, !534, !535, !536, !538, !539, !541, !542, !547, !548, !549, !550, !551, !552, !553, !554, !555, !559, !560, !561, !562, !563, !565, !566, !591, !592, !593, !594, !595, !597}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !409, file: !46, line: 67, baseType: !412, size: 4480)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !151, line: 122, baseType: !150)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !409, file: !46, line: 67, baseType: !414, size: 1344, offset: 4480)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1344, elements: !203)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !46, line: 39, size: 1344, elements: !416)
!416 = !{!417, !421, !422, !423, !427, !431, !436, !443, !447, !448, !449, !453, !457, !461, !471, !475, !480, !492, !496, !497, !502}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !415, file: !46, line: 40, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!165, !406}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !415, file: !46, line: 41, baseType: !418, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !415, file: !46, line: 42, baseType: !418, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !415, file: !46, line: 43, baseType: !424, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!165, !298, !406}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !415, file: !46, line: 44, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!165, !406, !171}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !415, file: !46, line: 45, baseType: !432, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!165, !406, !435, !406}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !27, line: 77, baseType: !26)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !415, file: !46, line: 46, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!165, !406, !352, !440, !441, !440, !147, !355}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !32)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !415, file: !46, line: 47, baseType: !444, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!165, !406, !352, !441, !147, !355}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !415, file: !46, line: 48, baseType: !437, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !415, file: !46, line: 49, baseType: !444, size: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !415, file: !46, line: 50, baseType: !450, size: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!165, !406, !352, !440, !147, !440, !441, !147, !355}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !415, file: !46, line: 51, baseType: !454, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!165, !406, !352, !147, !441, !147, !355}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !415, file: !46, line: 52, baseType: !458, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!165, !406, !352, !440, !441, !440, !147}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !415, file: !46, line: 53, baseType: !462, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!165, !406, !252, !465, !468, !468, !468}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !415, file: !46, line: 54, baseType: !472, size: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!165, !406, !252, !465, !468, !468}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !415, file: !46, line: 55, baseType: !476, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!165, !406, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !415, file: !46, line: 56, baseType: !481, size: 64, offset: 1024)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!165, !406, !252, !252, !468, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !407, line: 49, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 46, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !488, file: !407, line: 47, baseType: !207, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !488, file: !407, line: 48, baseType: !207, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !415, file: !46, line: 57, baseType: !493, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!165, !406, !207, !469, !479}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !415, file: !46, line: 58, baseType: !493, size: 64, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !415, file: !46, line: 60, baseType: !498, size: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!165, !440, !318, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !415, file: !46, line: 61, baseType: !503, size: 64, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!165, !440, !147}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !409, file: !46, line: 78, baseType: !507, size: 512, offset: 5824)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !46, line: 68, size: 512, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !516, !517, !518, !519, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !507, file: !46, line: 69, baseType: !207, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !507, file: !46, line: 69, baseType: !207, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !507, file: !46, line: 70, baseType: !322, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !507, file: !46, line: 71, baseType: !322, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !507, file: !46, line: 72, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !507, file: !46, line: 73, baseType: !269, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !507, file: !46, line: 74, baseType: !406, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !507, file: !46, line: 75, baseType: !207, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !507, file: !46, line: 76, baseType: !352, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !507, file: !46, line: 77, baseType: !322, size: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !409, file: !46, line: 81, baseType: !207, size: 32, offset: 6336)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !409, file: !46, line: 82, baseType: !207, size: 32, offset: 6368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !409, file: !46, line: 83, baseType: !252, size: 64, offset: 6400)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !409, file: !46, line: 84, baseType: !252, size: 64, offset: 6464)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !409, file: !46, line: 85, baseType: !207, size: 32, offset: 6528)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !409, file: !46, line: 85, baseType: !207, size: 32, offset: 6560)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !409, file: !46, line: 86, baseType: !528, size: 64, offset: 6592)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !409, file: !46, line: 87, baseType: !528, size: 64, offset: 6656)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !409, file: !46, line: 88, baseType: !207, size: 32, offset: 6720)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !409, file: !46, line: 89, baseType: !207, size: 32, offset: 6752)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !409, file: !46, line: 90, baseType: !533, size: 64, offset: 6784)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !409, file: !46, line: 91, baseType: !252, size: 64, offset: 6848)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !409, file: !46, line: 92, baseType: !252, size: 64, offset: 6912)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !409, file: !46, line: 93, baseType: !537, size: 128, offset: 6976)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 128, elements: !283)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !409, file: !46, line: 96, baseType: !286, size: 64, offset: 7104)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !409, file: !46, line: 97, baseType: !540, size: 64, offset: 7168)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !283)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !409, file: !46, line: 98, baseType: !286, size: 64, offset: 7232)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !409, file: !46, line: 99, baseType: !543, size: 128, offset: 7296)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 128, elements: !283)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !46, line: 64, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !46, line: 64, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !409, file: !46, line: 100, baseType: !543, size: 128, offset: 7424)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !409, file: !46, line: 101, baseType: !540, size: 64, offset: 7552)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !409, file: !46, line: 103, baseType: !207, size: 32, offset: 7616)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !409, file: !46, line: 104, baseType: !252, size: 64, offset: 7680)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !409, file: !46, line: 105, baseType: !322, size: 32, offset: 7744)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !409, file: !46, line: 106, baseType: !252, size: 64, offset: 7808)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !409, file: !46, line: 107, baseType: !252, size: 64, offset: 7872)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !409, file: !46, line: 108, baseType: !322, size: 32, offset: 7936)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !409, file: !46, line: 109, baseType: !556, size: 64, offset: 8000)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !144, line: 336, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !144, line: 336, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !409, file: !46, line: 110, baseType: !556, size: 64, offset: 8064)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !409, file: !46, line: 111, baseType: !406, size: 64, offset: 8128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !409, file: !46, line: 112, baseType: !322, size: 32, offset: 8192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !409, file: !46, line: 113, baseType: !322, size: 32, offset: 8224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !409, file: !46, line: 114, baseType: !564, size: 32, offset: 8256)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !27, line: 35, baseType: !39)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !409, file: !46, line: 115, baseType: !322, size: 32, offset: 8288)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !409, file: !46, line: 116, baseType: !567, size: 64, offset: 8320)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !568, line: 60, baseType: !569)
!568 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !571, line: 240, size: 640, elements: !572)
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !588, !589, !590}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !570, file: !571, line: 241, baseType: !143, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !570, file: !571, line: 242, baseType: !224, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !570, file: !571, line: 243, baseType: !207, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !570, file: !571, line: 243, baseType: !207, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !570, file: !571, line: 244, baseType: !207, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !570, file: !571, line: 244, baseType: !207, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !570, file: !571, line: 245, baseType: !252, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !570, file: !571, line: 246, baseType: !322, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !570, file: !571, line: 247, baseType: !207, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !570, file: !571, line: 251, baseType: !207, size: 32, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !570, file: !571, line: 252, baseType: !584, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !568, line: 30, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !568, line: 30, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !570, file: !571, line: 253, baseType: !322, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !570, file: !571, line: 254, baseType: !207, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !570, file: !571, line: 254, baseType: !207, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !570, file: !571, line: 255, baseType: !207, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !409, file: !46, line: 117, baseType: !322, size: 32, offset: 8384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !409, file: !46, line: 118, baseType: !322, size: 32, offset: 8416)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !409, file: !46, line: 119, baseType: !322, size: 32, offset: 8448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !409, file: !46, line: 120, baseType: !207, size: 32, offset: 8480)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !409, file: !46, line: 121, baseType: !596, size: 32, offset: 8512)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !46, line: 37, baseType: !45)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !46, line: 122, baseType: !147, size: 64, offset: 8576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !364, file: !363, line: 12, baseType: !599, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Info", file: !144, line: 337, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_info_t", file: !144, line: 337, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !144, line: 341, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !144, line: 351, size: 192, elements: !605)
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !604, file: !144, line: 354, baseType: !155, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !604, file: !144, line: 355, baseType: !155, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !604, file: !144, line: 356, baseType: !155, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !604, file: !144, line: 361, baseType: !155, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !604, file: !144, line: 362, baseType: !318, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !94)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!613 = !{!0, !614}
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "PetscSFWindowFlavorTypes", scope: !2, file: !363, line: 36, type: !616, isLocal: false, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 448, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 7)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 384, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 6)
!622 = !{i32 7, !"Dwarf Version", i32 4}
!623 = !{i32 2, !"Debug Info Version", i32 3}
!624 = !{i32 1, !"wchar_size", i32 4}
!625 = !{i32 7, !"PIC Level", i32 2}
!626 = !{i32 7, !"uwtable", i32 1}
!627 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!628 = distinct !DISubprogram(name: "PetscSFWindowSetFlavorType", scope: !363, file: !363, line: 160, type: !629, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{!165, !406, !397}
!631 = !{!632, !633, !634, !635, !637, !638, !640, !641, !643, !645, !646, !648, !654, !655, !657, !660, !661, !663, !666, !667, !670, !671, !673, !677}
!632 = !DILocalVariable(name: "sf", arg: 1, scope: !628, file: !363, line: 160, type: !406)
!633 = !DILocalVariable(name: "flavor", arg: 2, scope: !628, file: !363, line: 160, type: !397)
!634 = !DILocalVariable(name: "ierr", scope: !628, file: !363, line: 162, type: !165)
!635 = !DILocalVariable(name: "_7_ierr", scope: !636, file: !363, line: 166, type: !165)
!636 = distinct !DILexicalBlock(scope: !628, file: !363, line: 166, column: 3)
!637 = !DILocalVariable(name: "b0", scope: !636, file: !363, line: 166, type: !224)
!638 = !DILocalVariable(name: "b1", scope: !636, file: !363, line: 166, type: !639)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !283)
!640 = !DILocalVariable(name: "b2", scope: !636, file: !363, line: 166, type: !639)
!641 = !DILocalVariable(name: "_4_ierr", scope: !642, file: !363, line: 166, type: !165)
!642 = distinct !DILexicalBlock(scope: !636, file: !363, line: 166, column: 3)
!643 = !DILocalVariable(name: "a_b1", scope: !642, file: !363, line: 166, type: !644)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 192, elements: !620)
!645 = !DILocalVariable(name: "a_b2", scope: !642, file: !363, line: 166, type: !644)
!646 = !DILocalVariable(name: "_7_errorcode", scope: !647, file: !363, line: 166, type: !165)
!647 = distinct !DILexicalBlock(scope: !642, file: !363, line: 166, column: 3)
!648 = !DILocalVariable(name: "_7_errorstring", scope: !649, file: !363, line: 166, type: !651)
!649 = distinct !DILexicalBlock(scope: !650, file: !363, line: 166, column: 3)
!650 = distinct !DILexicalBlock(scope: !647, file: !363, line: 166, column: 3)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 2048, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 256)
!654 = !DILocalVariable(name: "_7_resultlen", scope: !649, file: !363, line: 166, type: !224)
!655 = !DILocalVariable(name: "_7_errorcode", scope: !656, file: !363, line: 166, type: !165)
!656 = distinct !DILexicalBlock(scope: !642, file: !363, line: 166, column: 3)
!657 = !DILocalVariable(name: "_7_errorstring", scope: !658, file: !363, line: 166, type: !651)
!658 = distinct !DILexicalBlock(scope: !659, file: !363, line: 166, column: 3)
!659 = distinct !DILexicalBlock(scope: !656, file: !363, line: 166, column: 3)
!660 = !DILocalVariable(name: "_7_resultlen", scope: !658, file: !363, line: 166, type: !224)
