; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/maij/maij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/maij/maij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 30, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306}
!302 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!312 = !{!313, !331, !412, !521, !1308, !352, !392, !1189, !1314, !402, !72, !1317, !487, !1319, !1430, !1431, !5, !384, !375}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !316, line: 73, size: 4480, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !320, !373, !374, !376, !379, !380, !381, !382, !390, !391, !393, !397, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !415, !416, !417, !419, !420, !422, !424, !425, !426, !427, !428, !431, !433, !434, !435, !436, !437, !440, !442, !443, !444, !454, !456, !457, !461, !462, !511, !516, !518, !519, !520}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !315, file: !316, line: 74, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !315, file: !316, line: 75, baseType: !321, size: 448, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 448, elements: !371)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !316, line: 53, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 45, size: 448, elements: !324)
!324 = !{!325, !335, !343, !348, !355, !359, !366}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !323, file: !316, line: 46, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !313, !330}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !332, line: 330, baseType: !333)
!332 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !332, line: 330, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !323, file: !316, line: 47, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!329, !313, !339}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !340, line: 16, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !340, line: 16, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !323, file: !316, line: 48, baseType: !344, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!329, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !323, file: !316, line: 49, baseType: !349, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!329, !313, !352, !313}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !323, file: !316, line: 50, baseType: !356, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!329, !313, !352, !347}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !323, file: !316, line: 51, baseType: !360, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!329, !313, !352, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !323, file: !316, line: 52, baseType: !367, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!329, !313, !352, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !315, file: !316, line: 76, baseType: !331, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !316, line: 77, baseType: !375, size: 32, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !315, file: !316, line: 78, baseType: !377, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !378)
!378 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !315, file: !316, line: 78, baseType: !377, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !315, file: !316, line: 78, baseType: !377, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !315, file: !316, line: 78, baseType: !377, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !315, file: !316, line: 79, baseType: !383, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !386, line: 27, baseType: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !388, line: 43, baseType: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!389 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !315, file: !316, line: 80, baseType: !375, size: 32, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !315, file: !316, line: 81, baseType: !392, size: 32, offset: 992)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !315, file: !316, line: 82, baseType: !394, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !315, file: !316, line: 83, baseType: !398, size: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !315, file: !316, line: 84, baseType: !402, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !315, file: !316, line: 85, baseType: !402, size: 64, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !315, file: !316, line: 86, baseType: !402, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !315, file: !316, line: 87, baseType: !402, size: 64, offset: 1344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !315, file: !316, line: 88, baseType: !313, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !315, file: !316, line: 89, baseType: !383, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 90, baseType: !402, size: 64, offset: 1536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !315, file: !316, line: 91, baseType: !402, size: 64, offset: 1600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !315, file: !316, line: 92, baseType: !375, size: 32, offset: 1664)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !315, file: !316, line: 93, baseType: !412, size: 64, offset: 1728)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !316, line: 94, baseType: !414, size: 64, offset: 1792)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !315, file: !316, line: 95, baseType: !375, size: 32, offset: 1856)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !315, file: !316, line: 95, baseType: !375, size: 32, offset: 1888)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !315, file: !316, line: 96, baseType: !418, size: 64, offset: 1920)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !315, file: !316, line: 96, baseType: !418, size: 64, offset: 1984)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !315, file: !316, line: 97, baseType: !421, size: 64, offset: 2048)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !315, file: !316, line: 97, baseType: !423, size: 64, offset: 2112)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !315, file: !316, line: 98, baseType: !375, size: 32, offset: 2176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !315, file: !316, line: 98, baseType: !375, size: 32, offset: 2208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !315, file: !316, line: 99, baseType: !418, size: 64, offset: 2240)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !315, file: !316, line: 99, baseType: !418, size: 64, offset: 2304)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !315, file: !316, line: 100, baseType: !429, size: 64, offset: 2368)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !378)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !315, file: !316, line: 100, baseType: !432, size: 64, offset: 2432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !315, file: !316, line: 101, baseType: !375, size: 32, offset: 2496)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !315, file: !316, line: 101, baseType: !375, size: 32, offset: 2528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !315, file: !316, line: 102, baseType: !418, size: 64, offset: 2560)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !315, file: !316, line: 102, baseType: !418, size: 64, offset: 2624)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !315, file: !316, line: 103, baseType: !438, size: 64, offset: 2688)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !430)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !315, file: !316, line: 103, baseType: !441, size: 64, offset: 2752)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !315, file: !316, line: 104, baseType: !370, size: 64, offset: 2816)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !315, file: !316, line: 105, baseType: !375, size: 32, offset: 2880)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !315, file: !316, line: 106, baseType: !445, size: 128, offset: 2944)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 128, elements: !452)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !316, line: 64, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 61, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !448, file: !316, line: 62, baseType: !363, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !448, file: !316, line: 63, baseType: !412, size: 64, offset: 64)
!452 = !{!453}
!453 = !DISubrange(count: 2)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !315, file: !316, line: 107, baseType: !455, size: 64, offset: 3072)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 64, elements: !452)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !315, file: !316, line: 108, baseType: !412, size: 64, offset: 3136)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !315, file: !316, line: 109, baseType: !458, size: 64, offset: 3200)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!329, !412}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !315, file: !316, line: 111, baseType: !375, size: 32, offset: 3264)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !315, file: !316, line: 112, baseType: !463, size: 320, offset: 3328)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 320, elements: !509)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!329, !467, !313, !412}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !470)
!470 = !{!471, !472, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !469, file: !10, line: 100, baseType: !375, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !10, line: 101, baseType: !473, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !484, !485, !486, !490, !492, !494, !495, !496}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !475, file: !10, line: 84, baseType: !402, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !475, file: !10, line: 85, baseType: !402, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !10, line: 86, baseType: !412, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !475, file: !10, line: 87, baseType: !394, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !475, file: !10, line: 88, baseType: !482, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !475, file: !10, line: 89, baseType: !354, size: 8, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !475, file: !10, line: 90, baseType: !402, size: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !475, file: !10, line: 91, baseType: !487, size: 64, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !488, line: 46, baseType: !489)
!488 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!489 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !475, file: !10, line: 92, baseType: !491, size: 32, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !10, line: 93, baseType: !493, size: 32, offset: 544)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !10, line: 94, baseType: !473, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !475, file: !10, line: 95, baseType: !402, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !475, file: !10, line: 96, baseType: !412, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !469, file: !10, line: 102, baseType: !402, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !469, file: !10, line: 102, baseType: !402, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !469, file: !10, line: 103, baseType: !402, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !469, file: !10, line: 104, baseType: !331, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !469, file: !10, line: 105, baseType: !491, size: 32, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !469, file: !10, line: 105, baseType: !491, size: 32, offset: 416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !469, file: !10, line: 105, baseType: !491, size: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !469, file: !10, line: 106, baseType: !313, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !469, file: !10, line: 107, baseType: !506, size: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!509 = !{!510}
!510 = !DISubrange(count: 5)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !315, file: !316, line: 113, baseType: !512, size: 320, offset: 3648)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !509)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!329, !313, !412}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !315, file: !316, line: 114, baseType: !517, size: 320, offset: 3968)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 320, elements: !509)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !315, file: !316, line: 115, baseType: !491, size: 32, offset: 4288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !315, file: !316, line: 120, baseType: !506, size: 64, offset: 4352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !315, file: !316, line: 121, baseType: !491, size: 32, offset: 4416)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIMAIJ", file: !523, line: 17, baseType: !524)
!523 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/maij/maij.h", directory: "/home/users/ndemeye/xSDK")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 11, size: 384, elements: !525)
!525 = !{!526, !527, !1299, !1300, !1301, !1307}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dof", scope: !524, file: !523, line: 12, baseType: !375, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "AIJ", scope: !524, file: !523, line: 13, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !531, line: 436, size: 23424, elements: !532)
!531 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!532 = !{!533, !535, !1042, !1062, !1063, !1064, !1066, !1067, !1068, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1195, !1196, !1212, !1213, !1214, !1215, !1216, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1251, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1297, !1298}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !530, file: !531, line: 437, baseType: !534, size: 4480)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !316, line: 122, baseType: !315)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !530, file: !531, line: 437, baseType: !536, size: 9472, offset: 4480)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 9472, elements: !371)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !531, line: 32, size: 9472, elements: !538)
!538 = !{!539, !548, !552, !553, !560, !564, !565, !566, !567, !568, !569, !570, !594, !598, !603, !609, !628, !633, !637, !638, !643, !648, !649, !654, !658, !662, !666, !670, !674, !675, !676, !677, !678, !682, !683, !688, !689, !690, !691, !692, !697, !704, !709, !713, !717, !721, !725, !726, !730, !731, !738, !743, !744, !745, !746, !808, !816, !817, !821, !822, !826, !827, !831, !836, !837, !841, !845, !852, !853, !854, !855, !856, !857, !862, !863, !867, !871, !875, !876, !877, !881, !891, !892, !896, !897, !901, !902, !906, !907, !912, !913, !917, !921, !922, !923, !924, !925, !926, !927, !931, !932, !933, !934, !935, !936, !940, !941, !942, !943, !944, !945, !946, !947, !951, !955, !956, !957, !961, !962, !963, !964, !965, !966, !967, !971, !972, !973, !978, !982, !983, !987, !988, !989, !990, !1016, !1020, !1021, !1022, !1023, !1024, !1028, !1029, !1030, !1031, !1032, !1036, !1040, !1041}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !537, file: !531, line: 34, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!329, !528, !375, !543, !375, !543, !545, !547}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !537, file: !531, line: 35, baseType: !549, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!329, !528, !375, !421, !423, !441}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !537, file: !531, line: 36, baseType: !549, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !537, file: !531, line: 37, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!329, !528, !557, !557}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !537, file: !531, line: 38, baseType: !561, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!329, !528, !557, !557, !557}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !537, file: !531, line: 40, baseType: !554, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !537, file: !531, line: 41, baseType: !561, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !537, file: !531, line: 42, baseType: !554, size: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !537, file: !531, line: 43, baseType: !561, size: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !537, file: !531, line: 44, baseType: !554, size: 64, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !537, file: !531, line: 46, baseType: !561, size: 64, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !537, file: !531, line: 47, baseType: !571, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!329, !528, !574, !574, !578}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !575, line: 11, baseType: !576)
!575 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !575, line: 11, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !581, file: !36, line: 1227, baseType: !430, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !581, file: !36, line: 1228, baseType: !430, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !581, file: !36, line: 1229, baseType: !430, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !581, file: !36, line: 1230, baseType: !430, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !581, file: !36, line: 1231, baseType: !430, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !581, file: !36, line: 1232, baseType: !430, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !581, file: !36, line: 1233, baseType: !430, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !581, file: !36, line: 1234, baseType: !430, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !581, file: !36, line: 1236, baseType: !430, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !581, file: !36, line: 1237, baseType: !430, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !581, file: !36, line: 1238, baseType: !430, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !537, file: !531, line: 48, baseType: !595, size: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!329, !528, !574, !578}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !537, file: !531, line: 49, baseType: !599, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!329, !528, !557, !430, !602, !430, !375, !375, !557}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !537, file: !531, line: 50, baseType: !604, size: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!329, !528, !607, !608}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !537, file: !531, line: 52, baseType: !610, size: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!329, !528, !613, !614}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !616, file: !36, line: 593, baseType: !377, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !616, file: !36, line: 594, baseType: !377, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !616, file: !36, line: 594, baseType: !377, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !616, file: !36, line: 594, baseType: !377, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !616, file: !36, line: 595, baseType: !377, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !616, file: !36, line: 596, baseType: !377, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !616, file: !36, line: 597, baseType: !377, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !616, file: !36, line: 598, baseType: !377, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !616, file: !36, line: 598, baseType: !377, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !616, file: !36, line: 599, baseType: !377, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !537, file: !531, line: 53, baseType: !629, size: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!329, !528, !528, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !537, file: !531, line: 54, baseType: !634, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!329, !528, !557}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !537, file: !531, line: 55, baseType: !554, size: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !537, file: !531, line: 56, baseType: !639, size: 64, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!329, !528, !642, !429}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !537, file: !531, line: 58, baseType: !644, size: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!329, !528, !647}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !537, file: !531, line: 59, baseType: !644, size: 64, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !537, file: !531, line: 60, baseType: !650, size: 64, offset: 1408)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!329, !528, !653, !491}
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !537, file: !531, line: 61, baseType: !655, size: 64, offset: 1472)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!329, !528}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !537, file: !531, line: 63, baseType: !659, size: 64, offset: 1536)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!329, !528, !375, !543, !439, !557, !557}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !537, file: !531, line: 64, baseType: !663, size: 64, offset: 1600)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!329, !528, !528, !574, !574, !578}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !537, file: !531, line: 65, baseType: !667, size: 64, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!329, !528, !528, !578}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !537, file: !531, line: 66, baseType: !671, size: 64, offset: 1728)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!329, !528, !528, !574, !578}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !537, file: !531, line: 67, baseType: !667, size: 64, offset: 1792)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !537, file: !531, line: 69, baseType: !655, size: 64, offset: 1856)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !537, file: !531, line: 70, baseType: !663, size: 64, offset: 1920)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !537, file: !531, line: 71, baseType: !671, size: 64, offset: 1984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !537, file: !531, line: 72, baseType: !679, size: 64, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!329, !528, !608}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !537, file: !531, line: 73, baseType: !655, size: 64, offset: 2112)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !537, file: !531, line: 75, baseType: !684, size: 64, offset: 2176)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!329, !528, !687, !608}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !537, file: !531, line: 76, baseType: !554, size: 64, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !537, file: !531, line: 77, baseType: !554, size: 64, offset: 2304)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !537, file: !531, line: 78, baseType: !571, size: 64, offset: 2368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !537, file: !531, line: 79, baseType: !595, size: 64, offset: 2432)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !537, file: !531, line: 81, baseType: !693, size: 64, offset: 2496)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!329, !528, !439, !528, !696}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !537, file: !531, line: 82, baseType: !698, size: 64, offset: 2560)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!329, !528, !375, !701, !701, !607, !703}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !537, file: !531, line: 83, baseType: !705, size: 64, offset: 2624)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!329, !528, !375, !708, !375}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !537, file: !531, line: 84, baseType: !710, size: 64, offset: 2688)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!329, !528, !375, !543, !375, !543, !438}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !537, file: !531, line: 85, baseType: !714, size: 64, offset: 2752)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!329, !528, !528, !696}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !537, file: !531, line: 87, baseType: !718, size: 64, offset: 2816)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!329, !528, !557, !421}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !537, file: !531, line: 88, baseType: !722, size: 64, offset: 2880)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!329, !528, !439}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !537, file: !531, line: 89, baseType: !722, size: 64, offset: 2944)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !537, file: !531, line: 90, baseType: !727, size: 64, offset: 3008)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!329, !528, !557, !547}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !537, file: !531, line: 91, baseType: !659, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !537, file: !531, line: 93, baseType: !732, size: 64, offset: 3136)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!329, !528, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !537, file: !531, line: 94, baseType: !739, size: 64, offset: 3200)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!329, !528, !375, !491, !491, !421, !742, !742, !632}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !537, file: !531, line: 95, baseType: !739, size: 64, offset: 3264)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !537, file: !531, line: 96, baseType: !739, size: 64, offset: 3328)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !537, file: !531, line: 97, baseType: !739, size: 64, offset: 3392)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !537, file: !531, line: 99, baseType: !747, size: 64, offset: 3456)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!329, !528, !750, !753}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !575, line: 51, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !575, line: 51, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !531, line: 609, size: 6208, elements: !756)
!756 = !{!757, !758, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !777, !784, !785, !786, !787, !788, !789, !790, !791, !795, !796, !797, !798, !799, !801, !802, !803, !804, !805, !806, !807}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !755, file: !531, line: 610, baseType: !534, size: 4480)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !755, file: !531, line: 610, baseType: !759, size: 32, offset: 4480)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !371)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !755, file: !531, line: 611, baseType: !375, size: 32, offset: 4512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !755, file: !531, line: 611, baseType: !375, size: 32, offset: 4544)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !755, file: !531, line: 611, baseType: !375, size: 32, offset: 4576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !755, file: !531, line: 612, baseType: !375, size: 32, offset: 4608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !755, file: !531, line: 613, baseType: !375, size: 32, offset: 4640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !755, file: !531, line: 614, baseType: !421, size: 64, offset: 4672)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !755, file: !531, line: 615, baseType: !423, size: 64, offset: 4736)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !755, file: !531, line: 616, baseType: !708, size: 64, offset: 4800)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !755, file: !531, line: 617, baseType: !421, size: 64, offset: 4864)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !755, file: !531, line: 618, baseType: !770, size: 64, offset: 4928)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !531, line: 602, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 598, size: 128, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !772, file: !531, line: 599, baseType: !375, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !772, file: !531, line: 600, baseType: !375, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !772, file: !531, line: 601, baseType: !438, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !755, file: !531, line: 619, baseType: !778, size: 64, offset: 4992)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !531, line: 607, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 604, size: 128, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !780, file: !531, line: 605, baseType: !375, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !780, file: !531, line: 606, baseType: !438, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !755, file: !531, line: 620, baseType: !438, size: 64, offset: 5056)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !755, file: !531, line: 621, baseType: !430, size: 64, offset: 5120)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !755, file: !531, line: 622, baseType: !430, size: 64, offset: 5184)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !755, file: !531, line: 623, baseType: !557, size: 64, offset: 5248)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !755, file: !531, line: 623, baseType: !557, size: 64, offset: 5312)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !755, file: !531, line: 623, baseType: !557, size: 64, offset: 5376)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !755, file: !531, line: 624, baseType: !491, size: 32, offset: 5440)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !755, file: !531, line: 625, baseType: !792, size: 64, offset: 5504)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!329}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !755, file: !531, line: 626, baseType: !412, size: 64, offset: 5568)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !755, file: !531, line: 627, baseType: !557, size: 64, offset: 5632)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !755, file: !531, line: 628, baseType: !375, size: 32, offset: 5696)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !755, file: !531, line: 629, baseType: !352, size: 64, offset: 5760)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !755, file: !531, line: 630, baseType: !800, size: 32, offset: 5824)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !755, file: !531, line: 631, baseType: !375, size: 32, offset: 5856)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !755, file: !531, line: 631, baseType: !375, size: 32, offset: 5888)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !755, file: !531, line: 632, baseType: !491, size: 32, offset: 5920)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !755, file: !531, line: 633, baseType: !491, size: 32, offset: 5952)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !755, file: !531, line: 634, baseType: !363, size: 64, offset: 6016)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !755, file: !531, line: 634, baseType: !412, size: 64, offset: 6080)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !755, file: !531, line: 635, baseType: !383, size: 64, offset: 6144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !537, file: !531, line: 100, baseType: !809, size: 64, offset: 3520)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!329, !528, !375, !375, !812, !815}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !814)
!814 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !537, file: !531, line: 101, baseType: !655, size: 64, offset: 3584)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !537, file: !531, line: 102, baseType: !818, size: 64, offset: 3648)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!329, !528, !574, !574, !608}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !537, file: !531, line: 103, baseType: !540, size: 64, offset: 3712)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !537, file: !531, line: 105, baseType: !823, size: 64, offset: 3776)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!329, !528, !574, !574, !607, !608}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !537, file: !531, line: 106, baseType: !655, size: 64, offset: 3840)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !537, file: !531, line: 107, baseType: !828, size: 64, offset: 3904)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!329, !528, !339}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !537, file: !531, line: 108, baseType: !832, size: 64, offset: 3968)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!329, !528, !835, !607, !608}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !537, file: !531, line: 109, baseType: !792, size: 64, offset: 4032)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !537, file: !531, line: 111, baseType: !838, size: 64, offset: 4096)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!329, !528, !528, !528, !430, !528}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !537, file: !531, line: 112, baseType: !842, size: 64, offset: 4160)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!329, !528, !528, !528, !528}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !537, file: !531, line: 113, baseType: !846, size: 64, offset: 4224)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!329, !528, !849, !849}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !575, line: 30, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !575, line: 30, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !537, file: !531, line: 114, baseType: !540, size: 64, offset: 4288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !537, file: !531, line: 115, baseType: !659, size: 64, offset: 4352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !537, file: !531, line: 117, baseType: !718, size: 64, offset: 4416)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !537, file: !531, line: 118, baseType: !718, size: 64, offset: 4480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !537, file: !531, line: 119, baseType: !832, size: 64, offset: 4544)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !537, file: !531, line: 120, baseType: !858, size: 64, offset: 4608)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!329, !528, !861, !632}
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !537, file: !531, line: 121, baseType: !792, size: 64, offset: 4672)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !537, file: !531, line: 123, baseType: !864, size: 64, offset: 4736)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!329, !528, !375, !412}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !537, file: !531, line: 124, baseType: !868, size: 64, offset: 4800)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!329, !528, !753, !557, !412}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !537, file: !531, line: 125, baseType: !872, size: 64, offset: 4864)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!329, !467, !528}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !537, file: !531, line: 126, baseType: !554, size: 64, offset: 4928)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !537, file: !531, line: 127, baseType: !554, size: 64, offset: 4992)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !537, file: !531, line: 129, baseType: !878, size: 64, offset: 5056)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!329, !528, !708}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !537, file: !531, line: 130, baseType: !882, size: 64, offset: 5120)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!329, !528, !885, !885}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !887, file: !60, line: 653, baseType: !375, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !887, file: !60, line: 653, baseType: !557, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !537, file: !531, line: 131, baseType: !882, size: 64, offset: 5184)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !537, file: !531, line: 132, baseType: !893, size: 64, offset: 5248)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!329, !528, !421, !421, !421}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !537, file: !531, line: 133, baseType: !828, size: 64, offset: 5312)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !537, file: !531, line: 135, baseType: !898, size: 64, offset: 5376)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!329, !528, !430, !632}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !537, file: !531, line: 136, baseType: !898, size: 64, offset: 5440)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !537, file: !531, line: 137, baseType: !903, size: 64, offset: 5504)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!329, !528, !632}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !537, file: !531, line: 138, baseType: !540, size: 64, offset: 5568)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !537, file: !531, line: 139, baseType: !908, size: 64, offset: 5632)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!329, !528, !911, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !537, file: !531, line: 141, baseType: !792, size: 64, offset: 5696)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !537, file: !531, line: 142, baseType: !914, size: 64, offset: 5760)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!329, !528, !528, !430, !528}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !537, file: !531, line: 143, baseType: !918, size: 64, offset: 5824)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!329, !528, !528, !528}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !537, file: !531, line: 144, baseType: !792, size: 64, offset: 5888)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !537, file: !531, line: 145, baseType: !914, size: 64, offset: 5952)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !537, file: !531, line: 147, baseType: !918, size: 64, offset: 6016)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !537, file: !531, line: 148, baseType: !792, size: 64, offset: 6080)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !537, file: !531, line: 149, baseType: !914, size: 64, offset: 6144)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !537, file: !531, line: 150, baseType: !918, size: 64, offset: 6208)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !537, file: !531, line: 151, baseType: !928, size: 64, offset: 6272)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!329, !528, !491}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !537, file: !531, line: 153, baseType: !655, size: 64, offset: 6336)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !537, file: !531, line: 154, baseType: !655, size: 64, offset: 6400)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !537, file: !531, line: 155, baseType: !655, size: 64, offset: 6464)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !537, file: !531, line: 156, baseType: !655, size: 64, offset: 6528)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !537, file: !531, line: 157, baseType: !828, size: 64, offset: 6592)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !537, file: !531, line: 159, baseType: !937, size: 64, offset: 6656)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!329, !528, !375, !545}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !537, file: !531, line: 160, baseType: !655, size: 64, offset: 6720)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !537, file: !531, line: 161, baseType: !655, size: 64, offset: 6784)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !537, file: !531, line: 162, baseType: !655, size: 64, offset: 6848)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !537, file: !531, line: 163, baseType: !655, size: 64, offset: 6912)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !537, file: !531, line: 165, baseType: !918, size: 64, offset: 6976)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !537, file: !531, line: 166, baseType: !918, size: 64, offset: 7040)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !537, file: !531, line: 167, baseType: !718, size: 64, offset: 7104)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !537, file: !531, line: 168, baseType: !948, size: 64, offset: 7168)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!329, !528, !557, !375}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !537, file: !531, line: 169, baseType: !952, size: 64, offset: 7232)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!329, !528, !632, !421}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !537, file: !531, line: 171, baseType: !679, size: 64, offset: 7296)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !537, file: !531, line: 172, baseType: !655, size: 64, offset: 7360)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !537, file: !531, line: 173, baseType: !958, size: 64, offset: 7424)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!329, !528, !421, !742}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !537, file: !531, line: 174, baseType: !818, size: 64, offset: 7488)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !537, file: !531, line: 175, baseType: !818, size: 64, offset: 7552)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !537, file: !531, line: 177, baseType: !554, size: 64, offset: 7616)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !537, file: !531, line: 178, baseType: !604, size: 64, offset: 7680)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !537, file: !531, line: 179, baseType: !554, size: 64, offset: 7744)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !537, file: !531, line: 180, baseType: !561, size: 64, offset: 7808)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !537, file: !531, line: 181, baseType: !968, size: 64, offset: 7872)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!329, !528, !331, !607, !608}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !537, file: !531, line: 183, baseType: !878, size: 64, offset: 7936)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !537, file: !531, line: 184, baseType: !639, size: 64, offset: 8000)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !537, file: !531, line: 185, baseType: !974, size: 64, offset: 8064)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!329, !528, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !537, file: !531, line: 186, baseType: !979, size: 64, offset: 8128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!329, !528, !375, !543, !438}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !537, file: !531, line: 187, baseType: !698, size: 64, offset: 8192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !537, file: !531, line: 189, baseType: !984, size: 64, offset: 8256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!329, !528, !375, !375, !421, !545}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !537, file: !531, line: 190, baseType: !792, size: 64, offset: 8320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !537, file: !531, line: 191, baseType: !914, size: 64, offset: 8384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !537, file: !531, line: 192, baseType: !918, size: 64, offset: 8448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !537, file: !531, line: 193, baseType: !991, size: 64, offset: 8512)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!329, !528, !750, !994}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !531, line: 660, size: 5312, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !996, file: !531, line: 661, baseType: !534, size: 4480)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !996, file: !531, line: 661, baseType: !759, size: 32, offset: 4480)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !996, file: !531, line: 662, baseType: !375, size: 32, offset: 4512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !996, file: !531, line: 662, baseType: !375, size: 32, offset: 4544)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !996, file: !531, line: 662, baseType: !375, size: 32, offset: 4576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !996, file: !531, line: 663, baseType: !375, size: 32, offset: 4608)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !996, file: !531, line: 664, baseType: !375, size: 32, offset: 4640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !996, file: !531, line: 665, baseType: !421, size: 64, offset: 4672)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !996, file: !531, line: 666, baseType: !421, size: 64, offset: 4736)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !996, file: !531, line: 667, baseType: !375, size: 32, offset: 4800)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !996, file: !531, line: 668, baseType: !800, size: 32, offset: 4832)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !996, file: !531, line: 670, baseType: !421, size: 64, offset: 4864)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !996, file: !531, line: 670, baseType: !421, size: 64, offset: 4928)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !996, file: !531, line: 671, baseType: !421, size: 64, offset: 4992)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !996, file: !531, line: 672, baseType: !421, size: 64, offset: 5056)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !996, file: !531, line: 673, baseType: !421, size: 64, offset: 5120)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !996, file: !531, line: 674, baseType: !375, size: 32, offset: 5184)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !996, file: !531, line: 675, baseType: !421, size: 64, offset: 5248)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !537, file: !531, line: 195, baseType: !1017, size: 64, offset: 8576)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!329, !994, !528, !528}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !537, file: !531, line: 196, baseType: !1017, size: 64, offset: 8640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !537, file: !531, line: 197, baseType: !792, size: 64, offset: 8704)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !537, file: !531, line: 198, baseType: !914, size: 64, offset: 8768)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !537, file: !531, line: 199, baseType: !918, size: 64, offset: 8832)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !537, file: !531, line: 201, baseType: !1025, size: 64, offset: 8896)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!329, !528, !375, !375}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !537, file: !531, line: 202, baseType: !693, size: 64, offset: 8960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !537, file: !531, line: 203, baseType: !561, size: 64, offset: 9024)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !537, file: !531, line: 204, baseType: !747, size: 64, offset: 9088)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !537, file: !531, line: 205, baseType: !878, size: 64, offset: 9152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !537, file: !531, line: 206, baseType: !1033, size: 64, offset: 9216)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!329, !331, !528, !375, !607, !608}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !537, file: !531, line: 208, baseType: !1037, size: 64, offset: 9280)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!329, !375, !703}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !537, file: !531, line: 209, baseType: !918, size: 64, offset: 9344)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !537, file: !531, line: 210, baseType: !710, size: 64, offset: 9408)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !530, file: !531, line: 438, baseType: !1043, size: 64, offset: 13952)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !575, line: 60, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1045, file: !114, line: 241, baseType: !331, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !114, line: 242, baseType: !392, size: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1045, file: !114, line: 243, baseType: !375, size: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1045, file: !114, line: 243, baseType: !375, size: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1045, file: !114, line: 244, baseType: !375, size: 32, offset: 160)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1045, file: !114, line: 244, baseType: !375, size: 32, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1045, file: !114, line: 245, baseType: !421, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1045, file: !114, line: 246, baseType: !491, size: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1045, file: !114, line: 247, baseType: !375, size: 32, offset: 352)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1045, file: !114, line: 251, baseType: !375, size: 32, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1045, file: !114, line: 252, baseType: !849, size: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1045, file: !114, line: 253, baseType: !491, size: 32, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1045, file: !114, line: 254, baseType: !375, size: 32, offset: 544)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1045, file: !114, line: 254, baseType: !375, size: 32, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1045, file: !114, line: 255, baseType: !375, size: 32, offset: 608)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !530, file: !531, line: 438, baseType: !1043, size: 64, offset: 14016)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !531, line: 439, baseType: !412, size: 64, offset: 14080)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !530, file: !531, line: 440, baseType: !1065, size: 32, offset: 14144)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !530, file: !531, line: 441, baseType: !491, size: 32, offset: 14176)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !530, file: !531, line: 442, baseType: !491, size: 32, offset: 14208)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !530, file: !531, line: 443, baseType: !1069, size: 448, offset: 14272)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 448, elements: !1071)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !352)
!1071 = !{!1072}
!1072 = !DISubrange(count: 7)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !530, file: !531, line: 444, baseType: !491, size: 32, offset: 14720)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !530, file: !531, line: 445, baseType: !491, size: 32, offset: 14752)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !530, file: !531, line: 446, baseType: !375, size: 32, offset: 14784)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !530, file: !531, line: 447, baseType: !414, size: 64, offset: 14848)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !530, file: !531, line: 448, baseType: !414, size: 64, offset: 14912)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !530, file: !531, line: 449, baseType: !615, size: 640, offset: 14976)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !530, file: !531, line: 450, baseType: !547, size: 32, offset: 15616)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !530, file: !531, line: 451, baseType: !1081, size: 2880, offset: 15680)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !531, line: 318, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !531, line: 319, size: 2880, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1089, !1090, !1103, !1104, !1109, !1114, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1129, !1130, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1162, !1163, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1186, !1187, !1188, !1192, !1193}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1082, file: !531, line: 320, baseType: !375, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1082, file: !531, line: 321, baseType: !375, size: 32, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1082, file: !531, line: 322, baseType: !375, size: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1082, file: !531, line: 323, baseType: !375, size: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1082, file: !531, line: 324, baseType: !375, size: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1082, file: !531, line: 325, baseType: !375, size: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1082, file: !531, line: 326, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !531, line: 293, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !531, line: 295, size: 448, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !531, line: 296, baseType: !1091, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1093, file: !531, line: 297, baseType: !438, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1093, file: !531, line: 297, baseType: !438, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1093, file: !531, line: 298, baseType: !421, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1093, file: !531, line: 298, baseType: !421, size: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1093, file: !531, line: 299, baseType: !375, size: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1093, file: !531, line: 300, baseType: !375, size: 32, offset: 352)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1093, file: !531, line: 301, baseType: !375, size: 32, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1082, file: !531, line: 326, baseType: !1091, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1082, file: !531, line: 328, baseType: !1105, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!329, !528, !1108, !421}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1082, file: !531, line: 329, baseType: !1110, size: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!329, !1108, !1113, !423, !423, !441, !421}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1082, file: !531, line: 330, baseType: !1115, size: 64, offset: 448)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!329, !1108}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1082, file: !531, line: 331, baseType: !1115, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1082, file: !531, line: 334, baseType: !331, size: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !531, line: 335, baseType: !392, size: 32, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1082, file: !531, line: 335, baseType: !392, size: 32, offset: 672)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1082, file: !531, line: 336, baseType: !392, size: 32, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1082, file: !531, line: 336, baseType: !392, size: 32, offset: 736)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1082, file: !531, line: 337, baseType: !1125, size: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !332, line: 339, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !332, line: 339, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1082, file: !531, line: 338, baseType: !1125, size: 64, offset: 832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1082, file: !531, line: 339, baseType: !1131, size: 64, offset: 896)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !332, line: 341, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !332, line: 351, size: 192, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1133, file: !332, line: 354, baseType: !72, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1133, file: !332, line: 355, baseType: !72, size: 32, offset: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1133, file: !332, line: 356, baseType: !72, size: 32, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1133, file: !332, line: 361, baseType: !72, size: 32, offset: 96)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1133, file: !332, line: 362, baseType: !487, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1082, file: !531, line: 340, baseType: !375, size: 32, offset: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1082, file: !531, line: 340, baseType: !375, size: 32, offset: 992)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1082, file: !531, line: 341, baseType: !438, size: 64, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1082, file: !531, line: 342, baseType: !421, size: 64, offset: 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1082, file: !531, line: 343, baseType: !441, size: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1082, file: !531, line: 344, baseType: !423, size: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1082, file: !531, line: 345, baseType: !375, size: 32, offset: 1280)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1082, file: !531, line: 346, baseType: !1113, size: 64, offset: 1344)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1082, file: !531, line: 347, baseType: !491, size: 32, offset: 1408)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1082, file: !531, line: 348, baseType: !375, size: 32, offset: 1440)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1082, file: !531, line: 351, baseType: !491, size: 32, offset: 1472)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1082, file: !531, line: 352, baseType: !491, size: 32, offset: 1504)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1082, file: !531, line: 353, baseType: !392, size: 32, offset: 1536)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1082, file: !531, line: 354, baseType: !392, size: 32, offset: 1568)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1082, file: !531, line: 355, baseType: !1113, size: 64, offset: 1600)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1082, file: !531, line: 356, baseType: !1113, size: 64, offset: 1664)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1082, file: !531, line: 357, baseType: !1157, size: 64, offset: 1728)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !531, line: 310, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 308, size: 32, elements: !1160)
!1160 = !{!1161}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1159, file: !531, line: 309, baseType: !375, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1082, file: !531, line: 357, baseType: !1157, size: 64, offset: 1792)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1082, file: !531, line: 358, baseType: !1164, size: 64, offset: 1856)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !531, line: 316, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 312, size: 128, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1166, file: !531, line: 313, baseType: !412, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1166, file: !531, line: 314, baseType: !375, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1166, file: !531, line: 315, baseType: !354, size: 8, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1082, file: !531, line: 359, baseType: !1164, size: 64, offset: 1920)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1082, file: !531, line: 360, baseType: !1164, size: 64, offset: 1984)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1082, file: !531, line: 361, baseType: !375, size: 32, offset: 2048)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1082, file: !531, line: 362, baseType: !392, size: 32, offset: 2080)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1082, file: !531, line: 363, baseType: !375, size: 32, offset: 2112)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1082, file: !531, line: 364, baseType: !1113, size: 64, offset: 2176)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1082, file: !531, line: 365, baseType: !1131, size: 64, offset: 2240)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1082, file: !531, line: 366, baseType: !392, size: 32, offset: 2304)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1082, file: !531, line: 367, baseType: !392, size: 32, offset: 2336)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1082, file: !531, line: 368, baseType: !1125, size: 64, offset: 2368)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1082, file: !531, line: 369, baseType: !1125, size: 64, offset: 2432)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1082, file: !531, line: 370, baseType: !1183, size: 64, offset: 2496)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1082, file: !531, line: 371, baseType: !1183, size: 64, offset: 2560)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1082, file: !531, line: 372, baseType: !1183, size: 64, offset: 2624)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1082, file: !531, line: 373, baseType: !1189, size: 64, offset: 2688)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !332, line: 331, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !332, line: 331, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1082, file: !531, line: 374, baseType: !487, size: 64, offset: 2752)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1082, file: !531, line: 375, baseType: !1194, size: 64, offset: 2816)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !530, file: !531, line: 451, baseType: !1081, size: 2880, offset: 18560)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !530, file: !531, line: 452, baseType: !1197, size: 64, offset: 21440)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !531, line: 681, size: 4864, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1199, file: !531, line: 682, baseType: !534, size: 4480)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1199, file: !531, line: 682, baseType: !759, size: 32, offset: 4480)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1199, file: !531, line: 683, baseType: !491, size: 32, offset: 4512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1199, file: !531, line: 684, baseType: !375, size: 32, offset: 4544)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1199, file: !531, line: 685, baseType: !911, size: 64, offset: 4608)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1199, file: !531, line: 686, baseType: !438, size: 64, offset: 4672)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1199, file: !531, line: 687, baseType: !1208, size: 64, offset: 4736)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!329, !1197, !557, !412}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1199, file: !531, line: 688, baseType: !412, size: 64, offset: 4800)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !530, file: !531, line: 453, baseType: !1197, size: 64, offset: 21504)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !530, file: !531, line: 454, baseType: !1197, size: 64, offset: 21568)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !530, file: !531, line: 455, baseType: !375, size: 32, offset: 21632)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !530, file: !531, line: 456, baseType: !491, size: 32, offset: 21664)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !530, file: !531, line: 457, baseType: !1217, size: 320, offset: 21696)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !531, line: 399, baseType: !1218)
