; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/interface/partitionerreg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/interface/partitionerreg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscPartitioner = type { %struct._p_PetscObject, [1 x %struct._PetscPartitionerOps], i8*, i32, i32, double, %struct._p_PetscViewer*, %struct._p_PetscViewer*, i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !{!33, !38, !42, !43}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !34, line: 1451, baseType: !35)
!34 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !39, line: 330, baseType: !40)
!39 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !39, line: 330, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !{!0, !47, !53, !56}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "PetscPartitionerList", scope: !2, file: !49, line: 5, type: !50, isLocal: false, isDefinition: true)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/partitioner/interface/partitionerreg.c", directory: "/home/users/ndemeye/xSDK")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "PetscPartitionerRegisterAllCalled", scope: !2, file: !49, line: 6, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "PetscPartitionerPackageInitialized", scope: !2, file: !49, line: 87, type: !55, isLocal: true, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !59)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!61 = !{i32 7, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 4}
!64 = !{i32 7, !"PIC Level", i32 2}
!65 = !{i32 7, !"uwtable", i32 1}
!66 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!67 = distinct !DISubprogram(name: "PetscPartitionerRegister", scope: !49, file: !49, line: 40, type: !68, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !310)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !43, !71}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !59)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!70, !74}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPartitioner", file: !75, line: 13, baseType: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpartitioner.h", directory: "/home/users/ndemeye/xSDK")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscPartitioner", file: !78, line: 21, size: 5312, elements: !79)
!78 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/partitionerimpl.h", directory: "/home/users/ndemeye/xSDK")
!79 = !{!80, !273, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !77, file: !78, line: 22, baseType: !81, size: 4480)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !84)
!84 = !{!85, !86, !130, !131, !133, !136, !137, !138, !139, !147, !148, !150, !151, !155, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !172, !173, !175, !177, !178, !179, !180, !181, !184, !186, !187, !188, !189, !190, !193, !195, !196, !197, !207, !209, !210, !214, !215, !263, !268, !270, !271, !272}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !83, file: !82, line: 74, baseType: !58, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !83, file: !82, line: 75, baseType: !87, size: 448, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !90)
!90 = !{!91, !98, !106, !111, !115, !119, !123}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !89, file: !82, line: 46, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!70, !95, !97}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !89, file: !82, line: 47, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!70, !95, !102}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !103, line: 16, baseType: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !103, line: 16, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !89, file: !82, line: 48, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!70, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !89, file: !82, line: 49, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!70, !95, !43, !95}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !89, file: !82, line: 50, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!70, !95, !43, !110}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !89, file: !82, line: 51, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!70, !95, !43, !35}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !89, file: !82, line: 52, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!70, !95, !43, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!128 = !{!129}
!129 = !DISubrange(count: 1)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !83, file: !82, line: 76, baseType: !38, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !82, line: 77, baseType: !132, size: 32, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !59)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !83, file: !82, line: 78, baseType: !134, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !135)
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !83, file: !82, line: 78, baseType: !134, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !83, file: !82, line: 78, baseType: !134, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !83, file: !82, line: 78, baseType: !134, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !83, file: !82, line: 79, baseType: !140, size: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !143, line: 27, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !145, line: 43, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!146 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !83, file: !82, line: 80, baseType: !132, size: 32, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !83, file: !82, line: 81, baseType: !149, size: 32, offset: 992)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !59)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !83, file: !82, line: 82, baseType: !50, size: 64, offset: 1024)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !83, file: !82, line: 83, baseType: !152, size: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !83, file: !82, line: 84, baseType: !156, size: 64, offset: 1152)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !83, file: !82, line: 85, baseType: !156, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !83, file: !82, line: 86, baseType: !156, size: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !83, file: !82, line: 87, baseType: !156, size: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !83, file: !82, line: 88, baseType: !95, size: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !83, file: !82, line: 89, baseType: !140, size: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !82, line: 90, baseType: !156, size: 64, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !83, file: !82, line: 91, baseType: !156, size: 64, offset: 1600)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !83, file: !82, line: 92, baseType: !132, size: 32, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !83, file: !82, line: 93, baseType: !42, size: 64, offset: 1728)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !83, file: !82, line: 94, baseType: !167, size: 64, offset: 1792)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !141)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !83, file: !82, line: 95, baseType: !132, size: 32, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !83, file: !82, line: 95, baseType: !132, size: 32, offset: 1888)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !83, file: !82, line: 96, baseType: !171, size: 64, offset: 1920)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !83, file: !82, line: 96, baseType: !171, size: 64, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !83, file: !82, line: 97, baseType: !174, size: 64, offset: 2048)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !83, file: !82, line: 97, baseType: !176, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !83, file: !82, line: 98, baseType: !132, size: 32, offset: 2176)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !83, file: !82, line: 98, baseType: !132, size: 32, offset: 2208)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !83, file: !82, line: 99, baseType: !171, size: 64, offset: 2240)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !83, file: !82, line: 99, baseType: !171, size: 64, offset: 2304)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !83, file: !82, line: 100, baseType: !182, size: 64, offset: 2368)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !135)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !83, file: !82, line: 100, baseType: !185, size: 64, offset: 2432)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !83, file: !82, line: 101, baseType: !132, size: 32, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !83, file: !82, line: 101, baseType: !132, size: 32, offset: 2528)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !83, file: !82, line: 102, baseType: !171, size: 64, offset: 2560)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !83, file: !82, line: 102, baseType: !171, size: 64, offset: 2624)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !83, file: !82, line: 103, baseType: !191, size: 64, offset: 2688)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !183)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !83, file: !82, line: 103, baseType: !194, size: 64, offset: 2752)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !83, file: !82, line: 104, baseType: !127, size: 64, offset: 2816)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !83, file: !82, line: 105, baseType: !132, size: 32, offset: 2880)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !83, file: !82, line: 106, baseType: !198, size: 128, offset: 2944)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 128, elements: !205)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !201, file: !82, line: 62, baseType: !35, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !201, file: !82, line: 63, baseType: !42, size: 64, offset: 64)
!205 = !{!206}
!206 = !DISubrange(count: 2)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !83, file: !82, line: 107, baseType: !208, size: 64, offset: 3072)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !205)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !83, file: !82, line: 108, baseType: !42, size: 64, offset: 3136)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !83, file: !82, line: 109, baseType: !211, size: 64, offset: 3200)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!70, !42}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !83, file: !82, line: 111, baseType: !132, size: 32, offset: 3264)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !83, file: !82, line: 112, baseType: !216, size: 320, offset: 3328)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 320, elements: !261)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!70, !220, !95, !42}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !223)
!223 = !{!224, !225, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !222, file: !12, line: 100, baseType: !132, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !12, line: 101, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !237, !238, !239, !243, !244, !246, !247, !248}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !228, file: !12, line: 84, baseType: !156, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !228, file: !12, line: 85, baseType: !156, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !12, line: 86, baseType: !42, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !228, file: !12, line: 87, baseType: !50, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !228, file: !12, line: 88, baseType: !235, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !228, file: !12, line: 89, baseType: !45, size: 8, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !228, file: !12, line: 90, baseType: !156, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !228, file: !12, line: 91, baseType: !240, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !241, line: 46, baseType: !242)
!241 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!242 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !228, file: !12, line: 92, baseType: !55, size: 32, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !12, line: 93, baseType: !245, size: 32, offset: 544)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !12, line: 94, baseType: !226, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !228, file: !12, line: 95, baseType: !156, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !228, file: !12, line: 96, baseType: !42, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !222, file: !12, line: 102, baseType: !156, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !222, file: !12, line: 102, baseType: !156, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !222, file: !12, line: 103, baseType: !156, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !222, file: !12, line: 104, baseType: !38, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !222, file: !12, line: 105, baseType: !55, size: 32, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !222, file: !12, line: 105, baseType: !55, size: 32, offset: 416)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !222, file: !12, line: 105, baseType: !55, size: 32, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !222, file: !12, line: 106, baseType: !95, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !222, file: !12, line: 107, baseType: !258, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!261 = !{!262}
!262 = !DISubrange(count: 5)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !83, file: !82, line: 113, baseType: !264, size: 320, offset: 3648)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 320, elements: !261)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!70, !95, !42}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !83, file: !82, line: 114, baseType: !269, size: 320, offset: 3968)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, elements: !261)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !83, file: !82, line: 115, baseType: !55, size: 32, offset: 4288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !83, file: !82, line: 120, baseType: !258, size: 64, offset: 4352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !83, file: !82, line: 121, baseType: !55, size: 32, offset: 4416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !77, file: !78, line: 22, baseType: !274, size: 384, offset: 4480)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 384, elements: !128)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscPartitionerOps", file: !78, line: 12, size: 384, elements: !276)
!276 = !{!277, !281, !282, !283, !287, !288}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !275, file: !78, line: 13, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!70, !220, !74}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !275, file: !78, line: 14, baseType: !71, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !275, file: !78, line: 15, baseType: !71, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !275, file: !78, line: 16, baseType: !284, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!70, !74, !102}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !275, file: !78, line: 17, baseType: !71, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !275, file: !78, line: 18, baseType: !289, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!70, !74, !132, !132, !174, !174, !292, !292, !292, !296}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !293, line: 18, baseType: !294)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !293, line: 18, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !298, line: 11, baseType: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !298, line: 11, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !78, line: 23, baseType: !42, size: 64, offset: 4864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !77, file: !78, line: 24, baseType: !132, size: 32, offset: 4928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "edgeCut", scope: !77, file: !78, line: 25, baseType: !132, size: 32, offset: 4960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !77, file: !78, line: 26, baseType: !183, size: 64, offset: 4992)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !77, file: !78, line: 27, baseType: !102, size: 64, offset: 5056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "viewerGraph", scope: !77, file: !78, line: 28, baseType: !102, size: 64, offset: 5120)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "viewGraph", scope: !77, file: !78, line: 29, baseType: !55, size: 32, offset: 5184)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "noGraph", scope: !77, file: !78, line: 30, baseType: !55, size: 32, offset: 5216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "usevwgt", scope: !77, file: !78, line: 31, baseType: !55, size: 32, offset: 5248)
!310 = !{!311, !312, !313, !314}
!311 = !DILocalVariable(name: "sname", arg: 1, scope: !67, file: !49, line: 40, type: !43)
!312 = !DILocalVariable(name: "function", arg: 2, scope: !67, file: !49, line: 40, type: !71)
!313 = !DILocalVariable(name: "ierr", scope: !67, file: !49, line: 42, type: !70)
!314 = !DILocalVariable(name: "ierr__", scope: !315, file: !49, line: 45, type: !70)
!315 = distinct !DILexicalBlock(scope: !67, file: !49, line: 45, column: 71)
!316 = !DILocation(line: 0, scope: !67)
!317 = !DILocation(line: 44, column: 3, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !49, line: 44, column: 3)
!319 = distinct !DILexicalBlock(scope: !320, file: !49, line: 44, column: 3)
!320 = distinct !DILexicalBlock(scope: !67, file: !49, line: 44, column: 3)
!321 = !{!322, !322, i64 0}
!322 = !{!"any pointer", !323, i64 0}
!323 = !{!"omnipotent char", !324, i64 0}
!324 = !{!"Simple C/C++ TBAA"}
!325 = !DILocation(line: 44, column: 3, scope: !319)
!326 = !DILocation(line: 44, column: 3, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !49, line: 44, column: 3)
!328 = distinct !DILexicalBlock(scope: !318, file: !49, line: 44, column: 3)
!329 = !{!330, !331, i64 1536}
!330 = !{!"", !323, i64 0, !323, i64 512, !323, i64 1024, !323, i64 1280, !331, i64 1536, !331, i64 1540, !323, i64 1544}
!331 = !{!"int", !323, i64 0}
!332 = !DILocation(line: 44, column: 3, scope: !328)
!333 = !DILocation(line: 44, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !327, file: !49, line: 44, column: 3)
!335 = !{!331, !331, i64 0}
!336 = !{!330, !331, i64 1540}
!337 = !DILocation(line: 45, column: 10, scope: !67)
!338 = !DILocation(line: 0, scope: !315)
!339 = !DILocation(line: 45, column: 71, scope: !340)
!340 = distinct !DILexicalBlock(scope: !315, file: !49, line: 45, column: 71)
!341 = !DILocation(line: 45, column: 71, scope: !315)
!342 = !{!"branch_weights", i32 2000, i32 1}
!343 = !DILocation(line: 46, column: 3, scope: !344)
!344 = distinct !DILexicalBlock(scope: !345, file: !49, line: 46, column: 3)
!345 = distinct !DILexicalBlock(scope: !346, file: !49, line: 46, column: 3)
!346 = distinct !DILexicalBlock(scope: !67, file: !49, line: 46, column: 3)
!347 = !DILocation(line: 46, column: 3, scope: !345)
!348 = !DILocation(line: 46, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !350, file: !49, line: 46, column: 3)
!350 = distinct !DILexicalBlock(scope: !344, file: !49, line: 46, column: 3)
!351 = !DILocation(line: 46, column: 3, scope: !350)
!352 = !DILocation(line: 46, column: 3, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !49, line: 46, column: 3)
!354 = distinct !DILexicalBlock(scope: !349, file: !49, line: 46, column: 3)
!355 = !{!330, !323, i64 1544}
!356 = !DILocation(line: 46, column: 3, scope: !354)
!357 = !DILocation(line: 46, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !353, file: !49, line: 46, column: 3)
!359 = !DILocation(line: 46, column: 3, scope: !360)
!360 = distinct !DILexicalBlock(scope: !349, file: !49, line: 46, column: 3)
!361 = !DILocation(line: 46, column: 3, scope: !362)
!362 = distinct !DILexicalBlock(scope: !360, file: !49, line: 46, column: 3)
!363 = !DILocation(line: 46, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !49, line: 46, column: 3)
!365 = distinct !DILexicalBlock(scope: !362, file: !49, line: 46, column: 3)
!366 = !DILocation(line: 46, column: 3, scope: !365)
!367 = !DILocation(line: 46, column: 3, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !49, line: 46, column: 3)
!369 = !DILocation(line: 47, column: 1, scope: !67)
!370 = !DISubprogram(name: "PetscFunctionListAdd_Private", scope: !34, file: !34, line: 1564, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !374)
!371 = !DISubroutineType(types: !372)
