; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/inode.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/inode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1189, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!311 = !{!312, !392, !471, !413, !1402, !355, !542, !389, !356, !1404, !1013, !461}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqAIJ", file: !314, line: 125, baseType: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 114, size: 2816, elements: !316)
!316 = !{!317, !319, !321, !322, !323, !324, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !344, !345, !346, !347, !348, !349, !350, !357, !359, !364, !365, !366, !367, !1335, !1376, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !315, file: !314, line: 115, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 544)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !315, file: !314, line: 115, baseType: !336, size: 192, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !337, line: 407, baseType: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 402, size: 192, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !338, file: !337, line: 403, baseType: !318, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !338, file: !337, line: 404, baseType: !320, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !338, file: !337, line: 405, baseType: !325, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !338, file: !337, line: 406, baseType: !325, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !315, file: !314, line: 115, baseType: !325, size: 64, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !315, file: !314, line: 115, baseType: !320, size: 32, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 1120)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !315, file: !314, line: 115, baseType: !351, size: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !353, line: 799, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !356)
!356 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !315, file: !314, line: 115, baseType: !358, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !315, file: !314, line: 115, baseType: !360, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !361, line: 11, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !361, line: 11, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !315, file: !314, line: 115, baseType: !360, size: 64, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !315, file: !314, line: 115, baseType: !360, size: 64, offset: 1408)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !315, file: !314, line: 115, baseType: !318, size: 32, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !315, file: !314, line: 115, baseType: !368, size: 64, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !337, line: 436, size: 23424, elements: !371)
!371 = !{!372, !575, !1078, !1098, !1099, !1100, !1102, !1103, !1104, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1231, !1232, !1248, !1249, !1250, !1251, !1252, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1287, !1307, !1308, !1310, !1311, !1312, !1313, !1314, !1315, !1333, !1334}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !337, line: 437, baseType: !373, size: 4480)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !374, line: 122, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !374, line: 73, size: 4480, elements: !376)
!376 = !{!377, !379, !434, !435, !436, !438, !439, !440, !441, !449, !450, !452, !456, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !472, !474, !475, !476, !478, !479, !480, !482, !483, !484, !485, !486, !488, !490, !491, !492, !493, !494, !495, !497, !498, !499, !509, !511, !512, !516, !517, !565, !570, !572, !573, !574}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !375, file: !374, line: 74, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !375, file: !374, line: 75, baseType: !380, size: 448, offset: 64)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 448, elements: !432)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !374, line: 53, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 45, size: 448, elements: !383)
!383 = !{!384, !396, !404, !409, !416, !420, !427}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !382, file: !374, line: 46, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!388, !389, !391}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !393, line: 330, baseType: !394)
!393 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !393, line: 330, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !382, file: !374, line: 47, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!388, !389, !400}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !401, line: 16, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !401, line: 16, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !382, file: !374, line: 48, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!388, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !382, file: !374, line: 49, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!388, !389, !413, !389}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !382, file: !374, line: 50, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!388, !389, !413, !408}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !382, file: !374, line: 51, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!388, !389, !413, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !382, file: !374, line: 52, baseType: !428, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!388, !389, !413, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!432 = !{!433}
!433 = !DISubrange(count: 1)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !375, file: !374, line: 76, baseType: !392, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !374, line: 77, baseType: !320, size: 32, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !375, file: !374, line: 78, baseType: !437, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !356)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !375, file: !374, line: 78, baseType: !437, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !375, file: !374, line: 78, baseType: !437, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !375, file: !374, line: 78, baseType: !437, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !375, file: !374, line: 79, baseType: !442, size: 64, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !445, line: 27, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !447, line: 43, baseType: !448)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!448 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !375, file: !374, line: 80, baseType: !320, size: 32, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !375, file: !374, line: 81, baseType: !451, size: 32, offset: 992)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !375, file: !374, line: 82, baseType: !453, size: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !375, file: !374, line: 83, baseType: !457, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !375, file: !374, line: 84, baseType: !461, size: 64, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !375, file: !374, line: 85, baseType: !461, size: 64, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !375, file: !374, line: 86, baseType: !461, size: 64, offset: 1280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !375, file: !374, line: 87, baseType: !461, size: 64, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !375, file: !374, line: 88, baseType: !389, size: 64, offset: 1408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !375, file: !374, line: 89, baseType: !442, size: 64, offset: 1472)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !374, line: 90, baseType: !461, size: 64, offset: 1536)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !375, file: !374, line: 91, baseType: !461, size: 64, offset: 1600)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !375, file: !374, line: 92, baseType: !320, size: 32, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !375, file: !374, line: 93, baseType: !471, size: 64, offset: 1728)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !374, line: 94, baseType: !473, size: 64, offset: 1792)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !443)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !375, file: !374, line: 95, baseType: !320, size: 32, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !375, file: !374, line: 95, baseType: !320, size: 32, offset: 1888)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !375, file: !374, line: 96, baseType: !477, size: 64, offset: 1920)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !375, file: !374, line: 96, baseType: !477, size: 64, offset: 1984)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !375, file: !374, line: 97, baseType: !325, size: 64, offset: 2048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !375, file: !374, line: 97, baseType: !481, size: 64, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !375, file: !374, line: 98, baseType: !320, size: 32, offset: 2176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !375, file: !374, line: 98, baseType: !320, size: 32, offset: 2208)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !375, file: !374, line: 99, baseType: !477, size: 64, offset: 2240)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !375, file: !374, line: 99, baseType: !477, size: 64, offset: 2304)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !375, file: !374, line: 100, baseType: !487, size: 64, offset: 2368)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !375, file: !374, line: 100, baseType: !489, size: 64, offset: 2432)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !375, file: !374, line: 101, baseType: !320, size: 32, offset: 2496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !375, file: !374, line: 101, baseType: !320, size: 32, offset: 2528)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !375, file: !374, line: 102, baseType: !477, size: 64, offset: 2560)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !375, file: !374, line: 102, baseType: !477, size: 64, offset: 2624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !375, file: !374, line: 103, baseType: !358, size: 64, offset: 2688)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !375, file: !374, line: 103, baseType: !496, size: 64, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !375, file: !374, line: 104, baseType: !431, size: 64, offset: 2816)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !375, file: !374, line: 105, baseType: !320, size: 32, offset: 2880)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !375, file: !374, line: 106, baseType: !500, size: 128, offset: 2944)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !507)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !374, line: 64, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 61, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !503, file: !374, line: 62, baseType: !424, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !503, file: !374, line: 63, baseType: !471, size: 64, offset: 64)
!507 = !{!508}
!508 = !DISubrange(count: 2)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !375, file: !374, line: 107, baseType: !510, size: 64, offset: 3072)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !507)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !375, file: !374, line: 108, baseType: !471, size: 64, offset: 3136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !375, file: !374, line: 109, baseType: !513, size: 64, offset: 3200)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!388, !471}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !375, file: !374, line: 111, baseType: !320, size: 32, offset: 3264)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !375, file: !374, line: 112, baseType: !518, size: 320, offset: 3328)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 320, elements: !563)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!388, !522, !389, !471}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !525)
!525 = !{!526, !527, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !524, file: !10, line: 100, baseType: !320, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !10, line: 101, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !539, !540, !541, !545, !546, !548, !549, !550}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !530, file: !10, line: 84, baseType: !461, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !530, file: !10, line: 85, baseType: !461, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !10, line: 86, baseType: !471, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !530, file: !10, line: 87, baseType: !453, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !530, file: !10, line: 88, baseType: !537, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !530, file: !10, line: 89, baseType: !415, size: 8, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !530, file: !10, line: 90, baseType: !461, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !530, file: !10, line: 91, baseType: !542, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !543, line: 46, baseType: !544)
!543 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!544 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !530, file: !10, line: 92, baseType: !318, size: 32, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !10, line: 93, baseType: !547, size: 32, offset: 544)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !10, line: 94, baseType: !528, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !530, file: !10, line: 95, baseType: !461, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !530, file: !10, line: 96, baseType: !471, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !524, file: !10, line: 102, baseType: !461, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !524, file: !10, line: 102, baseType: !461, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !524, file: !10, line: 103, baseType: !461, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !524, file: !10, line: 104, baseType: !392, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !524, file: !10, line: 105, baseType: !318, size: 32, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !524, file: !10, line: 105, baseType: !318, size: 32, offset: 416)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !524, file: !10, line: 105, baseType: !318, size: 32, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !524, file: !10, line: 106, baseType: !389, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !524, file: !10, line: 107, baseType: !560, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!563 = !{!564}
!564 = !DISubrange(count: 5)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !375, file: !374, line: 113, baseType: !566, size: 320, offset: 3648)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 320, elements: !563)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!388, !389, !471}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !375, file: !374, line: 114, baseType: !571, size: 320, offset: 3968)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 320, elements: !563)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !375, file: !374, line: 115, baseType: !318, size: 32, offset: 4288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !375, file: !374, line: 120, baseType: !560, size: 64, offset: 4352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !375, file: !374, line: 121, baseType: !318, size: 32, offset: 4416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !337, line: 437, baseType: !576, size: 9472, offset: 4480)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 9472, elements: !432)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !337, line: 32, size: 9472, elements: !578)
!578 = !{!579, !588, !592, !593, !600, !604, !605, !606, !607, !608, !609, !610, !630, !634, !639, !645, !664, !669, !673, !674, !679, !684, !685, !690, !694, !698, !702, !706, !710, !711, !712, !713, !714, !718, !719, !724, !725, !726, !727, !728, !733, !740, !745, !749, !753, !757, !761, !762, !766, !767, !774, !779, !780, !781, !782, !844, !852, !853, !857, !858, !862, !863, !867, !872, !873, !877, !881, !888, !889, !890, !891, !892, !893, !898, !899, !903, !907, !911, !912, !913, !917, !927, !928, !932, !933, !937, !938, !942, !943, !948, !949, !953, !957, !958, !959, !960, !961, !962, !963, !967, !968, !969, !970, !971, !972, !976, !977, !978, !979, !980, !981, !982, !983, !987, !991, !992, !993, !997, !998, !999, !1000, !1001, !1002, !1003, !1007, !1008, !1009, !1014, !1018, !1019, !1023, !1024, !1025, !1026, !1052, !1056, !1057, !1058, !1059, !1060, !1064, !1065, !1066, !1067, !1068, !1072, !1076, !1077}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !577, file: !337, line: 34, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!388, !368, !320, !583, !320, !583, !585, !587}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !577, file: !337, line: 35, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!388, !368, !320, !325, !481, !496}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !577, file: !337, line: 36, baseType: !589, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !577, file: !337, line: 37, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!388, !368, !597, !597}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !577, file: !337, line: 38, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!388, !368, !597, !597, !597}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !577, file: !337, line: 40, baseType: !594, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !577, file: !337, line: 41, baseType: !601, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !577, file: !337, line: 42, baseType: !594, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !577, file: !337, line: 43, baseType: !601, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !577, file: !337, line: 44, baseType: !594, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !577, file: !337, line: 46, baseType: !601, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !577, file: !337, line: 47, baseType: !611, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!388, !368, !360, !360, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !617, file: !36, line: 1227, baseType: !355, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !617, file: !36, line: 1228, baseType: !355, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !617, file: !36, line: 1229, baseType: !355, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !617, file: !36, line: 1230, baseType: !355, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !617, file: !36, line: 1231, baseType: !355, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !617, file: !36, line: 1232, baseType: !355, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !617, file: !36, line: 1233, baseType: !355, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !617, file: !36, line: 1234, baseType: !355, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !617, file: !36, line: 1236, baseType: !355, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !617, file: !36, line: 1237, baseType: !355, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !617, file: !36, line: 1238, baseType: !355, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !577, file: !337, line: 48, baseType: !631, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!388, !368, !360, !614}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !577, file: !337, line: 49, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!388, !368, !597, !355, !638, !355, !320, !320, !597}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !577, file: !337, line: 50, baseType: !640, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!388, !368, !643, !644}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !577, file: !337, line: 52, baseType: !646, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!388, !368, !649, !650}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !652, file: !36, line: 593, baseType: !437, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !652, file: !36, line: 594, baseType: !437, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !652, file: !36, line: 594, baseType: !437, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !652, file: !36, line: 594, baseType: !437, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !652, file: !36, line: 595, baseType: !437, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !652, file: !36, line: 596, baseType: !437, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !652, file: !36, line: 597, baseType: !437, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !652, file: !36, line: 598, baseType: !437, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !652, file: !36, line: 598, baseType: !437, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !652, file: !36, line: 599, baseType: !437, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !577, file: !337, line: 53, baseType: !665, size: 64, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!388, !368, !368, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !577, file: !337, line: 54, baseType: !670, size: 64, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!388, !368, !597}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !577, file: !337, line: 55, baseType: !594, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !577, file: !337, line: 56, baseType: !675, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!388, !368, !678, !487}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !577, file: !337, line: 58, baseType: !680, size: 64, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!388, !368, !683}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !577, file: !337, line: 59, baseType: !680, size: 64, offset: 1344)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !577, file: !337, line: 60, baseType: !686, size: 64, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!388, !368, !689, !318}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !577, file: !337, line: 61, baseType: !691, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!388, !368}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !577, file: !337, line: 63, baseType: !695, size: 64, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!388, !368, !320, !583, !354, !597, !597}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !577, file: !337, line: 64, baseType: !699, size: 64, offset: 1600)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!388, !368, !368, !360, !360, !614}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !577, file: !337, line: 65, baseType: !703, size: 64, offset: 1664)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!388, !368, !368, !614}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !577, file: !337, line: 66, baseType: !707, size: 64, offset: 1728)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!388, !368, !368, !360, !614}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !577, file: !337, line: 67, baseType: !703, size: 64, offset: 1792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !577, file: !337, line: 69, baseType: !691, size: 64, offset: 1856)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !577, file: !337, line: 70, baseType: !699, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !577, file: !337, line: 71, baseType: !707, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !577, file: !337, line: 72, baseType: !715, size: 64, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!388, !368, !644}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !577, file: !337, line: 73, baseType: !691, size: 64, offset: 2112)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !577, file: !337, line: 75, baseType: !720, size: 64, offset: 2176)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!388, !368, !723, !644}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !577, file: !337, line: 76, baseType: !594, size: 64, offset: 2240)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !577, file: !337, line: 77, baseType: !594, size: 64, offset: 2304)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !577, file: !337, line: 78, baseType: !611, size: 64, offset: 2368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !577, file: !337, line: 79, baseType: !631, size: 64, offset: 2432)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !577, file: !337, line: 81, baseType: !729, size: 64, offset: 2496)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!388, !368, !354, !368, !732}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !577, file: !337, line: 82, baseType: !734, size: 64, offset: 2560)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!388, !368, !320, !737, !737, !643, !739}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !577, file: !337, line: 83, baseType: !741, size: 64, offset: 2624)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!388, !368, !320, !744, !320}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !577, file: !337, line: 84, baseType: !746, size: 64, offset: 2688)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!388, !368, !320, !583, !320, !583, !358}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !577, file: !337, line: 85, baseType: !750, size: 64, offset: 2752)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!388, !368, !368, !732}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !577, file: !337, line: 87, baseType: !754, size: 64, offset: 2816)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!388, !368, !597, !325}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !577, file: !337, line: 88, baseType: !758, size: 64, offset: 2880)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!388, !368, !354}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !577, file: !337, line: 89, baseType: !758, size: 64, offset: 2944)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !577, file: !337, line: 90, baseType: !763, size: 64, offset: 3008)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!388, !368, !597, !587}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !577, file: !337, line: 91, baseType: !695, size: 64, offset: 3072)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !577, file: !337, line: 93, baseType: !768, size: 64, offset: 3136)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!388, !368, !771}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !577, file: !337, line: 94, baseType: !775, size: 64, offset: 3200)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!388, !368, !320, !318, !318, !325, !778, !778, !668}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !577, file: !337, line: 95, baseType: !775, size: 64, offset: 3264)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !577, file: !337, line: 96, baseType: !775, size: 64, offset: 3328)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !577, file: !337, line: 97, baseType: !775, size: 64, offset: 3392)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !577, file: !337, line: 99, baseType: !783, size: 64, offset: 3456)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!388, !368, !786, !789}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !361, line: 51, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !361, line: 51, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !337, line: 609, size: 6208, elements: !792)
!792 = !{!793, !794, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !813, !820, !821, !822, !823, !824, !825, !826, !827, !831, !832, !833, !834, !835, !837, !838, !839, !840, !841, !842, !843}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !791, file: !337, line: 610, baseType: !373, size: 4480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !791, file: !337, line: 610, baseType: !795, size: 32, offset: 4480)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !432)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !791, file: !337, line: 611, baseType: !320, size: 32, offset: 4512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !791, file: !337, line: 611, baseType: !320, size: 32, offset: 4544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !791, file: !337, line: 611, baseType: !320, size: 32, offset: 4576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !791, file: !337, line: 612, baseType: !320, size: 32, offset: 4608)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !791, file: !337, line: 613, baseType: !320, size: 32, offset: 4640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !791, file: !337, line: 614, baseType: !325, size: 64, offset: 4672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !791, file: !337, line: 615, baseType: !481, size: 64, offset: 4736)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !791, file: !337, line: 616, baseType: !744, size: 64, offset: 4800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !791, file: !337, line: 617, baseType: !325, size: 64, offset: 4864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !791, file: !337, line: 618, baseType: !806, size: 64, offset: 4928)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !337, line: 602, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 598, size: 128, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !808, file: !337, line: 599, baseType: !320, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !808, file: !337, line: 600, baseType: !320, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !808, file: !337, line: 601, baseType: !358, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !791, file: !337, line: 619, baseType: !814, size: 64, offset: 4992)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !337, line: 607, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 604, size: 128, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !816, file: !337, line: 605, baseType: !320, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !816, file: !337, line: 606, baseType: !358, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !791, file: !337, line: 620, baseType: !358, size: 64, offset: 5056)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !791, file: !337, line: 621, baseType: !355, size: 64, offset: 5120)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !791, file: !337, line: 622, baseType: !355, size: 64, offset: 5184)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !791, file: !337, line: 623, baseType: !597, size: 64, offset: 5248)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !791, file: !337, line: 623, baseType: !597, size: 64, offset: 5312)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !791, file: !337, line: 623, baseType: !597, size: 64, offset: 5376)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !791, file: !337, line: 624, baseType: !318, size: 32, offset: 5440)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !791, file: !337, line: 625, baseType: !828, size: 64, offset: 5504)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!388}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !791, file: !337, line: 626, baseType: !471, size: 64, offset: 5568)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !791, file: !337, line: 627, baseType: !597, size: 64, offset: 5632)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !791, file: !337, line: 628, baseType: !320, size: 32, offset: 5696)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !791, file: !337, line: 629, baseType: !413, size: 64, offset: 5760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !791, file: !337, line: 630, baseType: !836, size: 32, offset: 5824)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !791, file: !337, line: 631, baseType: !320, size: 32, offset: 5856)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !791, file: !337, line: 631, baseType: !320, size: 32, offset: 5888)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !791, file: !337, line: 632, baseType: !318, size: 32, offset: 5920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !791, file: !337, line: 633, baseType: !318, size: 32, offset: 5952)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !791, file: !337, line: 634, baseType: !424, size: 64, offset: 6016)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !791, file: !337, line: 634, baseType: !471, size: 64, offset: 6080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !791, file: !337, line: 635, baseType: !442, size: 64, offset: 6144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !577, file: !337, line: 100, baseType: !845, size: 64, offset: 3520)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!388, !368, !320, !320, !848, !851}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !850)
!850 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !577, file: !337, line: 101, baseType: !691, size: 64, offset: 3584)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !577, file: !337, line: 102, baseType: !854, size: 64, offset: 3648)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!388, !368, !360, !360, !644}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !577, file: !337, line: 103, baseType: !580, size: 64, offset: 3712)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !577, file: !337, line: 105, baseType: !859, size: 64, offset: 3776)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!388, !368, !360, !360, !643, !644}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !577, file: !337, line: 106, baseType: !691, size: 64, offset: 3840)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !577, file: !337, line: 107, baseType: !864, size: 64, offset: 3904)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!388, !368, !400}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !577, file: !337, line: 108, baseType: !868, size: 64, offset: 3968)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!388, !368, !871, !643, !644}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !413)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !577, file: !337, line: 109, baseType: !828, size: 64, offset: 4032)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !577, file: !337, line: 111, baseType: !874, size: 64, offset: 4096)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!388, !368, !368, !368, !355, !368}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !577, file: !337, line: 112, baseType: !878, size: 64, offset: 4160)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!388, !368, !368, !368, !368}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !577, file: !337, line: 113, baseType: !882, size: 64, offset: 4224)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!388, !368, !885, !885}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !361, line: 30, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !361, line: 30, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !577, file: !337, line: 114, baseType: !580, size: 64, offset: 4288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !577, file: !337, line: 115, baseType: !695, size: 64, offset: 4352)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !577, file: !337, line: 117, baseType: !754, size: 64, offset: 4416)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !577, file: !337, line: 118, baseType: !754, size: 64, offset: 4480)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !577, file: !337, line: 119, baseType: !868, size: 64, offset: 4544)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !577, file: !337, line: 120, baseType: !894, size: 64, offset: 4608)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!388, !368, !897, !668}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !577, file: !337, line: 121, baseType: !828, size: 64, offset: 4672)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !577, file: !337, line: 123, baseType: !900, size: 64, offset: 4736)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!388, !368, !320, !471}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !577, file: !337, line: 124, baseType: !904, size: 64, offset: 4800)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!388, !368, !789, !597, !471}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !577, file: !337, line: 125, baseType: !908, size: 64, offset: 4864)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!388, !522, !368}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !577, file: !337, line: 126, baseType: !594, size: 64, offset: 4928)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !577, file: !337, line: 127, baseType: !594, size: 64, offset: 4992)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !577, file: !337, line: 129, baseType: !914, size: 64, offset: 5056)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!388, !368, !744}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !577, file: !337, line: 130, baseType: !918, size: 64, offset: 5120)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!388, !368, !921, !921}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !923, file: !60, line: 653, baseType: !320, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !923, file: !60, line: 653, baseType: !597, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !577, file: !337, line: 131, baseType: !918, size: 64, offset: 5184)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !577, file: !337, line: 132, baseType: !929, size: 64, offset: 5248)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!388, !368, !325, !325, !325}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !577, file: !337, line: 133, baseType: !864, size: 64, offset: 5312)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !577, file: !337, line: 135, baseType: !934, size: 64, offset: 5376)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!388, !368, !355, !668}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !577, file: !337, line: 136, baseType: !934, size: 64, offset: 5440)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !577, file: !337, line: 137, baseType: !939, size: 64, offset: 5504)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!388, !368, !668}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !577, file: !337, line: 138, baseType: !580, size: 64, offset: 5568)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !577, file: !337, line: 139, baseType: !944, size: 64, offset: 5632)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!388, !368, !947, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !577, file: !337, line: 141, baseType: !828, size: 64, offset: 5696)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !577, file: !337, line: 142, baseType: !950, size: 64, offset: 5760)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!388, !368, !368, !355, !368}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !577, file: !337, line: 143, baseType: !954, size: 64, offset: 5824)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!388, !368, !368, !368}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !577, file: !337, line: 144, baseType: !828, size: 64, offset: 5888)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !577, file: !337, line: 145, baseType: !950, size: 64, offset: 5952)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !577, file: !337, line: 147, baseType: !954, size: 64, offset: 6016)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !577, file: !337, line: 148, baseType: !828, size: 64, offset: 6080)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !577, file: !337, line: 149, baseType: !950, size: 64, offset: 6144)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !577, file: !337, line: 150, baseType: !954, size: 64, offset: 6208)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !577, file: !337, line: 151, baseType: !964, size: 64, offset: 6272)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!388, !368, !318}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !577, file: !337, line: 153, baseType: !691, size: 64, offset: 6336)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !577, file: !337, line: 154, baseType: !691, size: 64, offset: 6400)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !577, file: !337, line: 155, baseType: !691, size: 64, offset: 6464)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !577, file: !337, line: 156, baseType: !691, size: 64, offset: 6528)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !577, file: !337, line: 157, baseType: !864, size: 64, offset: 6592)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !577, file: !337, line: 159, baseType: !973, size: 64, offset: 6656)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!388, !368, !320, !585}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !577, file: !337, line: 160, baseType: !691, size: 64, offset: 6720)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !577, file: !337, line: 161, baseType: !691, size: 64, offset: 6784)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !577, file: !337, line: 162, baseType: !691, size: 64, offset: 6848)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !577, file: !337, line: 163, baseType: !691, size: 64, offset: 6912)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !577, file: !337, line: 165, baseType: !954, size: 64, offset: 6976)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !577, file: !337, line: 166, baseType: !954, size: 64, offset: 7040)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !577, file: !337, line: 167, baseType: !754, size: 64, offset: 7104)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !577, file: !337, line: 168, baseType: !984, size: 64, offset: 7168)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!388, !368, !597, !320}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !577, file: !337, line: 169, baseType: !988, size: 64, offset: 7232)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!388, !368, !668, !325}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !577, file: !337, line: 171, baseType: !715, size: 64, offset: 7296)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !577, file: !337, line: 172, baseType: !691, size: 64, offset: 7360)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !577, file: !337, line: 173, baseType: !994, size: 64, offset: 7424)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!388, !368, !325, !778}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !577, file: !337, line: 174, baseType: !854, size: 64, offset: 7488)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !577, file: !337, line: 175, baseType: !854, size: 64, offset: 7552)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !577, file: !337, line: 177, baseType: !594, size: 64, offset: 7616)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !577, file: !337, line: 178, baseType: !640, size: 64, offset: 7680)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !577, file: !337, line: 179, baseType: !594, size: 64, offset: 7744)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !577, file: !337, line: 180, baseType: !601, size: 64, offset: 7808)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !577, file: !337, line: 181, baseType: !1004, size: 64, offset: 7872)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!388, !368, !392, !643, !644}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !577, file: !337, line: 183, baseType: !914, size: 64, offset: 7936)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !577, file: !337, line: 184, baseType: !675, size: 64, offset: 8000)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !577, file: !337, line: 185, baseType: !1010, size: 64, offset: 8064)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!388, !368, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !577, file: !337, line: 186, baseType: !1015, size: 64, offset: 8128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!388, !368, !320, !583, !358}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !577, file: !337, line: 187, baseType: !734, size: 64, offset: 8192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !577, file: !337, line: 189, baseType: !1020, size: 64, offset: 8256)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!388, !368, !320, !320, !325, !585}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !577, file: !337, line: 190, baseType: !828, size: 64, offset: 8320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !577, file: !337, line: 191, baseType: !950, size: 64, offset: 8384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !577, file: !337, line: 192, baseType: !954, size: 64, offset: 8448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !577, file: !337, line: 193, baseType: !1027, size: 64, offset: 8512)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!388, !368, !786, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !337, line: 660, size: 5312, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1032, file: !337, line: 661, baseType: !373, size: 4480)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1032, file: !337, line: 661, baseType: !795, size: 32, offset: 4480)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1032, file: !337, line: 662, baseType: !320, size: 32, offset: 4512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1032, file: !337, line: 662, baseType: !320, size: 32, offset: 4544)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1032, file: !337, line: 662, baseType: !320, size: 32, offset: 4576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1032, file: !337, line: 663, baseType: !320, size: 32, offset: 4608)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1032, file: !337, line: 664, baseType: !320, size: 32, offset: 4640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1032, file: !337, line: 665, baseType: !325, size: 64, offset: 4672)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1032, file: !337, line: 666, baseType: !325, size: 64, offset: 4736)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1032, file: !337, line: 667, baseType: !320, size: 32, offset: 4800)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1032, file: !337, line: 668, baseType: !836, size: 32, offset: 4832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1032, file: !337, line: 670, baseType: !325, size: 64, offset: 4864)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1032, file: !337, line: 670, baseType: !325, size: 64, offset: 4928)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1032, file: !337, line: 671, baseType: !325, size: 64, offset: 4992)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1032, file: !337, line: 672, baseType: !325, size: 64, offset: 5056)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1032, file: !337, line: 673, baseType: !325, size: 64, offset: 5120)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1032, file: !337, line: 674, baseType: !320, size: 32, offset: 5184)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1032, file: !337, line: 675, baseType: !325, size: 64, offset: 5248)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !577, file: !337, line: 195, baseType: !1053, size: 64, offset: 8576)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!388, !1030, !368, !368}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !577, file: !337, line: 196, baseType: !1053, size: 64, offset: 8640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !577, file: !337, line: 197, baseType: !828, size: 64, offset: 8704)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !577, file: !337, line: 198, baseType: !950, size: 64, offset: 8768)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !577, file: !337, line: 199, baseType: !954, size: 64, offset: 8832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !577, file: !337, line: 201, baseType: !1061, size: 64, offset: 8896)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!388, !368, !320, !320}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !577, file: !337, line: 202, baseType: !729, size: 64, offset: 8960)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !577, file: !337, line: 203, baseType: !601, size: 64, offset: 9024)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !577, file: !337, line: 204, baseType: !783, size: 64, offset: 9088)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !577, file: !337, line: 205, baseType: !914, size: 64, offset: 9152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !577, file: !337, line: 206, baseType: !1069, size: 64, offset: 9216)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!388, !392, !368, !320, !643, !644}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !577, file: !337, line: 208, baseType: !1073, size: 64, offset: 9280)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!388, !320, !739}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !577, file: !337, line: 209, baseType: !954, size: 64, offset: 9344)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !577, file: !337, line: 210, baseType: !746, size: 64, offset: 9408)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !370, file: !337, line: 438, baseType: !1079, size: 64, offset: 13952)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !361, line: 60, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1081, file: !114, line: 241, baseType: !392, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1081, file: !114, line: 242, baseType: !451, size: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1081, file: !114, line: 243, baseType: !320, size: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1081, file: !114, line: 243, baseType: !320, size: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1081, file: !114, line: 244, baseType: !320, size: 32, offset: 160)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1081, file: !114, line: 244, baseType: !320, size: 32, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1081, file: !114, line: 245, baseType: !325, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1081, file: !114, line: 246, baseType: !318, size: 32, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1081, file: !114, line: 247, baseType: !320, size: 32, offset: 352)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1081, file: !114, line: 251, baseType: !320, size: 32, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1081, file: !114, line: 252, baseType: !885, size: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1081, file: !114, line: 253, baseType: !318, size: 32, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1081, file: !114, line: 254, baseType: !320, size: 32, offset: 544)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1081, file: !114, line: 254, baseType: !320, size: 32, offset: 576)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1081, file: !114, line: 255, baseType: !320, size: 32, offset: 608)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !370, file: !337, line: 438, baseType: !1079, size: 64, offset: 14016)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !337, line: 439, baseType: !471, size: 64, offset: 14080)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !370, file: !337, line: 440, baseType: !1101, size: 32, offset: 14144)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !370, file: !337, line: 441, baseType: !318, size: 32, offset: 14176)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !370, file: !337, line: 442, baseType: !318, size: 32, offset: 14208)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !370, file: !337, line: 443, baseType: !1105, size: 448, offset: 14272)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 448, elements: !1107)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !413)
!1107 = !{!1108}
!1108 = !DISubrange(count: 7)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !370, file: !337, line: 444, baseType: !318, size: 32, offset: 14720)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !370, file: !337, line: 445, baseType: !318, size: 32, offset: 14752)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !370, file: !337, line: 446, baseType: !320, size: 32, offset: 14784)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !370, file: !337, line: 447, baseType: !473, size: 64, offset: 14848)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !370, file: !337, line: 448, baseType: !473, size: 64, offset: 14912)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !370, file: !337, line: 449, baseType: !651, size: 640, offset: 14976)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !370, file: !337, line: 450, baseType: !587, size: 32, offset: 15616)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !370, file: !337, line: 451, baseType: !1117, size: 2880, offset: 15680)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !337, line: 318, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !337, line: 319, size: 2880, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1139, !1140, !1145, !1150, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1165, !1166, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1198, !1199, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1224, !1228, !1229}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1118, file: !337, line: 320, baseType: !320, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1118, file: !337, line: 321, baseType: !320, size: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1118, file: !337, line: 322, baseType: !320, size: 32, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1118, file: !337, line: 323, baseType: !320, size: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1118, file: !337, line: 324, baseType: !320, size: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1118, file: !337, line: 325, baseType: !320, size: 32, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1118, file: !337, line: 326, baseType: !1127, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !337, line: 293, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !337, line: 295, size: 448, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !337, line: 296, baseType: !1127, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1129, file: !337, line: 297, baseType: !358, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1129, file: !337, line: 297, baseType: !358, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1129, file: !337, line: 298, baseType: !325, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1129, file: !337, line: 298, baseType: !325, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1129, file: !337, line: 299, baseType: !320, size: 32, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1129, file: !337, line: 300, baseType: !320, size: 32, offset: 352)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1129, file: !337, line: 301, baseType: !320, size: 32, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1118, file: !337, line: 326, baseType: !1127, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1118, file: !337, line: 328, baseType: !1141, size: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!388, !368, !1144, !325}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1118, file: !337, line: 329, baseType: !1146, size: 64, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!388, !1144, !1149, !481, !481, !496, !325}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1118, file: !337, line: 330, baseType: !1151, size: 64, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!388, !1144}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1118, file: !337, line: 331, baseType: !1151, size: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1118, file: !337, line: 334, baseType: !392, size: 64, offset: 576)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !337, line: 335, baseType: !451, size: 32, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1118, file: !337, line: 335, baseType: !451, size: 32, offset: 672)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1118, file: !337, line: 336, baseType: !451, size: 32, offset: 704)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1118, file: !337, line: 336, baseType: !451, size: 32, offset: 736)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1118, file: !337, line: 337, baseType: !1161, size: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !393, line: 339, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !393, line: 339, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1118, file: !337, line: 338, baseType: !1161, size: 64, offset: 832)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1118, file: !337, line: 339, baseType: !1167, size: 64, offset: 896)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !393, line: 341, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !393, line: 351, size: 192, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1169, file: !393, line: 354, baseType: !72, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1169, file: !393, line: 355, baseType: !72, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1169, file: !393, line: 356, baseType: !72, size: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1169, file: !393, line: 361, baseType: !72, size: 32, offset: 96)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1169, file: !393, line: 362, baseType: !542, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1118, file: !337, line: 340, baseType: !320, size: 32, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1118, file: !337, line: 340, baseType: !320, size: 32, offset: 992)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1118, file: !337, line: 341, baseType: !358, size: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1118, file: !337, line: 342, baseType: !325, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1118, file: !337, line: 343, baseType: !496, size: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1118, file: !337, line: 344, baseType: !481, size: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1118, file: !337, line: 345, baseType: !320, size: 32, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1118, file: !337, line: 346, baseType: !1149, size: 64, offset: 1344)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1118, file: !337, line: 347, baseType: !318, size: 32, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1118, file: !337, line: 348, baseType: !320, size: 32, offset: 1440)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1118, file: !337, line: 351, baseType: !318, size: 32, offset: 1472)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1118, file: !337, line: 352, baseType: !318, size: 32, offset: 1504)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1118, file: !337, line: 353, baseType: !451, size: 32, offset: 1536)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1118, file: !337, line: 354, baseType: !451, size: 32, offset: 1568)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1118, file: !337, line: 355, baseType: !1149, size: 64, offset: 1600)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1118, file: !337, line: 356, baseType: !1149, size: 64, offset: 1664)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1118, file: !337, line: 357, baseType: !1193, size: 64, offset: 1728)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !337, line: 310, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 308, size: 32, elements: !1196)
!1196 = !{!1197}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1195, file: !337, line: 309, baseType: !320, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1118, file: !337, line: 357, baseType: !1193, size: 64, offset: 1792)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1118, file: !337, line: 358, baseType: !1200, size: 64, offset: 1856)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !337, line: 316, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 312, size: 128, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1202, file: !337, line: 313, baseType: !471, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1202, file: !337, line: 314, baseType: !320, size: 32, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1202, file: !337, line: 315, baseType: !415, size: 8, offset: 96)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1118, file: !337, line: 359, baseType: !1200, size: 64, offset: 1920)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1118, file: !337, line: 360, baseType: !1200, size: 64, offset: 1984)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1118, file: !337, line: 361, baseType: !320, size: 32, offset: 2048)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1118, file: !337, line: 362, baseType: !451, size: 32, offset: 2080)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1118, file: !337, line: 363, baseType: !320, size: 32, offset: 2112)
