; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/qn/qn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/qn/qn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!88 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 782, baseType: !7, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "SNES_QN_SCALE_DEFAULT", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "SNES_QN_SCALE_NONE", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "SNES_QN_SCALE_SCALAR", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "SNES_QN_SCALE_DIAGONAL", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "SNES_QN_SCALE_JACOBIAN", value: 4, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 793, baseType: !7, size: 32, elements: !114)
!114 = !{!115, !116, !117}
!115 = !DIEnumerator(name: "SNES_QN_LBFGS", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "SNES_QN_BROYDEN", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "SNES_QN_BADBROYDEN", value: 2, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 790, baseType: !7, size: 32, elements: !120)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!120 = !{!121, !122, !123, !124}
!121 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_NONE", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_SCALAR", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_DIAGONAL", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "MAT_LMVM_SYMBROYDEN_SCALE_USER", value: 3, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 616, baseType: !7, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!132 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 155, baseType: !7, size: 32, elements: !135)
!134 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!135 = !{!136, !137, !138, !139, !140}
!136 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!140 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !142)
!142 = !{!143}
!143 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!144 = !{!145, !149, !150, !353, !185, !356, !319, !354, !225, !377, !380, !235, !28, !211, !7, !383, !384}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !146, line: 330, baseType: !147)
!146 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !146, line: 330, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !153, line: 73, size: 4480, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !157, !206, !207, !209, !212, !213, !214, !215, !223, !224, !226, !230, !234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !251, !252, !254, !256, !257, !258, !259, !260, !263, !265, !266, !267, !268, !269, !272, !274, !275, !276, !286, !288, !289, !293, !294, !343, !348, !350, !351, !352}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !152, file: !153, line: 74, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !152, file: !153, line: 75, baseType: !158, size: 448, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 448, elements: !204)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !153, line: 53, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 45, size: 448, elements: !161)
!161 = !{!162, !168, !176, !181, !188, !192, !199}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !160, file: !153, line: 46, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !150, !167}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !160, file: !153, line: 47, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!166, !150, !172}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !173, line: 16, baseType: !174)
!173 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !173, line: 16, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !160, file: !153, line: 48, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!166, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !160, file: !153, line: 49, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!166, !150, !185, !150}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !160, file: !153, line: 50, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!166, !150, !185, !180}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !160, file: !153, line: 51, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!166, !150, !185, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !160, file: !153, line: 52, baseType: !200, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!166, !150, !185, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !152, file: !153, line: 76, baseType: !145, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !153, line: 77, baseType: !208, size: 32, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !211)
!211 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !153, line: 79, baseType: !216, size: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !219, line: 27, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !221, line: 43, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !152, file: !153, line: 80, baseType: !208, size: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !152, file: !153, line: 81, baseType: !225, size: 32, offset: 992)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !152, file: !153, line: 82, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !152, file: !153, line: 83, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !152, file: !153, line: 84, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !152, file: !153, line: 85, baseType: !235, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !152, file: !153, line: 86, baseType: !235, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !152, file: !153, line: 87, baseType: !235, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !153, line: 88, baseType: !150, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !152, file: !153, line: 89, baseType: !216, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 90, baseType: !235, size: 64, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !152, file: !153, line: 91, baseType: !235, size: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !152, file: !153, line: 92, baseType: !208, size: 32, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !152, file: !153, line: 93, baseType: !149, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !152, file: !153, line: 94, baseType: !246, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !217)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !152, file: !153, line: 95, baseType: !208, size: 32, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !152, file: !153, line: 95, baseType: !208, size: 32, offset: 1888)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !152, file: !153, line: 96, baseType: !250, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !152, file: !153, line: 96, baseType: !250, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !152, file: !153, line: 97, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !152, file: !153, line: 97, baseType: !255, size: 64, offset: 2112)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !152, file: !153, line: 98, baseType: !208, size: 32, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !152, file: !153, line: 98, baseType: !208, size: 32, offset: 2208)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !152, file: !153, line: 99, baseType: !250, size: 64, offset: 2240)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !152, file: !153, line: 99, baseType: !250, size: 64, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !152, file: !153, line: 100, baseType: !261, size: 64, offset: 2368)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !211)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !152, file: !153, line: 100, baseType: !264, size: 64, offset: 2432)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !152, file: !153, line: 101, baseType: !208, size: 32, offset: 2496)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !152, file: !153, line: 101, baseType: !208, size: 32, offset: 2528)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !152, file: !153, line: 102, baseType: !250, size: 64, offset: 2560)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !152, file: !153, line: 102, baseType: !250, size: 64, offset: 2624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !152, file: !153, line: 103, baseType: !270, size: 64, offset: 2688)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !262)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !152, file: !153, line: 103, baseType: !273, size: 64, offset: 2752)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !152, file: !153, line: 104, baseType: !203, size: 64, offset: 2816)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !152, file: !153, line: 105, baseType: !208, size: 32, offset: 2880)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !152, file: !153, line: 106, baseType: !277, size: 128, offset: 2944)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !284)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !153, line: 64, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 61, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !280, file: !153, line: 62, baseType: !196, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !280, file: !153, line: 63, baseType: !149, size: 64, offset: 64)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !152, file: !153, line: 107, baseType: !287, size: 64, offset: 3072)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !284)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !152, file: !153, line: 108, baseType: !149, size: 64, offset: 3136)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !152, file: !153, line: 109, baseType: !290, size: 64, offset: 3200)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!166, !149}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !152, file: !153, line: 111, baseType: !208, size: 32, offset: 3264)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !152, file: !153, line: 112, baseType: !295, size: 320, offset: 3328)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !341)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!166, !299, !150, !149}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !302)
!302 = !{!303, !304, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !301, file: !12, line: 100, baseType: !208, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !12, line: 101, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !316, !317, !318, !322, !324, !326, !327, !328}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !307, file: !12, line: 84, baseType: !235, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !307, file: !12, line: 85, baseType: !235, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !12, line: 86, baseType: !149, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !307, file: !12, line: 87, baseType: !227, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !12, line: 88, baseType: !314, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !307, file: !12, line: 89, baseType: !187, size: 8, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !307, file: !12, line: 90, baseType: !235, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !307, file: !12, line: 91, baseType: !319, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 46, baseType: !321)
!320 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!321 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !12, line: 92, baseType: !323, size: 32, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !12, line: 93, baseType: !325, size: 32, offset: 544)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !12, line: 94, baseType: !305, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !307, file: !12, line: 95, baseType: !235, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !307, file: !12, line: 96, baseType: !149, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !301, file: !12, line: 102, baseType: !235, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !301, file: !12, line: 102, baseType: !235, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !301, file: !12, line: 103, baseType: !235, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !301, file: !12, line: 104, baseType: !145, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !301, file: !12, line: 106, baseType: !150, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !301, file: !12, line: 107, baseType: !338, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!341 = !{!342}
!342 = !DISubrange(count: 5)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !152, file: !153, line: 113, baseType: !344, size: 320, offset: 3648)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 320, elements: !341)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!166, !150, !149}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !152, file: !153, line: 114, baseType: !349, size: 320, offset: 3968)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !341)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !152, file: !153, line: 115, baseType: !323, size: 32, offset: 4288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !152, file: !153, line: 120, baseType: !338, size: 64, offset: 4352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !152, file: !153, line: 121, baseType: !323, size: 32, offset: 4416)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !355, line: 1451, baseType: !196)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_QN", file: !358, line: 21, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/qn/qn.c", directory: "/home/users/ndemeye/xSDK")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 10, size: 576, elements: !360)
!360 = !{!361, !365, !366, !367, !368, !369, !370, !371, !373, !375}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !359, file: !358, line: 11, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !359, file: !358, line: 12, baseType: !208, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !359, file: !358, line: 13, baseType: !261, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "monflg", scope: !359, file: !358, line: 14, baseType: !323, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !359, file: !358, line: 15, baseType: !172, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "powell_gamma", scope: !359, file: !358, line: 16, baseType: !262, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !359, file: !358, line: 17, baseType: !262, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !358, line: 18, baseType: !372, size: 32, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESQNType", file: !27, line: 796, baseType: !113)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scale_type", scope: !359, file: !358, line: 19, baseType: !374, size: 32, offset: 480)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESQNScaleType", file: !27, line: 786, baseType: !106)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "restart_type", scope: !359, file: !358, line: 20, baseType: !376, size: 32, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESQNRestartType", file: !27, line: 791, baseType: !74)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !146, line: 331, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !146, line: 331, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !146, line: 338, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !146, line: 338, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !141)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!385 = !{!0, !386, !391}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "SNESQNRestartTypes", scope: !2, file: !358, line: 7, type: !388, isLocal: false, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 448, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 7)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "SNESQNTypes", scope: !2, file: !358, line: 8, type: !393, isLocal: false, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 384, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 6)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 512, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !{i32 7, !"Dwarf Version", i32 4}
!400 = !{i32 2, !"Debug Info Version", i32 3}
!401 = !{i32 1, !"wchar_size", i32 4}
!402 = !{i32 7, !"PIC Level", i32 2}
!403 = !{i32 7, !"uwtable", i32 1}
!404 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!405 = distinct !DISubprogram(name: "SNESQNSetRestartType", scope: !358, file: !358, line: 411, type: !406, scopeLine: 412, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !593)
!406 = !DISubroutineType(types: !407)
!407 = !{!166, !408, !376}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !411, line: 38, size: 11648, elements: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!412 = !{!413, !415, !478, !483, !484, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !500, !504, !505, !507, !508, !509, !510, !511, !516, !518, !519, !520, !521, !522, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !558, !560, !561, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !410, file: !411, line: 39, baseType: !414, size: 4480)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !153, line: 122, baseType: !152)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !410, file: !411, line: 39, baseType: !416, size: 1088, offset: 4480)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 1088, elements: !204)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !411, line: 12, size: 1088, elements: !418)
!418 = !{!419, !426, !430, !434, !440, !441, !445, !446, !450, !454, !455, !456, !461, !465, !469, !473, !477}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !417, file: !411, line: 13, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!166, !408, !423, !149}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !134, line: 21, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !134, line: 21, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !417, file: !411, line: 14, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!166, !423, !423, !149}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !417, file: !411, line: 15, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!166, !408, !208}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !417, file: !411, line: 16, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!166, !408, !208, !262, !262, !262, !438, !149}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !417, file: !411, line: 17, baseType: !290, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !417, file: !411, line: 18, baseType: !442, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!166, !408}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !417, file: !411, line: 19, baseType: !442, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !417, file: !411, line: 20, baseType: !447, size: 64, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!166, !408, !172}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !417, file: !411, line: 21, baseType: !451, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!166, !299, !408}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !417, file: !411, line: 22, baseType: !442, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !417, file: !411, line: 23, baseType: !442, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !417, file: !411, line: 24, baseType: !457, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!166, !408, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !417, file: !411, line: 25, baseType: !462, size: 64, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!166, !460}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !417, file: !411, line: 26, baseType: !466, size: 64, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!166, !408, !423, !423}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !417, file: !411, line: 27, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!166, !408, !423, !423, !149}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !417, file: !411, line: 28, baseType: !474, size: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!166, !408, !423, !362, !362, !149}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !417, file: !411, line: 29, baseType: !447, size: 64, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !410, file: !411, line: 40, baseType: !479, size: 64, offset: 5568)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !480, line: 14, baseType: !481)
!480 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !480, line: 14, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !410, file: !411, line: 41, baseType: !323, size: 32, offset: 5632)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !410, file: !411, line: 42, baseType: !408, size: 64, offset: 5696)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !410, file: !411, line: 43, baseType: !486, size: 32, offset: 5760)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !410, file: !411, line: 44, baseType: !323, size: 32, offset: 5792)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !410, file: !411, line: 47, baseType: !149, size: 64, offset: 5824)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !410, file: !411, line: 49, baseType: !423, size: 64, offset: 5888)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !410, file: !411, line: 50, baseType: !423, size: 64, offset: 5952)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !410, file: !411, line: 52, baseType: !423, size: 64, offset: 6016)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !410, file: !411, line: 54, baseType: !362, size: 64, offset: 6080)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !410, file: !411, line: 55, baseType: !362, size: 64, offset: 6144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !410, file: !411, line: 56, baseType: !362, size: 64, offset: 6208)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !410, file: !411, line: 57, baseType: !149, size: 64, offset: 6272)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !410, file: !411, line: 58, baseType: !497, size: 64, offset: 6336)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !119, line: 22, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !119, line: 22, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !410, file: !411, line: 59, baseType: !501, size: 64, offset: 6400)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !410, file: !411, line: 60, baseType: !323, size: 32, offset: 6464)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !410, file: !411, line: 61, baseType: !506, size: 32, offset: 6496)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !410, file: !411, line: 63, baseType: !423, size: 64, offset: 6528)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !410, file: !411, line: 65, baseType: !423, size: 64, offset: 6592)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !410, file: !411, line: 66, baseType: !149, size: 64, offset: 6656)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !410, file: !411, line: 68, baseType: !262, size: 64, offset: 6720)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !410, file: !411, line: 74, baseType: !512, size: 320, offset: 6784)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !341)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!166, !408, !208, !262, !149}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !410, file: !411, line: 75, baseType: !517, size: 320, offset: 7104)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 320, elements: !341)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !410, file: !411, line: 76, baseType: !349, size: 320, offset: 7424)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !410, file: !411, line: 77, baseType: !208, size: 32, offset: 7744)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !410, file: !411, line: 78, baseType: !149, size: 64, offset: 7808)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !410, file: !411, line: 79, baseType: !439, size: 32, offset: 7872)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !410, file: !411, line: 80, baseType: !523, size: 320, offset: 7936)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !341)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!166, !408, !149}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !410, file: !411, line: 81, baseType: !517, size: 320, offset: 8256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !410, file: !411, line: 82, baseType: !349, size: 320, offset: 8576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !410, file: !411, line: 83, baseType: !208, size: 32, offset: 8896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !410, file: !411, line: 84, baseType: !323, size: 32, offset: 8928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !410, file: !411, line: 88, baseType: !323, size: 32, offset: 8960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 89, baseType: !149, size: 64, offset: 9024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !410, file: !411, line: 93, baseType: !208, size: 32, offset: 9088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !410, file: !411, line: 94, baseType: !208, size: 32, offset: 9120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !410, file: !411, line: 95, baseType: !208, size: 32, offset: 9152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !410, file: !411, line: 96, baseType: !208, size: 32, offset: 9184)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !410, file: !411, line: 97, baseType: !208, size: 32, offset: 9216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !410, file: !411, line: 98, baseType: !262, size: 64, offset: 9280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !410, file: !411, line: 99, baseType: !262, size: 64, offset: 9344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !410, file: !411, line: 100, baseType: !262, size: 64, offset: 9408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !410, file: !411, line: 101, baseType: !262, size: 64, offset: 9472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !410, file: !411, line: 102, baseType: !262, size: 64, offset: 9536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !410, file: !411, line: 103, baseType: !262, size: 64, offset: 9600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !410, file: !411, line: 104, baseType: !262, size: 64, offset: 9664)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !410, file: !411, line: 105, baseType: !262, size: 64, offset: 9728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !410, file: !411, line: 106, baseType: !323, size: 32, offset: 9792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !410, file: !411, line: 107, baseType: !208, size: 32, offset: 9824)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !410, file: !411, line: 108, baseType: !208, size: 32, offset: 9856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !410, file: !411, line: 109, baseType: !208, size: 32, offset: 9888)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !410, file: !411, line: 110, baseType: !323, size: 32, offset: 9920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !410, file: !411, line: 111, baseType: !208, size: 32, offset: 9952)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !410, file: !411, line: 112, baseType: !323, size: 32, offset: 9984)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !410, file: !411, line: 113, baseType: !208, size: 32, offset: 10016)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !410, file: !411, line: 115, baseType: !323, size: 32, offset: 10048)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !410, file: !411, line: 117, baseType: !323, size: 32, offset: 10080)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !410, file: !411, line: 119, baseType: !557, size: 32, offset: 10112)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !410, file: !411, line: 120, baseType: !559, size: 32, offset: 10144)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !410, file: !411, line: 124, baseType: !208, size: 32, offset: 10176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !410, file: !411, line: 125, baseType: !562, size: 64, offset: 10240)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !410, file: !411, line: 129, baseType: !208, size: 32, offset: 10304)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !410, file: !411, line: 130, baseType: !261, size: 64, offset: 10368)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !410, file: !411, line: 132, baseType: !253, size: 64, offset: 10432)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !410, file: !411, line: 133, baseType: !208, size: 32, offset: 10496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !410, file: !411, line: 134, baseType: !208, size: 32, offset: 10528)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !410, file: !411, line: 135, baseType: !323, size: 32, offset: 10560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !410, file: !411, line: 136, baseType: !323, size: 32, offset: 10592)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !410, file: !411, line: 137, baseType: !323, size: 32, offset: 10624)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !410, file: !411, line: 140, baseType: !208, size: 32, offset: 10656)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !410, file: !411, line: 141, baseType: !208, size: 32, offset: 10688)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !410, file: !411, line: 143, baseType: !208, size: 32, offset: 10720)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !410, file: !411, line: 144, baseType: !208, size: 32, offset: 10752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !410, file: !411, line: 146, baseType: !323, size: 32, offset: 10784)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !410, file: !411, line: 147, baseType: !323, size: 32, offset: 10816)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !410, file: !411, line: 148, baseType: !323, size: 32, offset: 10848)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !410, file: !411, line: 150, baseType: !323, size: 32, offset: 10880)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !410, file: !411, line: 151, baseType: !149, size: 64, offset: 10944)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !410, file: !411, line: 154, baseType: !262, size: 64, offset: 11008)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !410, file: !411, line: 155, baseType: !262, size: 64, offset: 11072)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !410, file: !411, line: 157, baseType: !562, size: 64, offset: 11136)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !410, file: !411, line: 158, baseType: !208, size: 32, offset: 11200)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !410, file: !411, line: 160, baseType: !323, size: 32, offset: 11232)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !410, file: !411, line: 161, baseType: !323, size: 32, offset: 11264)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !410, file: !411, line: 162, baseType: !208, size: 32, offset: 11296)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !410, file: !411, line: 164, baseType: !262, size: 64, offset: 11328)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !410, file: !411, line: 165, baseType: !423, size: 64, offset: 11392)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !410, file: !411, line: 165, baseType: !423, size: 64, offset: 11456)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !410, file: !411, line: 166, baseType: !208, size: 32, offset: 11520)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !410, file: !411, line: 167, baseType: !323, size: 32, offset: 11552)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !410, file: !411, line: 169, baseType: !323, size: 32, offset: 11584)
!593 = !{!594, !595, !596, !597, !600, !601, !603, !607}
!594 = !DILocalVariable(name: "snes", arg: 1, scope: !405, file: !358, line: 411, type: !408)
!595 = !DILocalVariable(name: "rtype", arg: 2, scope: !405, file: !358, line: 411, type: !376)
!596 = !DILocalVariable(name: "ierr", scope: !405, file: !358, line: 413, type: !166)
!597 = !DILocalVariable(name: "_7_f", scope: !598, file: !358, line: 417, type: !599)
!598 = distinct !DILexicalBlock(scope: !405, file: !358, line: 417, column: 10)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!600 = !DILocalVariable(name: "_7_ierr", scope: !598, file: !358, line: 417, type: !166)
!601 = !DILocalVariable(name: "ierr__", scope: !602, file: !358, line: 417, type: !166)
!602 = distinct !DILexicalBlock(scope: !598, file: !358, line: 417, column: 10)
!603 = !DILocalVariable(name: "ierr__", scope: !604, file: !358, line: 417, type: !166)
!604 = distinct !DILexicalBlock(scope: !605, file: !358, line: 417, column: 10)
!605 = distinct !DILexicalBlock(scope: !606, file: !358, line: 417, column: 10)
!606 = distinct !DILexicalBlock(scope: !598, file: !358, line: 417, column: 10)
!607 = !DILocalVariable(name: "ierr__", scope: !608, file: !358, line: 417, type: !166)
!608 = distinct !DILexicalBlock(scope: !405, file: !358, line: 417, column: 94)
!609 = !DILocation(line: 0, scope: !405)
!610 = !DILocation(line: 415, column: 3, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !358, line: 415, column: 3)
!612 = distinct !DILexicalBlock(scope: !613, file: !358, line: 415, column: 3)
!613 = distinct !DILexicalBlock(scope: !405, file: !358, line: 415, column: 3)
!614 = !{!615, !615, i64 0}
!615 = !{!"any pointer", !616, i64 0}
!616 = !{!"omnipotent char", !617, i64 0}
!617 = !{!"Simple C/C++ TBAA"}
!618 = !DILocation(line: 415, column: 3, scope: !612)
!619 = !DILocation(line: 415, column: 3, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !358, line: 415, column: 3)
!621 = distinct !DILexicalBlock(scope: !611, file: !358, line: 415, column: 3)
!622 = !{!623, !624, i64 1536}
!623 = !{!"", !616, i64 0, !616, i64 512, !616, i64 1024, !616, i64 1280, !624, i64 1536, !624, i64 1540, !616, i64 1544}
!624 = !{!"int", !616, i64 0}
!625 = !DILocation(line: 415, column: 3, scope: !621)
!626 = !DILocation(line: 415, column: 3, scope: !627)
!627 = distinct !DILexicalBlock(scope: !620, file: !358, line: 415, column: 3)
!628 = !{!624, !624, i64 0}
!629 = !{!623, !624, i64 1540}
!630 = !DILocation(line: 416, column: 3, scope: !631)
!631 = distinct !DILexicalBlock(scope: !632, file: !358, line: 416, column: 3)
!632 = distinct !DILexicalBlock(scope: !405, file: !358, line: 416, column: 3)
!633 = !DILocation(line: 416, column: 3, scope: !632)
!634 = !DILocation(line: 416, column: 3, scope: !635)
!635 = distinct !DILexicalBlock(scope: !632, file: !358, line: 416, column: 3)
!636 = !DILocation(line: 416, column: 3, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !358, line: 416, column: 3)
!638 = !{!639, !624, i64 0}
