; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/discgrad/tsdiscgrad.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/discgrad/tsdiscgrad.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 217, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 663, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125}
!117 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!121 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!123 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!124 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!125 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 30, baseType: !7, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 459, baseType: !7, size: 32, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIEnumerator(name: "TS_STEP_INCOMPLETE", value: 0, isUnsigned: true)
!136 = !DIEnumerator(name: "TS_STEP_PENDING", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "TS_STEP_COMPLETE", value: 2, isUnsigned: true)
!138 = !{!139, !143, !144, !147, !347, !182, !349, !232, !350, !366}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !140, line: 330, baseType: !141)
!140 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !140, line: 330, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 46, baseType: !146)
!145 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !150, line: 73, size: 4480, elements: !151)
!150 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!151 = !{!152, !154, !203, !204, !206, !209, !210, !211, !212, !220, !221, !223, !227, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !244, !245, !246, !248, !249, !251, !253, !254, !255, !256, !257, !260, !262, !263, !264, !265, !266, !269, !271, !272, !273, !283, !285, !286, !290, !291, !337, !342, !344, !345, !346}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !149, file: !150, line: 74, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !149, file: !150, line: 75, baseType: !155, size: 448, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 448, elements: !201)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !150, line: 53, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 45, size: 448, elements: !158)
!158 = !{!159, !165, !173, !178, !185, !189, !196}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !157, file: !150, line: 46, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !147, !164}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !157, file: !150, line: 47, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!163, !147, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !170, line: 16, baseType: !171)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !170, line: 16, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !157, file: !150, line: 48, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!163, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !157, file: !150, line: 49, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!163, !147, !182, !147}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !157, file: !150, line: 50, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!163, !147, !182, !177}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !157, file: !150, line: 51, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!163, !147, !182, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !157, file: !150, line: 52, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!163, !147, !182, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !149, file: !150, line: 76, baseType: !139, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !150, line: 77, baseType: !205, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !149, file: !150, line: 78, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !208)
!208 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !149, file: !150, line: 78, baseType: !207, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !149, file: !150, line: 78, baseType: !207, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !149, file: !150, line: 78, baseType: !207, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !150, line: 79, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !216, line: 27, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !218, line: 43, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!219 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !149, file: !150, line: 80, baseType: !205, size: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !149, file: !150, line: 81, baseType: !222, size: 32, offset: 992)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !149, file: !150, line: 82, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !149, file: !150, line: 83, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !149, file: !150, line: 84, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !149, file: !150, line: 85, baseType: !232, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !149, file: !150, line: 86, baseType: !232, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !149, file: !150, line: 87, baseType: !232, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !149, file: !150, line: 88, baseType: !147, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !149, file: !150, line: 89, baseType: !213, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !150, line: 90, baseType: !232, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !149, file: !150, line: 91, baseType: !232, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !149, file: !150, line: 92, baseType: !205, size: 32, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !149, file: !150, line: 93, baseType: !143, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !149, file: !150, line: 94, baseType: !243, size: 64, offset: 1792)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !214)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !149, file: !150, line: 95, baseType: !205, size: 32, offset: 1856)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !149, file: !150, line: 95, baseType: !205, size: 32, offset: 1888)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !149, file: !150, line: 96, baseType: !247, size: 64, offset: 1920)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !149, file: !150, line: 96, baseType: !247, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !149, file: !150, line: 97, baseType: !250, size: 64, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !149, file: !150, line: 97, baseType: !252, size: 64, offset: 2112)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !149, file: !150, line: 98, baseType: !205, size: 32, offset: 2176)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !149, file: !150, line: 98, baseType: !205, size: 32, offset: 2208)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !149, file: !150, line: 99, baseType: !247, size: 64, offset: 2240)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !149, file: !150, line: 99, baseType: !247, size: 64, offset: 2304)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !149, file: !150, line: 100, baseType: !258, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !208)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !149, file: !150, line: 100, baseType: !261, size: 64, offset: 2432)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !149, file: !150, line: 101, baseType: !205, size: 32, offset: 2496)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !149, file: !150, line: 101, baseType: !205, size: 32, offset: 2528)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !149, file: !150, line: 102, baseType: !247, size: 64, offset: 2560)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !149, file: !150, line: 102, baseType: !247, size: 64, offset: 2624)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !149, file: !150, line: 103, baseType: !267, size: 64, offset: 2688)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !259)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !149, file: !150, line: 103, baseType: !270, size: 64, offset: 2752)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !149, file: !150, line: 104, baseType: !200, size: 64, offset: 2816)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !149, file: !150, line: 105, baseType: !205, size: 32, offset: 2880)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !149, file: !150, line: 106, baseType: !274, size: 128, offset: 2944)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, elements: !281)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !150, line: 64, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 61, size: 128, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !277, file: !150, line: 62, baseType: !193, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !277, file: !150, line: 63, baseType: !143, size: 64, offset: 64)
!281 = !{!282}
!282 = !DISubrange(count: 2)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !149, file: !150, line: 107, baseType: !284, size: 64, offset: 3072)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !281)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !149, file: !150, line: 108, baseType: !143, size: 64, offset: 3136)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !149, file: !150, line: 109, baseType: !287, size: 64, offset: 3200)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!163, !143}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !149, file: !150, line: 111, baseType: !205, size: 32, offset: 3264)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !149, file: !150, line: 112, baseType: !292, size: 320, offset: 3328)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 320, elements: !335)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!163, !296, !147, !143}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !299)
!299 = !{!300, !301, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !298, file: !12, line: 100, baseType: !205, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !12, line: 101, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !313, !314, !315, !316, !318, !320, !321, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !304, file: !12, line: 84, baseType: !232, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !304, file: !12, line: 85, baseType: !232, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !12, line: 86, baseType: !143, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !304, file: !12, line: 87, baseType: !224, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !304, file: !12, line: 88, baseType: !311, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !304, file: !12, line: 89, baseType: !184, size: 8, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !304, file: !12, line: 90, baseType: !232, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !304, file: !12, line: 91, baseType: !144, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !304, file: !12, line: 92, baseType: !317, size: 32, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !12, line: 93, baseType: !319, size: 32, offset: 544)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !12, line: 94, baseType: !302, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !304, file: !12, line: 95, baseType: !232, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !304, file: !12, line: 96, baseType: !143, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !298, file: !12, line: 102, baseType: !232, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !298, file: !12, line: 102, baseType: !232, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !298, file: !12, line: 103, baseType: !232, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !298, file: !12, line: 104, baseType: !139, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !298, file: !12, line: 105, baseType: !317, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !298, file: !12, line: 105, baseType: !317, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !298, file: !12, line: 105, baseType: !317, size: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !298, file: !12, line: 106, baseType: !147, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !298, file: !12, line: 107, baseType: !332, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!335 = !{!336}
!336 = !DISubrange(count: 5)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !149, file: !150, line: 113, baseType: !338, size: 320, offset: 3648)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !335)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!163, !147, !143}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !149, file: !150, line: 114, baseType: !343, size: 320, offset: 3968)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 320, elements: !335)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !149, file: !150, line: 115, baseType: !317, size: 32, offset: 4288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !149, file: !150, line: 120, baseType: !332, size: 64, offset: 4352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !149, file: !150, line: 121, baseType: !317, size: 32, offset: 4416)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !348, line: 1451, baseType: !193)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_DiscGrad", file: !352, line: 23, baseType: !353)
!352 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/impls/implicit/discgrad/tsdiscgrad.c", directory: "/home/users/ndemeye/xSDK")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 17, size: 448, elements: !354)
!354 = !{!355, !356, !360, !361, !362, !862, !863}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "stage_time", scope: !353, file: !352, line: 18, baseType: !259, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "X0", scope: !353, file: !352, line: 19, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !27, line: 21, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !353, file: !352, line: 19, baseType: !357, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Xdot", scope: !353, file: !352, line: 19, baseType: !357, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Sfunc", scope: !353, file: !352, line: 20, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!163, !366, !259, !357, !388, !143}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !35, line: 17, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !56, line: 144, size: 17408, elements: !369)
!369 = !{!370, !372, !469, !471, !473, !478, !479, !480, !543, !545, !591, !598, !604, !606, !607, !612, !613, !614, !615, !616, !617, !621, !625, !626, !627, !631, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !742, !746, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !798, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !828, !829, !830, !831, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !860, !861}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !368, file: !56, line: 145, baseType: !371, size: 4480)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !150, line: 122, baseType: !149)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !368, file: !56, line: 145, baseType: !373, size: 2048, offset: 4480)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 2048, elements: !201)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !56, line: 33, size: 2048, elements: !375)
!375 = !{!376, !384, !391, !395, !396, !397, !401, !406, !411, !415, !416, !420, !421, !425, !426, !427, !433, !434, !435, !436, !437, !438, !439, !440, !441, !447, !451, !455, !459, !463, !464, !465}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !374, file: !56, line: 34, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!163, !380, !357, !357, !366}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !381, line: 18, baseType: !382)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !381, line: 18, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !374, file: !56, line: 35, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!163, !380, !357, !388, !388, !366}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !64, line: 16, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !64, line: 16, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !374, file: !56, line: 36, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!163, !366}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !374, file: !56, line: 37, baseType: !392, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !374, file: !56, line: 38, baseType: !392, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !374, file: !56, line: 39, baseType: !398, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!163, !366, !259, !357}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !374, file: !56, line: 40, baseType: !402, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!163, !366, !405, !250, !258}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !374, file: !56, line: 41, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!163, !366, !205, !357, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !374, file: !56, line: 42, baseType: !412, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!163, !296, !366}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !374, file: !56, line: 43, baseType: !392, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !374, file: !56, line: 44, baseType: !417, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!163, !366, !169}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !374, file: !56, line: 45, baseType: !392, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !374, file: !56, line: 46, baseType: !422, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!163, !366, !259, !259, !258, !258}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !374, file: !56, line: 47, baseType: !417, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !374, file: !56, line: 48, baseType: !392, size: 64, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !374, file: !56, line: 49, baseType: !428, size: 64, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!163, !366, !250, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !374, file: !56, line: 50, baseType: !392, size: 64, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !374, file: !56, line: 51, baseType: !392, size: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !374, file: !56, line: 52, baseType: !392, size: 64, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !374, file: !56, line: 53, baseType: !392, size: 64, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !374, file: !56, line: 54, baseType: !392, size: 64, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !374, file: !56, line: 55, baseType: !392, size: 64, offset: 1344)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !374, file: !56, line: 56, baseType: !392, size: 64, offset: 1408)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !374, file: !56, line: 57, baseType: !392, size: 64, offset: 1472)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !374, file: !56, line: 58, baseType: !442, size: 64, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!163, !366, !250, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !374, file: !56, line: 59, baseType: !448, size: 64, offset: 1600)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!163, !366, !250, !432}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !374, file: !56, line: 60, baseType: !452, size: 64, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!163, !366, !432}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !374, file: !56, line: 61, baseType: !456, size: 64, offset: 1728)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!163, !366, !205, !432}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !374, file: !56, line: 62, baseType: !460, size: 64, offset: 1792)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!163, !366, !357}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !374, file: !56, line: 63, baseType: !392, size: 64, offset: 1856)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !374, file: !56, line: 64, baseType: !460, size: 64, offset: 1920)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !374, file: !56, line: 65, baseType: !466, size: 64, offset: 1984)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!163, !366, !357, !357}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !368, file: !56, line: 146, baseType: !470, size: 32, offset: 6528)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !35, line: 57, baseType: !34)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !368, file: !56, line: 147, baseType: !472, size: 32, offset: 6560)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !35, line: 88, baseType: !39)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !368, file: !56, line: 149, baseType: !474, size: 64, offset: 6592)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !475, line: 14, baseType: !476)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !475, line: 14, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !368, file: !56, line: 150, baseType: !357, size: 64, offset: 6656)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !368, file: !56, line: 151, baseType: !357, size: 64, offset: 6720)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !368, file: !56, line: 152, baseType: !481, size: 64, offset: 6784)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !35, line: 686, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !56, line: 319, size: 10112, elements: !484)
!484 = !{!485, !486, !508, !509, !513, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !483, file: !56, line: 320, baseType: !371, size: 4480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !483, file: !56, line: 320, baseType: !487, size: 384, offset: 4480)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 384, elements: !201)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !56, line: 310, size: 384, elements: !489)
!489 = !{!490, !494, !498, !499, !503, !507}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !488, file: !56, line: 311, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!163, !481, !366, !259, !250, !258, !410, !258, !258, !258}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !488, file: !56, line: 312, baseType: !495, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!163, !481}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !488, file: !56, line: 313, baseType: !495, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !488, file: !56, line: 314, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!163, !481, !169}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !488, file: !56, line: 315, baseType: !504, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!163, !296, !481}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !488, file: !56, line: 316, baseType: !500, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !56, line: 321, baseType: !143, size: 64, offset: 4864)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !483, file: !56, line: 322, baseType: !510, size: 64, offset: 4928)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!163, !481, !366, !259, !357, !410}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !483, file: !56, line: 331, baseType: !514, size: 4160, offset: 4992)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !483, file: !56, line: 323, size: 4160, elements: !515)
!515 = !{!516, !517, !518, !522, !524, !525, !527}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !514, file: !56, line: 324, baseType: !205, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !514, file: !56, line: 325, baseType: !317, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !56, line: 326, baseType: !519, size: 1024, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 1024, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !514, file: !56, line: 327, baseType: !523, size: 512, offset: 1088)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 512, elements: !520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !514, file: !56, line: 328, baseType: !523, size: 512, offset: 1600)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !514, file: !56, line: 329, baseType: !526, size: 1024, offset: 2112)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 1024, elements: !520)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !514, file: !56, line: 330, baseType: !526, size: 1024, offset: 3136)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !483, file: !56, line: 332, baseType: !317, size: 32, offset: 9152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !483, file: !56, line: 333, baseType: !259, size: 64, offset: 9216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !483, file: !56, line: 334, baseType: !259, size: 64, offset: 9280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !483, file: !56, line: 335, baseType: !532, size: 128, offset: 9344)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !281)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !483, file: !56, line: 336, baseType: !259, size: 64, offset: 9472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !483, file: !56, line: 336, baseType: !259, size: 64, offset: 9536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !483, file: !56, line: 337, baseType: !259, size: 64, offset: 9600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !483, file: !56, line: 338, baseType: !317, size: 32, offset: 9664)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !483, file: !56, line: 339, baseType: !259, size: 64, offset: 9728)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !483, file: !56, line: 340, baseType: !532, size: 128, offset: 9792)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !483, file: !56, line: 341, baseType: !405, size: 32, offset: 9920)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !483, file: !56, line: 342, baseType: !169, size: 64, offset: 9984)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !483, file: !56, line: 343, baseType: !205, size: 32, offset: 10048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !483, file: !56, line: 344, baseType: !205, size: 32, offset: 10080)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !368, file: !56, line: 153, baseType: !544, size: 64, offset: 6848)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !35, line: 695, baseType: !182)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !368, file: !56, line: 154, baseType: !546, size: 64, offset: 6912)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !56, line: 71, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !56, line: 410, size: 1792, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !566, !570, !571, !572, !573, !574, !575, !576, !577, !579, !580, !581, !589, !590}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !548, file: !56, line: 411, baseType: !267, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !548, file: !56, line: 412, baseType: !267, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !548, file: !56, line: 413, baseType: !259, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !548, file: !56, line: 414, baseType: !259, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !548, file: !56, line: 415, baseType: !259, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !548, file: !56, line: 416, baseType: !267, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !548, file: !56, line: 417, baseType: !250, size: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !548, file: !56, line: 418, baseType: !259, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !548, file: !56, line: 419, baseType: !259, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !548, file: !56, line: 420, baseType: !259, size: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !548, file: !56, line: 421, baseType: !259, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !548, file: !56, line: 422, baseType: !410, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !548, file: !56, line: 423, baseType: !563, size: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!163, !366, !259, !357, !267, !143}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !548, file: !56, line: 424, baseType: !567, size: 64, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!163, !366, !205, !250, !259, !357, !317, !143}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !548, file: !56, line: 425, baseType: !143, size: 64, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !548, file: !56, line: 426, baseType: !250, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !548, file: !56, line: 427, baseType: !410, size: 64, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !548, file: !56, line: 428, baseType: !205, size: 32, offset: 1088)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !548, file: !56, line: 429, baseType: !205, size: 32, offset: 1120)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !548, file: !56, line: 430, baseType: !250, size: 64, offset: 1152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !548, file: !56, line: 431, baseType: !258, size: 64, offset: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !548, file: !56, line: 432, baseType: !578, size: 32, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !56, line: 408, baseType: !55)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !548, file: !56, line: 433, baseType: !205, size: 32, offset: 1312)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !548, file: !56, line: 434, baseType: !169, size: 64, offset: 1344)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !548, file: !56, line: 442, baseType: !582, size: 320, offset: 1408)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !548, file: !56, line: 436, size: 320, elements: !583)
!583 = !{!584, !585, !586, !587, !588}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !582, file: !56, line: 437, baseType: !205, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !582, file: !56, line: 438, baseType: !258, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !582, file: !56, line: 439, baseType: !250, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !582, file: !56, line: 440, baseType: !250, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !582, file: !56, line: 441, baseType: !252, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !548, file: !56, line: 443, baseType: !205, size: 32, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !548, file: !56, line: 444, baseType: !205, size: 32, offset: 1760)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !368, file: !56, line: 157, baseType: !592, size: 640, offset: 6976)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 640, elements: !596)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!163, !366, !205, !259, !357, !143}
!596 = !{!597}
!597 = !DISubrange(count: 10)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !368, file: !56, line: 158, baseType: !599, size: 640, offset: 7616)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 640, elements: !596)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!163, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !368, file: !56, line: 159, baseType: !605, size: 640, offset: 8256)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 640, elements: !596)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !368, file: !56, line: 160, baseType: !205, size: 32, offset: 8896)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !368, file: !56, line: 161, baseType: !608, size: 640, offset: 8960)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 640, elements: !596)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!163, !366, !205, !259, !357, !205, !432, !432, !143}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !368, file: !56, line: 162, baseType: !599, size: 640, offset: 9600)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !368, file: !56, line: 163, baseType: !605, size: 640, offset: 10240)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !368, file: !56, line: 164, baseType: !205, size: 32, offset: 10880)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !368, file: !56, line: 165, baseType: !205, size: 32, offset: 10912)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !368, file: !56, line: 167, baseType: !392, size: 64, offset: 10944)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !368, file: !56, line: 168, baseType: !618, size: 64, offset: 11008)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!163, !366, !259}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !368, file: !56, line: 169, baseType: !622, size: 64, offset: 11072)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!163, !366, !259, !205, !432}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !368, file: !56, line: 170, baseType: !392, size: 64, offset: 11136)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !368, file: !56, line: 171, baseType: !392, size: 64, offset: 11200)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !368, file: !56, line: 172, baseType: !628, size: 64, offset: 11264)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!163, !366, !259, !357, !410}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !368, file: !56, line: 175, baseType: !632, size: 64, offset: 11328)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !35, line: 293, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !56, line: 89, size: 7040, elements: !635)
!635 = !{!636, !637, !666, !670, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !707, !708, !709, !710, !711, !715, !716, !717}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !634, file: !56, line: 90, baseType: !371, size: 4480)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !634, file: !56, line: 90, baseType: !638, size: 448, offset: 4480)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 448, elements: !201)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !56, line: 75, size: 448, elements: !640)
!640 = !{!641, !645, !649, !650, !654, !658, !662}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !639, file: !56, line: 76, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!163, !632, !169}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !639, file: !56, line: 77, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!163, !632}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !639, file: !56, line: 78, baseType: !646, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !639, file: !56, line: 79, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!163, !632, !366, !205, !259, !357}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !639, file: !56, line: 80, baseType: !655, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!163, !632, !366, !205, !258}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !639, file: !56, line: 81, baseType: !659, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!163, !296, !632}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !639, file: !56, line: 82, baseType: !663, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!163, !632, !366}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !634, file: !56, line: 91, baseType: !667, size: 64, offset: 4928)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !56, line: 87, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !56, line: 87, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !634, file: !56, line: 116, baseType: !671, size: 1024, offset: 4992)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !56, line: 93, size: 1024, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !688}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !671, file: !56, line: 94, baseType: !205, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !671, file: !56, line: 95, baseType: !432, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !671, file: !56, line: 96, baseType: !267, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !671, file: !56, line: 97, baseType: !258, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !671, file: !56, line: 98, baseType: !432, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !671, file: !56, line: 99, baseType: !410, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !671, file: !56, line: 100, baseType: !258, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !671, file: !56, line: 103, baseType: !317, size: 32, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !671, file: !56, line: 109, baseType: !682, size: 256, offset: 512)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !56, line: 104, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !56, line: 105, baseType: !213, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !682, file: !56, line: 106, baseType: !243, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !682, file: !56, line: 107, baseType: !259, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !682, file: !56, line: 108, baseType: !205, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !671, file: !56, line: 115, baseType: !689, size: 256, offset: 768)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !56, line: 110, size: 256, elements: !690)
!690 = !{!691, !692, !693, !694}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !689, file: !56, line: 111, baseType: !213, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !689, file: !56, line: 112, baseType: !243, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !689, file: !56, line: 113, baseType: !259, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !689, file: !56, line: 114, baseType: !205, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !634, file: !56, line: 117, baseType: !357, size: 64, offset: 6016)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !634, file: !56, line: 117, baseType: !357, size: 64, offset: 6080)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !634, file: !56, line: 118, baseType: !317, size: 32, offset: 6144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !634, file: !56, line: 119, baseType: !317, size: 32, offset: 6176)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !634, file: !56, line: 120, baseType: !317, size: 32, offset: 6208)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !634, file: !56, line: 121, baseType: !169, size: 64, offset: 6272)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !634, file: !56, line: 122, baseType: !205, size: 32, offset: 6336)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !634, file: !56, line: 123, baseType: !205, size: 32, offset: 6368)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !634, file: !56, line: 124, baseType: !205, size: 32, offset: 6400)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !634, file: !56, line: 124, baseType: !205, size: 32, offset: 6432)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !634, file: !56, line: 125, baseType: !706, size: 64, offset: 6464)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !634, file: !56, line: 126, baseType: !317, size: 32, offset: 6528)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !634, file: !56, line: 127, baseType: !232, size: 64, offset: 6592)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !634, file: !56, line: 127, baseType: !232, size: 64, offset: 6656)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !634, file: !56, line: 128, baseType: !232, size: 64, offset: 6720)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !634, file: !56, line: 129, baseType: !712, size: 64, offset: 6784)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!163, !143, !357, !432}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !634, file: !56, line: 130, baseType: !287, size: 64, offset: 6848)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !634, file: !56, line: 131, baseType: !143, size: 64, offset: 6912)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !634, file: !56, line: 132, baseType: !143, size: 64, offset: 6976)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !368, file: !56, line: 176, baseType: !432, size: 64, offset: 11392)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !368, file: !56, line: 177, baseType: !432, size: 64, offset: 11456)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !368, file: !56, line: 178, baseType: !205, size: 32, offset: 11520)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !368, file: !56, line: 179, baseType: !357, size: 64, offset: 11584)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !368, file: !56, line: 180, baseType: !205, size: 32, offset: 11648)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !368, file: !56, line: 181, baseType: !205, size: 32, offset: 11680)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !368, file: !56, line: 182, baseType: !205, size: 32, offset: 11712)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !368, file: !56, line: 183, baseType: !317, size: 32, offset: 11744)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !368, file: !56, line: 184, baseType: !317, size: 32, offset: 11776)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !368, file: !56, line: 185, baseType: !357, size: 64, offset: 11840)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !368, file: !56, line: 186, baseType: !388, size: 64, offset: 11904)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !368, file: !56, line: 186, baseType: !388, size: 64, offset: 11968)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !368, file: !56, line: 187, baseType: !143, size: 64, offset: 12032)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !368, file: !56, line: 187, baseType: !143, size: 64, offset: 12096)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !368, file: !56, line: 188, baseType: !143, size: 64, offset: 12160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !368, file: !56, line: 189, baseType: !432, size: 64, offset: 12224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !368, file: !56, line: 190, baseType: !432, size: 64, offset: 12288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !368, file: !56, line: 191, baseType: !357, size: 64, offset: 12352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !368, file: !56, line: 191, baseType: !357, size: 64, offset: 12416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !368, file: !56, line: 194, baseType: !363, size: 64, offset: 12480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !368, file: !56, line: 195, baseType: !739, size: 64, offset: 12544)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!163, !366, !259, !357, !357, !259, !388, !143}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !368, file: !56, line: 196, baseType: !743, size: 64, offset: 12608)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!163, !366, !259, !357, !357, !143}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !368, file: !56, line: 197, baseType: !747, size: 64, offset: 12672)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!163, !366, !259, !357, !432, !143}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !368, file: !56, line: 198, baseType: !747, size: 64, offset: 12736)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !368, file: !56, line: 201, baseType: !432, size: 64, offset: 12800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !368, file: !56, line: 202, baseType: !432, size: 64, offset: 12864)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !368, file: !56, line: 203, baseType: !357, size: 64, offset: 12928)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !368, file: !56, line: 204, baseType: !432, size: 64, offset: 12992)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !368, file: !56, line: 204, baseType: !432, size: 64, offset: 13056)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !368, file: !56, line: 205, baseType: !432, size: 64, offset: 13120)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !368, file: !56, line: 205, baseType: !432, size: 64, offset: 13184)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !368, file: !56, line: 206, baseType: !432, size: 64, offset: 13248)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !368, file: !56, line: 206, baseType: !432, size: 64, offset: 13312)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !368, file: !56, line: 207, baseType: !432, size: 64, offset: 13376)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !368, file: !56, line: 207, baseType: !432, size: 64, offset: 13440)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !368, file: !56, line: 208, baseType: !143, size: 64, offset: 13504)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !368, file: !56, line: 208, baseType: !143, size: 64, offset: 13568)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !368, file: !56, line: 209, baseType: !765, size: 64, offset: 13632)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!163, !366, !259, !357, !432, !357, !432, !143}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !368, file: !56, line: 210, baseType: !765, size: 64, offset: 13696)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !368, file: !56, line: 211, baseType: !765, size: 64, offset: 13760)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !368, file: !56, line: 212, baseType: !765, size: 64, offset: 13824)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !368, file: !56, line: 213, baseType: !765, size: 64, offset: 13888)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !368, file: !56, line: 214, baseType: !765, size: 64, offset: 13952)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !368, file: !56, line: 215, baseType: !765, size: 64, offset: 14016)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !368, file: !56, line: 216, baseType: !765, size: 64, offset: 14080)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !368, file: !56, line: 219, baseType: !388, size: 64, offset: 14144)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !368, file: !56, line: 220, baseType: !357, size: 64, offset: 14208)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !368, file: !56, line: 221, baseType: !432, size: 64, offset: 14272)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !368, file: !56, line: 222, baseType: !205, size: 32, offset: 14336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !368, file: !56, line: 223, baseType: !205, size: 32, offset: 14368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !368, file: !56, line: 224, baseType: !143, size: 64, offset: 14400)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !368, file: !56, line: 225, baseType: !205, size: 32, offset: 14464)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !368, file: !56, line: 226, baseType: !317, size: 32, offset: 14496)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !368, file: !56, line: 227, baseType: !747, size: 64, offset: 14528)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !368, file: !56, line: 231, baseType: !388, size: 64, offset: 14592)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !368, file: !56, line: 232, baseType: !388, size: 64, offset: 14656)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !368, file: !56, line: 233, baseType: !357, size: 64, offset: 14720)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !368, file: !56, line: 247, baseType: !788, size: 384, offset: 14784)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !56, line: 238, size: 384, elements: !789)
!789 = !{!790, !791, !792, !793, !795, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !788, file: !56, line: 239, baseType: !259, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !788, file: !56, line: 240, baseType: !213, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !788, file: !56, line: 241, baseType: !243, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !788, file: !56, line: 242, baseType: !794, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !64, line: 285, baseType: !63)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !788, file: !56, line: 245, baseType: !317, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !788, file: !56, line: 246, baseType: !259, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !788, file: !56, line: 246, baseType: !259, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !368, file: !56, line: 251, baseType: !799, size: 64, offset: 15168)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !56, line: 249, size: 64, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !799, file: !56, line: 250, baseType: !259, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !368, file: !56, line: 253, baseType: !794, size: 32, offset: 15232)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !368, file: !56, line: 255, baseType: !380, size: 64, offset: 15296)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !368, file: !56, line: 256, baseType: !317, size: 32, offset: 15360)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !368, file: !56, line: 258, baseType: !205, size: 32, offset: 15392)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !368, file: !56, line: 259, baseType: !205, size: 32, offset: 15424)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !368, file: !56, line: 260, baseType: !205, size: 32, offset: 15456)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !368, file: !56, line: 261, baseType: !205, size: 32, offset: 15488)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !368, file: !56, line: 264, baseType: !205, size: 32, offset: 15520)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !368, file: !56, line: 264, baseType: !205, size: 32, offset: 15552)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !368, file: !56, line: 264, baseType: !205, size: 32, offset: 15584)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !368, file: !56, line: 264, baseType: !205, size: 32, offset: 15616)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !368, file: !56, line: 267, baseType: !205, size: 32, offset: 15648)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !56, line: 268, baseType: !143, size: 64, offset: 15680)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !368, file: !56, line: 269, baseType: !143, size: 64, offset: 15744)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !368, file: !56, line: 272, baseType: !205, size: 32, offset: 15808)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !368, file: !56, line: 273, baseType: !259, size: 64, offset: 15872)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !368, file: !56, line: 277, baseType: !317, size: 32, offset: 15936)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !368, file: !56, line: 278, baseType: !317, size: 32, offset: 15968)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !368, file: !56, line: 279, baseType: !205, size: 32, offset: 16000)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !368, file: !56, line: 280, baseType: !259, size: 64, offset: 16064)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !368, file: !56, line: 281, baseType: !259, size: 64, offset: 16128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !368, file: !56, line: 282, baseType: !259, size: 64, offset: 16192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !368, file: !56, line: 283, baseType: !259, size: 64, offset: 16256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !368, file: !56, line: 284, baseType: !259, size: 64, offset: 16320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !368, file: !56, line: 286, baseType: !827, size: 32, offset: 16384)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !35, line: 115, baseType: !70)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !368, file: !56, line: 287, baseType: !317, size: 32, offset: 16416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !368, file: !56, line: 288, baseType: !205, size: 32, offset: 16448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !368, file: !56, line: 288, baseType: !205, size: 32, offset: 16480)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !368, file: !56, line: 289, baseType: !832, size: 32, offset: 16512)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !35, line: 217, baseType: !83)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !368, file: !56, line: 291, baseType: !259, size: 64, offset: 16576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !368, file: !56, line: 291, baseType: !259, size: 64, offset: 16640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !368, file: !56, line: 292, baseType: !357, size: 64, offset: 16704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !368, file: !56, line: 292, baseType: !357, size: 64, offset: 16768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !368, file: !56, line: 293, baseType: !259, size: 64, offset: 16832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !368, file: !56, line: 293, baseType: !259, size: 64, offset: 16896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !368, file: !56, line: 295, baseType: !317, size: 32, offset: 16960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !368, file: !56, line: 296, baseType: !317, size: 32, offset: 16992)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !368, file: !56, line: 298, baseType: !205, size: 32, offset: 17024)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !368, file: !56, line: 299, baseType: !432, size: 64, offset: 17088)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !368, file: !56, line: 302, baseType: !205, size: 32, offset: 17152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !368, file: !56, line: 303, baseType: !845, size: 64, offset: 17216)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !56, line: 135, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !56, line: 136, size: 320, elements: !848)
!848 = !{!849, !850, !851, !856, !857}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !847, file: !56, line: 137, baseType: !366, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !847, file: !56, line: 138, baseType: !232, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !847, file: !56, line: 139, baseType: !852, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !853, line: 11, baseType: !854)
!853 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !853, line: 11, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !56, line: 140, baseType: !845, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !847, file: !56, line: 141, baseType: !858, size: 32, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !859, line: 80, baseType: !40)
!859 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!860 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !368, file: !56, line: 304, baseType: !317, size: 32, offset: 17280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !368, file: !56, line: 307, baseType: !366, size: 64, offset: 17344)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Ffunc", scope: !353, file: !352, line: 21, baseType: !563, size: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Gfunc", scope: !353, file: !352, line: 22, baseType: !743, size: 64, offset: 384)
!864 = !{!0, !865}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "DGCitation", scope: !2, file: !352, line: 8, type: !867, isLocal: false, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2152, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 269)
!870 = !{i32 7, !"Dwarf Version", i32 4}
!871 = !{i32 2, !"Debug Info Version", i32 3}
!872 = !{i32 1, !"wchar_size", i32 4}
!873 = !{i32 7, !"PIC Level", i32 2}
!874 = !{i32 7, !"uwtable", i32 1}
!875 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!876 = distinct !DISubprogram(name: "TSCreate_DiscGrad", scope: !352, file: !352, line: 349, type: !393, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !877)
!877 = !{!878, !879, !880, !881, !883, !885, !887}
!878 = !DILocalVariable(name: "ts", arg: 1, scope: !876, file: !352, line: 349, type: !366)
!879 = !DILocalVariable(name: "th", scope: !876, file: !352, line: 351, type: !350)
!880 = !DILocalVariable(name: "ierr", scope: !876, file: !352, line: 352, type: !163)
!881 = !DILocalVariable(name: "ierr__", scope: !882, file: !352, line: 355, type: !163)
!882 = distinct !DILexicalBlock(scope: !876, file: !352, line: 355, column: 54)
!883 = !DILocalVariable(name: "ierr__", scope: !884, file: !352, line: 370, type: !163)
!884 = distinct !DILexicalBlock(scope: !876, file: !352, line: 370, column: 30)
!885 = !DILocalVariable(name: "ierr__", scope: !886, file: !352, line: 372, type: !163)
!886 = distinct !DILexicalBlock(scope: !876, file: !352, line: 372, column: 117)
!887 = !DILocalVariable(name: "ierr__", scope: !888, file: !352, line: 373, type: !163)
!888 = distinct !DILexicalBlock(scope: !876, file: !352, line: 373, column: 117)
!889 = !DILocation(line: 0, scope: !876)
!890 = !DILocation(line: 351, column: 3, scope: !876)
!891 = !DILocation(line: 354, column: 3, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !352, line: 354, column: 3)
!893 = distinct !DILexicalBlock(scope: !894, file: !352, line: 354, column: 3)
!894 = distinct !DILexicalBlock(scope: !876, file: !352, line: 354, column: 3)
!895 = !{!896, !896, i64 0}
!896 = !{!"any pointer", !897, i64 0}
!897 = !{!"omnipotent char", !898, i64 0}
!898 = !{!"Simple C/C++ TBAA"}
!899 = !DILocation(line: 354, column: 3, scope: !893)
!900 = !DILocation(line: 354, column: 3, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !352, line: 354, column: 3)
!902 = distinct !DILexicalBlock(scope: !892, file: !352, line: 354, column: 3)
!903 = !{!904, !905, i64 1536}
!904 = !{!"", !897, i64 0, !897, i64 512, !897, i64 1024, !897, i64 1280, !905, i64 1536, !905, i64 1540, !897, i64 1544}
!905 = !{!"int", !897, i64 0}
!906 = !DILocation(line: 354, column: 3, scope: !902)
!907 = !DILocation(line: 354, column: 3, scope: !908)
!908 = distinct !DILexicalBlock(scope: !901, file: !352, line: 354, column: 3)
!909 = !{!905, !905, i64 0}
!910 = !DILocation(line: 2749, column: 3, scope: !911, inlinedAt: !929)
!911 = distinct !DILexicalBlock(scope: !912, file: !348, line: 2749, column: 3)
!912 = distinct !DILexicalBlock(scope: !913, file: !348, line: 2749, column: 3)
!913 = distinct !DILexicalBlock(scope: !914, file: !348, line: 2749, column: 3)
!914 = distinct !DISubprogram(name: "PetscCitationsRegister", scope: !348, file: !348, line: 2743, type: !915, scopeLine: 2744, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!163, !182, !410}
!917 = !{!918, !919, !920, !921, !922, !923, !925, !927}
