; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redistribute/redistribute.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redistribute/redistribute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!62 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90}
!82 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!88 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!89 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!90 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 30, baseType: !5, size: 32, elements: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 238, baseType: !5, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!110 = !{!111, !147, !151, !152, !187, !315, !235, !26, !225, !349, !352, !144, !211, !5}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Redistribute", file: !113, line: 16, baseType: !114)
!113 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/redistribute/redistribute.c", directory: "/home/users/ndemeye/xSDK")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 8, size: 576, elements: !115)
!115 = !{!116, !121, !125, !126, !132, !137, !139, !141, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !114, file: !113, line: 9, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !118, line: 22, baseType: !119)
!118 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !118, line: 22, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !114, file: !113, line: 10, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !92, line: 21, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !92, line: 21, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !114, file: !113, line: 10, baseType: !122, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "scatter", scope: !114, file: !113, line: 11, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !128, line: 59, baseType: !129)
!128 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !128, line: 15, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !128, line: 15, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !114, file: !113, line: 12, baseType: !133, size: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !134, line: 11, baseType: !135)
!134 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !134, line: 11, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dcnt", scope: !114, file: !113, line: 13, baseType: !138, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "drows", scope: !114, file: !113, line: 13, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !114, file: !113, line: 14, baseType: !142, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !145)
!145 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !114, file: !113, line: 15, baseType: !122, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !148, line: 330, baseType: !149)
!148 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !148, line: 330, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !155, line: 73, size: 4480, elements: !156)
!155 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!156 = !{!157, !159, !208, !209, !210, !212, !213, !214, !215, !223, !224, !226, !230, !234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !251, !252, !253, !255, !256, !257, !258, !259, !261, !263, !264, !265, !266, !267, !268, !270, !271, !272, !282, !284, !285, !289, !290, !339, !344, !346, !347, !348}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !154, file: !155, line: 74, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !154, file: !155, line: 75, baseType: !160, size: 448, offset: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 448, elements: !206)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !155, line: 53, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 45, size: 448, elements: !163)
!163 = !{!164, !170, !178, !183, !190, !194, !201}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !162, file: !155, line: 46, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !152, !169}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !162, file: !155, line: 47, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!168, !152, !174}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !175, line: 16, baseType: !176)
!175 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !175, line: 16, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !162, file: !155, line: 48, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!168, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !162, file: !155, line: 49, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!168, !152, !187, !152}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !162, file: !155, line: 50, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!168, !152, !187, !182}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !162, file: !155, line: 51, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!168, !152, !187, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !162, file: !155, line: 52, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!168, !152, !187, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!206 = !{!207}
!207 = !DISubrange(count: 1)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !154, file: !155, line: 76, baseType: !147, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !155, line: 77, baseType: !138, size: 32, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !154, file: !155, line: 78, baseType: !211, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !145)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !154, file: !155, line: 78, baseType: !211, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !154, file: !155, line: 78, baseType: !211, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !154, file: !155, line: 78, baseType: !211, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 79, baseType: !216, size: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !219, line: 27, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !221, line: 43, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !154, file: !155, line: 80, baseType: !138, size: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !154, file: !155, line: 81, baseType: !225, size: 32, offset: 992)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !154, file: !155, line: 82, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !154, file: !155, line: 83, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !154, file: !155, line: 84, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !154, file: !155, line: 85, baseType: !235, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !154, file: !155, line: 86, baseType: !235, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !154, file: !155, line: 87, baseType: !235, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !154, file: !155, line: 88, baseType: !152, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !154, file: !155, line: 89, baseType: !216, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 90, baseType: !235, size: 64, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !154, file: !155, line: 91, baseType: !235, size: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !154, file: !155, line: 92, baseType: !138, size: 32, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !154, file: !155, line: 93, baseType: !151, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !154, file: !155, line: 94, baseType: !246, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !217)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !154, file: !155, line: 95, baseType: !138, size: 32, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !154, file: !155, line: 95, baseType: !138, size: 32, offset: 1888)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !154, file: !155, line: 96, baseType: !250, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !154, file: !155, line: 96, baseType: !250, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !154, file: !155, line: 97, baseType: !140, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !154, file: !155, line: 97, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !154, file: !155, line: 98, baseType: !138, size: 32, offset: 2176)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !154, file: !155, line: 98, baseType: !138, size: 32, offset: 2208)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !154, file: !155, line: 99, baseType: !250, size: 64, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !154, file: !155, line: 99, baseType: !250, size: 64, offset: 2304)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !154, file: !155, line: 100, baseType: !260, size: 64, offset: 2368)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !154, file: !155, line: 100, baseType: !262, size: 64, offset: 2432)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !154, file: !155, line: 101, baseType: !138, size: 32, offset: 2496)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !154, file: !155, line: 101, baseType: !138, size: 32, offset: 2528)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !154, file: !155, line: 102, baseType: !250, size: 64, offset: 2560)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !154, file: !155, line: 102, baseType: !250, size: 64, offset: 2624)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !154, file: !155, line: 103, baseType: !142, size: 64, offset: 2688)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !154, file: !155, line: 103, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !154, file: !155, line: 104, baseType: !205, size: 64, offset: 2816)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !154, file: !155, line: 105, baseType: !138, size: 32, offset: 2880)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !154, file: !155, line: 106, baseType: !273, size: 128, offset: 2944)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !155, line: 64, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 61, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !276, file: !155, line: 62, baseType: !198, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !155, line: 63, baseType: !151, size: 64, offset: 64)
!280 = !{!281}
!281 = !DISubrange(count: 2)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !154, file: !155, line: 107, baseType: !283, size: 64, offset: 3072)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !154, file: !155, line: 108, baseType: !151, size: 64, offset: 3136)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !154, file: !155, line: 109, baseType: !286, size: 64, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!168, !151}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !154, file: !155, line: 111, baseType: !138, size: 32, offset: 3264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !154, file: !155, line: 112, baseType: !291, size: 320, offset: 3328)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !337)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!168, !295, !152, !151}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !298)
!298 = !{!299, !300, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !297, file: !10, line: 100, baseType: !138, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !10, line: 101, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !312, !313, !314, !318, !320, !322, !323, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !303, file: !10, line: 84, baseType: !235, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !303, file: !10, line: 85, baseType: !235, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !10, line: 86, baseType: !151, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !303, file: !10, line: 87, baseType: !227, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !10, line: 88, baseType: !310, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !303, file: !10, line: 89, baseType: !189, size: 8, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !303, file: !10, line: 90, baseType: !235, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !303, file: !10, line: 91, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!317 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !303, file: !10, line: 92, baseType: !319, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !10, line: 93, baseType: !321, size: 32, offset: 544)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !10, line: 94, baseType: !301, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !303, file: !10, line: 95, baseType: !235, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !303, file: !10, line: 96, baseType: !151, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !297, file: !10, line: 102, baseType: !235, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !297, file: !10, line: 102, baseType: !235, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !297, file: !10, line: 103, baseType: !235, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !297, file: !10, line: 104, baseType: !147, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !297, file: !10, line: 105, baseType: !319, size: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !297, file: !10, line: 106, baseType: !152, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !10, line: 107, baseType: !334, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!337 = !{!338}
!338 = !DISubrange(count: 5)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !154, file: !155, line: 113, baseType: !340, size: 320, offset: 3648)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 320, elements: !337)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!168, !152, !151}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !154, file: !155, line: 114, baseType: !345, size: 320, offset: 3968)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !337)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !154, file: !155, line: 115, baseType: !319, size: 32, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !154, file: !155, line: 120, baseType: !334, size: 64, offset: 4352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !154, file: !155, line: 121, baseType: !319, size: 32, offset: 4416)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !148, line: 331, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !148, line: 331, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !148, line: 338, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !148, line: 338, flags: DIFlagFwdDecl)
!355 = !{i32 7, !"Dwarf Version", i32 4}
!356 = !{i32 2, !"Debug Info Version", i32 3}
!357 = !{i32 1, !"wchar_size", i32 4}
!358 = !{i32 7, !"PIC Level", i32 2}
!359 = !{i32 7, !"uwtable", i32 1}
!360 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!361 = distinct !DISubprogram(name: "PCRedistributeGetKSP", scope: !113, file: !113, line: 315, type: !362, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !463)
!362 = !DISubroutineType(types: !363)
!363 = !{!168, !364, !462}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !367, line: 37, size: 6720, elements: !368)
!367 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!368 = !{!369, !371, !430, !435, !436, !437, !438, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !455, !456, !457, !458, !459, !461}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !366, file: !367, line: 38, baseType: !370, size: 4480)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !155, line: 122, baseType: !154)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !366, file: !367, line: 38, baseType: !372, size: 1152, offset: 4480)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 1152, elements: !206)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !367, line: 13, size: 1152, elements: !374)
!374 = !{!375, !379, !383, !390, !396, !401, !402, !406, !410, !414, !415, !420, !421, !422, !423, !424, !428, !429}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !373, file: !367, line: 14, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!168, !364}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !373, file: !367, line: 15, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!168, !364, !122, !122}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !373, file: !367, line: 16, baseType: !384, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!168, !364, !387, !387}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !373, file: !367, line: 17, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!168, !364, !122, !122, !122, !144, !144, !144, !138, !319, !140, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !373, file: !367, line: 18, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!168, !364, !400, !122, !122, !122}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !373, file: !367, line: 19, baseType: !380, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !373, file: !367, line: 20, baseType: !403, size: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!168, !364, !138, !122, !122, !122}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !373, file: !367, line: 21, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!168, !295, !364}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !373, file: !367, line: 22, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!168, !364, !117, !122, !122}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !373, file: !367, line: 23, baseType: !411, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !373, file: !367, line: 24, baseType: !416, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!168, !364, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !373, file: !367, line: 25, baseType: !380, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !373, file: !367, line: 26, baseType: !380, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !373, file: !367, line: 27, baseType: !376, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !373, file: !367, line: 28, baseType: !376, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !373, file: !367, line: 29, baseType: !425, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!168, !364, !174}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !373, file: !367, line: 30, baseType: !376, size: 64, offset: 1024)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !373, file: !367, line: 31, baseType: !425, size: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !366, file: !367, line: 39, baseType: !431, size: 64, offset: 5632)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !432, line: 14, baseType: !433)
!432 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !432, line: 14, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !366, file: !367, line: 40, baseType: !138, size: 32, offset: 5696)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !366, file: !367, line: 41, baseType: !246, size: 64, offset: 5760)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !366, file: !367, line: 41, baseType: !246, size: 64, offset: 5824)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !366, file: !367, line: 42, baseType: !319, size: 32, offset: 5888)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !367, line: 43, baseType: !440, size: 32, offset: 5920)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !366, file: !367, line: 45, baseType: !138, size: 32, offset: 5952)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !366, file: !367, line: 46, baseType: !319, size: 32, offset: 5984)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !366, file: !367, line: 47, baseType: !387, size: 64, offset: 6016)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !366, file: !367, line: 47, baseType: !387, size: 64, offset: 6080)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !366, file: !367, line: 48, baseType: !122, size: 64, offset: 6144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !366, file: !367, line: 48, baseType: !122, size: 64, offset: 6208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !366, file: !367, line: 49, baseType: !319, size: 32, offset: 6272)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !366, file: !367, line: 50, baseType: !319, size: 32, offset: 6304)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !366, file: !367, line: 51, baseType: !450, size: 64, offset: 6336)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!168, !364, !138, !453, !453, !419, !151}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !366, file: !367, line: 52, baseType: !151, size: 64, offset: 6400)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !367, line: 53, baseType: !151, size: 64, offset: 6464)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !366, file: !367, line: 54, baseType: !138, size: 32, offset: 6528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !366, file: !367, line: 55, baseType: !151, size: 64, offset: 6592)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !366, file: !367, line: 56, baseType: !460, size: 32, offset: 6656)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !366, file: !367, line: 57, baseType: !460, size: 32, offset: 6688)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!463 = !{!464, !465, !466}
!464 = !DILocalVariable(name: "pc", arg: 1, scope: !361, file: !113, line: 315, type: !364)
!465 = !DILocalVariable(name: "innerksp", arg: 2, scope: !361, file: !113, line: 315, type: !462)
!466 = !DILocalVariable(name: "red", scope: !361, file: !113, line: 317, type: !111)
!467 = !DILocation(line: 0, scope: !361)
!468 = !DILocation(line: 317, column: 48, scope: !361)
!469 = !{!470, !475, i64 808}
!470 = !{!"_p_PC", !471, i64 0, !473, i64 560, !475, i64 704, !472, i64 712, !477, i64 720, !477, i64 728, !473, i64 736, !473, i64 740, !472, i64 744, !473, i64 748, !475, i64 752, !475, i64 760, !475, i64 768, !475, i64 776, !473, i64 784, !473, i64 788, !475, i64 792, !475, i64 800, !475, i64 808, !472, i64 816, !475, i64 824, !473, i64 832, !473, i64 836}
!471 = !{!"_p_PetscObject", !472, i64 0, !473, i64 8, !475, i64 64, !472, i64 72, !476, i64 80, !476, i64 88, !476, i64 96, !476, i64 104, !477, i64 112, !472, i64 120, !472, i64 124, !475, i64 128, !475, i64 136, !475, i64 144, !475, i64 152, !475, i64 160, !475, i64 168, !475, i64 176, !477, i64 184, !475, i64 192, !475, i64 200, !472, i64 208, !475, i64 216, !477, i64 224, !472, i64 232, !472, i64 236, !475, i64 240, !475, i64 248, !475, i64 256, !475, i64 264, !472, i64 272, !472, i64 276, !475, i64 280, !475, i64 288, !475, i64 296, !475, i64 304, !472, i64 312, !472, i64 316, !475, i64 320, !475, i64 328, !475, i64 336, !475, i64 344, !475, i64 352, !472, i64 360, !473, i64 368, !473, i64 384, !475, i64 392, !475, i64 400, !472, i64 408, !473, i64 416, !473, i64 456, !473, i64 496, !473, i64 536, !475, i64 544, !473, i64 552}
!472 = !{!"int", !473, i64 0}
!473 = !{!"omnipotent char", !474, i64 0}
!474 = !{!"Simple C/C++ TBAA"}
!475 = !{!"any pointer", !473, i64 0}
!476 = !{!"double", !473, i64 0}
!477 = !{!"long", !473, i64 0}
!478 = !DILocation(line: 319, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !113, line: 319, column: 3)
!480 = distinct !DILexicalBlock(scope: !481, file: !113, line: 319, column: 3)
!481 = distinct !DILexicalBlock(scope: !361, file: !113, line: 319, column: 3)
!482 = !{!475, !475, i64 0}
!483 = !DILocation(line: 319, column: 3, scope: !480)
!484 = !DILocation(line: 319, column: 3, scope: !485)
!485 = distinct !DILexicalBlock(scope: !486, file: !113, line: 319, column: 3)
!486 = distinct !DILexicalBlock(scope: !479, file: !113, line: 319, column: 3)
!487 = !{!488, !472, i64 1536}
!488 = !{!"", !473, i64 0, !473, i64 512, !473, i64 1024, !473, i64 1280, !472, i64 1536, !472, i64 1540, !473, i64 1544}
!489 = !DILocation(line: 319, column: 3, scope: !486)
!490 = !DILocation(line: 319, column: 3, scope: !491)
!491 = distinct !DILexicalBlock(scope: !485, file: !113, line: 319, column: 3)
!492 = !{!472, !472, i64 0}
!493 = !{!488, !472, i64 1540}
!494 = !DILocation(line: 320, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !113, line: 320, column: 3)
!496 = distinct !DILexicalBlock(scope: !361, file: !113, line: 320, column: 3)
!497 = !DILocation(line: 320, column: 3, scope: !496)
!498 = !DILocation(line: 320, column: 3, scope: !499)
!499 = distinct !DILexicalBlock(scope: !496, file: !113, line: 320, column: 3)
!500 = !{!471, !472, i64 0}
!501 = !DILocation(line: 320, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !113, line: 320, column: 3)
!503 = distinct !DILexicalBlock(scope: !499, file: !113, line: 320, column: 3)
!504 = !DILocation(line: 320, column: 3, scope: !503)
!505 = !DILocation(line: 321, column: 3, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !113, line: 321, column: 3)
!507 = distinct !DILexicalBlock(scope: !361, file: !113, line: 321, column: 3)
!508 = !DILocation(line: 321, column: 3, scope: !507)
!509 = !DILocation(line: 321, column: 3, scope: !510)
!510 = distinct !DILexicalBlock(scope: !507, file: !113, line: 321, column: 3)
!511 = !DILocation(line: 322, column: 20, scope: !361)
!512 = !{!513, !475, i64 0}
!513 = !{!"", !475, i64 0, !475, i64 8, !475, i64 16, !475, i64 24, !475, i64 32, !472, i64 40, !475, i64 48, !475, i64 56, !475, i64 64}
!514 = !DILocation(line: 322, column: 13, scope: !361)
!515 = !DILocation(line: 323, column: 3, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !113, line: 323, column: 3)
!517 = distinct !DILexicalBlock(scope: !518, file: !113, line: 323, column: 3)
!518 = distinct !DILexicalBlock(scope: !361, file: !113, line: 323, column: 3)
!519 = !DILocation(line: 323, column: 3, scope: !517)
!520 = !DILocation(line: 323, column: 3, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !113, line: 323, column: 3)
!522 = distinct !DILexicalBlock(scope: !516, file: !113, line: 323, column: 3)
!523 = !DILocation(line: 323, column: 3, scope: !522)
!524 = !DILocation(line: 323, column: 3, scope: !525)
!525 = distinct !DILexicalBlock(scope: !526, file: !113, line: 323, column: 3)
!526 = distinct !DILexicalBlock(scope: !521, file: !113, line: 323, column: 3)
!527 = !{!488, !473, i64 1544}
!528 = !DILocation(line: 323, column: 3, scope: !526)
!529 = !DILocation(line: 323, column: 3, scope: !530)
!530 = distinct !DILexicalBlock(scope: !525, file: !113, line: 323, column: 3)
!531 = !DILocation(line: 323, column: 3, scope: !532)
!532 = distinct !DILexicalBlock(scope: !521, file: !113, line: 323, column: 3)
!533 = !DILocation(line: 323, column: 3, scope: !534)
!534 = distinct !DILexicalBlock(scope: !532, file: !113, line: 323, column: 3)
!535 = !DILocation(line: 323, column: 3, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !113, line: 323, column: 3)
!537 = distinct !DILexicalBlock(scope: !534, file: !113, line: 323, column: 3)
!538 = !DILocation(line: 323, column: 3, scope: !537)
!539 = !DILocation(line: 323, column: 3, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !113, line: 323, column: 3)
!541 = !DILocation(line: 324, column: 1, scope: !361)
!542 = !DISubprogram(name: "PetscError", scope: !55, file: !55, line: 668, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!168, !149, !26, !187, !187, !26, !54, !187, null}
!545 = !{}
!546 = !DISubprogram(name: "PetscCheckPointer", scope: !155, file: !155, line: 183, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!547 = !DISubroutineType(types: !548)
!548 = !{!3, !549, !60}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!551 = distinct !DISubprogram(name: "PCCreate_Redistribute", scope: !113, file: !113, line: 348, type: !377, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!552 = !{!553, !554, !555, !556, !557, !559, !561, !563, !565, !567, !569, !571}
!553 = !DILocalVariable(name: "pc", arg: 1, scope: !551, file: !113, line: 348, type: !364)
!554 = !DILocalVariable(name: "ierr", scope: !551, file: !113, line: 350, type: !168)
!555 = !DILocalVariable(name: "red", scope: !551, file: !113, line: 351, type: !111)
!556 = !DILocalVariable(name: "prefix", scope: !551, file: !113, line: 352, type: !187)
!557 = !DILocalVariable(name: "ierr__", scope: !558, file: !113, line: 355, type: !168)
!558 = distinct !DILexicalBlock(scope: !551, file: !113, line: 355, column: 35)
!559 = !DILocalVariable(name: "ierr__", scope: !560, file: !113, line: 365, type: !168)
!560 = distinct !DILexicalBlock(scope: !551, file: !113, line: 365, column: 64)
!561 = !DILocalVariable(name: "ierr__", scope: !562, file: !113, line: 366, type: !168)
!562 = distinct !DILexicalBlock(scope: !551, file: !113, line: 366, column: 65)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !113, line: 367, type: !168)
!564 = distinct !DILexicalBlock(scope: !551, file: !113, line: 367, column: 80)
!565 = !DILocalVariable(name: "ierr__", scope: !566, file: !113, line: 368, type: !168)
!566 = distinct !DILexicalBlock(scope: !551, file: !113, line: 368, column: 70)
!567 = !DILocalVariable(name: "ierr__", scope: !568, file: !113, line: 369, type: !168)
!568 = distinct !DILexicalBlock(scope: !551, file: !113, line: 369, column: 41)
!569 = !DILocalVariable(name: "ierr__", scope: !570, file: !113, line: 370, type: !168)
!570 = distinct !DILexicalBlock(scope: !551, file: !113, line: 370, column: 47)
!571 = !DILocalVariable(name: "ierr__", scope: !572, file: !113, line: 371, type: !168)
!572 = distinct !DILexicalBlock(scope: !551, file: !113, line: 371, column: 59)
!573 = !DILocation(line: 0, scope: !551)
!574 = !DILocation(line: 351, column: 3, scope: !551)
!575 = !DILocation(line: 352, column: 3, scope: !551)
!576 = !DILocation(line: 354, column: 3, scope: !577)
!577 = distinct !DILexicalBlock(scope: !578, file: !113, line: 354, column: 3)
!578 = distinct !DILexicalBlock(scope: !579, file: !113, line: 354, column: 3)
!579 = distinct !DILexicalBlock(scope: !551, file: !113, line: 354, column: 3)
!580 = !DILocation(line: 354, column: 3, scope: !578)
!581 = !DILocation(line: 354, column: 3, scope: !582)
!582 = distinct !DILexicalBlock(scope: !583, file: !113, line: 354, column: 3)
!583 = distinct !DILexicalBlock(scope: !577, file: !113, line: 354, column: 3)
!584 = !DILocation(line: 354, column: 3, scope: !583)
!585 = !DILocation(line: 354, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !582, file: !113, line: 354, column: 3)
!587 = !DILocation(line: 355, column: 14, scope: !551)
!588 = !{!"branch_weights", i32 2146410443, i32 1073205}
!589 = !DILocation(line: 0, scope: !558)
!590 = !DILocation(line: 355, column: 35, scope: !558)
!591 = !{!"branch_weights", i32 2000, i32 1}
!592 = !DILocation(line: 355, column: 35, scope: !593)
!593 = distinct !DILexicalBlock(scope: !558, file: !113, line: 355, column: 35)
!594 = !DILocation(line: 356, column: 21, scope: !551)
!595 = !DILocation(line: 356, column: 7, scope: !551)
!596 = !DILocation(line: 356, column: 12, scope: !551)
!597 = !DILocation(line: 358, column: 12, scope: !551)
!598 = !DILocation(line: 358, column: 27, scope: !551)
!599 = !{!600, !475, i64 8}
!600 = !{!"_PCOps", !475, i64 0, !475, i64 8, !475, i64 16, !475, i64 24, !475, i64 32, !475, i64 40, !475, i64 48, !475, i64 56, !475, i64 64, !475, i64 72, !475, i64 80, !475, i64 88, !475, i64 96, !475, i64 104, !475, i64 112, !475, i64 120, !475, i64 128, !475, i64 136}
!601 = !DILocation(line: 359, column: 12, scope: !551)
!602 = !DILocation(line: 359, column: 27, scope: !551)
!603 = !{!600, !475, i64 40}
!604 = !DILocation(line: 360, column: 12, scope: !551)
!605 = !DILocation(line: 360, column: 27, scope: !551)
!606 = !{!600, !475, i64 0}
!607 = !DILocation(line: 361, column: 12, scope: !551)
!608 = !DILocation(line: 361, column: 27, scope: !551)
!609 = !{!600, !475, i64 112}
!610 = !DILocation(line: 362, column: 12, scope: !551)
!611 = !DILocation(line: 362, column: 27, scope: !551)
!612 = !{!600, !475, i64 56}
!613 = !DILocation(line: 363, column: 12, scope: !551)
!614 = !DILocation(line: 363, column: 27, scope: !551)
!615 = !{!600, !475, i64 120}
!616 = !DILocation(line: 365, column: 20, scope: !551)
!617 = !DILocation(line: 365, column: 54, scope: !551)
!618 = !DILocation(line: 365, column: 59, scope: !551)
!619 = !DILocation(line: 365, column: 10, scope: !551)
!620 = !DILocation(line: 0, scope: !560)
!621 = !DILocation(line: 365, column: 64, scope: !622)
!622 = distinct !DILexicalBlock(scope: !560, file: !113, line: 365, column: 64)
!623 = !DILocation(line: 365, column: 64, scope: !560)
!624 = !DILocation(line: 366, column: 36, scope: !551)
!625 = !DILocation(line: 366, column: 41, scope: !551)
!626 = !DILocation(line: 366, column: 49, scope: !551)
!627 = !{!470, !473, i64 748}
!628 = !DILocation(line: 366, column: 10, scope: !551)
!629 = !DILocation(line: 0, scope: !562)
!630 = !DILocation(line: 366, column: 65, scope: !631)
!631 = distinct !DILexicalBlock(scope: !562, file: !113, line: 366, column: 65)
!632 = !DILocation(line: 366, column: 65, scope: !562)
!633 = !DILocation(line: 367, column: 52, scope: !551)
!634 = !DILocation(line: 367, column: 57, scope: !551)
!635 = !DILocation(line: 367, column: 10, scope: !551)
!636 = !DILocation(line: 0, scope: !564)
!637 = !DILocation(line: 367, column: 80, scope: !638)
!638 = distinct !DILexicalBlock(scope: !564, file: !113, line: 367, column: 80)
!639 = !DILocation(line: 367, column: 80, scope: !564)
!640 = !DILocation(line: 368, column: 60, scope: !551)
!641 = !DILocation(line: 368, column: 65, scope: !551)
!642 = !DILocation(line: 368, column: 10, scope: !551)
!643 = !DILocation(line: 0, scope: !566)
!644 = !DILocation(line: 368, column: 70, scope: !645)
!645 = distinct !DILexicalBlock(scope: !566, file: !113, line: 368, column: 70)
!646 = !DILocation(line: 368, column: 70, scope: !566)
!647 = !DILocation(line: 369, column: 10, scope: !551)
!648 = !DILocation(line: 0, scope: !568)
!649 = !DILocation(line: 369, column: 41, scope: !650)
!650 = distinct !DILexicalBlock(scope: !568, file: !113, line: 369, column: 41)
!651 = !DILocation(line: 369, column: 41, scope: !568)
!652 = !DILocation(line: 370, column: 30, scope: !551)
!653 = !DILocation(line: 370, column: 35, scope: !551)
!654 = !DILocation(line: 370, column: 39, scope: !551)
!655 = !DILocation(line: 370, column: 10, scope: !551)
!656 = !DILocation(line: 0, scope: !570)
!657 = !DILocation(line: 370, column: 47, scope: !658)
!658 = distinct !DILexicalBlock(scope: !570, file: !113, line: 370, column: 47)
!659 = !DILocation(line: 370, column: 47, scope: !570)
!660 = !DILocation(line: 371, column: 33, scope: !551)
!661 = !DILocation(line: 371, column: 38, scope: !551)
!662 = !DILocation(line: 371, column: 10, scope: !551)
!663 = !DILocation(line: 0, scope: !572)
!664 = !DILocation(line: 371, column: 59, scope: !665)
!665 = distinct !DILexicalBlock(scope: !572, file: !113, line: 371, column: 59)
!666 = !DILocation(line: 371, column: 59, scope: !572)
!667 = !DILocation(line: 372, column: 3, scope: !668)
!668 = distinct !DILexicalBlock(scope: !669, file: !113, line: 372, column: 3)
!669 = distinct !DILexicalBlock(scope: !670, file: !113, line: 372, column: 3)
!670 = distinct !DILexicalBlock(scope: !551, file: !113, line: 372, column: 3)
!671 = !DILocation(line: 372, column: 3, scope: !669)
!672 = !DILocation(line: 372, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !113, line: 372, column: 3)
!674 = distinct !DILexicalBlock(scope: !668, file: !113, line: 372, column: 3)
!675 = !DILocation(line: 372, column: 3, scope: !674)
!676 = !DILocation(line: 372, column: 3, scope: !677)
!677 = distinct !DILexicalBlock(scope: !678, file: !113, line: 372, column: 3)
!678 = distinct !DILexicalBlock(scope: !673, file: !113, line: 372, column: 3)
!679 = !DILocation(line: 372, column: 3, scope: !678)
!680 = !DILocation(line: 372, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !677, file: !113, line: 372, column: 3)
!682 = !DILocation(line: 372, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !673, file: !113, line: 372, column: 3)
!684 = !DILocation(line: 372, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !683, file: !113, line: 372, column: 3)
!686 = !DILocation(line: 372, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !113, line: 372, column: 3)
!688 = distinct !DILexicalBlock(scope: !685, file: !113, line: 372, column: 3)
!689 = !DILocation(line: 372, column: 3, scope: !688)
!690 = !DILocation(line: 372, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !687, file: !113, line: 372, column: 3)
!692 = !DILocation(line: 373, column: 1, scope: !551)
!693 = !DISubprogram(name: "PetscMallocA", scope: !694, file: !694, line: 1288, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!694 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!695 = !DISubroutineType(types: !696)
!696 = !{!168, !26, !3, !26, !187, !187, !317, !151, null}
!697 = !DISubprogram(name: "PetscLogObjectMemory", scope: !698, file: !698, line: 228, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!698 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!699 = !DISubroutineType(types: !700)
!700 = !{!26, !153, !145}
!701 = distinct !DISubprogram(name: "PCApply_Redistribute", scope: !113, file: !113, line: 239, type: !381, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !713, !714, !717, !718, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748}
!703 = !DILocalVariable(name: "pc", arg: 1, scope: !701, file: !113, line: 239, type: !364)
!704 = !DILocalVariable(name: "b", arg: 2, scope: !701, file: !113, line: 239, type: !122)
!705 = !DILocalVariable(name: "x", arg: 3, scope: !701, file: !113, line: 239, type: !122)
!706 = !DILocalVariable(name: "red", scope: !701, file: !113, line: 241, type: !111)
!707 = !DILocalVariable(name: "ierr", scope: !701, file: !113, line: 242, type: !168)
!708 = !DILocalVariable(name: "dcnt", scope: !701, file: !113, line: 243, type: !138)
!709 = !DILocalVariable(name: "i", scope: !701, file: !113, line: 243, type: !138)
!710 = !DILocalVariable(name: "drows", scope: !701, file: !113, line: 244, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!713 = !DILocalVariable(name: "xwork", scope: !701, file: !113, line: 245, type: !142)
!714 = !DILocalVariable(name: "bwork", scope: !701, file: !113, line: 246, type: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!717 = !DILocalVariable(name: "diag", scope: !701, file: !113, line: 246, type: !715)
!718 = !DILocalVariable(name: "ierr__", scope: !719, file: !113, line: 250, type: !168)
!719 = distinct !DILexicalBlock(scope: !720, file: !113, line: 250, column: 39)
!720 = distinct !DILexicalBlock(scope: !721, file: !113, line: 249, column: 19)
!721 = distinct !DILexicalBlock(scope: !701, file: !113, line: 249, column: 7)
!722 = !DILocalVariable(name: "ierr__", scope: !723, file: !113, line: 253, type: !168)
!723 = distinct !DILexicalBlock(scope: !701, file: !113, line: 253, column: 24)
!724 = !DILocalVariable(name: "ierr__", scope: !725, file: !113, line: 254, type: !168)
!725 = distinct !DILexicalBlock(scope: !701, file: !113, line: 254, column: 32)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !113, line: 255, type: !168)
!727 = distinct !DILexicalBlock(scope: !701, file: !113, line: 255, column: 36)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !113, line: 257, type: !168)
!729 = distinct !DILexicalBlock(scope: !701, file: !113, line: 257, column: 30)
!730 = !DILocalVariable(name: "ierr__", scope: !731, file: !113, line: 258, type: !168)
!731 = distinct !DILexicalBlock(scope: !701, file: !113, line: 258, column: 44)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !113, line: 259, type: !168)
!733 = distinct !DILexicalBlock(scope: !701, file: !113, line: 259, column: 40)
!734 = !DILocalVariable(name: "ierr__", scope: !735, file: !113, line: 261, type: !168)
!735 = distinct !DILexicalBlock(scope: !701, file: !113, line: 261, column: 40)
!736 = !DILocalVariable(name: "ierr__", scope: !737, file: !113, line: 262, type: !168)
!737 = distinct !DILexicalBlock(scope: !701, file: !113, line: 262, column: 36)
!738 = !DILocalVariable(name: "ierr__", scope: !739, file: !113, line: 264, type: !168)
!739 = distinct !DILexicalBlock(scope: !701, file: !113, line: 264, column: 87)
!740 = !DILocalVariable(name: "ierr__", scope: !741, file: !113, line: 265, type: !168)
!741 = distinct !DILexicalBlock(scope: !701, file: !113, line: 265, column: 85)
!742 = !DILocalVariable(name: "ierr__", scope: !743, file: !113, line: 266, type: !168)
!743 = distinct !DILexicalBlock(scope: !701, file: !113, line: 266, column: 43)
!744 = !DILocalVariable(name: "ierr__", scope: !745, file: !113, line: 267, type: !168)
!745 = distinct !DILexicalBlock(scope: !701, file: !113, line: 267, column: 44)
!746 = !DILocalVariable(name: "ierr__", scope: !747, file: !113, line: 268, type: !168)
!747 = distinct !DILexicalBlock(scope: !701, file: !113, line: 268, column: 79)
!748 = !DILocalVariable(name: "ierr__", scope: !749, file: !113, line: 269, type: !168)
!749 = distinct !DILexicalBlock(scope: !701, file: !113, line: 269, column: 77)
!750 = !DILocation(line: 0, scope: !701)
!751 = !DILocation(line: 241, column: 50, scope: !701)
!752 = !DILocation(line: 243, column: 35, scope: !701)
!753 = !{!513, !472, i64 40}
!754 = !DILocation(line: 244, column: 35, scope: !701)
!755 = !{!513, !475, i64 48}
!756 = !DILocation(line: 245, column: 3, scope: !701)
!757 = !DILocation(line: 246, column: 3, scope: !701)
!758 = !DILocation(line: 246, column: 41, scope: !701)
!759 = !{!513, !475, i64 56}
!760 = !DILocation(line: 248, column: 3, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !113, line: 248, column: 3)
!762 = distinct !DILexicalBlock(scope: !763, file: !113, line: 248, column: 3)
!763 = distinct !DILexicalBlock(scope: !701, file: !113, line: 248, column: 3)
!764 = !DILocation(line: 248, column: 3, scope: !762)
!765 = !DILocation(line: 248, column: 3, scope: !766)
!766 = distinct !DILexicalBlock(scope: !767, file: !113, line: 248, column: 3)
!767 = distinct !DILexicalBlock(scope: !761, file: !113, line: 248, column: 3)
!768 = !DILocation(line: 248, column: 3, scope: !767)
!769 = !DILocation(line: 248, column: 3, scope: !770)
!770 = distinct !DILexicalBlock(scope: !766, file: !113, line: 248, column: 3)
!771 = !DILocation(line: 249, column: 13, scope: !721)
!772 = !{!513, !475, i64 64}
!773 = !DILocation(line: 249, column: 8, scope: !721)
!774 = !DILocation(line: 249, column: 7, scope: !701)
!775 = !DILocation(line: 250, column: 12, scope: !720)
!776 = !DILocation(line: 0, scope: !719)
!777 = !DILocation(line: 250, column: 39, scope: !778)
!778 = distinct !DILexicalBlock(scope: !719, file: !113, line: 250, column: 39)
!779 = !DILocation(line: 250, column: 39, scope: !719)
!780 = !DILocation(line: 253, column: 10, scope: !701)
!781 = !DILocation(line: 0, scope: !723)
!782 = !DILocation(line: 253, column: 24, scope: !783)
!783 = distinct !DILexicalBlock(scope: !723, file: !113, line: 253, column: 24)
!784 = !DILocation(line: 253, column: 24, scope: !723)
!785 = !DILocation(line: 254, column: 10, scope: !701)
!786 = !DILocation(line: 0, scope: !725)
!787 = !DILocation(line: 254, column: 32, scope: !788)
!788 = distinct !DILexicalBlock(scope: !725, file: !113, line: 254, column: 32)
!789 = !DILocation(line: 254, column: 32, scope: !725)
!790 = !DILocation(line: 255, column: 10, scope: !701)
!791 = !DILocation(line: 0, scope: !727)
!792 = !DILocation(line: 255, column: 36, scope: !793)
!793 = distinct !DILexicalBlock(scope: !727, file: !113, line: 255, column: 36)
!794 = !DILocation(line: 255, column: 36, scope: !727)
!795 = !DILocation(line: 256, column: 14, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !113, line: 256, column: 3)
!797 = distinct !DILexicalBlock(scope: !701, file: !113, line: 256, column: 3)
!798 = !DILocation(line: 256, column: 3, scope: !797)
!799 = !DILocation(line: 256, column: 44, scope: !796)
!800 = !{!476, !476, i64 0}
!801 = !DILocation(line: 256, column: 58, scope: !796)
!802 = !DILocation(line: 256, column: 52, scope: !796)
!803 = !DILocation(line: 256, column: 51, scope: !796)
!804 = !DILocation(line: 256, column: 26, scope: !796)
!805 = !DILocation(line: 256, column: 42, scope: !796)
!806 = !DILocation(line: 256, column: 22, scope: !796)
!807 = distinct !{!807, !798, !808, !809}
!808 = !DILocation(line: 256, column: 66, scope: !797)
!809 = !{!"llvm.loop.mustprogress"}
!810 = !DILocation(line: 257, column: 24, scope: !701)
!811 = !DILocalVariable(name: "n", arg: 1, scope: !812, file: !698, line: 270, type: !211)
!812 = distinct !DISubprogram(name: "PetscLogFlops", scope: !698, file: !698, line: 270, type: !813, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!168, !211}
!815 = !{!811}
!816 = !DILocation(line: 0, scope: !812, inlinedAt: !817)
!817 = distinct !DILocation(line: 257, column: 10, scope: !701)
!818 = !DILocation(line: 272, column: 3, scope: !819, inlinedAt: !817)
!819 = distinct !DILexicalBlock(scope: !820, file: !698, line: 272, column: 3)
!820 = distinct !DILexicalBlock(scope: !821, file: !698, line: 272, column: 3)
!821 = distinct !DILexicalBlock(scope: !812, file: !698, line: 272, column: 3)
!822 = !DILocation(line: 272, column: 3, scope: !820, inlinedAt: !817)
!823 = !DILocation(line: 272, column: 3, scope: !824, inlinedAt: !817)
!824 = distinct !DILexicalBlock(scope: !825, file: !698, line: 272, column: 3)
!825 = distinct !DILexicalBlock(scope: !819, file: !698, line: 272, column: 3)
!826 = !DILocation(line: 272, column: 3, scope: !825, inlinedAt: !817)
!827 = !DILocation(line: 272, column: 3, scope: !828, inlinedAt: !817)
!828 = distinct !DILexicalBlock(scope: !824, file: !698, line: 272, column: 3)
!829 = !DILocation(line: 274, column: 9, scope: !830, inlinedAt: !817)
!830 = distinct !DILexicalBlock(scope: !812, file: !698, line: 274, column: 7)
!831 = !DILocation(line: 274, column: 7, scope: !812, inlinedAt: !817)
!832 = !DILocation(line: 276, column: 20, scope: !812, inlinedAt: !817)
!833 = !DILocation(line: 277, column: 3, scope: !834, inlinedAt: !817)
!834 = distinct !DILexicalBlock(scope: !835, file: !698, line: 277, column: 3)
!835 = distinct !DILexicalBlock(scope: !812, file: !698, line: 277, column: 3)
!836 = !DILocation(line: 277, column: 3, scope: !837, inlinedAt: !817)
!837 = distinct !DILexicalBlock(scope: !838, file: !698, line: 277, column: 3)
!838 = distinct !DILexicalBlock(scope: !839, file: !698, line: 277, column: 3)
!839 = distinct !DILexicalBlock(scope: !834, file: !698, line: 277, column: 3)
!840 = !DILocation(line: 277, column: 3, scope: !838, inlinedAt: !817)
!841 = !DILocation(line: 277, column: 3, scope: !842, inlinedAt: !817)
!842 = distinct !DILexicalBlock(scope: !843, file: !698, line: 277, column: 3)
!843 = distinct !DILexicalBlock(scope: !837, file: !698, line: 277, column: 3)
!844 = !DILocation(line: 277, column: 3, scope: !843, inlinedAt: !817)
!845 = !DILocation(line: 277, column: 3, scope: !846, inlinedAt: !817)
!846 = distinct !DILexicalBlock(scope: !842, file: !698, line: 277, column: 3)
!847 = !DILocation(line: 277, column: 3, scope: !848, inlinedAt: !817)
!848 = distinct !DILexicalBlock(scope: !837, file: !698, line: 277, column: 3)
!849 = !DILocation(line: 277, column: 3, scope: !850, inlinedAt: !817)
!850 = distinct !DILexicalBlock(scope: !848, file: !698, line: 277, column: 3)
!851 = !DILocation(line: 277, column: 3, scope: !852, inlinedAt: !817)
!852 = distinct !DILexicalBlock(scope: !853, file: !698, line: 277, column: 3)
!853 = distinct !DILexicalBlock(scope: !850, file: !698, line: 277, column: 3)
!854 = !DILocation(line: 277, column: 3, scope: !853, inlinedAt: !817)
!855 = !DILocation(line: 277, column: 3, scope: !856, inlinedAt: !817)
!856 = distinct !DILexicalBlock(scope: !852, file: !698, line: 277, column: 3)
!857 = !DILocation(line: 274, column: 14, scope: !830, inlinedAt: !817)
!858 = !DILocation(line: 0, scope: !729)
!859 = !DILocation(line: 257, column: 30, scope: !860)
!860 = distinct !DILexicalBlock(scope: !729, file: !113, line: 257, column: 30)
!861 = !DILocation(line: 257, column: 30, scope: !729)
!862 = !DILocation(line: 258, column: 31, scope: !701)
!863 = !DILocation(line: 258, column: 10, scope: !701)
!864 = !DILocation(line: 0, scope: !731)
!865 = !DILocation(line: 258, column: 44, scope: !866)
!866 = distinct !DILexicalBlock(scope: !731, file: !113, line: 258, column: 44)
!867 = !DILocation(line: 258, column: 44, scope: !731)
!868 = !DILocation(line: 259, column: 10, scope: !701)
!869 = !DILocation(line: 0, scope: !733)
!870 = !DILocation(line: 259, column: 40, scope: !871)
!871 = distinct !DILexicalBlock(scope: !733, file: !113, line: 259, column: 40)
!872 = !DILocation(line: 259, column: 40, scope: !733)
!873 = !DILocation(line: 261, column: 22, scope: !701)
!874 = !{!470, !475, i64 760}
!875 = !DILocation(line: 261, column: 34, scope: !701)
!876 = !DILocation(line: 261, column: 10, scope: !701)
!877 = !DILocation(line: 0, scope: !735)
!878 = !DILocation(line: 261, column: 40, scope: !879)
!879 = distinct !DILexicalBlock(scope: !735, file: !113, line: 261, column: 40)
!880 = !DILocation(line: 261, column: 40, scope: !735)
!881 = !DILocation(line: 262, column: 23, scope: !701)
!882 = !DILocation(line: 262, column: 10, scope: !701)
!883 = !DILocation(line: 0, scope: !737)
!884 = !DILocation(line: 262, column: 36, scope: !885)
!885 = distinct !DILexicalBlock(scope: !737, file: !113, line: 262, column: 36)
!886 = !DILocation(line: 262, column: 36, scope: !737)
!887 = !DILocation(line: 264, column: 31, scope: !701)
!888 = !{!513, !475, i64 24}
!889 = !DILocation(line: 264, column: 44, scope: !701)
!890 = !DILocation(line: 264, column: 54, scope: !701)
!891 = !{!513, !475, i64 16}
!892 = !DILocation(line: 264, column: 10, scope: !701)
!893 = !DILocation(line: 0, scope: !739)
!894 = !DILocation(line: 264, column: 87, scope: !895)
!895 = distinct !DILexicalBlock(scope: !739, file: !113, line: 264, column: 87)
!896 = !DILocation(line: 264, column: 87, scope: !739)
!897 = !DILocation(line: 265, column: 29, scope: !701)
!898 = !DILocation(line: 265, column: 42, scope: !701)
!899 = !DILocation(line: 265, column: 52, scope: !701)
!900 = !DILocation(line: 265, column: 10, scope: !701)
!901 = !DILocation(line: 0, scope: !741)
!902 = !DILocation(line: 265, column: 85, scope: !903)
!903 = distinct !DILexicalBlock(scope: !741, file: !113, line: 265, column: 85)
!904 = !DILocation(line: 265, column: 85, scope: !741)
!905 = !DILocation(line: 266, column: 24, scope: !701)
!906 = !DILocation(line: 266, column: 33, scope: !701)
!907 = !DILocation(line: 266, column: 40, scope: !701)
!908 = !{!513, !475, i64 8}
!909 = !DILocation(line: 266, column: 10, scope: !701)
!910 = !DILocation(line: 0, scope: !743)
!911 = !DILocation(line: 266, column: 43, scope: !912)
!912 = distinct !DILexicalBlock(scope: !743, file: !113, line: 266, column: 43)
!913 = !DILocation(line: 266, column: 43, scope: !743)
!914 = !DILocation(line: 267, column: 29, scope: !701)
!915 = !DILocation(line: 267, column: 41, scope: !701)
!916 = !DILocation(line: 267, column: 10, scope: !701)
!917 = !DILocation(line: 0, scope: !745)
!918 = !DILocation(line: 267, column: 44, scope: !919)
!919 = distinct !DILexicalBlock(scope: !745, file: !113, line: 267, column: 44)
!920 = !DILocation(line: 267, column: 44, scope: !745)
!921 = !DILocation(line: 268, column: 31, scope: !701)
!922 = !DILocation(line: 268, column: 44, scope: !701)
!923 = !DILocation(line: 268, column: 10, scope: !701)
!924 = !DILocation(line: 0, scope: !747)
!925 = !DILocation(line: 268, column: 79, scope: !926)
!926 = distinct !DILexicalBlock(scope: !747, file: !113, line: 268, column: 79)
!927 = !DILocation(line: 268, column: 79, scope: !747)
!928 = !DILocation(line: 269, column: 29, scope: !701)
!929 = !DILocation(line: 269, column: 42, scope: !701)
!930 = !DILocation(line: 269, column: 10, scope: !701)
!931 = !DILocation(line: 0, scope: !749)
!932 = !DILocation(line: 269, column: 77, scope: !933)
!933 = distinct !DILexicalBlock(scope: !749, file: !113, line: 269, column: 77)
!934 = !DILocation(line: 269, column: 77, scope: !749)
!935 = !DILocation(line: 270, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !113, line: 270, column: 3)
!937 = distinct !DILexicalBlock(scope: !938, file: !113, line: 270, column: 3)
!938 = distinct !DILexicalBlock(scope: !701, file: !113, line: 270, column: 3)
!939 = !DILocation(line: 270, column: 3, scope: !937)
!940 = !DILocation(line: 270, column: 3, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !113, line: 270, column: 3)
!942 = distinct !DILexicalBlock(scope: !936, file: !113, line: 270, column: 3)
!943 = !DILocation(line: 270, column: 3, scope: !942)
!944 = !DILocation(line: 270, column: 3, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !113, line: 270, column: 3)
!946 = distinct !DILexicalBlock(scope: !941, file: !113, line: 270, column: 3)
!947 = !DILocation(line: 270, column: 3, scope: !946)
!948 = !DILocation(line: 270, column: 3, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !113, line: 270, column: 3)
!950 = !DILocation(line: 270, column: 3, scope: !951)
!951 = distinct !DILexicalBlock(scope: !941, file: !113, line: 270, column: 3)
!952 = !DILocation(line: 270, column: 3, scope: !953)
!953 = distinct !DILexicalBlock(scope: !951, file: !113, line: 270, column: 3)
!954 = !DILocation(line: 270, column: 3, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !113, line: 270, column: 3)
!956 = distinct !DILexicalBlock(scope: !953, file: !113, line: 270, column: 3)
!957 = !DILocation(line: 270, column: 3, scope: !956)
!958 = !DILocation(line: 270, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !955, file: !113, line: 270, column: 3)
!960 = !DILocation(line: 271, column: 1, scope: !701)
!961 = distinct !DISubprogram(name: "PCSetUp_Redistribute", scope: !113, file: !113, line: 41, type: !377, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1025, !1026, !1035, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1047, !1049, !1051, !1053, !1055, !1057, !1063, !1064, !1066, !1068, !1073, !1075, !1077, !1079, !1081, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1107, !1108, !1110, !1113, !1114, !1116, !1119, !1120, !1122, !1125, !1126, !1128, !1130, !1132, !1134, !1136, !1140, !1142, !1144, !1146, !1148, !1150, !1155, !1158, !1159, !1161, !1163, !1170, !1173, !1174, !1177, !1180, !1181, !1183, !1186, !1187, !1189, !1191, !1193, !1195, !1197, !1201, !1203, !1206, !1207, !1209, !1211, !1214, !1216, !1218, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248}
!963 = !DILocalVariable(name: "pc", arg: 1, scope: !961, file: !113, line: 41, type: !364)
!964 = !DILocalVariable(name: "red", scope: !961, file: !113, line: 43, type: !111)
!965 = !DILocalVariable(name: "ierr", scope: !961, file: !113, line: 44, type: !168)
!966 = !DILocalVariable(name: "comm", scope: !961, file: !113, line: 45, type: !147)
!967 = !DILocalVariable(name: "rstart", scope: !961, file: !113, line: 46, type: !138)
!968 = !DILocalVariable(name: "rend", scope: !961, file: !113, line: 46, type: !138)
!969 = !DILocalVariable(name: "i", scope: !961, file: !113, line: 46, type: !138)
!970 = !DILocalVariable(name: "nz", scope: !961, file: !113, line: 46, type: !138)
!971 = !DILocalVariable(name: "cnt", scope: !961, file: !113, line: 46, type: !138)
!972 = !DILocalVariable(name: "rows", scope: !961, file: !113, line: 46, type: !140)
!973 = !DILocalVariable(name: "ncnt", scope: !961, file: !113, line: 46, type: !138)
!974 = !DILocalVariable(name: "dcnt", scope: !961, file: !113, line: 46, type: !138)
!975 = !DILocalVariable(name: "drows", scope: !961, file: !113, line: 46, type: !140)
!976 = !DILocalVariable(name: "map", scope: !961, file: !113, line: 47, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !134, line: 60, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !980, line: 240, size: 640, elements: !981)
!980 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !996, !997, !998, !999}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !979, file: !980, line: 241, baseType: !147, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !979, file: !980, line: 242, baseType: !225, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !979, file: !980, line: 243, baseType: !138, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !979, file: !980, line: 243, baseType: !138, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !979, file: !980, line: 244, baseType: !138, size: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !979, file: !980, line: 244, baseType: !138, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !979, file: !980, line: 245, baseType: !140, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !979, file: !980, line: 246, baseType: !319, size: 32, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !979, file: !980, line: 247, baseType: !138, size: 32, offset: 352)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !979, file: !980, line: 251, baseType: !138, size: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !979, file: !980, line: 252, baseType: !993, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !134, line: 30, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !134, line: 30, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !979, file: !980, line: 253, baseType: !319, size: 32, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !979, file: !980, line: 254, baseType: !138, size: 32, offset: 544)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !979, file: !980, line: 254, baseType: !138, size: 32, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !979, file: !980, line: 255, baseType: !138, size: 32, offset: 608)
!1000 = !DILocalVariable(name: "nmap", scope: !961, file: !113, line: 47, type: !977)
!1001 = !DILocalVariable(name: "size", scope: !961, file: !113, line: 48, type: !225)
!1002 = !DILocalVariable(name: "tag", scope: !961, file: !113, line: 48, type: !225)
!1003 = !DILocalVariable(name: "n", scope: !961, file: !113, line: 48, type: !225)
!1004 = !DILocalVariable(name: "imdex", scope: !961, file: !113, line: 49, type: !225)
!1005 = !DILocalVariable(name: "source", scope: !961, file: !113, line: 50, type: !140)
!1006 = !DILocalVariable(name: "sizes", scope: !961, file: !113, line: 51, type: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!1008 = !DILocalVariable(name: "nrecvs", scope: !961, file: !113, line: 51, type: !225)
!1009 = !DILocalVariable(name: "j", scope: !961, file: !113, line: 52, type: !138)
!1010 = !DILocalVariable(name: "nsends", scope: !961, file: !113, line: 52, type: !138)
!1011 = !DILocalVariable(name: "owner", scope: !961, file: !113, line: 53, type: !140)
!1012 = !DILocalVariable(name: "starts", scope: !961, file: !113, line: 53, type: !140)
!1013 = !DILocalVariable(name: "count", scope: !961, file: !113, line: 53, type: !138)
!1014 = !DILocalVariable(name: "slen", scope: !961, file: !113, line: 53, type: !138)
!1015 = !DILocalVariable(name: "rvalues", scope: !961, file: !113, line: 54, type: !140)
!1016 = !DILocalVariable(name: "svalues", scope: !961, file: !113, line: 54, type: !140)
!1017 = !DILocalVariable(name: "recvtotal", scope: !961, file: !113, line: 54, type: !138)
!1018 = !DILocalVariable(name: "onodes1", scope: !961, file: !113, line: 55, type: !1007)
!1019 = !DILocalVariable(name: "olengths1", scope: !961, file: !113, line: 55, type: !1007)
!1020 = !DILocalVariable(name: "send_waits", scope: !961, file: !113, line: 56, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !148, line: 339, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !148, line: 339, flags: DIFlagFwdDecl)
!1025 = !DILocalVariable(name: "recv_waits", scope: !961, file: !113, line: 56, type: !1021)
!1026 = !DILocalVariable(name: "recv_status", scope: !961, file: !113, line: 57, type: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !148, line: 341, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !148, line: 351, size: 192, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1028, file: !148, line: 354, baseType: !26, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1028, file: !148, line: 355, baseType: !26, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1028, file: !148, line: 356, baseType: !26, size: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1028, file: !148, line: 361, baseType: !26, size: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1028, file: !148, line: 362, baseType: !315, size: 64, offset: 128)
!1035 = !DILocalVariable(name: "send_status", scope: !961, file: !113, line: 57, type: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1037 = !DILocalVariable(name: "tvec", scope: !961, file: !113, line: 58, type: !122)
!1038 = !DILocalVariable(name: "diag", scope: !961, file: !113, line: 58, type: !122)
!1039 = !DILocalVariable(name: "tmat", scope: !961, file: !113, line: 59, type: !387)
!1040 = !DILocalVariable(name: "d", scope: !961, file: !113, line: 60, type: !715)
!1041 = !DILocalVariable(name: "values", scope: !961, file: !113, line: 60, type: !715)
!1042 = !DILocalVariable(name: "cols", scope: !961, file: !113, line: 61, type: !711)
!1043 = !DILocalVariable(name: "ierr__", scope: !1044, file: !113, line: 65, type: !168)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !113, line: 65, column: 49)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !113, line: 64, column: 24)
!1046 = distinct !DILexicalBlock(scope: !961, file: !113, line: 64, column: 7)
!1047 = !DILocalVariable(name: "ierr__", scope: !1048, file: !113, line: 66, type: !168)
!1048 = distinct !DILexicalBlock(scope: !1045, file: !113, line: 66, column: 80)
!1049 = !DILocalVariable(name: "ierr__", scope: !1050, file: !113, line: 67, type: !168)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !113, line: 67, column: 48)
!1051 = !DILocalVariable(name: "NN", scope: !1052, file: !113, line: 69, type: !138)
!1052 = distinct !DILexicalBlock(scope: !1046, file: !113, line: 68, column: 10)
!1053 = !DILocalVariable(name: "ierr__", scope: !1054, file: !113, line: 71, type: !168)
!1054 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 71, column: 54)
!1055 = !DILocalVariable(name: "_7_errorcode", scope: !1056, file: !113, line: 72, type: !168)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 72, column: 38)
!1057 = !DILocalVariable(name: "_7_errorstring", scope: !1058, file: !113, line: 72, type: !1060)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !113, line: 72, column: 38)
!1059 = distinct !DILexicalBlock(scope: !1056, file: !113, line: 72, column: 38)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 2048, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 256)
!1063 = !DILocalVariable(name: "_7_resultlen", scope: !1058, file: !113, line: 72, type: !225)
!1064 = !DILocalVariable(name: "ierr__", scope: !1065, file: !113, line: 73, type: !168)
!1065 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 73, column: 55)
!1066 = !DILocalVariable(name: "ierr__", scope: !1067, file: !113, line: 76, type: !168)
!1067 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 76, column: 56)
!1068 = !DILocalVariable(name: "ierr__", scope: !1069, file: !113, line: 79, type: !168)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !113, line: 79, column: 53)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !113, line: 78, column: 33)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !113, line: 78, column: 5)
!1072 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 78, column: 5)
!1073 = !DILocalVariable(name: "j", scope: !1074, file: !113, line: 80, type: !138)
!1074 = distinct !DILexicalBlock(scope: !1070, file: !113, line: 80, column: 7)
!1075 = !DILocalVariable(name: "ierr__", scope: !1076, file: !113, line: 86, type: !168)
!1076 = distinct !DILexicalBlock(scope: !1070, file: !113, line: 86, column: 57)
!1077 = !DILocalVariable(name: "ierr__", scope: !1078, file: !113, line: 88, type: !168)
!1078 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 88, column: 36)
!1079 = !DILocalVariable(name: "ierr__", scope: !1080, file: !113, line: 89, type: !168)
!1080 = distinct !DILexicalBlock(scope: !1052, file: !113, line: 89, column: 53)
!1081 = !DILocalVariable(name: "diagonly", scope: !1082, file: !113, line: 94, type: !319)
