; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/gcreate.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/gcreate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 624, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!332 = !{!333, !336, !354, !431, !506, !540, !541, !411, !542, !545, !421, !72, !548, !382, !369, !5}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !339, line: 73, size: 4480, elements: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!340 = !{!341, !343, !392, !393, !395, !398, !399, !400, !401, !409, !410, !412, !416, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !432, !434, !435, !436, !438, !439, !441, !443, !444, !445, !446, !447, !450, !452, !453, !454, !455, !456, !459, !461, !462, !463, !473, !475, !476, !480, !481, !530, !535, !537, !538, !539}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !338, file: !339, line: 74, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !338, file: !339, line: 75, baseType: !344, size: 448, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 448, elements: !390)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !339, line: 53, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 45, size: 448, elements: !347)
!347 = !{!348, !357, !365, !370, !374, !378, !385}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !346, file: !339, line: 46, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !336, !353}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !321, line: 330, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !321, line: 330, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !339, line: 47, baseType: !358, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!352, !336, !361}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !362, line: 16, baseType: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !362, line: 16, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !339, line: 48, baseType: !366, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!352, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !346, file: !339, line: 49, baseType: !371, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!352, !336, !333, !336}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !346, file: !339, line: 50, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!352, !336, !333, !369}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !346, file: !339, line: 51, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!352, !336, !333, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !346, file: !339, line: 52, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!352, !336, !333, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!390 = !{!391}
!391 = !DISubrange(count: 1)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !338, file: !339, line: 76, baseType: !354, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !339, line: 77, baseType: !394, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !338, file: !339, line: 78, baseType: !396, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !397)
!397 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !338, file: !339, line: 78, baseType: !396, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !338, file: !339, line: 78, baseType: !396, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !338, file: !339, line: 78, baseType: !396, size: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !339, line: 79, baseType: !402, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !405, line: 27, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !407, line: 43, baseType: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!408 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !338, file: !339, line: 80, baseType: !394, size: 32, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !338, file: !339, line: 81, baseType: !411, size: 32, offset: 992)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !338, file: !339, line: 82, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !338, file: !339, line: 83, baseType: !417, size: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !338, file: !339, line: 84, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !338, file: !339, line: 85, baseType: !421, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !338, file: !339, line: 86, baseType: !421, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !338, file: !339, line: 87, baseType: !421, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !339, line: 88, baseType: !336, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !338, file: !339, line: 89, baseType: !402, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !339, line: 90, baseType: !421, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !338, file: !339, line: 91, baseType: !421, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !338, file: !339, line: 92, baseType: !394, size: 32, offset: 1664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !338, file: !339, line: 93, baseType: !431, size: 64, offset: 1728)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !339, line: 94, baseType: !433, size: 64, offset: 1792)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !403)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !338, file: !339, line: 95, baseType: !394, size: 32, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !338, file: !339, line: 95, baseType: !394, size: 32, offset: 1888)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !338, file: !339, line: 96, baseType: !437, size: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !338, file: !339, line: 96, baseType: !437, size: 64, offset: 1984)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !338, file: !339, line: 97, baseType: !440, size: 64, offset: 2048)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !338, file: !339, line: 97, baseType: !442, size: 64, offset: 2112)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !338, file: !339, line: 98, baseType: !394, size: 32, offset: 2176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !338, file: !339, line: 98, baseType: !394, size: 32, offset: 2208)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !338, file: !339, line: 99, baseType: !437, size: 64, offset: 2240)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !338, file: !339, line: 99, baseType: !437, size: 64, offset: 2304)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !338, file: !339, line: 100, baseType: !448, size: 64, offset: 2368)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !397)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !338, file: !339, line: 100, baseType: !451, size: 64, offset: 2432)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !338, file: !339, line: 101, baseType: !394, size: 32, offset: 2496)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !338, file: !339, line: 101, baseType: !394, size: 32, offset: 2528)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !338, file: !339, line: 102, baseType: !437, size: 64, offset: 2560)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !338, file: !339, line: 102, baseType: !437, size: 64, offset: 2624)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !338, file: !339, line: 103, baseType: !457, size: 64, offset: 2688)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !449)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !338, file: !339, line: 103, baseType: !460, size: 64, offset: 2752)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !338, file: !339, line: 104, baseType: !389, size: 64, offset: 2816)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !338, file: !339, line: 105, baseType: !394, size: 32, offset: 2880)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !338, file: !339, line: 106, baseType: !464, size: 128, offset: 2944)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 128, elements: !471)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !339, line: 64, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 61, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !467, file: !339, line: 62, baseType: !382, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !467, file: !339, line: 63, baseType: !431, size: 64, offset: 64)
!471 = !{!472}
!472 = !DISubrange(count: 2)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !338, file: !339, line: 107, baseType: !474, size: 64, offset: 3072)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !471)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !338, file: !339, line: 108, baseType: !431, size: 64, offset: 3136)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !338, file: !339, line: 109, baseType: !477, size: 64, offset: 3200)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!352, !431}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !338, file: !339, line: 111, baseType: !394, size: 32, offset: 3264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !338, file: !339, line: 112, baseType: !482, size: 320, offset: 3328)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 320, elements: !528)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!352, !486, !336, !431}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !489)
!489 = !{!490, !491, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !488, file: !10, line: 100, baseType: !394, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 101, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !503, !504, !505, !509, !511, !513, !514, !515}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !494, file: !10, line: 84, baseType: !421, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !494, file: !10, line: 85, baseType: !421, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !10, line: 86, baseType: !431, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !494, file: !10, line: 87, baseType: !413, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !494, file: !10, line: 88, baseType: !501, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !494, file: !10, line: 89, baseType: !335, size: 8, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !494, file: !10, line: 90, baseType: !421, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !494, file: !10, line: 91, baseType: !506, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !507, line: 46, baseType: !508)
!507 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!508 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !494, file: !10, line: 92, baseType: !510, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !10, line: 93, baseType: !512, size: 32, offset: 544)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !10, line: 94, baseType: !492, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !494, file: !10, line: 95, baseType: !421, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !494, file: !10, line: 96, baseType: !431, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !488, file: !10, line: 102, baseType: !421, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !488, file: !10, line: 102, baseType: !421, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !488, file: !10, line: 103, baseType: !421, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !488, file: !10, line: 104, baseType: !354, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !488, file: !10, line: 105, baseType: !510, size: 32, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !488, file: !10, line: 106, baseType: !336, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !488, file: !10, line: 107, baseType: !525, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!528 = !{!529}
!529 = !DISubrange(count: 5)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !338, file: !339, line: 113, baseType: !531, size: 320, offset: 3648)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 320, elements: !528)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!352, !336, !431}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !338, file: !339, line: 114, baseType: !536, size: 320, offset: 3968)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 320, elements: !528)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !338, file: !339, line: 115, baseType: !510, size: 32, offset: 4288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !338, file: !339, line: 120, baseType: !525, size: 64, offset: 4352)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !338, file: !339, line: 121, baseType: !510, size: 32, offset: 4416)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !339, line: 130, baseType: !366)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !339, line: 131, baseType: !358)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !321, line: 331, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !321, line: 331, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !321, line: 338, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !321, line: 338, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !550, line: 1451, baseType: !382)
!550 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!551 = !{i32 7, !"Dwarf Version", i32 4}
!552 = !{i32 2, !"Debug Info Version", i32 3}
!553 = !{i32 1, !"wchar_size", i32 4}
!554 = !{i32 7, !"PIC Level", i32 2}
!555 = !{i32 7, !"uwtable", i32 1}
!556 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!557 = distinct !DISubprogram(name: "MatSetBlockSizes_Default", scope: !558, file: !558, line: 4, type: !559, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1327)
!558 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/gcreate.c", directory: "/home/users/ndemeye/xSDK")
!559 = !DISubroutineType(types: !560)
!560 = !{!352, !561, !394, !394}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !564, line: 436, size: 23424, elements: !565)
!564 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!565 = !{!566, !568, !1073, !1093, !1094, !1095, !1097, !1098, !1099, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1223, !1224, !1240, !1241, !1242, !1243, !1244, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1279, !1299, !1300, !1302, !1303, !1304, !1305, !1306, !1307, !1325, !1326}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !563, file: !564, line: 437, baseType: !567, size: 4480)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !339, line: 122, baseType: !338)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !563, file: !564, line: 437, baseType: !569, size: 9472, offset: 4480)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 9472, elements: !390)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !564, line: 32, size: 9472, elements: !571)
!571 = !{!572, !581, !585, !586, !593, !597, !598, !599, !600, !601, !602, !603, !627, !631, !636, !642, !661, !666, !670, !671, !676, !681, !682, !687, !691, !695, !699, !703, !707, !708, !709, !710, !711, !715, !716, !721, !722, !723, !724, !725, !730, !737, !742, !746, !750, !754, !758, !759, !763, !764, !771, !776, !777, !778, !779, !841, !849, !850, !854, !855, !859, !860, !864, !869, !870, !874, !878, !885, !886, !887, !888, !889, !890, !895, !896, !900, !904, !908, !909, !910, !914, !924, !925, !929, !930, !934, !935, !939, !940, !945, !946, !950, !954, !955, !956, !957, !958, !959, !960, !964, !965, !966, !967, !968, !969, !973, !974, !975, !976, !977, !978, !979, !980, !984, !988, !989, !990, !994, !995, !996, !997, !998, !999, !1000, !1004, !1005, !1006, !1011, !1015, !1016, !1020, !1021, !1022, !1023, !1049, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1061, !1062, !1063, !1067, !1071, !1072}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !570, file: !564, line: 34, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!352, !561, !394, !576, !394, !576, !578, !580}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !570, file: !564, line: 35, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!352, !561, !394, !440, !442, !460}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !570, file: !564, line: 36, baseType: !582, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !570, file: !564, line: 37, baseType: !587, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!352, !561, !590, !590}
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !570, file: !564, line: 38, baseType: !594, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!352, !561, !590, !590, !590}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !570, file: !564, line: 40, baseType: !587, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !570, file: !564, line: 41, baseType: !594, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !570, file: !564, line: 42, baseType: !587, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !570, file: !564, line: 43, baseType: !594, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !570, file: !564, line: 44, baseType: !587, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !570, file: !564, line: 46, baseType: !594, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !570, file: !564, line: 47, baseType: !604, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!352, !561, !607, !607, !611}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !608, line: 11, baseType: !609)
!608 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !608, line: 11, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !614, file: !36, line: 1227, baseType: !449, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !614, file: !36, line: 1228, baseType: !449, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !614, file: !36, line: 1229, baseType: !449, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !614, file: !36, line: 1230, baseType: !449, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !614, file: !36, line: 1231, baseType: !449, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !614, file: !36, line: 1232, baseType: !449, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !614, file: !36, line: 1233, baseType: !449, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !614, file: !36, line: 1234, baseType: !449, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !614, file: !36, line: 1236, baseType: !449, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !614, file: !36, line: 1237, baseType: !449, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !614, file: !36, line: 1238, baseType: !449, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !570, file: !564, line: 48, baseType: !628, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!352, !561, !607, !611}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !570, file: !564, line: 49, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!352, !561, !590, !449, !635, !449, !394, !394, !590}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !570, file: !564, line: 50, baseType: !637, size: 64, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!352, !561, !640, !641}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !570, file: !564, line: 52, baseType: !643, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!352, !561, !646, !647}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !649, file: !36, line: 593, baseType: !396, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !649, file: !36, line: 594, baseType: !396, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !649, file: !36, line: 594, baseType: !396, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !649, file: !36, line: 594, baseType: !396, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !649, file: !36, line: 595, baseType: !396, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !649, file: !36, line: 596, baseType: !396, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !649, file: !36, line: 597, baseType: !396, size: 64, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !649, file: !36, line: 598, baseType: !396, size: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !649, file: !36, line: 598, baseType: !396, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !649, file: !36, line: 599, baseType: !396, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !570, file: !564, line: 53, baseType: !662, size: 64, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!352, !561, !561, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !570, file: !564, line: 54, baseType: !667, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!352, !561, !590}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !570, file: !564, line: 55, baseType: !587, size: 64, offset: 1152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !570, file: !564, line: 56, baseType: !672, size: 64, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!352, !561, !675, !448}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !570, file: !564, line: 58, baseType: !677, size: 64, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!352, !561, !680}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !570, file: !564, line: 59, baseType: !677, size: 64, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !570, file: !564, line: 60, baseType: !683, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!352, !561, !686, !510}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !570, file: !564, line: 61, baseType: !688, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!352, !561}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !570, file: !564, line: 63, baseType: !692, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!352, !561, !394, !576, !458, !590, !590}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !570, file: !564, line: 64, baseType: !696, size: 64, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!352, !561, !561, !607, !607, !611}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !570, file: !564, line: 65, baseType: !700, size: 64, offset: 1664)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!352, !561, !561, !611}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !570, file: !564, line: 66, baseType: !704, size: 64, offset: 1728)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!352, !561, !561, !607, !611}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !570, file: !564, line: 67, baseType: !700, size: 64, offset: 1792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !570, file: !564, line: 69, baseType: !688, size: 64, offset: 1856)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !570, file: !564, line: 70, baseType: !696, size: 64, offset: 1920)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !570, file: !564, line: 71, baseType: !704, size: 64, offset: 1984)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !570, file: !564, line: 72, baseType: !712, size: 64, offset: 2048)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!352, !561, !641}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !570, file: !564, line: 73, baseType: !688, size: 64, offset: 2112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !570, file: !564, line: 75, baseType: !717, size: 64, offset: 2176)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!352, !561, !720, !641}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !570, file: !564, line: 76, baseType: !587, size: 64, offset: 2240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !570, file: !564, line: 77, baseType: !587, size: 64, offset: 2304)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !570, file: !564, line: 78, baseType: !604, size: 64, offset: 2368)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !570, file: !564, line: 79, baseType: !628, size: 64, offset: 2432)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !570, file: !564, line: 81, baseType: !726, size: 64, offset: 2496)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!352, !561, !458, !561, !729}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !570, file: !564, line: 82, baseType: !731, size: 64, offset: 2560)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!352, !561, !394, !734, !734, !640, !736}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !570, file: !564, line: 83, baseType: !738, size: 64, offset: 2624)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!352, !561, !394, !741, !394}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !570, file: !564, line: 84, baseType: !743, size: 64, offset: 2688)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!352, !561, !394, !576, !394, !576, !457}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !570, file: !564, line: 85, baseType: !747, size: 64, offset: 2752)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!352, !561, !561, !729}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !570, file: !564, line: 87, baseType: !751, size: 64, offset: 2816)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!352, !561, !590, !440}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !570, file: !564, line: 88, baseType: !755, size: 64, offset: 2880)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!352, !561, !458}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !570, file: !564, line: 89, baseType: !755, size: 64, offset: 2944)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !570, file: !564, line: 90, baseType: !760, size: 64, offset: 3008)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!352, !561, !590, !580}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !570, file: !564, line: 91, baseType: !692, size: 64, offset: 3072)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !570, file: !564, line: 93, baseType: !765, size: 64, offset: 3136)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!352, !561, !768}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !570, file: !564, line: 94, baseType: !772, size: 64, offset: 3200)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!352, !561, !394, !510, !510, !440, !775, !775, !665}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !570, file: !564, line: 95, baseType: !772, size: 64, offset: 3264)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !570, file: !564, line: 96, baseType: !772, size: 64, offset: 3328)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !570, file: !564, line: 97, baseType: !772, size: 64, offset: 3392)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !570, file: !564, line: 99, baseType: !780, size: 64, offset: 3456)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!352, !561, !783, !786}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !608, line: 51, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !608, line: 51, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !564, line: 609, size: 6208, elements: !789)
!789 = !{!790, !791, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !810, !817, !818, !819, !820, !821, !822, !823, !824, !828, !829, !830, !831, !832, !834, !835, !836, !837, !838, !839, !840}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !788, file: !564, line: 610, baseType: !567, size: 4480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !788, file: !564, line: 610, baseType: !792, size: 32, offset: 4480)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !390)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !788, file: !564, line: 611, baseType: !394, size: 32, offset: 4512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !788, file: !564, line: 611, baseType: !394, size: 32, offset: 4544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !788, file: !564, line: 611, baseType: !394, size: 32, offset: 4576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !788, file: !564, line: 612, baseType: !394, size: 32, offset: 4608)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !788, file: !564, line: 613, baseType: !394, size: 32, offset: 4640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !788, file: !564, line: 614, baseType: !440, size: 64, offset: 4672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !788, file: !564, line: 615, baseType: !442, size: 64, offset: 4736)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !788, file: !564, line: 616, baseType: !741, size: 64, offset: 4800)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !788, file: !564, line: 617, baseType: !440, size: 64, offset: 4864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !788, file: !564, line: 618, baseType: !803, size: 64, offset: 4928)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !564, line: 602, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 598, size: 128, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !805, file: !564, line: 599, baseType: !394, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !805, file: !564, line: 600, baseType: !394, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !805, file: !564, line: 601, baseType: !457, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !788, file: !564, line: 619, baseType: !811, size: 64, offset: 4992)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !564, line: 607, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 604, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !813, file: !564, line: 605, baseType: !394, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !813, file: !564, line: 606, baseType: !457, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !788, file: !564, line: 620, baseType: !457, size: 64, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !788, file: !564, line: 621, baseType: !449, size: 64, offset: 5120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !788, file: !564, line: 622, baseType: !449, size: 64, offset: 5184)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !788, file: !564, line: 623, baseType: !590, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !788, file: !564, line: 623, baseType: !590, size: 64, offset: 5312)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !788, file: !564, line: 623, baseType: !590, size: 64, offset: 5376)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !788, file: !564, line: 624, baseType: !510, size: 32, offset: 5440)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !788, file: !564, line: 625, baseType: !825, size: 64, offset: 5504)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!352}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !788, file: !564, line: 626, baseType: !431, size: 64, offset: 5568)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !788, file: !564, line: 627, baseType: !590, size: 64, offset: 5632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !788, file: !564, line: 628, baseType: !394, size: 32, offset: 5696)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !788, file: !564, line: 629, baseType: !333, size: 64, offset: 5760)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !788, file: !564, line: 630, baseType: !833, size: 32, offset: 5824)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !788, file: !564, line: 631, baseType: !394, size: 32, offset: 5856)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !788, file: !564, line: 631, baseType: !394, size: 32, offset: 5888)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !788, file: !564, line: 632, baseType: !510, size: 32, offset: 5920)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !788, file: !564, line: 633, baseType: !510, size: 32, offset: 5952)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !788, file: !564, line: 634, baseType: !382, size: 64, offset: 6016)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !788, file: !564, line: 634, baseType: !431, size: 64, offset: 6080)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !788, file: !564, line: 635, baseType: !402, size: 64, offset: 6144)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !570, file: !564, line: 100, baseType: !842, size: 64, offset: 3520)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!352, !561, !394, !394, !845, !848}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !847)
!847 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !570, file: !564, line: 101, baseType: !688, size: 64, offset: 3584)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !570, file: !564, line: 102, baseType: !851, size: 64, offset: 3648)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!352, !561, !607, !607, !641}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !570, file: !564, line: 103, baseType: !573, size: 64, offset: 3712)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !570, file: !564, line: 105, baseType: !856, size: 64, offset: 3776)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!352, !561, !607, !607, !640, !641}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !570, file: !564, line: 106, baseType: !688, size: 64, offset: 3840)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !570, file: !564, line: 107, baseType: !861, size: 64, offset: 3904)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!352, !561, !361}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !570, file: !564, line: 108, baseType: !865, size: 64, offset: 3968)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!352, !561, !868, !640, !641}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !333)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !570, file: !564, line: 109, baseType: !825, size: 64, offset: 4032)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !570, file: !564, line: 111, baseType: !871, size: 64, offset: 4096)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!352, !561, !561, !561, !449, !561}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !570, file: !564, line: 112, baseType: !875, size: 64, offset: 4160)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!352, !561, !561, !561, !561}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !570, file: !564, line: 113, baseType: !879, size: 64, offset: 4224)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!352, !561, !882, !882}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !608, line: 30, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !608, line: 30, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !570, file: !564, line: 114, baseType: !573, size: 64, offset: 4288)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !570, file: !564, line: 115, baseType: !692, size: 64, offset: 4352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !570, file: !564, line: 117, baseType: !751, size: 64, offset: 4416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !570, file: !564, line: 118, baseType: !751, size: 64, offset: 4480)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !570, file: !564, line: 119, baseType: !865, size: 64, offset: 4544)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !570, file: !564, line: 120, baseType: !891, size: 64, offset: 4608)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!352, !561, !894, !665}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !570, file: !564, line: 121, baseType: !825, size: 64, offset: 4672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !570, file: !564, line: 123, baseType: !897, size: 64, offset: 4736)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!352, !561, !394, !431}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !570, file: !564, line: 124, baseType: !901, size: 64, offset: 4800)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!352, !561, !786, !590, !431}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !570, file: !564, line: 125, baseType: !905, size: 64, offset: 4864)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!352, !486, !561}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !570, file: !564, line: 126, baseType: !587, size: 64, offset: 4928)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !570, file: !564, line: 127, baseType: !587, size: 64, offset: 4992)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !570, file: !564, line: 129, baseType: !911, size: 64, offset: 5056)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!352, !561, !741}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !570, file: !564, line: 130, baseType: !915, size: 64, offset: 5120)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!352, !561, !918, !918}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !920, file: !60, line: 653, baseType: !394, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !920, file: !60, line: 653, baseType: !590, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !570, file: !564, line: 131, baseType: !915, size: 64, offset: 5184)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !570, file: !564, line: 132, baseType: !926, size: 64, offset: 5248)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!352, !561, !440, !440, !440}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !570, file: !564, line: 133, baseType: !861, size: 64, offset: 5312)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !570, file: !564, line: 135, baseType: !931, size: 64, offset: 5376)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!352, !561, !449, !665}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !570, file: !564, line: 136, baseType: !931, size: 64, offset: 5440)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !570, file: !564, line: 137, baseType: !936, size: 64, offset: 5504)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!352, !561, !665}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !570, file: !564, line: 138, baseType: !573, size: 64, offset: 5568)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !570, file: !564, line: 139, baseType: !941, size: 64, offset: 5632)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!352, !561, !944, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !570, file: !564, line: 141, baseType: !825, size: 64, offset: 5696)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !570, file: !564, line: 142, baseType: !947, size: 64, offset: 5760)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!352, !561, !561, !449, !561}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !570, file: !564, line: 143, baseType: !951, size: 64, offset: 5824)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!352, !561, !561, !561}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !570, file: !564, line: 144, baseType: !825, size: 64, offset: 5888)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !570, file: !564, line: 145, baseType: !947, size: 64, offset: 5952)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !570, file: !564, line: 147, baseType: !951, size: 64, offset: 6016)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !570, file: !564, line: 148, baseType: !825, size: 64, offset: 6080)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !570, file: !564, line: 149, baseType: !947, size: 64, offset: 6144)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !570, file: !564, line: 150, baseType: !951, size: 64, offset: 6208)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !570, file: !564, line: 151, baseType: !961, size: 64, offset: 6272)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!352, !561, !510}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !570, file: !564, line: 153, baseType: !688, size: 64, offset: 6336)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !570, file: !564, line: 154, baseType: !688, size: 64, offset: 6400)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !570, file: !564, line: 155, baseType: !688, size: 64, offset: 6464)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !570, file: !564, line: 156, baseType: !688, size: 64, offset: 6528)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !570, file: !564, line: 157, baseType: !861, size: 64, offset: 6592)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !570, file: !564, line: 159, baseType: !970, size: 64, offset: 6656)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!352, !561, !394, !578}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !570, file: !564, line: 160, baseType: !688, size: 64, offset: 6720)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !570, file: !564, line: 161, baseType: !688, size: 64, offset: 6784)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !570, file: !564, line: 162, baseType: !688, size: 64, offset: 6848)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !570, file: !564, line: 163, baseType: !688, size: 64, offset: 6912)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !570, file: !564, line: 165, baseType: !951, size: 64, offset: 6976)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !570, file: !564, line: 166, baseType: !951, size: 64, offset: 7040)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !570, file: !564, line: 167, baseType: !751, size: 64, offset: 7104)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !570, file: !564, line: 168, baseType: !981, size: 64, offset: 7168)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!352, !561, !590, !394}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !570, file: !564, line: 169, baseType: !985, size: 64, offset: 7232)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!352, !561, !665, !440}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !570, file: !564, line: 171, baseType: !712, size: 64, offset: 7296)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !570, file: !564, line: 172, baseType: !688, size: 64, offset: 7360)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !570, file: !564, line: 173, baseType: !991, size: 64, offset: 7424)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!352, !561, !440, !775}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !570, file: !564, line: 174, baseType: !851, size: 64, offset: 7488)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !570, file: !564, line: 175, baseType: !851, size: 64, offset: 7552)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !570, file: !564, line: 177, baseType: !587, size: 64, offset: 7616)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !570, file: !564, line: 178, baseType: !637, size: 64, offset: 7680)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !570, file: !564, line: 179, baseType: !587, size: 64, offset: 7744)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !570, file: !564, line: 180, baseType: !594, size: 64, offset: 7808)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !570, file: !564, line: 181, baseType: !1001, size: 64, offset: 7872)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!352, !561, !354, !640, !641}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !570, file: !564, line: 183, baseType: !911, size: 64, offset: 7936)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !570, file: !564, line: 184, baseType: !672, size: 64, offset: 8000)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !570, file: !564, line: 185, baseType: !1007, size: 64, offset: 8064)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!352, !561, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !570, file: !564, line: 186, baseType: !1012, size: 64, offset: 8128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!352, !561, !394, !576, !457}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !570, file: !564, line: 187, baseType: !731, size: 64, offset: 8192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !570, file: !564, line: 189, baseType: !1017, size: 64, offset: 8256)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!352, !561, !394, !394, !440, !578}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !570, file: !564, line: 190, baseType: !825, size: 64, offset: 8320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !570, file: !564, line: 191, baseType: !947, size: 64, offset: 8384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !570, file: !564, line: 192, baseType: !951, size: 64, offset: 8448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !570, file: !564, line: 193, baseType: !1024, size: 64, offset: 8512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!352, !561, !783, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !564, line: 660, size: 5312, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1029, file: !564, line: 661, baseType: !567, size: 4480)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1029, file: !564, line: 661, baseType: !792, size: 32, offset: 4480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1029, file: !564, line: 662, baseType: !394, size: 32, offset: 4512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1029, file: !564, line: 662, baseType: !394, size: 32, offset: 4544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1029, file: !564, line: 662, baseType: !394, size: 32, offset: 4576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1029, file: !564, line: 663, baseType: !394, size: 32, offset: 4608)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1029, file: !564, line: 664, baseType: !394, size: 32, offset: 4640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1029, file: !564, line: 665, baseType: !440, size: 64, offset: 4672)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1029, file: !564, line: 666, baseType: !440, size: 64, offset: 4736)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1029, file: !564, line: 667, baseType: !394, size: 32, offset: 4800)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1029, file: !564, line: 668, baseType: !833, size: 32, offset: 4832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1029, file: !564, line: 670, baseType: !440, size: 64, offset: 4864)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1029, file: !564, line: 670, baseType: !440, size: 64, offset: 4928)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1029, file: !564, line: 671, baseType: !440, size: 64, offset: 4992)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1029, file: !564, line: 672, baseType: !440, size: 64, offset: 5056)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1029, file: !564, line: 673, baseType: !440, size: 64, offset: 5120)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1029, file: !564, line: 674, baseType: !394, size: 32, offset: 5184)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1029, file: !564, line: 675, baseType: !440, size: 64, offset: 5248)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !570, file: !564, line: 195, baseType: !1050, size: 64, offset: 8576)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!352, !1027, !561, !561}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !570, file: !564, line: 196, baseType: !1050, size: 64, offset: 8640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !570, file: !564, line: 197, baseType: !825, size: 64, offset: 8704)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !570, file: !564, line: 198, baseType: !947, size: 64, offset: 8768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !570, file: !564, line: 199, baseType: !951, size: 64, offset: 8832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !570, file: !564, line: 201, baseType: !1058, size: 64, offset: 8896)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !570, file: !564, line: 202, baseType: !726, size: 64, offset: 8960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !570, file: !564, line: 203, baseType: !594, size: 64, offset: 9024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !570, file: !564, line: 204, baseType: !780, size: 64, offset: 9088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !570, file: !564, line: 205, baseType: !911, size: 64, offset: 9152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !570, file: !564, line: 206, baseType: !1064, size: 64, offset: 9216)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!352, !354, !561, !394, !640, !641}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !570, file: !564, line: 208, baseType: !1068, size: 64, offset: 9280)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!352, !394, !736}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !570, file: !564, line: 209, baseType: !951, size: 64, offset: 9344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !570, file: !564, line: 210, baseType: !743, size: 64, offset: 9408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !563, file: !564, line: 438, baseType: !1074, size: 64, offset: 13952)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !608, line: 60, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1076, file: !114, line: 241, baseType: !354, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !114, line: 242, baseType: !411, size: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1076, file: !114, line: 243, baseType: !394, size: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1076, file: !114, line: 243, baseType: !394, size: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1076, file: !114, line: 244, baseType: !394, size: 32, offset: 160)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1076, file: !114, line: 244, baseType: !394, size: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1076, file: !114, line: 245, baseType: !440, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1076, file: !114, line: 246, baseType: !510, size: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1076, file: !114, line: 247, baseType: !394, size: 32, offset: 352)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1076, file: !114, line: 251, baseType: !394, size: 32, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1076, file: !114, line: 252, baseType: !882, size: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1076, file: !114, line: 253, baseType: !510, size: 32, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1076, file: !114, line: 254, baseType: !394, size: 32, offset: 544)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1076, file: !114, line: 254, baseType: !394, size: 32, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1076, file: !114, line: 255, baseType: !394, size: 32, offset: 608)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !563, file: !564, line: 438, baseType: !1074, size: 64, offset: 14016)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !563, file: !564, line: 439, baseType: !431, size: 64, offset: 14080)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !563, file: !564, line: 440, baseType: !1096, size: 32, offset: 14144)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !563, file: !564, line: 441, baseType: !510, size: 32, offset: 14176)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !563, file: !564, line: 442, baseType: !510, size: 32, offset: 14208)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !563, file: !564, line: 443, baseType: !1100, size: 448, offset: 14272)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 448, elements: !1102)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !333)
!1102 = !{!1103}
!1103 = !DISubrange(count: 7)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !563, file: !564, line: 444, baseType: !510, size: 32, offset: 14720)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !563, file: !564, line: 445, baseType: !510, size: 32, offset: 14752)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !563, file: !564, line: 446, baseType: !394, size: 32, offset: 14784)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !563, file: !564, line: 447, baseType: !433, size: 64, offset: 14848)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !563, file: !564, line: 448, baseType: !433, size: 64, offset: 14912)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !563, file: !564, line: 449, baseType: !648, size: 640, offset: 14976)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !563, file: !564, line: 450, baseType: !580, size: 32, offset: 15616)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !563, file: !564, line: 451, baseType: !1112, size: 2880, offset: 15680)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !564, line: 318, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !564, line: 319, size: 2880, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1134, !1135, !1140, !1145, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1160, !1161, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1193, !1194, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1217, !1218, !1219, !1220, !1221}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1113, file: !564, line: 320, baseType: !394, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1113, file: !564, line: 321, baseType: !394, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1113, file: !564, line: 322, baseType: !394, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1113, file: !564, line: 323, baseType: !394, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1113, file: !564, line: 324, baseType: !394, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1113, file: !564, line: 325, baseType: !394, size: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1113, file: !564, line: 326, baseType: !1122, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !564, line: 293, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !564, line: 295, size: 448, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !564, line: 296, baseType: !1122, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1124, file: !564, line: 297, baseType: !457, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1124, file: !564, line: 297, baseType: !457, size: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1124, file: !564, line: 298, baseType: !440, size: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1124, file: !564, line: 298, baseType: !440, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1124, file: !564, line: 299, baseType: !394, size: 32, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1124, file: !564, line: 300, baseType: !394, size: 32, offset: 352)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1124, file: !564, line: 301, baseType: !394, size: 32, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1113, file: !564, line: 326, baseType: !1122, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1113, file: !564, line: 328, baseType: !1136, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!352, !561, !1139, !440}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1113, file: !564, line: 329, baseType: !1141, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!352, !1139, !1144, !442, !442, !460, !440}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1113, file: !564, line: 330, baseType: !1146, size: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!352, !1139}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1113, file: !564, line: 331, baseType: !1146, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1113, file: !564, line: 334, baseType: !354, size: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !564, line: 335, baseType: !411, size: 32, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1113, file: !564, line: 335, baseType: !411, size: 32, offset: 672)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1113, file: !564, line: 336, baseType: !411, size: 32, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1113, file: !564, line: 336, baseType: !411, size: 32, offset: 736)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1113, file: !564, line: 337, baseType: !1156, size: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !321, line: 339, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !321, line: 339, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1113, file: !564, line: 338, baseType: !1156, size: 64, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1113, file: !564, line: 339, baseType: !1162, size: 64, offset: 896)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !321, line: 341, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !321, line: 351, size: 192, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1164, file: !321, line: 354, baseType: !72, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1164, file: !321, line: 355, baseType: !72, size: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1164, file: !321, line: 356, baseType: !72, size: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1164, file: !321, line: 361, baseType: !72, size: 32, offset: 96)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1164, file: !321, line: 362, baseType: !506, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1113, file: !564, line: 340, baseType: !394, size: 32, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1113, file: !564, line: 340, baseType: !394, size: 32, offset: 992)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1113, file: !564, line: 341, baseType: !457, size: 64, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1113, file: !564, line: 342, baseType: !440, size: 64, offset: 1088)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1113, file: !564, line: 343, baseType: !460, size: 64, offset: 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1113, file: !564, line: 344, baseType: !442, size: 64, offset: 1216)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1113, file: !564, line: 345, baseType: !394, size: 32, offset: 1280)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1113, file: !564, line: 346, baseType: !1144, size: 64, offset: 1344)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1113, file: !564, line: 347, baseType: !510, size: 32, offset: 1408)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1113, file: !564, line: 348, baseType: !394, size: 32, offset: 1440)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1113, file: !564, line: 351, baseType: !510, size: 32, offset: 1472)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1113, file: !564, line: 352, baseType: !510, size: 32, offset: 1504)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1113, file: !564, line: 353, baseType: !411, size: 32, offset: 1536)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1113, file: !564, line: 354, baseType: !411, size: 32, offset: 1568)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1113, file: !564, line: 355, baseType: !1144, size: 64, offset: 1600)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1113, file: !564, line: 356, baseType: !1144, size: 64, offset: 1664)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1113, file: !564, line: 357, baseType: !1188, size: 64, offset: 1728)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !564, line: 310, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 308, size: 32, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1190, file: !564, line: 309, baseType: !394, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1113, file: !564, line: 357, baseType: !1188, size: 64, offset: 1792)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1113, file: !564, line: 358, baseType: !1195, size: 64, offset: 1856)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !564, line: 316, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 312, size: 128, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1197, file: !564, line: 313, baseType: !431, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1197, file: !564, line: 314, baseType: !394, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1197, file: !564, line: 315, baseType: !335, size: 8, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1113, file: !564, line: 359, baseType: !1195, size: 64, offset: 1920)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1113, file: !564, line: 360, baseType: !1195, size: 64, offset: 1984)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1113, file: !564, line: 361, baseType: !394, size: 32, offset: 2048)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1113, file: !564, line: 362, baseType: !411, size: 32, offset: 2080)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1113, file: !564, line: 363, baseType: !394, size: 32, offset: 2112)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1113, file: !564, line: 364, baseType: !1144, size: 64, offset: 2176)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1113, file: !564, line: 365, baseType: !1162, size: 64, offset: 2240)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1113, file: !564, line: 366, baseType: !411, size: 32, offset: 2304)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1113, file: !564, line: 367, baseType: !411, size: 32, offset: 2336)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1113, file: !564, line: 368, baseType: !1156, size: 64, offset: 2368)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1113, file: !564, line: 369, baseType: !1156, size: 64, offset: 2432)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1113, file: !564, line: 370, baseType: !1214, size: 64, offset: 2496)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1113, file: !564, line: 371, baseType: !1214, size: 64, offset: 2560)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1113, file: !564, line: 372, baseType: !1214, size: 64, offset: 2624)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1113, file: !564, line: 373, baseType: !542, size: 64, offset: 2688)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1113, file: !564, line: 374, baseType: !506, size: 64, offset: 2752)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1113, file: !564, line: 375, baseType: !1222, size: 64, offset: 2816)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !563, file: !564, line: 451, baseType: !1112, size: 2880, offset: 18560)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !563, file: !564, line: 452, baseType: !1225, size: 64, offset: 21440)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !564, line: 681, size: 4864, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235, !1239}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1227, file: !564, line: 682, baseType: !567, size: 4480)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1227, file: !564, line: 682, baseType: !792, size: 32, offset: 4480)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1227, file: !564, line: 683, baseType: !510, size: 32, offset: 4512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1227, file: !564, line: 684, baseType: !394, size: 32, offset: 4544)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1227, file: !564, line: 685, baseType: !944, size: 64, offset: 4608)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1227, file: !564, line: 686, baseType: !457, size: 64, offset: 4672)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1227, file: !564, line: 687, baseType: !1236, size: 64, offset: 4736)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!352, !1225, !590, !431}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1227, file: !564, line: 688, baseType: !431, size: 64, offset: 4800)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !563, file: !564, line: 453, baseType: !1225, size: 64, offset: 21504)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !563, file: !564, line: 454, baseType: !1225, size: 64, offset: 21568)
